{
    "search_metadata": {
        "id": "67850a2410f804cf3e670576",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/aa9dedb436781485/67850a2410f804cf3e670576.json",
        "created_at": "2025-01-13 12:42:12 UTC",
        "processed_at": "2025-01-13 12:42:12 UTC",
        "google_jobs_url": "https://www.google.cz/async/callback:550?q=Android+developer&uule=w+CAIQICIHQ3plY2hpYQ&udm=8&fc=EuICCqICQUpHOUprUFRZSjdZREFUZDBET3JCck5JZUJtUDgxLTluT2tzTk5aNk50c1ZtQTdoZWRrdkpzd0NGcDE1U25JbVQxTHFZWmtNRVpzQjBjbUFTQzlTdWRmVWZRbS1MZ1ZBMV9sUHhpMlk2NmlMckl1aE8xZ29yYXVEcHVwQmxPMW1maEVjOWZ5aG4xbVRfTXNFZXQzMExxVTV4U1NZNlkyRFBEcnRpTDNxWk9iRHFfNm5Cc20zWEwxbEhIa01JT0tRVENXMTIzbGJJQk9FMFFaTllmU0Y2MkVucE9QSjRTRHFVM2dkNGxJWlJPb1pDaE41ZHJqanFHWjQ0V3NvU3h1SEVRNEw2ck5RUmlvNVI4eEYxMlFDTnJ2eTNXZW0yc212RlESF0l3cUZaNkdQS083UTVOb1BsZXVOd0FjGiJBRlhyRWNyU01nOTR2bHJUMHhTUzMxWS12V0xWa2lMTmhB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/aa9dedb436781485/67850a2410f804cf3e670576.html",
        "prettify_html_file": "https://serpapi.com/searches/aa9dedb436781485/67850a2410f804cf3e670576.prettify",
        "total_time_taken": 0.51
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Czechia",
        "location_used": "Czechia",
        "google_domain": "google.cz",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRlJaU2pkWlJFRlVaREJFVDNKQ2NrNUpaVUp0VURneExUbHVUMnR6VGs1YU5rNTBjMVp0UVRkb1pXUnJka3B6ZDBOR2NERTFVMjVKYlZReFRIRlpXbXROUlZwelFqQmpiVUZUUXpsVGRXUm1WV1pSYlMxTVoxWkJNVjlzVUhocE1sazJObWxNY2tsMWFFOHhaMjl5WVhWRWNIVndRbXhQTVcxbWFFVmpPV1o1YUc0eGJWUmZUWE5GWlhRek1FeHhWVFY0VTFOWk5sa3lSRkJFY25ScFRETnhXazlpUkhGZk5tNUNjMjB6V0V3eGJFaElhMDFKVDB0UlZFTlhNVEl6YkdKSlFrOUZNRkZhVGxsbVUwWTJNa1Z1Y0U5UVNqUlRSSEZWTTJka05HeEpXbEpQYjFwRGFFNDFaSEpxYW5GSFdqUTBWM052VTNoMVNFVlJORXcyY2s1UlVtbHZOVkk0ZUVZeE1sRkRUbkoyZVROWFpXMHljMjEyUmxFU0YwbDNjVVphTmtkUVMwODNVVFZPYjFCc1pYVk9kMEZqR2lKQlJsaHlSV055VTAxbk9UUjJiSEpVTUhoVFV6TXhXUzEyVjB4V2EybE1UbWhCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "iOS & Android Developer",
            "company_name": "PILULKA LÉKÁRNY A.S.",
            "location": "Czechia",
            "via": "Indeed.cz",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=G-3pn53RRl6zJAUGAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU7n4iCYiOCiU1EQbVGxODhJmh5NJOZCLkhxc3Tzn_pj4hte9h1kwh4rGEPum0i2gQ0-0VHACFPYUw2MKmoD5GFL1DocrkxKgZdSMjvRclLJaqHpIcljTZ28U83_bmxUxOBUwtt8MetE8O1kdNqVl7LIoew_Rf8-H66Qi0qA9bB-oTZW_QCfo9JIkwAAAA&shmds=v1_AUFQtOPq-ZmM59Ul80sHm7mDiJbq9SVs8DKwjQxUO_Y_QFeL1w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=G-3pn53RRl6zJAUGAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Jak vypadá náš IT tým?\n\nNových technologií se nebojíme a snažíme se držet aktuálních verzí. Na Androidu stavíme aplikace výhradně na Jetpack Compose, zatímco na iOS postupně přecházíme na SwiftUI. Součástí naší práce je také pravidelný prostor na refactoring a odstraňování technologického dluhu, což nám pomáhá udržet vysokou kvalitu kódu a aplikací.\n\nNa čem aktuálně pracujeme?\n\nSpolečně vyvíjíme naši eshopovou mobilní aplikaci, která pro nás není jen chudým bráchou k webovému řešení. Používají ji desítky procent našich zákazníků. Za vše mluví průměrné hodnocení 4,8 a více než 50 000 hodnocení na obou platformách dohromady.\n\nJako první v ČR jsme také implementovali platbu Apple Pay nebo umožnili našim zákazníkům sledovat Pilulka Auto během doručení, podobně jako taxi při objednání Uberu. Zaplatit bitcoinem je u nás také samozřejmostí.\n\nJakou další technologickou inovaci společně vymyslíme?\n\nDále u nás najdeš vývojáře pro rozvoj eshopového řešení, interního backoffice systému (CRM, ERP), business inteligence a Vendor management systému, kteří primárně pracují v PHP, JS, Pythonu, GoLangu.\n\nCo od tebe očekáváme - iOS?\n• Alespoň 2 letá zkušenost s tvorbou mobilních aplikací na iOS\n• Výborná znalost programovacího jazyka Swift a XCode\n• Při tvorbě UITableViews a UICollectionViews se cítíš jako ryba ve vodě\n• Znalost SwiftUI výhodou\n\nNejdůležitější pro nás je proto analytické myšlení, ochota učit se novým věcem a chuť do práce.\n\nCo od tebe očekáváme - Android?\n• Alespoň 2 letá zkušenost s tvorbou mobilních aplikací na Android\n• Výborná znalost Kotlinu\n• Výborná znalost Android SDK\n• Dobrá znalost Kotlin Flow\n• Dobrá znalost Kotlin Coroutines\n• Dobrá znalost MVVM architektury\n• Výhodou znalost Jetpack Compose\n\nNejdůležitější pro nás je proto analytické myšlení, ochota učit se novým věcem a chuť do práce.\n\nCo ti můžeme nabídnout dál?\n• Možnost částečný remote s občasným dojížděním do kanceláří, důležitá je pro nás odvedená práce, nikoliv vyplněné píchačky\n• Neformální firemní kulturu\n• Máme rádi transparentnost, upřímnost, lidskost a rychlá efektivní řešení, svůj názor můžeš říct upřímně komukoliv ve firmě\n• Lekce cizích jazyků - English, Deutsch, Español? :)\n• Příspěvek na Multisportku.\n• Kanceláře jen pár minut chůze od metra Palmovka nebo Českomoravská\n• Dog friendly office\n• Každé úterý Ti přichystáme hromadu ovoce k snídani\n• Společné firemní akce (hory, voda, kultura, běžecké závody a spousta jiných zážitků) i IT teambuildingy, naposledy to byla návštěva pivovaru Trautenberk a výstup na Sněžku\n• Slevy na sortiment z naší nabídky\n• Dbáme na správně vyvážený work-life balanc, protože je win-win pro obě strany\n\nPokud se k nám chceš připojit, tak se ozvi, nebo pošli odkaz na LindkedIn.\n\nTěšíme se na tebe :)",
            "apply_options": [
                {
                    "title": "Indeed.cz",
                    "link": "https://cz.indeed.com/viewjob?jk=883854b4c14397f5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgXHUwMDI2IEFuZHJvaWQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiUElMVUxLQSBMw4lLw4FSTlkgQS5TLiIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6IkctM3BuNTNSUmw2ekpBVUdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Junior Android developer",
            "company_name": "Grafton Recruitment s.r.o.",
            "location": "Brno, Czechia",
            "via": "JenPráce.cz",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=xBOs3m_7MeE09CJDAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMOw7CMAwAULFyBCbPfBKExAITMFTqyAWqNDVtUGpHtosqrsJlgeWNb_lZLH09UWKBC3XCqYMOX5i5oMAOam5BMUgcgAkq5j7j6jyYFT15r5pdrxYsRRd59EzY8uyf3OqfRocgWHIwbA7H_ewK9etNJeFhv-yOUaZkI5KBOnHsIBFchXgLtzfGIYUvboDRyJ4AAAA&shmds=v1_AUFQtOMypAHgZTuMDIkO4T13hA_GKAs1vklvtz3fRB4fUzLrQA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=xBOs3m_7MeE09CJDAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Ozvěte se na aktuální pracovní nabídku Junior Android developer v lokalitě Brno.",
            "apply_options": [
                {
                    "title": "JenPráce.cz",
                    "link": "https://www.jenprace.cz/nabidka/dnegi4/junior-android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgQW5kcm9pZCBkZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJHcmFmdG9uIFJlY3J1aXRtZW50IHMuci5vLiIsImFkZHJlc3NfY2l0eSI6IkJybm8sIEN6ZWNoaWEiLCJodGlkb2NpZCI6InhCT3MzbV83TWVFMDlDSkRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Mobile Developer Trainee",
            "company_name": "607 Stora Enso Wood Products Zdirec s.r.o.",
            "location": "Ostrava, Czechia",
            "via": "Workday",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=7GWfVrqixyFU4MTQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQrCMAwAULzuEzzlLNoOQQUFLyqCIAoKgpeRdmGr1GYkdYgf5TeK7_CK76CwR3YhEmypp8gdCVwFQyKCCRzYgRKKb4ET7JmbSMNVm3OnS2tVo2k0Yw7eeH5aTuT4bR_s9F-lLQp1ETNV01n5Nl1qRut5uYBLZkHYJWW4MddwFq5fPivc6yDkQY0YNhASnDQL9jiGzYd8G_AHP94OsLEAAAA&shmds=v1_AUFQtOMO1WkxSl4fvDYkff9NdIggQLKsKAWatP8XyxjmT5YPeg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=7GWfVrqixyFU4MTQAAAAAA%3D%3D",
            "extensions": [
                "6 days ago",
                "Part-time"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Part-time"
            },
            "description": "Mobile Developer Trainee (Part-time Trainee Position) Stora Enso is a leading provider of renewable products in packaging, biomaterials, and wooden construction, and one of the largest private forest owners in the world. At Stora Enso, we believe that everything made from fossil-based materials today can be made from a tree tomorrow. We employ approximately 20,000 people globally. Career for a better climate. Every day. Are you passionate about mobile development? Would you like to gain valuable hands-on experience while pursuing your studies? Are you available to work 20 hours per week until August 2026? We are seeking a motivated Flutter (Dart) or Android Mobile Developer Trainee to join our innovative IT and development team in the Forest Division. In this role, you will contribute to building modern mobile applications that empower our organization and customers, helping drive forward our mission of sustainability and digital innovation. You will be located in our office - Organica in Ostrava, Czechia. Key Responsibilities: Mobile App Development: Assist in developing and maintaining Flutter (Dart) mobile applications, focusing on both Android and iOS compatibility. UI/UX Implementation: Help design and implement intuitive, user-friendly interfaces that enhance customer and employee experiences. Bug Fixing and Optimization: Identify and resolve issues in existing mobile applications, ensuring performance and stability. API Integration: Collaborate with backend developers to integrate REST APIs and ensure seamless data communication between apps and server systems. Documentation: Maintain detailed technical documentation to support project workflows and future development. Collaboration: Work closely with senior developers, project managers, and other stakeholders to align app development with business goals. Qualifications Currently pursuing a degree in Computer Science, Software Engineering, IT, or a related field. Basic understanding of mobile app development using Flutter (Dart) or experience with Android development. Familiarity with version control tools like Git. Knowledge of REST APIs and app lifecycle management is a plus. Experience with Firebase or other backend services is a bonus. A passion for mobile app development, problem-solving, and attention to detail. Good communication skills and proficiency in English for collaboration with global teams. What We Offer By joining us, you will become part of a diverse, forward-thinking culture where you’ll gain hands-on experience in mobile development while contributing to a more sustainable future. Your work will support Stora Enso’s mission to lead the way in sustainable innovation. We also care deeply about your wellbeing, offering resources to help you thrive both physically and mentally. Role specific opportunities/things that we offer: modern office in Ostrava - we apply hybrid model 5 weeks of vacation per year lunch cards 160 CZK commuting allowance cafeteria pension insurance annual bonus How to Apply Submit your application through our recruitment portal. Applications will be reviewed on an ongoing basis, so we encourage you to apply as soon as possible, but no later than 26 January 2025. Our recruitment process may include video interviews, aptitude tests, and pre-employment checks such as reference, background, and health assessments, as well as a drug test. If you have any questions, feel free to contact our TA Partner Lucie Staňková, lucie.stankova@storaenso.com. Är du nyfiken och vill jobba med innovation inom förnybara produkter? Vårt syfte ”Göra gott för människor och planeten. Ersätt icke-förnybara material med förnybara produkter” underbygger vår övertygelse om att allt som kan göras med fossilbaserade material idag kan göras av ett träd imorgon, och lyfter fram Stora Ensos möjlighet att bidra till en grönare ekonomi. Ta en titt på våra lediga tjänster! På Stora Enso kommer du att slå dig samman med cirka 22 000 kollegor – ett brett spektrum av människor med olika bakgrunder och färdigheter, alla fokuserade på potentialen hos biomaterial, papper, förpackningar och träkonstruktion. Presentera dig för våra rekryterare så hör vi av oss om det finns en roll som verkar passa dig. Hos oss kommer du bidra till en mer hållbar värld, eftersom vi tror att allt som idag görs av fossilbaserat material kan göras av ett träd imorgon. Med våra värderingar i Stora Enso, ”Ta ledningen” och ”Gör det rätta”, förväntar vi oss hög prestation, snabbhet och smidighet i varje del av vår organisation. Säkerhet och välbefinnande är vår högsta prioritet varje dag. Vi inspirerar dig att leda din utveckling och att ha höga ambitioner. Vi tror att mångfald stärker vår konkurrenskraft och bidrar till bättre beslutsfattande. Olika arbetsgrupper med olika bakgrund hjälper oss att utforska olika perspektiv och utmanar vårt sätt att tänka. Vi arbetar aktivt för att öka mångfalden på arbetsplatsen och välkomnar sökande med olika bakgrund. Stora Enso är en arbetsgivare för lika möjligheter som följer icke-diskriminerande metoder. Förbered dig inför vår rekryteringsprocess genom att utforska den angivna sidan: Hur du söker en tjänst – Karriär | Stora Enso Beroende på placering och nivån på tjänsten kan den normala rekryteringsprocessen även innefatta videointervju, lämplighetstester och förberedande åtgärder som bakgrundskontroller, referenser, hälsokontroll och drogtest som en del av de sista stegen. Du kommer att informeras om vad som är tillämpligt för rollen under rekryteringsprocessen. Privacy Statement Legal Notice",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://storaenso.wd3.myworkdayjobs.com/sv-SE/Stora_Enso_site_opportunities/job/Ostrava/Mobile-Developer-Trainee_JR107161?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/mobile-developer-trainee/3776378?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Climatebase",
                    "link": "https://jobs.climatebase.org/job/55238962/mobile-developer-trainee?utm_source=jobs_directory&queryID=de50ebcb582073a10dfd0c51781dab21&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://cz.linkedin.com/jobs/view/mobile-developer-trainee-at-stora-enso-4117152142?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/mobile-developer-trainee-jobs/2A968759A0FC747D?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIFRyYWluZWUiLCJjb21wYW55X25hbWUiOiI2MDcgU3RvcmEgRW5zbyBXb29kIFByb2R1Y3RzIFpkaXJlYyBzLnIuby4iLCJhZGRyZXNzX2NpdHkiOiJPc3RyYXZhLCBDemVjaGlhIiwiaHRpZG9jaWQiOiI3R1dmVnJxaXh5RlU0TVRRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFEzcGxZMmhwWVEifQ=="
        },
        {
            "title": "Android developer, kterého zajímá Internet of Things",
            "company_name": "MEMOS Software, s.r.o.",
            "location": "Prague, Czechia",
            "via": "Volná Místa",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=G3piGvb387hmaqQnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXJuwoCMRBAUWz9BKtpFU1EsNFKRETBB6y9ZHfHJBozIRMf7N9YWtjb74-5Nrc4t_1ttbczX0ayJZR4R0cBYx8uCWP9NgSVOtefa_2ClW_IYwI6wcFYrxkGsKYcGFUsDJCHJZF22JmalAJPpGR2QnNSyRaioKskjzk95Zly_ufIRkUMTiU8jsbDpwhe97qbxWaXQUan9GhuH1hEQQKsh31U-tbIvMLCWPUDuWVs1LsAAAA&shmds=v1_AUFQtOPESrZJAWZu7AmqtvJ3aAFyjcryQ_7z5cUXxScW53Tr8g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=G3piGvb387hmaqQnAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a2410f804cf3e670576/images/61804bf77eaf66c0e23cbbe3a26b2098538f027b5c4309d8fdd491cbc91b897f.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Gratulujeme, právě jste prošli prvním kolem, protože většina lidí by na takový titulek vůbec neklikla. Pojďme si ho rozebrat, abyste se o své budoucnosti dozvěděli co nejvíc.\n\nAndroid - jak asi správně chápete, nehledáme robota, ale skutečného člověka, který zná platformu Android a orientuje se ve vývoji mobilních aplikací.\n\nDeveloper - na to, abyste dovedli vytvořit úspěšnou aplikaci, nestačí jen hrát hry na mobilu. Jednoznačně oceníme to, že jste zběhlí v programování a nepřekvapí vás jazyk Java.\n\nKterého - zájmeno. Bez něj věta nedává smysl.\n\nZajímá - důležité slovo, protože se stanete součástí týmu technologických nadšenců a určitě se budete cítit lépe, pokud vás baví řešit aktuální trendy v IT, sdílet své znalosti s ostatními a učit se od sebe navzájem.\n\nInternet of Things - tím se lišíme od běžných firem. Vyvíjíme totiž nejen software, ale i chytrý hardware, takže u nás mimo nesmyslně velkých monitorů narazíte také na 3D tiskárny, chytré koloběžky, sekačky, pumpy nebo třeba sledovací zařízení pro zvířata.\n\nJako vývojář mobilní aplikace budete s kolegy řešit nejen to, aby aplikace fungovala sama o sobě, ale také aby zařízení k ní připojené dělalo to, co se od něj chce. (Zní to jasně, ale divili byste se, co se stane, když se v kanceláři vzbouří robotická sekačka)\n\nUž se vidíte v našem týmu? Přečtěte si, co vám můžeme nabídnout.\n\nNa co se můžete těšit?\n\nDěláme smysluplnou práci a zakládáme si na neformálním prostředí bez zbytečné byrokracie. Flexibilní pracovní dobu bereme jako standard, kolegům vycházíme vstříc prací na dálku a když někdo onemocní, neděláme z toho drama. Dává nám to větší smysl než rozdávat lístky na balet. Většina kolegů by je stejně vyměnila za kupony na Steam.\n\nZapomeňte na openspace. Kanceláře na pomezí Vinohrad a Vršovic jsme si sami navrhli tak, aby se nám tu dobře pracovalo. Budete mít klid na práci i místo, kde si odpočinout a vyměnit dojmy. 3D tiskárna je neustále ve střehu, Volkswagen Caravelle se těší, až si ho půjčíte na dovolenou, a bez kvalitní čerstvé kávy by to nešlo. K obědu v okolí si račte vybrat ze všech koutů světa - od poklidné Asie přes hipsterská bistra až po solidní českou čtyřku. No a park se zmrzlinou máme hned za rohem.\n\nPokud chcete být součástí příjemného týmu a pracovat na opravdu zajímavých projektech, ozvěte se nám. Těšíme se na vás.\n\nVíce o pozici\n\nPožadované vzdělání:\n\nNení podstatné\n\nPlatové rozmezí:\n\n90 000,- až 120 000,-\n\nPožadované jazyky:\n\nČeština, Angličtina (středně pokročilá)\n\nBenefity:\n\nBonusy/prémie, Notebook, Flexibilní začátek/konec pracovní doby, Zdravotní volno/sickday, Možnost občasné práce z domova, Firemní akce, Možnost studijního volna, Sdílené auto, Lekce angličtiny\n\nTyp pracovního poměru:\n\nPráce na plný úvazek\n\nDélka pracovního poměru:\n\nNa dobu neurčitou\n\nTyp smluvního vztahu:\n\nPracovní smlouva, práce na živnostenský list/IČO, dohoda o pracovní činnosti\n\nAdresa:\n\nNa Královce 31/4, 10100 Praha - Vršovice, Česká republika",
            "apply_options": [
                {
                    "title": "Volná Místa",
                    "link": "https://www.volnamista.cz/nabidka-prace/android-developer-ktereho-zajima-internet-of-things/189342159?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIGRldmVsb3Blciwga3RlcsOpaG8gemFqw61tw6EgSW50ZXJuZXQgb2YgVGhpbmdzIiwiY29tcGFueV9uYW1lIjoiTUVNT1MgU29mdHdhcmUsIHMuci5vLiIsImFkZHJlc3NfY2l0eSI6IlByYWd1ZSwgQ3plY2hpYSIsImh0aWRvY2lkIjoiRzNwaUd2YjM4N2htYXFRbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRM3BsWTJocFlRIn0="
        },
        {
            "title": "Computer Scientist (m/f/d) as App Developer for iOS / Android",
            "company_name": "RIWA GmbH",
            "location": "Czechia",
            "via": "Jooble",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=GEWGid0WAxS3mAu5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAAUFw7OzndqIKNCC46lQpVF8EKjiVNr00kyYVclOIf-Zfq8qaXfSbZrSQXngkj1MqgT4YTzJ3oRbcAyVCEAAd8oaXwKz1FMJcaBBS-i2Q6WMGZWmCUUWkgDxXRYHG21ykF3gnBbPOBk0xG5YqcII8tjeJBLf9pWMuIwcqEzWa7HvPgh-X0eroXULn2CMZD-UaljfwCX-bs16wAAAA&shmds=v1_AUFQtOO2Y5m8_Zb0HorPthk1LSLaPrA_oF-HQZ_pqM1oThUYmg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=GEWGid0WAxS3mAu5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a2410f804cf3e670576/images/61804bf77eaf66c00cde70a8b0f286e79ea035cb542e7879cfa4ce5c76279431.gif",
            "extensions": [
                "6 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Computer Scientist (m/f/d) as App Developer for iOS / Android\nRIWA - All geoinformation becomes a digital experience\n\nRIWA GmbH is a leading company in the field of geoinformation and municipal specialist processes with over 25 years of experience and market leader in Bavaria. Our team develops innovative solutions for the digital transformation of cities and municipalities, in particular through geographic information systems (GIS). We also create digital twins of municipalities for construction planning, energy management and sustainable urban development. We offer customized solutions and attach great importance to close cooperation.\n\nBecome part of our team in one of our branches in Augsburg, Memmingen or Kempten im AllgÃ¤u. After training, you can also work from home.\nThese are your tasks\n• Further development of our native RIWA GIS Android app\n• Implementation of our previous apps for Apple iOS with Kotlin & Compose Multiplatform\n• Quality assurance through code reviews, unit tests and automated test procedures\n• Technical conceptualization of functional requirements from product management\n• Advising product management on development issues\nYou know your way around this\n• Completed studies in computer science or equivalent training\n• Sound knowledge in the development of Android apps (Kotlin, Java, Android SDK). Basic knowledge of iOS development advantageous (Swift)\n• Ideally experience with Jetpack Compose, Kotlin Multiplatform and Compose Multiplatform\n• Expertise with automated tests, CI/CD processes and agile software development\n• Knowledge of designing appealing user interfaces is a plus\n• Independent working style, ability to work in a team and a high level of self-motivation\nWhat we offer you\n• A great team - #GernePerDu - and a varied job in the office and home office\n• Attractive salary, 13 monthly salaries, capital-forming benefits and a performance bonus\n• Family-friendly working time models with flexible working hours (flexitime)\n• Corporate benefits such as a job bike, drinks flat rate or employee discounts with over 1,500 providers\n• Intensive training in the field of activity and regular further training\n• An exciting environment with varied tasks\n• A secure, modern workplace close to the city center with future prospects\nHave we piqued your interest?\n\nPlease send us your complete application documents directly online via our applicant management system, stating your salary expectations and the earliest possible starting date.\nRIWA GmbH\n\nAn der NeumÃ¼hle 5, 87700 Memmingen\nEveryone is welcome at RIWA. Diversity and equal opportunities are an integral part of our company. We see the uniqueness of each individual, and therefore the diversity of our teams, as the driving force behind our daily work and innovations. - We look forward to meeting you.\n\n+\n\nOnline application",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://cz.jooble.org/jdp/-8959441279879164494?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJDb21wdXRlciBTY2llbnRpc3QgKG0vZi9kKSBhcyBBcHAgRGV2ZWxvcGVyIGZvciBpT1MgLyBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiUklXQSBHbWJIIiwiYWRkcmVzc19jaXR5IjoiQ3plY2hpYSIsImh0aWRvY2lkIjoiR0VXR2lkMFdBeFMzbUF1NUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRM3BsWTJocFlRIn0="
        },
        {
            "title": "Android Developer @ Cloud IT Services",
            "company_name": "Cloud IT Services",
            "location": "Anywhere",
            "via": "Jooble",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=vYus3G4A3mqwlbkyAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_2XNvQrCMBAAYFz7CNLhZsFEBBd1qFQouupe8nMkkZgLuViKb-LbirPLt37NZ9EcT8kWChbOOGGkjAU66CO9LFzucMMyBYMMa7iSBkZVjAdKMBC5iMuDrzXzXkrmKBxXVYMRhp6SEmqa5YM0_xjZq4I5qorjdreZRU5u1f43IUH_RuOD-gJkKu3onAAAAA&shmds=v1_AUFQtONVgz8sOMFVx2toH58f7gzncHGq-q88G4i_elxldqQINw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=vYus3G4A3mqwlbkyAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "€680–€1,290 a month",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "salary": "€680–€1,290 a month",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "O pozici / o projektu\nPůvodní popisek.\n\nШукаємо талановитого та амбітного Android-розробника, який бажає розвиватися в динамічній IT-компанії.\n\nВимоги:\n• Розуміння основ програмування (Java або Kotlin)\n• Знання основ Android SDK\n• Бажання вчитися та розвиватися\n\nБуде перевагою:\n• Досвід розробки простих Android-додатків\n• Знання Git\n\nОбов’язки:\n• Розробка нових функціональних можливостей для мобільних додатків\n• Тестування та налагодження коду\n• Участь у всіх етапах розробки продукту\nOdpovědnosti\nPůvodní popisek.\n• Розробка нових функціональних можливостей для мобільних додатків\n• Тестування та налагодження коду\n• Участь у всіх етапах розробки продукту\nDetail pracovní nabídky\n• Jazyk náboru: Ukrajinština\n• Ihned\n• Dlouhodobá spolupráce\n• Práce plně na dálku\nVýhody v kanceláři\n• Bezplatná káva\n• Posilovna\n• Bezplatné nápoje\n• Moderní kancelář\n• Vnitřní školení\n• Bezplatný oběd\n• Atmosféra startupu\n• Sprcha\nVýhody\n• Mezinárodní projekty\n• Malé týmy\n• Plochá struktura\n• Soukromá zdravotní péče",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://cz.jooble.org/jdp/1020666985212974651?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://cz.trabajo.org/job-2011-18c514f098817bb6febc659c8b74f2f9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBAIENsb3VkIElUIFNlcnZpY2VzIiwiY29tcGFueV9uYW1lIjoiQ2xvdWQgSVQgU2VydmljZXMiLCJhZGRyZXNzX2NpdHkiOiJDemVjaGlhIiwiaHRpZG9jaWQiOiJ2WXVzM0c0QTNtcXdsYmt5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFEzcGxZMmhwWVEifQ=="
        },
        {
            "title": "Java Android Developer | Remote",
            "company_name": "Jobs Contact Personal, s.r.o.",
            "location": "Czechia",
            "via": "Jooble",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=WFOyfDQT5TrEFqpHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43imgigg46SQWhk_gD5ZoeTSTNhdxRivgv_qq6vPFVn0V1bHBCuKS-cOjhShNFzlTgDQ8aWQm20HAHQlicB05wYx4iLc9eNcvJWpFoBlHU4Izj0XKijmf75E7-tOKxUI6o1O4Pu9nkNKxXv1Kg5qToFO5UhBPGDYgphg2EBPWLnA_4BYbiZgmiAAAA&shmds=v1_AUFQtONhDdR-zVBtaEuYLC6yq2RnIu1UpZ7lmmI1r1NfdGB2xg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=WFOyfDQT5TrEFqpHAAAAAA%3D%3D",
            "extensions": [
                "CZK 60K–CZK 100K a month",
                "Full-time"
            ],
            "detected_extensions": {
                "salary": "CZK 60K–CZK 100K a month",
                "schedule_type": "Full-time"
            },
            "description": "Popis pracovní nabídky\nMobilní aplikace jsou budoucnost. Pokud chceš být její součástí, jsi na správné adrese. Jsme ryze česká firma, která se rozhodla své produkty přenést do světa mobilních aplikací. A právě proto, potřebujeme Tebe.\n\nNáplň práce:\n• Vývoj mobilních aplikací pro platformu Android\n• Implementace a monitoring aplikací\n• Rozvoj existujících aplikací\n• Spolupráce v malých týmech\n\nPožadujeme\n• Alespoň 2 roky komerční praxe s vývojem\n• Znalost Android platformy (Android SDK, Java API)\n• Skvěle si rozumíš s Javou nebo Kotlinem\n• Nedělá Ti problém práce s dokumentací v angličtině\n\nNabízíme\n• Možnost remote, hybridní i on-site spolupráce\n• Samozřejmostí jsou sick days i flexibilní pracovní doba\n• Jsem otevřeni pracovnímu poměru i spolupráci na IČO\n• Služební notebook a firemní tarif\n• Dotovaná MultiSport karta a stravenková karta\n• Firemní akce, občerstvení na pracovišti a firemní vzdělávání\n\nVhodné pro\nAbsolventy.\n\nPráce z domova\nNabízíme možnost částečně pracovat z domova, převážně pracovat z domova nebo pracovat jen z domova.\n\nJiná sdělení\nZaujala Vás tato pracovní nabídka? Neváhejte a zašlete svůj profesní životopis. Pokud jste již u nás absolvoval/a pohovor, můžete kontaktovat přímo svého konzultanta. Tato pracovní pozice je také vhodná pro programátor, vývojář, junior, medior, senior, mobile application, android, native, multiplatform, java, kotlin, material, play store, gaming, betting, rest, jira, sql, git, html, css, backend, java2ee, enterprise edition, db, employment, freelance, contract, kontrakt. Uchazeče, kteří postoupí do užšího kola, budeme kontaktovat obratem. Ostatní uchazeče budeme kontaktovat v případě, že pro ně nalezneme jinou vhodnou pracovní nabídku. Další pracovní nabídky naleznete na stránkách použijte odpovědní formulář Jobs Contact Personal, s.r.o. se sídlem v Brně, Křenová 531/69a, IČ:17181879 (dále jen Jobs Contact) bude Vaše osobní údaje (životopis, případně další materiály) zpracovávat v souladu se Zákonem o ochraně osobních údajů 110/2019 Sb. a v souladu s Obecným nařízením o ochraně osobních údajů (EU) 2016/679, a to výhradně za účelem prezentace potenciálním zaměstnavatelům a zprostředkování zaměstnání. Jobs Contact je pracovní agentura s platným povolením Generálního ředitelství Úřadu práce ČR a osobní údaje může v souladu s účelem poskytnout třetím stranám. Tým Jobs Contact se těší na spolupráci s Vámi!",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://cz.jooble.org/jdp/-4356105554703386712?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKYXZhIEFuZHJvaWQgRGV2ZWxvcGVyIHwgUmVtb3RlIiwiY29tcGFueV9uYW1lIjoiSm9icyBDb250YWN0IFBlcnNvbmFsLCBzLnIuby4iLCJhZGRyZXNzX2NpdHkiOiJDemVjaGlhIiwiaHRpZG9jaWQiOiJXRk95ZkRRVDVUckVGcXBIQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFEzcGxZMmhwWVEifQ=="
        },
        {
            "title": "Android Developer @ Connectis_",
            "company_name": "Connectis_",
            "location": "Czechia",
            "via": "Jooble",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=Nj27_gPVqKtGkSTTAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_03MsQoCMQwAUFxvd3HKLNiKcIsuygmCP1HaXmgrNSlNkMNf8KfFzeWNb_ishvFCc-cywxVfWLlhhzNMTIRRizjYwZ0DCPoeMzDBjTlV3JyyapOjtSLVJFGvJZrIT8uEgRf74CA_nGTfsVWv6A7jfjGN0nb99xeC6Y0xF_8F0SBxU44AAAA&shmds=v1_AUFQtOOSzVIkqcLBqJkIsy06c7d74-IDpdcoJ_Mfq8dG9bZadg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Nj27_gPVqKtGkSTTAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "O pozici / o projektu\nPůvodní popisek.\n\nWspólnie z naszym Partnerem, międzynarodową firmą z branży mediowej, poszukujemy osoby na stanowisko Android Developer.\n\nNasz Partner to amerykańska wytwórnia filmowa zajmująca się produkcją i dystrybucją filmów. Specjalista dołączy do zespołu odpowiedzialnego za rozwój oraz utrzymanie platformy streamingowej.\n\n📌 start: już od grudnia 2024 r.!\n\nOFERUJEMY:\n• Możliwość uczestnictwa w spotkaniach integracyjnych oraz meetupach technologicznych, gdzie będziesz mógł/mogła dzielić się wiedzą i doświadczeniem,\n• Wsparcie indywidulanego opiekuna ds. kadr i HR, który zawsze jest dostępny, by pomóc Ci w sprawach związanych z pracą,\n• Stabilne i długoterminowe zatrudnienie w firmie o ugruntowanej pozycji na rynku,\n• 5000 PLN za polecenie znajomego do któregokolwiek z naszych projektów,\n• Pracę 100% zdalną (lub z biura w Warszawie dla chętnych),\n• Szybki, zdalny proces rekrutacyjny,\n\nPROCES REKRUTACYJNY:\n• 10-minutowa rozmowa wstępna po stronie Connectis,\n• Rozmowa z działem HR po stronie Connectis,\n• Etap techniczny po stronie Klienta - DECYZJA!\n\nJeśli chcesz być częścią zespołu, który napędza transformację i innowacje w branży mediowej, czekamy na Twoją aplikację! 🌐🎥\n\nDziękujemy za wszystkie zgłoszenia. Pragniemy poinformować że skontaktujemy się z wybranymi kandydatami .\nOdpovědnosti\nPůvodní popisek.\n• Tworzenie nowych funkcjonalności i modułów aplikacji mobilnej oraz TV, zgodnych z wymaganiami projektowymi,\n• Modernizacja starszego kodu, aby dostosować go do nowoczesnych standardów i najlepszych praktyk,\n• Prowadzenie przeglądów kodu w celu zapewnienia wysokiej jakości i zgodności ze standardami,\n• Współpraca z międzynarodowym zespołem przy realizacji sprintów i codziennych zadań,\n• Rozwiązywanie problemów technicznych i redukcja długu technologicznego.\nDetail pracovní nabídky\n• Online nábor\n• Jazyk náboru: Polština\n• Ihned\n• Dlouhodobá spolupráce\n• Práce plně na dálku\nVýhody\n• Sportovní balíček\n• Soukromá zdravotní péče\n• Mezinárodní projekty",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://cz.jooble.org/jdp/-6229213353269575346?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://cz.trabajo.org/job-2011-f3e2cf476716311ac23f1df031f2aa4c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBAIENvbm5lY3Rpc18iLCJjb21wYW55X25hbWUiOiJDb25uZWN0aXNfIiwiYWRkcmVzc19jaXR5IjoiQ3plY2hpYSIsImh0aWRvY2lkIjoiTmoyN19nUFZxS3RHa1NUVEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRM3BsWTJocFlRIn0="
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVx9hE43CzYiuOhYrSh0qntJ0jOJxFzInVh8G9_Uuvzb_y2_i2XbhXGMqHpMgQp0ZEJEaONLBAv0dJe3Lgin5EJCLAxruJIBRl2sB0pwJnIRq4MXybxXijnWjkVLsLWlp6KEhib1IMP_DOxnL0ctOGx3m6nOya2qy_EGDZVMZf5mNCRoPmh90D9R1Sk2pAAAAA&shmds=v1_AUFQtON_2906xFZB0cIF5WHkx_rz5MbPmTTEWDmx7NXP-AAjBA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a2410f804cf3e670576/images/61804bf77eaf66c067e10428eec592e8812501dcfb1d39a28c6abaaf7629154d.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6IlQxeHZ0bGpKbmNkMW91MGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Sr. Android Engineer",
            "company_name": "ITExpert",
            "location": "Czechia",
            "via": "Jooble",
            "share_link": "https://www.google.cz/search?ibp=htl;jobs&q=Android+developer&htidocid=qYY8tKDbzhoyYA_pAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwA0P1WN6fMiq0ILjqJHKKr7kfbC22PmpSkQ3Hx18U3vOE7bJ9i4EKzcJ5hpJgJUWAHD_ag6CQkYIIbcyy4PqfWqp6sVS0manMtBxP4bZnQc7cLe_03aXKCtbiG0-G476ZS3Kzur7FXlAaZ4PrBkLL7AceZ3viBAAAA&shmds=v1_AUFQtONIk6sLqhyPNW4TYD-d58nw537oZLOa9yBE_z4cd82kpg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=qYY8tKDbzhoyYA_pAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Fingerprint empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).\n\nWe have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman , Apollo.io, MinIO , Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar &Gradle ).\n\nWho We Are Looking For: We are looking for a Senior Android Engineer with a solid background in Information Security. The ideal candidate will have experience building Android applications or libraries from scratch and will be skilled in security frameworks, cryptography, and network protocols. The role requires strong expertise in Kotlin, and familiarity with Jetpack Compose is preferred.\n\nKey Responsibilities:\n• Design, develop, and optimize native Android applications and libraries, focusing on security, scalability, and performance.\n• Collaborate with cross-functional teams to implement security protocols and ensure that applications align with best security practices.\n• Build developer tools that enhance productivity and streamline the development process.\n• Contribute to the maintenance and advancement of security frameworks for mobile applications.\n• Provide mentorship to junior team members and contribute to their technical development.\n\nRequirements:\n• Education: Degree in Computer Science, Information Security, or equivalent experience.\n• Experience:\n• 5+ years as a Senior Android Engineer (prior experience in a Senior Android role is required).\n• Strong Information Security background, with practical experience in:\n• Network protocols and secure coding practices\n• Cryptography and security framework development\n• Proven experience in building Android applications from the ground up, with expertise in Kotlin and vanilla Android SDKs. Experience with Jetpack Compose is preferred.\n• Experience with Android NDK is a plus.\n• Contributions to Open Source projects on GitHub are a bonus.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nDue to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location .\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.\n\nIf you are applying as a resident of California, please read our CCPA notice here\n\nIf you are applying as a resident of the EU, please read our GDPR notice here",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://cz.jooble.org/jdp/-2851592231998746821?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IklURXhwZXJ0IiwiYWRkcmVzc19jaXR5IjoiQ3plY2hpYSIsImh0aWRvY2lkIjoicVlZOHRLRGJ6aG95WUFfcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRM3BsWTJocFlRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUM2d6VkhaUlprbHFWWGx2U2kxNFNqSjZabUZtVm5Sc1pFZEpOSE5hUkZCSk1YTXdWa3MzUkRWZmEzRTFUWGN4UTNKWE9YVlhPSGd4Vm5OSldIQjBlbXhSZDBZemJUVklNamhXVVZsbmVrdzVNR0ZUY0RSYVgxUkNRMVI2YjNwcU5saExRV0pGUXpGZmVrUjRSM2RXY21kMGIxUlFkbGxRYUVSM2NGbDFTbmhDYzFoWVlVVXRlVGRVUlhjd2MzcGFPRlJ6TTBSQmFWaERha3Q0VldnM2RIRllia0Z3T0VOaFVIWlBURFowTUZoVFJuSjVaWGxpYW5waVpFWjBlV1JEYmpWbk5DMTZURlZqYjBnMFRVSmFRbnBCTTA1c2NtZFFVM3BHZHpGV05EVmpNazE2TkVvdFRWTlVXa3R2UkhCbFUxTm9iM2xVV2tsbmFGZDJOR295TTBWMFRXRnVVWFpzTjBOMU1saHZWazlwYTNWdFdXcDNhaTA0WTJjU0YwcEJjVVphWDNsZlJqbDJZbkIwVVZCdmRYbFJiMUZyR2lKQlJsaHlSV055YjBsVFRsZDRTVkJSUm5WVlRVTXdSVFZyZVdoMFFrTk1hM0JuIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.cz&location=Czechia&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUM2d6VkhaUlprbHFWWGx2U2kxNFNqSjZabUZtVm5Sc1pFZEpOSE5hUkZCSk1YTXdWa3MzUkRWZmEzRTFUWGN4UTNKWE9YVlhPSGd4Vm5OSldIQjBlbXhSZDBZemJUVklNamhXVVZsbmVrdzVNR0ZUY0RSYVgxUkNRMVI2YjNwcU5saExRV0pGUXpGZmVrUjRSM2RXY21kMGIxUlFkbGxRYUVSM2NGbDFTbmhDYzFoWVlVVXRlVGRVUlhjd2MzcGFPRlJ6TTBSQmFWaERha3Q0VldnM2RIRllia0Z3T0VOaFVIWlBURFowTUZoVFJuSjVaWGxpYW5waVpFWjBlV1JEYmpWbk5DMTZURlZqYjBnMFRVSmFRbnBCTTA1c2NtZFFVM3BHZHpGV05EVmpNazE2TkVvdFRWTlVXa3R2UkhCbFUxTm9iM2xVV2tsbmFGZDJOR295TTBWMFRXRnVVWFpzTjBOMU1saHZWazlwYTNWdFdXcDNhaTA0WTJjU0YwcEJjVVphWDNsZlJqbDJZbkIwVVZCdmRYbFJiMUZyR2lKQlJsaHlSV055YjBsVFRsZDRTVkJSUm5WVlRVTXdSVFZyZVdoMFFrTk1hM0JuIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}