{
    "search_metadata": {
        "id": "67850a2660e13e0f83dac7fe",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/a159e3eb68b22919/67850a2660e13e0f83dac7fe.json",
        "created_at": "2025-01-13 12:42:14 UTC",
        "processed_at": "2025-01-13 12:42:14 UTC",
        "google_jobs_url": "https://www.google.dk/async/callback:550?q=Android+developer&uule=w+CAIQICIHRGVubWFyaw&udm=8&fc=EswCCowCQUpHOUprT3JTZEtfdE91TG1weDNzQnQ4NXFqMDh5YkRmTU5PblMxc1gzQ093cGczdUFvUWxaLWl6ZThDODE3bTFtR3FyMlhPS3JmcTluMktUWkpkamFKMlAwZkJFMDdjeXhLbmdkaGUwdm04RE11TGllS1BndnYyV2lyNmZyam4yWTUxSUt3YU5TMGh2OC11X0twbnExanZhOVBGc2xXZDFEcVBFUVVMbks0SmxhUm51ZHJvYmFnY1BFcGx0UDdvU05lbDVpOUVuWGZKdElkLUNVa2pHWUUzbFhxX3h1VU5Wa0JBNEZWNlB6b0p5VndNVkYtVFJFa19tVEJROFFzeHlwU2prREY4Y04yWhIXSmdxRlo1SDBESk9pNU5vUHJhMlFpUU0aIkFGWHJFY3J2WmZmdDBDRjBHSjd6YzBfYlRlOHU2REIzOXc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/a159e3eb68b22919/67850a2660e13e0f83dac7fe.html",
        "prettify_html_file": "https://serpapi.com/searches/a159e3eb68b22919/67850a2660e13e0f83dac7fe.prettify",
        "total_time_taken": 0.39
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Denmark",
        "location_used": "Denmark",
        "google_domain": "google.dk",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUM0pUWkV0ZmRFOTFURzF3ZUROelFuUTROWEZxTURoNVlrUm1UVTVQYmxNeGMxZ3pRMDkzY0djemRVRnZVV3hhTFdsNlpUaERPREUzYlRGdFIzRnlNbGhQUzNKbWNUbHVNa3RVV2twa2FtRktNbEF3WmtKRk1EZGplWGhMYm1ka2FHVXdkbTA0UkUxMVRHbGxTMUJuZG5ZeVYybHlObVp5YW00eVdUVXhTVXQzWVU1VE1HaDJPQzExWDB0d2JuRXhhblpoT1ZCR2MyeFhaREZFY1ZCRlVWVk1ia3MwU214aFVtNTFaSEp2WW1GblkxQkZjR3gwVURkdlUwNWxiRFZwT1VWdVdHWktkRWxrTFVOVmEycEhXVVV6YkZoeFgzaDFWVTVXYTBKQk5FWldObEI2YjBwNVZuZE5Wa1l0VkZKRmExOXRWRUpST0ZGemVIbHdVMnByUkVZNFkwNHlXaElYU21keFJsbzFTREJFU2s5cE5VNXZVSEpoTWxGcFVVMGFJa0ZHV0hKRlkzSjJXbVptZERCRFJqQkhTamQ2WXpCZllsUmxPSFUyUkVJek9YYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Mobile App Developer - Team Sports",
            "company_name": "TrackMan A/S",
            "location": "Hørsholm, Denmark",
            "via": "Indeed",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=1gAk-AmPFPBBbLUGAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOsQrCMBCAYVz7CE6Ho2gjgoM6FQRF6NTu5RKOpm2SC7kgfRgfxN0Xsy4_fNtfvFfFuWY9OIIqRrjRixxHSrCHltBDEzllWfRkDUKYjAUOcGfuHa2vNucoF6VEXNlLxjyY0rBXHEjzrEbW8k8nFhNFh5m64-kwlzH0202b0Ew1BqhUA0OAx_eTxLLzu-UjeEzTDzVBoYyfAAAA&shmds=v1_AUFQtOOnQbbv2h-RbXtkiLrlQ9mp1Q4BSEJeUO2OufY8PpMp0A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=1gAk-AmPFPBBbLUGAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a2660e13e0f83dac7fe/images/2e9f5c93c0dd6af299bf83b73e5bc99737fc73e202ae7185abe88741bb854820.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Want to develop cutting-edge mobile applications for our world-leading products? Looking to use and grow your development skills in a fast-paced and creative environment? If this sounds like an exciting challenge, we’d love to hear from you!\n\nAbout the job\n\nTrackman products generate extremely accurate measurements using a patented combination of camera and radar, which provide valuable insights for athletes ranging from top world class professionals to enthusiastic amateurs, as well as coaches, scouts, and clubs of all levels.\n\nAs part of our company's continued expansion, we are looking for a mobile developer. You will join a department of 30+ skilled developers, responsible for applications used in golf, baseball and football. You will be part of refinement, planning, implementation, testing and\ndeployment to our customers.\n\nWe build apps for both iOS and Android for smart phones as well as tablets. You will get to interact with skilled developers working across a range of platforms and apps. We work with Swift for iOS, Kotlin for Android, as well as Xamarin.Forms and Xamarin.Native.\n\nYou will join a small team that loves what they do and, in a role, where you can have a big impact both on what is being built and how it is built.\n\nIf you're fascinated by camera and video technology, you are self-motivated and eager to expand your knowledge, that's the job for you!\n\nIf the following describes you, we encourage you to apply:\n• You hold a Bachelor's degree in Computer Science or a related field\n• You have experience with iOS/Swift and possibly also Android/Kotlin development and are open to learning new languages and platforms\n• You have great communication skills\n• You are able to quickly pick up new technologies and concepts to get the job done\n\nNice to have:\n• experienced in Xamarin Forms development\n• .NET and C# programming skills\n• professional usage of an IDE like Visual Studio or JetBrains Rider\n• experience with Azure (NET Core APIs, Azure Functions, Blob Storage, Service Bus, …)\n• experience with MongoDB\n• a good understanding of the world of sports (Football, American Football, Baseball, Golf)\n\nAll we ask is that you bring passion, curiosity and structure to our workplace. We are a company of many nationalities. Whether you are from abroad or already living in Denmark, we welcome talented people of any gender, nationality and belief. We think the right mix of people makes for the best culture and product.\n\nThe Office\n\nWe have just moved to our state-of-art HQ in Hørsholm, located at DTU Science Park. We take great pride of the building we designed! The office features bright meeting rooms, coffee areas to catch up with colleagues, a large testing arena with simulators available for employees and a fitness centre, everything surrounded by a beautiful forest and respecting the environment. We made sure to utilize the newest technologies to be energy efficient and be mindful of ventilation and sound propagation.\n\nThe cherry on top is our canteen: with indoor and outdoor areas to enjoy the fresh food prepared by our own kitchen staff.\n\nJoin the home of a powerful sports brand and a one-of-a-kind technology\n\nOur proprietary technology is based on expert knowledge about radar, computer vision, data, and software engineering. Our solutions are developed by specialists who endlessly explore and challenge new technical boundaries. Trackman’s blend of cutting-edge technology, sports, and continued growth make our company an outstanding place to work. Our work culture is entrepreneurial, ambitious, and rewarding as you get to collaborate with inspiring colleagues and interact with the leaders of golf, baseball, and football. Based on a unique brand reputation, we are proud to work in close partnership with the top athletes, organizations, and teams that rely on our technology to stay ahead of the race.\n\nWe are a Danish company founded, owned, and managed since 2003 by three entrepreneurs with a strong passion for sports. Today, we have a global footprint with our headquarters located in Denmark (Hørsholm) and offices in New York, Phoenix, Seoul, and Tokyo. We employ over 750 people worldwide, half of which work in Denmark, where most hardware and software products are developed, tested, and manufactured.\n\nWhere innovation happens\n\nAt Trackman, we know that great people make great products. We believe that teams thrive, and innovation sparks in an atmosphere where people are encouraged to think for themselves, where everybody’s voices are heard, and where the best ideas prevail in the pursuit of exceptional solutions.\n\nShare our Passion!\n\nFor additional information about the position, please contact Team Lead, Joen Sindholt at josi@trackman.com",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://dk.indeed.com/viewjob?jk=58855dab049cf3b7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/mobile-app-developer-team-sports-application-unleash-your-potential-at-trackman-5640977?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://dk.linkedin.com/jobs/view/mobile-app-developer-team-sports-at-trackman-4044936167?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciAtIFRlYW0gU3BvcnRzIiwiY29tcGFueV9uYW1lIjoiVHJhY2tNYW4gQS9TIiwiYWRkcmVzc19jaXR5IjoiSMO4cnNob2xtLCBEZW5tYXJrIiwiaHRpZG9jaWQiOiIxZ0FrLUFtUEZQQkJiTFVHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        },
        {
            "title": "Senior Android Developer (English speaking)",
            "company_name": "Work Supply",
            "location": "Copenhagen, Denmark",
            "via": "Jooble",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=Nz_aUiQ6Nva4yxxzAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOvwrCMBCAcVz7CE6Hk4o2Irjo5D8E1w6OJW2PJCa9C7ko9YF8T-vyrb-v-E6KU4XkOMGRusSugwu-MXDEBPMrmeDEgkTU3pFZwBru3ICgTq0FJrgxm4DTg805yl4pkVAayTq7tmy5V0zY8KCe3Mg_tVidMAadsd7uNkMZySxnD04eqleM4QOO4DziZLVBWo0z1Ovkfy860RuoAAAA&shmds=v1_AUFQtOPYQ9E3mUlBl3v7ih41D4e-br4qvcVZr4OMgN_rGPTIkw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Nz_aUiQ6Nva4yxxzAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Joboversigt\n\nWork Supply invite all suitable candidates to apply for this position, regardless of you live in an EU country or not, as long as you have or can get a work permit for Denmark on your own.\n\nDuration: Permanent job (Fulltime)\n\nLanguage required: English\n\nLocation: Copenhagen, Denmark (On site) This is not a remote position.\n\nWork Permit: All applicants must have work permit for Denmark\n\nExperience: More than 5 years experience required\n\nWork Supply is seeking on behalf of our client an on site Senior Android Developer.\n\nAbout the job:\n• Analyze business and technical requirements\n• Take requirements and specs from design to implementation\n• Support applications by working on bug fixes and improving performance, security, reliability and stability\n• Continuously discover, evaluate, and implement new technologies to improve the applications and the development process\n\nAbout you:\n• You have ability to both work on a team and to solve problems independently\n• You have knowledge of software development methodologies and processes\n• Your track record includes the design and release of high-quality, high-performance enterprise software products/applications\n• Strong analytical, prioritization, and troubleshooting skills\n• Strong written and verbal communication skills\n• Proficient in Java, Kotlin and native Android application development.\n• Experience with unit testing and test-driven development is a plus.\n• Proficient in Java, Kotlin. flutter and native Android application development\n• Android studio (layouts, views, activities and their life cycle, services) profiling and debugging.\n\nInterviews will be conducted currently, therefore please mail your CV to Se e-mailadresse på jobbank.dk as soon as possible ( JOB ID 22071)\n\nJobdetaljer",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://dk.jooble.org/jdp/-919935053779493257?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org",
                    "link": "https://dk.trabajo.org/job-3059-a724de6a5893b897f81669a5702013bf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobdenmark247.Com",
                    "link": "https://jobdenmark247.com/de/remote-senior-android-developer-full-time-job19125?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKEVuZ2xpc2ggc3BlYWtpbmcpIiwiY29tcGFueV9uYW1lIjoiV29yayBTdXBwbHkiLCJhZGRyZXNzX2NpdHkiOiJDb3BlbmhhZ2VuLCBEZW5tYXJrIiwiaHRpZG9jaWQiOiJOel9hVWlRNk52YTR5eHh6QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        },
        {
            "title": "Intern. Mobile App Developer (React Native/Flutter) for learning app",
            "company_name": "Factorise",
            "location": "Anywhere",
            "via": "JobTeaser",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=QwBym5PihLFLwxTIAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOsQoCMRBEsb3aympLFUxEsNFKkBMFLWwtjuRYc9HcbkjW4z7LTzQ2UwzzZqb6TqrHmQQTKbiy9QHhECMcccDAERPM72hagZsRP6Cuw0dKeAFPThDQJPLkwBRiBRe2kIvVdsAEJ2YXcLbvRGLeaZ1zUC5LqWlVy71mQsujfrHNf2lyZxLGYASbzXY9qkhuOa3LNCefETyVT9Sb9P4BbU4lrbMAAAA&shmds=v1_AUFQtOOnQDYAlva2p6S_wRIaWbQcoN-lUbf8_ZCgOsW3zjwt9g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=QwBym5PihLFLwxTIAAAAAA%3D%3D",
            "extensions": [
                "15 days ago",
                "Work from home",
                "Internship"
            ],
            "detected_extensions": {
                "posted_at": "15 days ago",
                "work_from_home": true,
                "schedule_type": "Internship"
            },
            "description": "About Us\nFactorise is a pre-seed stage AI Fintech startup.\n\nFactorise is a fintech startup on a mission to revolutionize financial literacy for retail investors. Our mission is to equip retail investors and investment learners with the tools and knowledge needed to navigate the complexities of the financial world. Our AI-powered learning platform combines gamified lessons, GenAI-driven insights, and a community-oriented approach to make investing knowledge engaging, accessible, and actionable.\n\nMilestones Achieved:\n• Concept Validation: Addressing key gaps in the market with an education-first approach.\n• Product Development: A robust foundation for our learning platform, with interactive modules and a GenAI chatbot. Local & Cloud based.\n• Team Growth: A talented remote team of 12+ specialists across tech, design, and marketing.\n• Go-to-Market Strategy: Launching a freemium-to-premium MVP model targeting Gen Z and Millennials but other generations can benefit as well.\n\nOur short term Goals:\n• New website will go live\n• Finalize coding of our MVP's lessons and quick learning modules.\n• Moving past Alpha & Beta Testing\n• Launch app for early onboarding of users.\n\nValue Proposition: Factorise provide interactive, AI-driven, and community-supported learning to demystify the financial markets. There are many cool things happening in the investment space, but the challenge of solving financial literacy is underestimated. We want to change that.\n\nOur Progress\nWe have achieved significant milestones, including completed and tested 5 lessons designs in Figma for the learning platform, our chatbot is live for internal test use and demo investor purpose both locally through Docker and in a cloud solution. We've built an AWS cloud setup with the following components: Backend: NestJS microservices on AWS Fargate. Frontend: Next.js on AWS Amplify. Message Broker: RabbitMQ on Amazon MQ. Database: MongoDB. API Gateway: AWS API Gateway. Our ML/AI is integrated both in the cloud and locally same as our RAG system. We've enriched our chatbot capabilities and carried out comprehensive API development. Our product designs are complete for some aspects and being further developed on other features, and we are conducting innovative R&D to transform investment knowledge. We've engaged in extensive user research, userbility testing, competitor analysis, product positioning and built a strong and motivated team, and established early industry partnerships. We take on a demand driven approach to pre-Product-Market-Fit (pre-PMF) phase.\n\nWith our robust backend infrastructure and interactive learning platform ready for mobile, we are seeking a skilled Mobile Developer to develop and launch our app across Android and iOS platforms. You will be at the forefront of delivering interactive, gamified learning experiences and community-driven features to users worldwide\n\nMobile Developer (Android & iOS)\nYour Role and Responsibilities\n\nAs a Mobile Developer, you will:\n• Work with UI/UX Integration. I.e. integrating designs from Figma or similar tools into functional, responsive, and user-friendly interfaces.\n• Master mobile-specific designs, such as screen size variations, touch interactions, and performance optimizations.\n• Build and maintain a cross-platform mobile app using frameworks like Flutter (Dart) or React Native (JavaScript/TypeScript).\n• Leverage native programming languages like Kotlin (Android) and Swift (iOS) to handle platform-specific features where necessary.\n• Collaborate with designers and backend developers to implement gamified learning modules, GenAI chatbot features, and community tools.\n• Optimize app performance for responsiveness and reliability across devices, ensuring a seamless user experience.\n• Deploy the app to the Google Play Store and Apple App Store, adhering to platform-specific guidelines.\n• Implement secure payment workflows for subscriptions using platforms like Stripe, Apple Pay, or Google Pay etc.\n\nWhat We're Looking For\nWe value a balance of cross-platform versatility and platform-specific expertise to create a high-quality user experience.\n\nProgramming Languages (Foundational Skills):\n• Dart: For developing mobile applications with Flutter.\n• JavaScript/TypeScript: Used in React Native for cross-platform development and backend integration.\n• Kotlin (Android): Preferred for Android-specific customizations or features.\n• Swift (iOS): Preferred for building high-performance, iOS-specific components.\n\nFrameworks (Development Environment):\n• Flutter (Dart): Ideal for creating visually rich and interactive UIs, perfect for gamified learning modules.\n• React Native (JavaScript/TypeScript): For leveraging a shared codebase across platforms, especially for community-driven and API-dependent features.\n\nCross-Platform Development Expertise (Primary Focus):\n• Experience building apps with Flutter or React Native to maximize code reuse while ensuring platform consistency.\n• Ability to integrate RESTful APIs and cloud-based backend services for real-time learning and chatbot functionalities.\n\nSingle-Platform Competencies (As a Plus):\n• Proficiency in Kotlin (Android) and Swift (iOS) for implementing advanced, platform-specific features or optimizations.\n• Familiarity with native toolkits like Android Studio and Xcode for debugging, testing, and customizations.\n\nAdditional Skills:\n• Experience with app analytics tools like Firebase or Google Analytics for Firebase.\n• Knowledge of CI/CD pipelines and tools for automating app deployment and updates.\n• Familiarity with messaging and real-time updates (e.g., WebSockets or Firebase).\n• Performance Optimization:\n• Proven track record of optimizing app performance, memory usage, and responsiveness.\n• Experience with tools like Android Profiler and Instruments for debugging and performance tuning.\n• Testing and Deployment:\n• Knowledge of mobile app testing frameworks (e.g., Appium, Espresso).\n• Experience in deploying apps to Google Play Store and Apple App Store, including handling app review processes.\n• Security and Data Management:\n• Understanding of mobile app security best practices, including secure storage, encryption, and API communication.\n• Experience with secure payment workflows is a bonus.\n\nAbout you\nYou can be a student, more experienced and in between projects, and/or wanting in on an exciting opportunity, while you are working your regular job.\n\nPersonal and professional compatibility as well as trust, the right set of skills and ability in addition to complete buy-in on mission, vision, and values are significantly important.\n\nWe look at your competences and personality. What matters is your contributions to the mission and ability to work with the teams, tech lead, and founder.\n\nIt's crucial that you have the mindset of a problem solver and are excited about contributing in a startup setting. You need to be able to work remote and independently between team collaborations.\n\nPersonal Attributes:\n• Self-starter with intrinsic motivation\n• A problem-solver with a startup mindset.\n• Highly organized with the ability to manage multiple tasks.\n• Passion for financial inclusion and democratizing investment knowledge.\n• Strong analytical and problem-solving skills.\n• Excellent communication skills and ability to work collaboratively with a cross-functional team.\n• Highly motivated and driven to contribute\n• Adaptable and eager to learn, with a growth mindset that thrives in a startup environment.\n\nThe Team\nThe team will support you with resources, learning and experience. There will be room for you to develop and grow.\n\nThe team have distinct results, experience and achievements in AI, Cloud, Learning and Software Development. This includes technology leadership, learning, knowledge production, education, user centricity and visionary leadership. In addition to a funding track-record and project management optmization.\n\nYou have the opportunity to leverage network resources and meet with a variety of entrepreneurial people.\n\nCheck out Founders LinkedIn profile and connect or follow for more: www.linkedin.com/in/peter-nørgaard-04773167.\n\nThe current team will be on our coming new landing page, until then we will tell you about them if/when we chat.\n\nWhat We Offer:\nYou get to work at the intersection of finance and AI, building mobille applications that makes a difference for the users. You will be part of a forward thinking investment learning platform. If you are passionate about investment and want to contribute to shaping the future of financial education, we would love to hear from you! As a Factorise intern you furthermore get:\n• Hands-on experience in a fintech startup\n• Opportunities for career growth within a growing company.\n• Flexibility in work hours and a remote working setup.\n• Build your portfolio, get access to great use case, gain experience, create a network.\n• Potential for a full-time role, when funded and /or generating revenue and if you deliver results, upon successful completion of the internship.\n\nThe job is unpaid and without equity for now, but when funded and /or generating revenue, you will have a chance to apply for and negotiate for a paid position. You will need to sign an NDA.\n\nWe will make the contract for 3-6 months with a 14-day trial period. Hours a week will depend upon individual agreement, but there will be a lower limit, for you to be able to deliver the results needed.\n\nPlease send your resume, LinkedIn and a portfolio showcasing your best projects.\n\nWe're excited to review your application and potentially welcome you to our team, where together we'll build something truly impactful in the investment space!",
            "apply_options": [
                {
                    "title": "JobTeaser",
                    "link": "https://www.jobteaser.com/en/job-offers/8864c1c2-37bf-4f4d-9b34-1c53e21e2124-factorise-intern-mobile-developer-for-learning-app?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://dk.indeed.com/viewjob?jk=efb267fc6c821f0c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://dk.jooble.org/jdp/4502074688791656465?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobsearch.dk",
                    "link": "https://www.jobsearch.dk/softwareudvikler/4915654?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Outscal",
                    "link": "https://outscal.com/job/mobile-app-developer-team-sports-at-trackman-in-denmark-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/dk/job/slack-app-developer--denmark--ec2498ad18fa6aeb5362201daca09974f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/dk-slack-app-developer-yo-it-consulting-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcm4uIE1vYmlsZSBBcHAgRGV2ZWxvcGVyIChSZWFjdCBOYXRpdmUvRmx1dHRlcikgZm9yIGxlYXJuaW5nIGFwcCIsImNvbXBhbnlfbmFtZSI6IkZhY3RvcmlzZSIsImFkZHJlc3NfY2l0eSI6IkRlbm1hcmsiLCJodGlkb2NpZCI6IlF3QnltNVBpaExGTHd4VElBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUkdWdWJXRnlhdyJ9"
        },
        {
            "title": "Sr. Android Engineer",
            "company_name": "ITExpert",
            "location": "Denmark",
            "via": "Jooble",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=0zZdjSp-85ZfQm9kAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwA0P1WN6fMiq0ILjoJHqKr7kfbC221l5SkQzd_XXzDG77D9ikGLjQL5xlGipkQBXbwYA-KTkICJrgxx4Lrc2qt6sla1WKiNtdyMIEXy4Seu32z13-TJidYi2s4HY77birFzer-GntFaZAJrkiLk88PLkjEHoEAAAA&shmds=v1_AUFQtOME01QvVG9JNBMcuRPHm_qUe6RAa-See_7ohh01VnBsJA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=0zZdjSp-85ZfQm9kAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Fingerprint empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).\n\nWe have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman , Apollo.io, MinIO , Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar &Gradle ).\n\nWho We Are Looking For: We are looking for a Senior Android Engineer with a solid background in Information Security. The ideal candidate will have experience building Android applications or libraries from scratch and will be skilled in security frameworks, cryptography, and network protocols. The role requires strong expertise in Kotlin, and familiarity with Jetpack Compose is preferred.\n\nKey Responsibilities:\n• Design, develop, and optimize native Android applications and libraries, focusing on security, scalability, and performance.\n• Collaborate with cross-functional teams to implement security protocols and ensure that applications align with best security practices.\n• Build developer tools that enhance productivity and streamline the development process.\n• Contribute to the maintenance and advancement of security frameworks for mobile applications.\n• Provide mentorship to junior team members and contribute to their technical development.\n\nRequirements:\n• Education: Degree in Computer Science, Information Security, or equivalent experience.\n• Experience:\n• 5+ years as a Senior Android Engineer (prior experience in a Senior Android role is required).\n• Strong Information Security background, with practical experience in:\n• Network protocols and secure coding practices\n• Cryptography and security framework development\n• Proven experience in building Android applications from the ground up, with expertise in Kotlin and vanilla Android SDKs. Experience with Jetpack Compose is preferred.\n• Experience with Android NDK is a plus.\n• Contributions to Open Source projects on GitHub are a bonus.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nDue to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location .\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.\n\nIf you are applying as a resident of California, please read our CCPA notice here\n\nIf you are applying as a resident of the EU, please read our GDPR notice here",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://dk.jooble.org/jdp/-2437950403668694584?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IklURXhwZXJ0IiwiYWRkcmVzc19jaXR5IjoiRGVubWFyayIsImh0aWRvY2lkIjoiMHpaZGpTcC04NVpmUW05a0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSR1Z1YldGeWF3In0="
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQoCMQyA4f1GR6eMItiK4qKjouDqAxxpCe1prilNlANf3nP5-ba_-3arK7_NqMGFPsRSZ23gLgGUsMUMUuAmkpiWp2xW9ei9KrukhjZEF2X0UijI5J8S9J9eMzaqjEb97rCdXC1pvXhEZNqfYSjzqYzYXj-1v-kHfQAAAA&shmds=v1_AUFQtOOdDE97mU0CzmUT5VFCheMWDmmSwfmPchItyxULAKlVsA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a2660e13e0f83dac7fe/images/2e9f5c93c0dd6af264d8501acaa21b2580fb9064ec5f7276463da445d8f54c58.gif",
            "extensions": [
                "21 days ago",
                "€192K a year",
                "Work from home",
                "Internship",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "salary": "€192K a year",
                "work_from_home": true,
                "schedule_type": "Internship",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: European Union\n\nWho we are\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\nWhat we are looking for\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environmentInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\nTalent acquisition team\n\nThis offer from \"Scale3C\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/677c07d256373d87f2b9cbc6-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJEZW5tYXJrIiwiaHRpZG9jaWQiOiJsU0xRZGVndzZaUThGWWRSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        },
        {
            "title": ".Net Software Engineer",
            "company_name": "B&B Tech Group",
            "location": "Glostrup, Denmark",
            "via": "B&B Tech Group",
            "share_link": "https://www.google.dk/search?ibp=htl;jobs&q=Android+developer&htidocid=35INC6dlLShpno2KAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU4HgoPYRAQX3YpScHDRvaThTKNpLuSu2N_wj43LG1_1XVS1uqHAnZ7yMRnhEp2PiBlquFIPjCbbAShCS-QCLk-DSOKj1sxBORYj3ipLo6aIPc36RT3_6XgoXQpGsNsfdrNK0W1WzbqBB5awzTQl8KUNxJKntIUzxtHk9w8OFfIUlAAAAA&shmds=v1_AUFQtOP4X3aziCMjgmHgQJ2iQEtLWl7uOK_-Ka1SNYuUe-3XvA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=35INC6dlLShpno2KAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "We are seeking a skilled .NET developer to join our team and contribute to the development of software using the .NET framework. In this role, you will be responsible for creating applications from the ground up, configuring existing systems, and providing user support.. If you have a genuine passion for the .NET framework and possess a strong understanding of software design and architecture, we would like to meet you.\n\nResponsibilities\n• Participate in requirements analysis\n• Collaborate with internal teams to produce software design and architecture\n• Write clean, scalable code using .NET programming languages\n• Test and deploy applications and systems\n• Revise, update, refactor and debug code\n• Improve existing software\n• Develop documentation throughout the software development life cycle (SDLC)\n• Serve as an expert on applications and provide technical support\n\nRequirements and skills\n• Proven experience as a .NET Developer\n• Familiarity with the ASP.NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC))\n• Knowledge of at least one of the .NET languages (e.g. C#, Visual Basic .NET) and HTML5/CSS3\n• Familiarity with architecture styles/APIs (REST, RPC)\n• Understanding of Agile methodologies\n• Excellent troubleshooting and communication skills\n• Attention to detail\n• BSc/BA in Computer Science, Engineering or a related field",
            "apply_options": [
                {
                    "title": "B&B Tech Group",
                    "link": "https://thebandbtech.com/jobs/net-software-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIuTmV0IFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQlx1MDAyNkIgVGVjaCBHcm91cCIsImFkZHJlc3NfY2l0eSI6Ikdsb3N0cnVwLCBEZW5tYXJrIiwiaHRpZG9jaWQiOiIzNUlOQzZkbExTaHBubzJLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        }
    ]
}