{
    "search_metadata": {
        "id": "67850a4e71de537cf0b487aa",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/0b037b949b87ce1a/67850a4e71de537cf0b487aa.json",
        "created_at": "2025-01-13 12:42:54 UTC",
        "processed_at": "2025-01-13 12:42:54 UTC",
        "google_jobs_url": "https://www.google.gr/async/callback:550?q=Android+developer&uule=w+CAIQICIGR3JlZWNl&udm=8&fc=EuICCqICQUpHOUprTlQ4TEp6bzFTbVY4Nl8zUVNBejFlQ2hpRzNfUWZoUHVHbUgwWHVkT2VVSU9QVk1pTElzQU9pOWRHajNYaTRNeDJMOFgxRmh2NGZNV250eGVSb242X0RZUC1QdUpmdXFqUUxmWWFPbDVDYkVsOVZfczNUWkMxZGRIalRLLUJab2hDR0hCblZONGdmNmwzSTNGOG0wemxMU0dHMmtCTjhya2JSYzJCa0NOUGRWcURzODJCU1U2NFRvNzNrbzl6YXJmTHR2ckp1NWhCYzJUUlFYcW8xOUV2SWxIUkxLXy1yam84dFF2cElqQ2NsSDQyZjBmb0Z4dG5YVFRFNjA5ZVlQVTU1OGpyNG1CQ3BabEM3WE9XR1d5YnBFTEtMNkESF1RRcUZaNmFNQlBuX3A4NFB2ZFNDNlFFGiJBRlhyRWNwbERJWU8za0JtQlpUX01XOE1KbjhWMk9HVlJ3&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/0b037b949b87ce1a/67850a4e71de537cf0b487aa.html",
        "prettify_html_file": "https://serpapi.com/searches/0b037b949b87ce1a/67850a4e71de537cf0b487aa.prettify",
        "total_time_taken": 0.82
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Greece",
        "location_used": "Greece",
        "google_domain": "google.gr",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUbFE0VEVwNmJ6RlRiVlk0Tmw4elVWTkJlakZsUTJocFJ6TmZVV1pvVUhWSGJVZ3dXSFZrVDJWVlNVOVFWazFwVEVselFVOXBPV1JIYWpOWWFUUk5lREpNT0ZneFJtaDJOR1pOVjI1MGVHVlNiMjQyWDBSWlVDMVFkVXBtZFhGcVVVeG1XV0ZQYkRWRFlrVnNPVlpmY3pOVVdrTXhaR1JJYWxSTExVSmFiMmhEUjBoQ2JsWk9OR2RtTm13elNUTkdPRzB3ZW14TVUwZEhNbXRDVGpoeWEySlNZekpDYTBOT1VHUldjVVJ6T0RKQ1UxVTJORlJ2TnpOcmJ6bDZZWEptVEhSMmNrcDFOV2hDWXpKVVVsRlljVzh4T1VWMlNXeElVa3hMWHkxeWFtODRkRkYyY0VscVEyTnNTRFF5WmpCbWIwWjRkRzVZVkZSRk5qQTVaVmxRVlRVMU9HcHlORzFDUTNCYWJFTTNXRTlYUjFkNVluQkZURXRNTmtFU0YxUlJjVVphTm1GTlFsQnVYM0E0TkZCMlpGTkRObEZGR2lKQlJsaHlSV053YkVSSldVOHphMEp0UWxwVVgwMVhPRTFLYmpoV01rOUhWbEozIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Mobile Application Developer (Android)",
            "company_name": "Tickmill",
            "location": "Greece",
            "via": "Indeed",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=LOqOiCy9bEMnMRbkAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVw7OjrdqIKJCC6KQ0EQBDf3kqRHe3rNhVyQPoaPbFz-6edrvovm8hBPjNCmxBRcIYlwxQ-yJMywbmOfhfoN7OAuHhRdDiPU5yYyMK7OYylJT9aqshm0VCCYIJOViF5m-xKv_3Q6uoyJXcHucNzPJsVhu3xSeE_EDFTBjBjwB6Hj1USTAAAA&shmds=v1_AUFQtOO3PpYmOyoDfj1m0eUTOSbDLoSlGvX6KvGjGYC5rA4Xpg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=LOqOiCy9bEMnMRbkAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f9b7f923ac9b1b3a9637568e227166ae5d3e5382ce9b87935c.gif",
            "extensions": [
                "21 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Are you looking for the next professional opportunity, that will challenge you and advance your career? Join our team now!\n\nTickmill is looking to hire a Mobile Application Developer (Android) to join our Software Development team.\n\nAbout Tickmill.\n\nTickmill is an award-winning, multi-regulated broker offering a wide range of asset classes including CFDs on Forex, Stocks, Indices, Commodities, Cryptocurrencies and bonds, as well as Exchange Traded Derivatives (Futures & Options).\n\nThe Tickmill Group was established in 2014, and employs over 270 individuals through its offices in London, Cyprus, Estonia, South Africa and several other regional offices globally.\n\nOur philosophy is based on trust, transparency, and diversity, reflected in both our workplace culture and outstanding customer support. Our employees, a multilingual team of highly skilled professionals from every continent, are the backbone of the company. Their hard work and dedication are what makes it possible to rank among the best in the industry. Tickmill offers a competitive benefits package, hybrid work model, team-building events, and many opportunities for professional growth.\n\nWhat the job looks like?\n\nThe Mobile Application Developer (Android) will have the opportunity to:\n• Design and build applications for the Android platform.\n• Ensure the performance, quality, and responsiveness of applications.\n• Collaborate with internal/external teams to define, design, and ship new features.\n• Identify, correct bottlenecks and fix bugs.\n• Help maintain code quality, organization, and automatization.\n• Stay up to date with new mobile technology trends, applications, and protocols.\n\nWhat will you need to be able to do the job?\n• Degree in Computer Science, Engineering, or a related field.\n• Minimum 3 years of proven experience in Android development in either Java or Kotlin.\n• General knowledge of the Google Play release procedures.\n• Proficiency with Android Studio and Android SDK tools.\n• Experience using RESTful APIs to integrate mobile applications to server-side systems.\n• Good understanding of Android release cycle and familiarity with CI/CD.\n• Familiarity with mobile product and design lifecycles.\n• Experience with various testing tools and code versioning tools.\n• Excellent analytical, and problem-solving skills with both developers and product members.\n• Proficient in English language with excellent written and verbal communication skills.\n\nIt will be considered as a plus if you have:\n• Experience with agile development methodologies.\n• Experience within the financial markets Industry on a similar IT field.\n\nBy joining us, you can expect:\n• A Unique Opportunity for a career in a global, fast-growing company.\n• Attractive remuneration package based on qualifications and experience (including 13th salary and Discretionary Bonuses to reward exceptional performance).\n• Opportunities to learn and grow through our “Employee Training & Development program”.\n• Medical Insurance Cover, which includes Outpatient, Inpatient, and Dental Care.\n• Multiple events to bond with the team and the group through Quarterly/Semestrial Team Activities for all the Company.\n• Participation in our welfare investment and savings plan through our Provident Fund Scheme.\n• Birthday and Loyalty benefits.\n\nMake your next Career step and apply NOW!\n• Due to the great number of applications, we receive for each of our open vacancies, we are unable to respond on an individual basis",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://gr.indeed.com/viewjob?jk=92c0c55eaf1c515e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIChBbmRyb2lkKSIsImNvbXBhbnlfbmFtZSI6IlRpY2ttaWxsIiwiYWRkcmVzc19jaXR5IjoiR3JlZWNlIiwiaHRpZG9jaWQiOiJMT3FPaUN5OWJFTW5NUmJrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1IzSmxaV05sIn0="
        },
        {
            "title": "Intermediate Mobile Developer",
            "company_name": "Exandia",
            "location": "Thessaloniki, Greece",
            "via": "IG@Work",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=CQ05ZxZcaWvE2SI5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQoCMRBGYWz3CDZOLboR0UZbZVGws5ck_myi2ZmQCbIH8cCuzSu_13xnze7CFWXAM9oKuomLCXTCB0kyCq3pKo4UtvhAwtSJ9AnzY6g168EY1dT2Wm2NvvUyGGE4Gc1LnP7z0GALcprsx3a_GdvM_XJxHi1PP4pM9wBVm4TjO66oK4DHD30eRmiXAAAA&shmds=v1_AUFQtOPq_EpZ0ber1biTMc4bjbc8tjCWYxEDBtu3-fN4Gqn4Bg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=CQ05ZxZcaWvE2SI5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f9d607706391569564fcdfe4d24c03911e5aa270f21aa912a3.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "We are seeking a skilled and motivated Intermediate Mobile Developer to join our dynamic development team. As an Intermediate Mobile Developer, you will be responsible for designing, developing, and maintaining mobile applications for our company. You will work closely with cross-functional teams to deliver high-quality mobile solutions that meet business requirements and enhance the user experience. This is an exciting opportunity to contribute to the development of innovative mobile applications and grow your skills in a collaborative environment.\n\nResponsibilities\n\n● Design, develop, and maintain mobile applications for iOS and/or Android platforms, ensuring high performance, responsiveness, and usability.\n\n● Collaborate with the rest of the team to understand requirements, identify technical solutions, and translate them into well-designed mobile applications.\n\n● Write clean, maintainable, and efficient code following best practices and coding standards.\n\n● Conduct thorough testing and debugging of mobile applications to ensure they meet quality standards and address any defects or issues.\n\n● Integrate mobile applications with backend services and third-party APIs to enable seamless functionality and data synchronization.\n\n● Optimize mobile applications for performance, scalability, and security.\n\n● Stay up to date with the latest trends and technologies in mobile development and propose innovative solutions to improve the mobile development process.\n\n● Collaborate with the team to identify and resolve technical challenges, provide technical guidance, and share knowledge and best practices.\n\n● Participate in code reviews to ensure code quality, maintainability, and adherence to development standards.\n\n● Assist in troubleshooting and resolving issues reported by users or the support team.\n\n● Document technical specifications, processes, and procedures related to mobile application development.\n\nRequirements\n\n● Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\n\n● Proficiency in programming languages such as Swift, Objective-C, Java, or Kotlin.\n\n● Strong knowledge of mobile application development frameworks and tools (e.g., Xcode, Android Studio).\n\n● Knowledge of hybrid mobile app development using web technologies (Progressive Web App)\n\n● Experience with cross-platform development frameworks such as React Native, Xamarin, or Flutter.\n\n● Solid understanding of mobile UI/UX principles and ability to translate design specifications into functional applications.\n\n● Experience with APIs, web services integration, and working with backend technologies.\n\n● Familiarity with version control systems (e.g., Git) and collaborative development workflows.\n\n● Ability to write clean, efficient, and well-documented code following coding standards and best practices.\n\n● Strong problem-solving skills and ability to troubleshoot and debug complex issues.\n\n● Excellent communication and collaboration skills to work effectively in a team environment.\n\n● Self-motivated with a strong desire to learn and stay updated with the latest trends and technologies in mobile development.\n\nDesired (will be considered as a plus)\n\n● Familiarity with backend development languages (e.g., Java).\n\n● Familiarity with OOP design principles and data structures\n\n● Understanding mobile security best practices and techniques.\n\n● Experience with automated testing frameworks and continuous integration/continuous deployment (CI/CD) pipelines.\n\nPersonal Skills We Are Looking For\n\n● Fluency in Greek and English (written and spoken)\n\n● Strong communication and collaboration abilities.\n\n● Excellent analytical, problem solving and troubleshooting abilities\n\n● Ability to work independently and handle multiple tasks simultaneously.\n\n● Solid organizational skills and focus on accuracy and attention to detail\n\n● Detail oriented, maintaining the highest quality work standards\n\n● Enjoy working within agile/scrum-based team",
            "apply_options": [
                {
                    "title": "IG@Work",
                    "link": "https://www.igwork.gr/view/3ZvEdHpmBaTFh4DGX8Kqup/intermediate-mobile-developer-in-thessaloniki-at-exandia?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcm1lZGlhdGUgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkV4YW5kaWEiLCJhZGRyZXNzX2NpdHkiOiJUaGVzc2Fsb25pa2ksIEdyZWVjZSIsImh0aWRvY2lkIjoiQ1EwNVp4WmNhV3ZFMlNJNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSM0psWldObCJ9"
        },
        {
            "title": "Mobile Application Developer - React Native",
            "company_name": "Token Metrics",
            "location": "Athens, Greece",
            "via": "Lever",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=QpLgIiwakWB3hssKAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWKsQrCMBRFce0nuPhm0UYEF50qQkGog7iXJFyaaMwLeaH4PX6pcTlwOKf5LprzwMYHUJdS8FYXz5EumBE4IdOW7tC20K2GGVWvbEigs3VUx555ClieXClJjkqJhHaSUmfbWn4rjjD8UU828scoTmekoAvG_WH3aVOc1qsHvxBpQMneCvlIXXGIsqE-AxY_A0t2tqUAAAA&shmds=v1_AUFQtOPS1_OeJOyd4Ww7f4y3BIrlvVpjGj_rfqYtNF4mMacCyw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=QpLgIiwakWB3hssKAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f99617dd34fa210a98362acd9d51e6ead24636780c80447c7e.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms. You will be responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure. Building a product is a highly collaborative effort, and as such, a strong team player with a commitment to perfection is required.\n\nResponsibilities\n• Build pixel-perfect, buttery smooth UIs across both mobile platforms.\n• Leverage native APIs for deep integrations with both platforms.\n• Diagnose and fix bugs and performance bottlenecks for performance that feels native.\n• Reach out to the open source community to encourage and help implement mission-critical software fixes—React Native moves fast and often breaks things.\n• Maintain code and write automated tests to ensure the product is of the highest quality.\n• Transition existing React web apps to React Native.\n\nSkills\n• Working Knowledge In React Native\n• Firm grasp of the JavaScript, TypeScript language, and its nuances, including ES6+ syntax\n• Knowledge of object-oriented programming\n• Ability to write well-documented, clean Javascript code\n• Rock solid at working with third-party dependencies and debugging dependency conflicts\n• Familiarity with native build tools, like XCode, Gradle, Android Studio, IntelliJ\n• Understanding of REST APIs, the document request model, and offline storage",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/tokenmetrics/cfd10673-7af6-45f6-8199-1564a84aa6fb?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Crypto Careers",
                    "link": "https://www.crypto-careers.com/jobs/353206851-mobile-application-developer-react-native-at-token-metrics?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIC0gUmVhY3QgTmF0aXZlIiwiY29tcGFueV9uYW1lIjoiVG9rZW4gTWV0cmljcyIsImFkZHJlc3NfY2l0eSI6IkF0aGVucywgR3JlZWNlIiwiaHRpZG9jaWQiOiJRcExnSWl3YWtXQjNoc3NLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1IzSmxaV05sIn0="
        },
        {
            "title": "Senior Android Developer",
            "company_name": "Palta",
            "location": "Greece",
            "via": "Indeed",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=2WuVARwBRxCLxugQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQoCMRAF0H4be6upBTci2GglCIKV4AGWSfaTRGImzATZzqurzSvf8BncAzWL0rnOKnmmC94o0qC0pZt4MrCGRFLpKhIL1qfUe7Ojc2ZljNa55zAGeTmp8LK4p3j7M1liRSvcMe0Pu2VsNW5Wdy6dKf82BQK-H5T76IEAAAA&shmds=v1_AUFQtOOF8pyGJlN71oAwFhF9ta-gPidTrbJPG42fSIiA4dcAGA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2WuVARwBRxCLxugQAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Palta is a multi-product tech platform developing several mobile apps focused on health and well-being with a combined audience of more than 60 million monthly active users. Our portfolio includes such successful companies as Flo (global leader in female health), Simple (a nutrition and wellness app with over 15m downloads), Zing (personal fitness trainer), and more.\nThe rapid portfolio growth was fueled by the recently raised $100 million Series B round led by VNV Global, and the group's revenue is currently sustainably growing 50% YoY.\n\nSIMPLE is a successful mobile product with over 15 million unique downloads, more than 300K 5-star reviews, and over 50% year-over-year revenue growth.\n\nIt offers judgment-free, gentle guidance toward balanced nutrition, a healthy relationship with food, and ultimately, improved health and well-being. Built with flexibility and convenience in mind, the app is a safe and supportive space to get actionable feedback, learn, and increase confidence. SIMPLE's method is shaped by a global team of nutrition, behavior change, digital health, and medical experts. The journey is enhanced through Avo, a personal wellness assistant within the app that provides timely suggestions and real-time answers.\n\nWith SIMPLE as a partner in their pocket, users feel cared for and empowered to embrace — and stick to — new healthy habits. To learn more, visit simple.life.\n\nRight now we are looking for a talented Senior Android Developer who will join our team and help us grow.\n\nPush the pace of innovation and build a future of a healthier world with us!\n\nWhat You'll Do:\n• Feature Development: Build and implement a wide range of product features to enhance user experience and functionality;\n• Lifecycle Involvement: Actively participate in the entire feature lifecycle, from ideation and prototyping to design, development, and analytics;\n• Proactivity: Take initiative in identifying opportunities for improvement and proposing innovative solutions to drive product success;\n• Flexibility: Adapt quickly to changing priorities, new challenges, and evolving project needs in a dynamic environment;\n• Collaboration: Work closely with cross-functional teams to bring creative ideas to life.\n\nWhat We Look For:\n• You know Android SDK, have experience with Kotlin and Java, understand material guidelines, and have expertise in developing complex interfaces, custom views, and animations;\n• You are interested in creating a helpful product and understand the importance and impact of development on users;\n• You have 5+ years of experience in a product development team;\n• You know how to estimate the development time and timely communicate any problems that may affect the execution;\n• You are a team player, and you know how to handle feedback. You are open to other's ideas and suggestions;\n• High level of autonomy and ability to work in uncertainty;\n• Fluency in Russian and English languages.\n\nOur tech stack:\n• Kotlin\n• MVI/MVVM Architectures\n• Coruoutines\n• Room\n• Dagger 2\n• Multimodule\n• Jetpack Compose\n\nPerks and Benefits:\n• Competitive salary package commensurate with experience, plus stock options;\n• Relocation package (Cyprus);\n• The equipment you need to do your job;\n• A premium Palta Family subscriptions (Simple, Flo, Zing etc.);\n• 21 days annual leave, plus bank holidays;\n• Support to learn English, should you need (or want) to;\n• Office in Limassol. Hybrid format ( 3+ day in office).\n\nPlease read our privacy notice in respect of your application\n\nPlease note that your personal data will be stored for one year, as reasonably necessary to resolve any disputes within the hiring process, if any occur.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://gr.indeed.com/viewjob?jk=883bb9be325c0ebb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://gr.jooble.org/jdp/1430865222525657279?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/drupal-developer/3786258?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://gr.linkedin.com/jobs/view/drupal-developer-at-randstad-hellas-4117108872?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobgreek.com",
                    "link": "https://jobgreek.com/de/senior-android-developer-job10516?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJQYWx0YSIsImFkZHJlc3NfY2l0eSI6IkdyZWVjZSIsImh0aWRvY2lkIjoiMld1VkFSd0JSeENMeHVnUUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSM0psWldObCJ9"
        },
        {
            "title": "Java Android Software Engineers - Financial Technology Solutions and Payments",
            "company_name": "Euronet – EFT Segment",
            "location": "Athens, Greece",
            "via": "Indeed",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=_H9p3BqS8kdeO-m-AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNPU7DQBCGYdHmCFRfCwIbIdFAlcKJlAop6aPxetjdaDNj7Uz-Ou7AvTgEJ8Fu3uqR3sXv3WLY0JmwlKFqHrDVL79QZXQSszBXwzNWWUhCpoIdhyRaNN4mWU6eVQwkAz7pdmTxWW-0hzHVkKCCtWosfP-R3Ed7b1uz0kRz8hyaoMdWhXu9tgftbc7e0nQfCznvX99ers0o8fGhO9XJOf6-f9CtdthynG_IgqUnFnvCujIH_gf5Khvj0QAAAA&shmds=v1_AUFQtONeTAESxWOBHDSldjPs9-txhmiScrEytwtwvGb-aBurmg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=_H9p3BqS8kdeO-m-AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f9edf5b1e0afa09125b0faa0958b2500c7055351c3fc4a64e0.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Euronet seeks to employ dynamic and passionate Java Android Software Engineers with experience in mobile development, to embark on an exciting journey with us!\n\nThe successful candidates will play a pivotal role in developing and maintaining applications for our cutting-edge payment terminals.\n\nKEY RESPONSIBILITIES:\n• Design and develop Android applications for payment terminals using reusable and reliable JAVA code.\n• Collaborate with cross-functional teams to understand requirements and translate them into technical specifications.\n• Implement secure and efficient payment processing solutions.\n• Debug and resolve software defects and issues and optimize application performance.\n• Participate in code reviewing activities.\n• Utilize Git for version control and collaboration.\n\nRequirements\n• University Degree in Information Technology or a related academic field.\n• Minimum of 3 years of professional software development experience with Java and Android.\n• Knowledge of banking and/or financial systems will be considered a plus.\n• Proficiency in software design principles and architectural patterns.\n• Experience with secure coding practices.\n• Excellent knowledge of Git for version control.\n• Proficiency in Android Studio for application development.\n• Ability to apply Android UI design principles to create intuitive interfaces.\n• Fluency in Greek & English, both verbal and written.\n• Eligible to work in the EU on full-time permanent basis without the need of employer sponsorship.\n\nCOMPETENCIES:\n• Self-driven, self-motivated and ability to work independently as well as in a team.\n• Attention to detail and results oriented with strong problem-solving skills.\n• Ability to own and drive tasks/assignments while collaborating with peers and other technology teams.\n• Enjoy building knowledge of financial products and concepts.\n• Ability and readiness to work in nationally and geographically diversified teams.\n\nBenefits\n• Work in a dynamic, stable, international environment.\n• Excellent career prospects within a dynamic and multinational organization with leading position in the market and ambitious expansion plans.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://gr.indeed.com/viewjob?jk=e0d6c29b5f850e1f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/java-android-software-engineers/3078653?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://gr.jooble.org/jdp/-414457230616641323?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://gr.linkedin.com/jobs/view/java-android-software-engineers-financial-technology-solutions-and-payments-at-euronet-eft-segment-4117103157?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/greece/job/full-time/others/java-android-software-engineers-financial-technology-solutions-and-payments-122737235?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com: Talent",
                    "link": "https://gr.talent.com/view?id=f3dd29a11061&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKYXZhIEFuZHJvaWQgU29mdHdhcmUgRW5naW5lZXJzIC0gRmluYW5jaWFsIFRlY2hub2xvZ3kgU29sdXRpb25zIGFuZCBQYXltZW50cyIsImNvbXBhbnlfbmFtZSI6IkV1cm9uZXQg4oCTIEVGVCBTZWdtZW50IiwiYWRkcmVzc19jaXR5IjoiQXRoZW5zLCBHcmVlY2UiLCJodGlkb2NpZCI6Il9IOXAzQnFTOGtkZU8tbS1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUjNKbFpXTmwifQ=="
        },
        {
            "title": "Flutter Developer",
            "company_name": "iTechScope",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=nR8EO7_4ylPde0GCAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQoCMRAF-6utrLYUwUQEG23lBFvtjyQ8kkjMhuwq1_jvns0w1czwHTZjeaui0wUfFG6L7ejGngSuh0Rc6cocC9bnpNrkZK1IMVHUaQ4m8MtyhefZPtnLH5Mk19GKU0yH4342rcbtKj8Q0j0sA8pLsgMBP_PEcvd_AAAA&shmds=v1_AUFQtOPJIWxyS8rVx1_J-AsCP17SaiLwY5rwgQyh7rF_ZXFlqw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=nR8EO7_4ylPde0GCAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f90ea16d092763ad0e1aa9537e4fb74055533a2e0929d58a3f.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Greece\n\nOn behalf of our client, a global leader in the production and distribution of a wide range of established nutritional supplements and cosmetic products, we are seeking experienced Flutter Developer to join their new IT Hub in Greece. The company's headquarters are located in Germany, with a subsidiary in Athens, and the IT teams work fully remotely from anywhere in Greece.\n\nA day in the life of a 'Flutter Developer'\n\nThe company has developed two internal products: a web and a mobile application, through which it manages all its internal processes while also supporting its partner network, which consists of approximately 3,000 partners. The web application is built using Java/Spring Boot microservices and Angular, while the mobile application is developed with GO and Flutter, supporting both Android and iOS platforms. Based on your expertise in using Flutter, you will join one of the sub-teams, contributing to the development of the company’s products through the conception, design, and implementation of business solutions.\n\nYour day-to-day\n• Conception, design and implementation of business solutions in the area of digital customer solutions for our sales partners\n• Development and support of iOS and Android applications with a high degree of innovation for our partners\n• Strategic planning and implementation of front-end development projects\n• Taking responsibility for the coordination and control of troubleshooting as part of incident management and ensuring the operation of the developed solutions of the developed solutions\n• Use and continuous optimization of agile development processes and corresponding tool stacks\n• Ensuring software quality by implementing unit tests, expanding End2End tests in test automation and the support of integration tests\n• Technical support in requirements management with regard to feasibility analyses, development and further development of systems\n• Designing data models, interfaces and authorization concepts with the system managers and specialist departments\n• Responsibility for results and realization of the desired solutions with a focus on the needs of the customers/stakeholders and compliance with the company processes (business process and data flow via the existing business applications)\n\nRequirements\n• Completed studies in computer science, business informatics or comparable training\n• Knowledge in the conception and development of multi-tier software architectures in the Flutter/Dart environment\n• Knowledge of mobile development for Android and IOS\n• Knowledge in dealing with tools for collaboration in the development team (Git, Jira, Confluence, SonarQube) and automated deployment/integration of applications (CodeMagick, Jenkins, Docker, Kubernetes)\n• Knowledge of common and cloud databases such as Postgres, MySQL, Azure Cosmos DB\n• Knowledge of build management and continuous integration\n• Knowledge of the Microsoft Azure DevOps environment is a plus\n• Basic application-related knowledge of interfaces (REST, sockets) and protocols (AMQP, TCP, UDP) will be considered as an asset\n\nBenefits\n\nWhat’s in it for you\n\nYou will have the opportunity to work in a motivating and multicultural environment working on a global scale projects and using latest technologies. Additionally, you will enjoy the following benefits:\n• Attractive remuneration package plus performance related reward\n• Intellectually stimulating work environment\n• Customized training plan\n\nThis offer from \"iTechScope\" has been enriched by Jobgether.com and got a 72% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66f5858ffe4b55feaba46a25-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Newjobs",
                    "link": "https://www.newjobs.gr/view/hX1JEUKSZx7Lw4xu3oeFA5/remote-flutter-developer-in-greece-at-itechscope?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6ImlUZWNoU2NvcGUiLCJhZGRyZXNzX2NpdHkiOiJHcmVlY2UiLCJodGlkb2NpZCI6Im5SOEVPN180eWxQZGUwR0NBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUjNKbFpXTmwifQ=="
        },
        {
            "title": "Android Engineer",
            "company_name": "Plum Fintech",
            "location": "Athens, Greece",
            "via": "Indeed",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=liWu6XbjxBgws3YsAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CQ5ymyCaiOCiUwctOPkHJUmPJJLehdwJ_QK_W13e-LrPqtv2NDXOE9woZkJscIAHexB0LSRggoE5Flxfk2qVi7UixURRpzmYwLNlQs-LfbGXP6Mk17AWpziezsfFVIq7zbO8Z7hnUvylmaDXhCR7GBpiwC8IDu9LiQAAAA&shmds=v1_AUFQtOP13M2AlWH5htOywvMnL8b6fRfZZDEzqcr-KjwW3fVZHw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=liWu6XbjxBgws3YsAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f92edb6948ce82522fad60e10a05fc399bc64ae5034c001255.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At Plum, we're on a mission to maximise wealth for all. We’re making saving money effortless and turning investing into something everyone can do. Our journey began back in 2017, when we became one of the first to use artificial intelligence and automation to simplify personal finance. Fast forward to today, and we've already helped people save £2 billion across 10 European markets.\n\nNamed the UK's fastest-growing fintech in the Deloitte Technology Fast 50, our success is down to the passion and dedication of our diverse team. Based in our London, Athens and Nicosia offices, 170 talented people work together to empower people to do more with their money. And now, the team is growing!\n\nThe Role\n\nWe’re looking for a user-focused Android Engineer to join our engineering team. You'll be building Plum on Android from its early days, giving our current and prospective customers a more intimate way to interact with their money.\n\nOur Engineering Approach\n\nWe value good engineering principles, imagination, quirkiness and healthy curiosity. We take a conservative approach to using external frameworks and we aspire to write simple, well-tested code, delivered in rapid iterations.\n\nHow We Work\n\nWe work in \"squads\" – a more startup-appropriate name for saying small, cross-functional teams. Each squad has a mission and a set of KPIs to monitor and improve. As an engineer you'll be working in a squad, but you can also reach out to and work with anyone in the company. You will also be part of a Mobile engineering team, consisting of Mobile Product Engineers who share the same vision and passion of building an exceptional mobile team that will help people be financially better off.\n• Please note we are following a hybrid work model, in which we visit our office 2 times per week. #LI-Hybrid\n\nWhat we look for\n\nTechnical knowledge is critical but we are a startup treading in uncharted territory so attitude is even more important. We're looking for people that like uncertainty and want to figure out how to do things that haven’t been done before. You're a true team player and inherently positive. Where others see problems, you see solutions.\n• You want to build a product that makes people better off\n• You’re excited about programming in Kotlin\n• Yet, you still have intimate knowledge of the full Android stack and Android architecture patterns\n• You want to collaborate on a cutting-edge Android project\n• You’re a designer's best friend. You love being part of the design process and enjoy turning the design into a well-crafted and delightful experience\n• You’re a product person too — you understand the value and impact of your work\n\nFist-bumps if you have\n• Solid experience with Kotlin programming language\n• Hands-on experience with DI and Android architecture components\n• Sound understanding of Git strategies, continuous integration setup, and automation\n• Experience with unit testing\n• An eye for design that you can transform into Material Design!\n• Jetpack compose experience\n• A genuine interest in agile development processes\n• Solid experience working with remote data via REST and JSON\n\nWhat to expect from our hiring process\n\nAt Plum, we value a lot the time you devote to the hiring process, this is why we are always trying to make the process as fast and smooth as possible.\n• 30 min. Call with our Recruitment Team. So we understand better your career plan and what motivates you. ️\n• 45 min. Call with our Engineering Lead. Brief technical discussion about the role and your skills.\n• Task. You will be given a task for us to better to understand your skills. No hard deadlines! ️\n• 90 min. Consisting of two steps:\n1. Call with two people from our Android team. We'll go over the task and introduce you to your future colleagues and to get a glimpse of Plum's culture.\n2. Call with a Product Manager and an Engineering Manager for you to understand the business and envision yourself as part of Plum.\n• Offer\n\nPlum's Perks\nWe're all in this together! Own part of the company through stock options\n• Annual training budget\n• Private Health & Life Insurance\n• Free Plum Premium subscription (normally £9.99 a month)\n• Free parking slots\n• 25 days holiday a year, excluding public holidays\n• Employee referral scheme up to €4000\n• Flexible approach to remote working, though we encourage at least 2-3 days a week in our beautiful office in central Athens for optimal collaboration\n• 45 days work from anywhere\n• Team breakfast on Tuesdays and team lunch on Thursdays in the office, as well as a plentiful supply of fruit, snacks and coffee\n• 1 day paid leave for volunteering, supporting you giving back to society\n• 2 weeks paid sabbatical after four years of service\n• Team trip to secret destinations once a year ✈️\n• Great office location in the heart of Athens (Syntagma square), with an amazing view! A vibe that’s\n\nIf you think this sounds like a bit of you then don’t hesitate to get in touch!\n\nThanks,\n\nPlum Τeam\n• Plum is an Equal Opportunity Employer. Plum does not discriminate on the basis of age, race, religion, sex, gender identity, sexual orientation, non-disqualifying physical or mental disability, national origin or any other basis covered by appropriate law. All employment is decided on the basis of qualifications, merit and business need.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://gr.indeed.com/viewjob?jk=70e2fe4e875a1c88&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://gr.linkedin.com/jobs/view/android-engineer-at-plum-3931232126?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://gr.jooble.org/jdp/-4765259331763652879?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AI Jobs",
                    "link": "https://aijobs.app/android-engineer-plum-fintech-4847058?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs",
                    "link": "https://globalworkly.com/jobs.php?job=Android+engineer&country=Greece&city=Athens&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiUGx1bSBGaW50ZWNoIiwiYWRkcmVzc19jaXR5IjoiQXRoZW5zLCBHcmVlY2UiLCJodGlkb2NpZCI6ImxpV3U2WGJqeEJnd3MzWXNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUjNKbFpXTmwifQ=="
        },
        {
            "title": "Mid-Level Software Engineer - Mobile Applications (Swift & Kotlin)",
            "company_name": "Moveo.AI",
            "location": "Anywhere",
            "via": "Jobs By Workable",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=wJQN8tjU7UdLoBT4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNuw6CQBAAY8snWG1l1AgYExutKAzxQUVlReBc4My5e7ndAB_mB4rNVDOZ6LuInoV9xQ8c0EHJrY51QLhQZwkxQAwFN9YhZN47a2q1TALrcrStwgrurM7SZtZu3IBgHUwPTJAzdw6X517VyylNRVzSic65SQx_UiZseErf3MgflfTz1btasToc91PiqdsuCx6Qk-wKliDTHkl2kAdEgz_A4-bStwAAAA&shmds=v1_AUFQtOP7HST9UTkgrUT234p-a8MMeMU9SCaOXM4JfNlLzOTMrw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=wJQN8tjU7UdLoBT4AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a4e71de537cf0b487aa/images/ebe4b944f12663f907b7a28212d0427c93e2b4e2c92651a7912ef2698f86491c.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who we are\n\nAt Moveo.AI, we’re creating exceptional conversational AI experiences that engage millions of users worldwide. Our mission is to merge leading-edge technology with authentic human interaction, and we’re proud to collaborate with top-tier partners such as Kaizen Gaming, Skroutz, and Allianz European Reliance.\n\nJoin our innovative team of skilled professionals as we push the boundaries of what’s possible in the tech industry. If you’re passionate about mobile application development and excited to contribute to game-changing projects, we want to hear from you!\nAbout the role\n\nWe are looking for a Mid-Level Software Engineer with proficiency in mobile app development, specifically in Swift and/or Kotlin. In this role, you will collaborate with cross-functional teams to design, develop, and maintain high-quality mobile applications/SDK that provide seamless user experiences.\n\nYour expertise in mobile technologies will help us create robust, reliable applications that resonate with our customers. If you thrive in a fast-paced environment and are eager to be part of a dynamic team, this is the perfect opportunity for you!\n\nJoin us if you are excited to\n• Design, develop, and maintain mobile applications for both iOS (using Swift) and/or Android (using Kotlin) platforms.\n• Collaborate with UI/UX designers to create visually appealing and user-friendly interfaces.\n• Conduct code reviews, provide constructive feedback, and ensure adherence to coding best practices.\n• Participate in the entire application lifecycle, focusing on optimization, continuous delivery, and improvement.\n• Stay updated with the latest industry trends and advancements in mobile technology.\nWhat you bring to the team\n• 2+ years of experience in mobile application development with a focus on Swift for iOS or Kotlin for Android.\n• Proven experience in building and deploying mobile applications on the App Store and Google Play.\n• Strong understanding of mobile development paradigms, design patterns, and lifecycle management.\n• Familiarity with RESTful APIs and third-party libraries integration.\n• Good communication skills and ability to work collaboratively in a team environment.\n• A portfolio of relevant mobile applications or projects showcasing your skills is a plus.\n\nWhy You’ll Love Working at Moveo.ai\n• 🏃 A buddy will support you with your onboarding\n• 💸 Competitive salary package\n• 📚 Learning budget for ongoing education\n• ⭐ Clear career paths & growth opportunities\n• Join us, not just for a job, but for a thriving journey!",
            "apply_options": [
                {
                    "title": "Jobs By Workable",
                    "link": "https://jobs.workable.com/view/3Qz7UxLQcJPMvcKSk6Bgby/hybrid-mid-level-software-engineer---mobile-applications-(swift-%26-kotlin)-in-athens-at-moveo.ai?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Newjobs",
                    "link": "https://www.newjobs.gr/view/3Qz7UxLQcJPMvcKSk6Bgby/hybrid-mid-level-software-engineer---mobile-applications-(swift-%26-kotlin)-in-athens-at-moveo.ai?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWQtTGV2ZWwgU29mdHdhcmUgRW5naW5lZXIgLSBNb2JpbGUgQXBwbGljYXRpb25zIChTd2lmdCBcdTAwMjYgS290bGluKSIsImNvbXBhbnlfbmFtZSI6Ik1vdmVvLkFJIiwiYWRkcmVzc19jaXR5IjoiQXRoZW5zLCBHcmVlY2UiLCJodGlkb2NpZCI6IndKUU44dGpVN1VkTG9CVDRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUjNKbFpXTmwifQ=="
        },
        {
            "title": "Sr. Android Engineer",
            "company_name": "ITExpert",
            "location": "Greece",
            "via": "Jooble",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=VO8MIFhM63slbEBuAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMoQ4CMQwAUH8SiaqGsBESDCjEhYAFf9l2zW5ktEtbMcW3A-bJN3yG7UMcXGgWLjOMlAshCuzgzhEUg6QFmODKnCuuz4tZ05P3qtVltWAlucRvz4SRu39x1D-TLkGw1WA4HY777hrlzer2HHtDMSi_UBATfgEqaHndgAAAAA&shmds=v1_AUFQtOPXj09phlhCPuO63K-CHsGEChlR00CcVyeLUrMLzhOVlw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=VO8MIFhM63slbEBuAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Fingerprint empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).\n\nWe have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman , Apollo.io, MinIO , Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar &Gradle ).\n\nWho We Are Looking For: We are looking for a Senior Android Engineer with a solid background in Information Security. The ideal candidate will have experience building Android applications or libraries from scratch and will be skilled in security frameworks, cryptography, and network protocols. The role requires strong expertise in Kotlin, and familiarity with Jetpack Compose is preferred.\n\nKey Responsibilities:\n• Design, develop, and optimize native Android applications and libraries, focusing on security, scalability, and performance.\n• Collaborate with cross-functional teams to implement security protocols and ensure that applications align with best security practices.\n• Build developer tools that enhance productivity and streamline the development process.\n• Contribute to the maintenance and advancement of security frameworks for mobile applications.\n• Provide mentorship to junior team members and contribute to their technical development.\n\nRequirements:\n• Education: Degree in Computer Science, Information Security, or equivalent experience.\n• Experience:\n• 5+ years as a Senior Android Engineer (prior experience in a Senior Android role is required).\n• Strong Information Security background, with practical experience in:\n• Network protocols and secure coding practices\n• Cryptography and security framework development\n• Proven experience in building Android applications from the ground up, with expertise in Kotlin and vanilla Android SDKs. Experience with Jetpack Compose is preferred.\n• Experience with Android NDK is a plus.\n• Contributions to Open Source projects on GitHub are a bonus.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nDue to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location .\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.\n\nIf you are applying as a resident of California, please read our CCPA notice here\n\nIf you are applying as a resident of the EU, please read our GDPR notice here",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://gr.jooble.org/jdp/-5108457785176956055?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IklURXhwZXJ0IiwiYWRkcmVzc19jaXR5IjoiR3JlZWNlIiwiaHRpZG9jaWQiOiJWTzhNSUZoTTYzc2xiRUJ1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1IzSmxaV05sIn0="
        },
        {
            "title": "Mobile Developer",
            "company_name": "DND Media",
            "location": "Athens, Greece",
            "via": "Indeed",
            "share_link": "https://www.google.gr/search?ibp=htl;jobs&q=Android+developer&htidocid=ZbzayeKW6t5OpaX4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQoCIRQFUNrOJ9Tm7YIojaBNrQJhIJh-YVC7qGE-8UnMvh-PzuIM39WwndilDDL4IHNFowPd2ZHANh-JC43MIWN9jb1XuWgtklWQbnvyyvNbc4HjRb_Yyb9Zom2o2XbMp_NxUbWE3cY8DE14Jkup0K1HFNnT2ACPH71MB7qGAAAA&shmds=v1_AUFQtOPDlIao93mwW5HX2Ft4UHUF02kHizEyk5wfKHG__URBqA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ZbzayeKW6t5OpaX4AAAAAA%3D%3D",
            "extensions": [
                "23 days ago",
                "€2K–€4K a month",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "23 days ago",
                "salary": "€2K–€4K a month",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Description:\nWe are seeking a skilled Mobile Developer with experience in Flutter to build high-quality mobile applications. The ideal candidate should be proficient in developing cross-platform applications that work seamlessly on both iOS and Android. You will work closely with our product and design teams to create engaging and efficient user interfaces, ensuring smooth and reliable performance.\n\nKey Responsibilities:\n• Develop, test, and deploy high-quality mobile applications using Flutter for both iOS and Android platforms.\n• Write clean, maintainable, and efficient code while following best practices.\n• Collaborate with UI/UX designers to implement modern and intuitive designs.\n• Troubleshoot, debug, and optimize applications for performance, speed, and scalability.\n• Integrate third-party libraries and APIs to extend the functionality of the applications.\n• Stay up-to-date with the latest industry trends, technologies, and Flutter updates to continuously improve your skills.\n• Participate in code reviews, providing constructive feedback to peers to maintain high code quality.\n• Collaborate in an agile environment with cross-functional teams including product managers, designers, and other developers.\n• Ensure that applications follow security and data protection best practices.\n\nRequired Skills and Qualifications:\n• Proven experience as a Mobile Developer with strong knowledge of Flutter.\n• Solid understanding of Dart programming language.\n• Experience with both Android and iOS mobile platforms.\n• Experience with integrating RESTful APIs and working with third-party libraries.\n• Familiarity with version control systems such as Git.\n• Knowledge of mobile app performance optimization techniques.\n• Strong problem-solving skills and attention to detail.\n• Ability to work independently as well as part of a team.\n\nJob Type: Full-time\n\nPay: 2,000.00€ - 4,000.00€ per month\n\nExperience:\n• Flutter: 2 years (Required)\n• Mobile Developer: 2 years (Required)\n\nApplication Deadline: 06/01/2025",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://gr.indeed.com/viewjob?jk=135efe5bc9a4b3dd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://gr.linkedin.com/jobs/view/android-app-developer-at-m-stat-4117159146?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Cyprus Cinema",
                    "link": "https://www.cypruscinema.com/jobs/job/28125/senior-mobile-app-developer-athens-greece?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "CyprusNet",
                    "link": "https://www.cyprusnet.com/jobs/job/28125/senior-mobile-app-developer-athens-greece?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Cyprus Employment",
                    "link": "https://www.cyprusemployment.com/jobs/job/28125/senior-mobile-app-developer-athens-greece?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Cyprus Consultants",
                    "link": "https://www.cyprusconsultants.com/jobs/job/28125/senior-mobile-app-developer-athens-greece?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "MyCarriera.gr",
                    "link": "https://mycarriera.gr/view/417653.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs",
                    "link": "https://globalworkly.com/jobs.php?job=Mobile+developer&country=Greece&city=Athens&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiRE5EIE1lZGlhIiwiYWRkcmVzc19jaXR5IjoiQXRoZW5zLCBHcmVlY2UiLCJodGlkb2NpZCI6IlpiemF5ZUtXNnQ1T3BhWDRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUjNKbFpXTmwifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUekJJWVhKcFVGZHVkRUpOU1dnMmVGRmtiMEZ2V0hCdVlUWkJkVUZsWlU5Vk5HUkNlazF3TjNOVU0zZGhkMVZQVFc5ak9GcFBWMkpzWkhsdU1qZFBNMjUzV1hZMlpuaFFPRVp5VDFGSmFGYzNTMGQxUlRONE5uTnlVeTB6Yms5dVRDMVRXa3QzYkRSSmFrVXhRV05RV0RWUFIwdGpaV2R1VEZGblNVRmFUemxoWkZsa1FtaFpVbnBLTjJoRVNHdHBVbm95WDI1U0xUTlhUSFpRVkZCZlRXeFNkRzFIT1c1M1ZWVXdTMHh0U2psNkxXUk5OazlPU214VFJFaFVNbnBtTkhWcmJIZDBVMmRqWTJaTmRVZG1RVll3UWt4WWFDMXpVbmxrTTJ3MU5rdDBNVWN3Tlc5T1JsRkVNbDlKY0RWdVJFbzBNbDgyU25VM2NFdzFWbkpRTVdsVlJEWlpkSEpUYldZeU1VTlNNbFUxZERkWldVZHNaRGhoVWtFU0YxUm5jVVphTkdwWVNWcEhjelZPYjFCdFlXVjBNbEZaR2lKQlJsaHlSV053YUhaUVJVWjJPVzlLWW5sUGRrTnNaVWh3U1VkTkxYQkdRVUZSIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.gr&location=Greece&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUekJJWVhKcFVGZHVkRUpOU1dnMmVGRmtiMEZ2V0hCdVlUWkJkVUZsWlU5Vk5HUkNlazF3TjNOVU0zZGhkMVZQVFc5ak9GcFBWMkpzWkhsdU1qZFBNMjUzV1hZMlpuaFFPRVp5VDFGSmFGYzNTMGQxUlRONE5uTnlVeTB6Yms5dVRDMVRXa3QzYkRSSmFrVXhRV05RV0RWUFIwdGpaV2R1VEZGblNVRmFUemxoWkZsa1FtaFpVbnBLTjJoRVNHdHBVbm95WDI1U0xUTlhUSFpRVkZCZlRXeFNkRzFIT1c1M1ZWVXdTMHh0U2psNkxXUk5OazlPU214VFJFaFVNbnBtTkhWcmJIZDBVMmRqWTJaTmRVZG1RVll3UWt4WWFDMXpVbmxrTTJ3MU5rdDBNVWN3Tlc5T1JsRkVNbDlKY0RWdVJFbzBNbDgyU25VM2NFdzFWbkpRTVdsVlJEWlpkSEpUYldZeU1VTlNNbFUxZERkWldVZHNaRGhoVWtFU0YxUm5jVVphTkdwWVNWcEhjelZPYjFCdFlXVjBNbEZaR2lKQlJsaHlSV053YUhaUVJVWjJPVzlLWW5sUGRrTnNaVWh3U1VkTkxYQkdRVUZSIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}