{
    "search_metadata": {
        "id": "67850a528b5c6e127bec21d1",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/bbf56c65c0b31056/67850a528b5c6e127bec21d1.json",
        "created_at": "2025-01-13 12:42:58 UTC",
        "processed_at": "2025-01-13 12:42:58 UTC",
        "google_jobs_url": "https://www.google.hu/async/callback:550?q=Android+developer&uule=w+CAIQICIHSHVuZ2FyeQ&udm=8&fc=EskCCowCQUpHOUprTlpRVU1IQm8xb1R0UUpvek1TbE5ReFVmSU1zaGRQcEEwYjZtdzlVRU9HT0libnBjWkNNeEZ6Uk5tTnpQVHN4bnFzRlFadmZDNlMtYVlXNVNRX0JVcktIRjVINEFocnQzc19WTmM3aGpWczdfSGZFczNfdllIM3hsX1BSMzdaQmVWUkhWUFNHSnNEME52bjlLeEN6elVTZEVpV3pwMm9zcTQzczVNcTFHb2hXaGZwYndITzBxZmxTT3J6WGxTaWdqdGNhQk5lWUdfZHpkSzM4c3BuMkRoNDJuMWU2TFFzMDBPam80T2FnaFR1YVlNM2JXSnNHQnQxRktWRnl4LTBmS2lLS0VrUBIUVWdxRlo4UWhrdExrMmctaDdNVWcaIkFGWHJFY3FXQXI1RXAzOUNPZ2xZald3M2dGYWtMYm1ON3c&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/bbf56c65c0b31056/67850a528b5c6e127bec21d1.html",
        "prettify_html_file": "https://serpapi.com/searches/bbf56c65c0b31056/67850a528b5c6e127bec21d1.prettify",
        "total_time_taken": 0.34
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Hungary",
        "location_used": "Hungary",
        "google_domain": "google.hu",
        "next_page_token": "eyJmYyI6IkVza0NDb3dDUVVwSE9VcHJUbHBSVlUxSVFtOHhiMVIwVVVwdmVrMVRiRTVSZUZWbVNVMXphR1JRY0VFd1lqWnRkemxWUlU5SFQwbGlibkJqV2tOTmVFWjZVazV0VG5wUVZITjRibkZ6UmxGYWRtWkRObE10WVZsWE5WTlJYMEpWY2t0SVJqVklORUZvY25RemMxOVdUbU0zYUdwV2N6ZGZTR1pGY3pOZmRsbElNM2hzWDFCU016ZGFRbVZXVWtoV1VGTkhTbk5FTUU1MmJqbExlRU42ZWxWVFpFVnBWM3B3TW05emNUUXpjelZOY1RGSGIyaFhhR1p3WW5kSVR6QnhabXhUVDNKNldHeFRhV2RxZEdOaFFrNWxXVWRmWkhwa1N6TTRjM0J1TWtSb05ESnVNV1UyVEZGek1EQlBhbTgwVDJGbmFGUjFZVmxOTTJKWFNuTkhRblF4Umt0V1JubDRMVEJtUzJsTFMwVnJVQklVVldkeFJsbzRVV2hyZEV4ck1tY3RhRGROVldjYUlrRkdXSEpGWTNGWFFYSTFSWEF6T1VOUFoyeFphbGQzTTJkR1lXdE1ZbTFPTjNjIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Mobile Developer",
            "company_name": "Apollo Technical LLC",
            "location": "Hungary",
            "via": "Jooble",
            "share_link": "https://www.google.hu/search?ibp=htl;jobs&q=Android+developer&htidocid=FfM_3XNp7B6Lro3QAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwAUFzvE1zMJgi2IrjoJAqKnJv70ZbQ9ohJaaqcX-Bvi2943XfWLe_iMyGc8Y0kBSus4SYeFF0NCYThIhIJ54fUWtG9tapkojbXcjBBnlYYvUx2FK__Bk2uYiHXcNjuNpMpHFeLYxEigQeGxDk4gr4_QWa4vji6-vkBdHTDWYoAAAA&shmds=v1_AUFQtOPZ_H5J8E9uABC1b2BxAP1RQ2FGQ69u_4c8k_SaK00NAQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=FfM_3XNp7B6Lro3QAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "About Us\n\nBegin a career with one of the world’s largest virtual companies where you have flexibility and space to grow, just as we have been able to thanks to our team. Use the latest tools and technology to produce your best work and enjoy remuneration that’s reflective of your skills and experience.\n\nBrowse our current openings and apply today. We look forward to hearing from you.\n\nJob Description\n\nThis is a remote position.\n\nAre you on the hunt for exciting new challenges that boost your professional growth? We’re looking for an experienced Mobile Developer with strong expertise in Dart (Flutter), C/C++, and Objective-C or Swift C++ . If you’re ready to contribute to cutting-edge applications and join a dynamic, global team, this full-time, remote position could be the perfect fit for you. Read on to learn more about becoming part of Scopic’s team of 250+ professionals from over 60 countries.\n\nRequirements:\n• 5+ years of experience in mobile development with Dart (Flutter), C/C++, and either Objective-C or Swift.\n• Strong knowledge of Core ML, with hands-on experience in Objective-C implementations.\n• Proficiency in TensorFlow/TFLite for mobile machine learning.\n• Experience with vendor SDKs like Qualcomm SNEP and Samsung ENN SDK for mobile AI/ML optimization.\n• Familiarity with CI/CD processes, preferably with Jenkins (or similar tools).\n• Solid understanding of mobile performance optimization and architecture.\n• Bachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).\n• Proficiency in English, both written and spoken.\n\nThe secret ingredients that make us special:\n• Your growth is our growth. We invest in your future with paid training and other professional opportunities.\n• We’re industry innovators at the forefront of change. Equipped with the latest technologies and a team of knowledgeable colleagues by your side, you’ll embrace new and interesting challenges.\n• Your location. Your schedule — Pick your time zone, choose your preferred hours, and work from the place where you feel most at home.\n• Flexibility and freedom are in our DNA! As long as you have a stable internet connection and the drive to thrive, you can travel and work from anywhere you like.\n• A workload you can rely on. We’ll set you enough tasks to keep that mind busy! At Scopic, we’ll ensure you always have a consistent flow of engaging, challenging work to do.\n• Recognition and reward. We acknowledge diligence and hard work through annual pay increases for good performance.\n\nDown to business!\n• Your starting rate is negotiable depending on your skills and experience.\n• This is an hourly paid position.\n• Contractors are paid monthly via wire transfer.\n\nOur values:\n\nScopic is an equal-opportunity employer. We value diversity and do not discriminate on the basis of race, religion, color, marital status, national origin, gender, veteran status, sexual orientation, age, or disability status.\n\nHave the skills, the drive, and the passion to join the Scopic family?\n\nApply today to join our growing team of remote professionals from around the world.\n\nTERMS OF APPLICATION\n\nBy submitting an application;\n• I consent that the data provided in this form, and the attached CV, will be used for Scopic's recruiting purposes and email communications.\n• I consent to Scopic conducting an identity verification process as part of the hiring process. I understand that my personal information may be collected and processed for the purpose of verifying my identity in compliance with applicable laws. \n\nAttention Job Seekers: Please be aware that scammers may be fraudulently using our company's name in hiring scams. To ensure your safety, all legitimate communication regarding job opportunities from our company will only come from email addresses ending with @scopicsoftware.com. Please exercise caution and report any suspicious activity to our official channels.",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://hu.jooble.org/jdp/-5781918884232768450?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Állás, Munka | Jobrapido.com",
                    "link": "https://hu.jobrapido.com/jobpreview/1303786104939347968?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQXBvbGxvIFRlY2huaWNhbCBMTEMiLCJhZGRyZXNzX2NpdHkiOiJIdW5nYXJ5IiwiaHRpZG9jaWQiOiJGZk1fM1hOcDdCNkxybzNRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNIVnVaMkZ5ZVEifQ=="
        },
        {
            "title": "Mobile Developer",
            "company_name": "BlueThrone",
            "location": "Budapest, Hungary",
            "via": "Trabajo.org",
            "share_link": "https://www.google.hu/search?ibp=htl;jobs&q=Android+developer&htidocid=c9LTUkiCJgqCLFW5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKMQoCMRAAQGzvCTZuJ4gmIthodwiKYGd_JHFJcsRsyG7kfIHfVpuppvvMuuWNbEwIJ3xhooIVNnAlC4ymugCU4UzkE86PQaTwQWvmpDyLkeiUo6emjJYmPZLlPwMHU7EkIzjs9ttJlexXiz41vIf6uxAz9O1hCrKs4dKyN_X9BSPJyWqKAAAA&shmds=v1_AUFQtOOfguEQg9EhsDNFzA3OZaljxSEussoDscDU1Qd6IvCaFg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=c9LTUkiCJgqCLFW5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a528b5c6e127bec21d1/images/1f36ef2ee8e1f897a461c191714b2d6632250b4eae3a0e148261b197e0031d0a.gif",
            "extensions": [
                "29 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "29 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "The leading app in the music-tech world is looking for a powerful Mobile Flutter Developer\n\nFirst things first, if you are looking for a fully remote role with flexible hours, unlimited time off, and are based somewhere in Europe or Asia, read on\nAbout BlueThrone\n\nEmbark on a transformative journey with BlueThrone, a pioneer in the mobile app domain.\n\nOur Specialization: Turning B2C mobile apps into market leaders, boasting over 49.5 million downloads and 4.6 million monthly active users.\n\nOur Mission: Propel iOS and Android applications to new heights. We've achieved a remarkable $8M ARR organically in just 25 months, exemplifying sustainable growth and innovation.\n\nOur Team: Rich in tech entrepreneurship and mobile marketing expertise, we thrive in an environment that values agility, growth mindset, flexibility, creativity, and tangible outcomes.\n\nAt BlueThrone, your career is more than a job - it's a journey toward excellence in an innovative culture where high performance is as valued as innovation.\n\nAbout Our Unicorn\n\nYou will join one of our shining unicorns: an innovative music analytics mobile platform that has quickly become a staple for music lovers globally.\n\nOur Reach: Launched in 2020, we've organically reached over 20 million users, allowing them to analyze, track, and compare their musical tastes while connecting directly with their favorite artists.\n\nOur Growth: Has been entirely organic, demonstrating strong product-market fit and high user engagement.\n\nOur Coverage: This platform has penetrated 35+ languages and 190+ markets, with a diverse user base and substantial revenue streams.\n\nThe Role\n\nWe are looking for a Flutter Developer to help build our revolutionary music tech app. This role is not just about coding it's a calling for those who can harmonize technology and music to create seamless mobile experiences.\nWhat are we looking for?\n• 5+ years of professional mobile app development experience\n• 3+ years building high-quality Flutter apps\n• Dart Expertise: Strong knowledge of Dart and its ecosystem\n• IDE Proficiency: Skilled with Android Studio and Visual Studio Code\n• Architectural Know-how: Experience designing app architecture using patterns like BLoC or Provider\n• Firebase Skills: Familiarity with Firebase services is a plus\n• Team Player: Comfortable with collaboration and code reviews\n• Continuous Learner: Keen to stay updated with new tech trends\n• In-App Purchase Experience: Knowledge of implementing in-app purchases in Flutter (desired)\n• Cultural Awareness: Experience in multicultural work environments is valued\nThings we'll trust you with...\n• Async Programming: Handle concurrency using Dart's async features\n• Architecture: Build and maintain robust apps using clean, scalable code\n• State Management: Implement effective state management solutions\n• API Integration: Develop solid networking components for REST APIs\n• Quality Assurance: Conduct thorough unit and widget testing\nYou’ll love it here if:\n• You prefer flexible hours, unlimited time off, and the ability to work from anywhere.\n• You are naturally curious and eager to drive impact for both users and the business.\n• You enjoy wearing multiple hats - we value experts but appreciate jacks of all trades.\n• You thrive in a drama-free, calm, and systematic problem-solving environment.\n• You love challenges and are always ready to roll up your sleeves.\n• You believe in working smarter, not harder - prioritizing productivity and quality over punching the clock.\n• Above all, you follow your passion and have fun while doing it.\n\nEqual opportunities for everyone\nTo truly represent our vibrant and diverse BlueThrone community, we prioritize diversity and inclusion. We are committed to fostering an environment where everyone can do their best work. We strongly encourage applicants of all backgrounds. We consider all candidates regardless of age, ethnicity, religion, sex, sexual orientation, gender identity, family or parental status, national origin, veteran status, neurodiversity, or disability. If you need reasonable adjustments at any point in the application or interview process, please let us know.\n\nJoin us in a role that's more than a job - it's a chance to be part of a transformative mission propelling mobile apps to unparalleled success.",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://hu.trabajo.org/job-2653-6466bc95521ba003e7506dd409a15131?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://hu.bebee.com/job/b0f36cc800c334d95b37bccca897b2e8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQmx1ZVRocm9uZSIsImFkZHJlc3NfY2l0eSI6IkJ1ZGFwZXN0LCBIdW5nYXJ5IiwiaHRpZG9jaWQiOiJjOUxUVWtpQ0pncUNMRlc1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNIVnVaMkZ5ZVEifQ=="
        },
        {
            "title": "Mobile Application Developer Position for Navigation System",
            "company_name": "Experis Polska",
            "location": "Budapest, Hungary",
            "via": "Trabajo.org",
            "share_link": "https://www.google.hu/search?ibp=htl;jobs&q=Android+developer&htidocid=0KXxAbK4V_G8P8d9AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yWNQQrCMBBFcdsjuBpwJ9qI4EZXiqIIiugBSlLHNJpmQiYt7cU8n1E3f_H4j5e9B9n1RMpYhLX31pQyGnKwxRYteQxwITY_9KAAZ9ka_X_ceo5YwxSOpIBRhrKChPdE2uJwVcXoeSkEs801x-SUeUm1IIeKOvEkxd8puJIBvZURi_li1uXe6fFo16Wy4dS2_JJgHGyau_TIcQKHxmkZ-g9P12_-uQAAAA&shmds=v1_AUFQtONIJ6HNrwwGufbFUjl8q0z1-ir_lJWRghOKE-d3m6W0jQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=0KXxAbK4V_G8P8d9AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a528b5c6e127bec21d1/images/1f36ef2ee8e1f8970b090f9765f76af0dd49fc299807a87d0d430d57ebb1c09a.gif",
            "extensions": [
                "28 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are seeking a highly skilled Mobile Application Developer to join our team at Experis Polska.\nJob Description:\n\nThis part-time opportunity involves verifying the quality of our documentation and ensuring the best possible user experience for drivers. The ideal candidate will have experience in application development, knowledge of Kotlin language, and proficiency in Android Studio.\n\nThe project focuses on developing maps and navigation applications using Android SDKs. As a member of our global team, you will collaborate with unique and passionate problem solvers to deliver innovative solutions.\n\nYou will work 100% remotely and have the flexibility to manage your own IT equipment. The engagement is 2 hours per week for 1 month, with a B2B Contract / Mandate Contract salary of 80 PLN/h.\nRequirements:\n• Minimum 2 years of experience in application development\n• Knowledge of Kotlin language\n• Working with Android Studio\n• Advanced English skills\nBenefits:\n\nThis role offers a competitive salary, remote work flexibility, and the opportunity to work on a global project. If you're passionate about mobile application development and want to contribute to delivering top-notch navigation systems, we encourage you to apply.",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://hu.trabajo.org/job-3073-dc944fae47905fb52954688d30adb6f8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIFBvc2l0aW9uIGZvciBOYXZpZ2F0aW9uIFN5c3RlbSIsImNvbXBhbnlfbmFtZSI6IkV4cGVyaXMgUG9sc2thIiwiYWRkcmVzc19jaXR5IjoiQnVkYXBlc3QsIEh1bmdhcnkiLCJodGlkb2NpZCI6IjBLWHhBYks0Vl9HOFA4ZDlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        }
    ]
}