{
    "search_metadata": {
        "id": "67850a812e786d8f0cc0571c",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/cd7ce9a998b1be6b/67850a812e786d8f0cc0571c.json",
        "created_at": "2025-01-13 12:43:45 UTC",
        "processed_at": "2025-01-13 12:43:45 UTC",
        "google_jobs_url": "https://www.google.nl/async/callback:550?q=Android+developer&uule=w+CAIQICILTmV0aGVybGFuZHM&udm=8&fc=EuICCqICQUpHOUprT0RfVW1OR1JzTVhnU0dxTkgweEdoQVpqWTljSlppQnhVUXRjbGRWazhCUnFFME9lejR4OUVTSmZBRW5JSHZDUVByZHdLQlIteU92dUtCblBIaEdYUTgwcVNoQ1BYb1BVSTNNejdtNl9MdTZXeURoMERjMXVpc3drWEJxRGhmbG1hV0RxWXdDdDhLeUZIUkdsZVltN1RDSUVZd2JMMEdoaVRfZ3piZDJLak1qZ3FJU2g1bkszRS1DTk9qTi1xbVVsTzk2MzAxWURHWUxvU0FFZ3NIdW10akhfaVdHMXl6T2JOaE93SWs4WnBIQWViSGV4R0hIQVJnZm1iWjlHYnNhWHZ5OUcyUGRST3F5RTVOd1pNZTQtM3htd19sS1ESF2dBcUZaLTdOQlBTMXdONFAxSVMxMFFVGiJBRlhyRWNyN1p6aFUyNmZoLWRfRk9ONnlkbW05bWJtTGhB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/cd7ce9a998b1be6b/67850a812e786d8f0cc0571c.html",
        "prettify_html_file": "https://serpapi.com/searches/cd7ce9a998b1be6b/67850a812e786d8f0cc0571c.prettify",
        "total_time_taken": 1.24
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Netherlands",
        "location_used": "Netherlands",
        "google_domain": "google.nl",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUMFJmVlcxT1IxSnpUVmhuVTBkeFRrZ3dlRWRvUVZwcVdUbGpTbHBwUW5oVlVYUmpiR1JXYXpoQ1VuRkZNRTlsZWpSNE9VVlRTbVpCUlc1SlNIWkRVVkJ5WkhkTFFsSXRlVTkyZFV0Q2JsQklhRWRZVVRnd2NWTm9RMUJZYjFCVlNUTk5lamR0Tmw5TWRUWlhlVVJvTUVSak1YVnBjM2RyV0VKeFJHaG1iRzFoVjBSeFdYZERkRGhMZVVaSVVrZHNaVmx0TjFSRFNVVlpkMkpNTUVkb2FWUmZaM3BpWkRKTGFrMXFaM0ZKVTJnMWJrc3pSUzFEVGs5cVRpMXhiVlZzVHprMk16QXhXVVJIV1V4dlUwRkZaM05JZFcxMGFraGZhVmRITVhsNlQySk9hRTkzU1dzNFduQklRV1ZpU0dWNFIwaElRVkpuWm0xaVdqbEhZbk5oV0haNU9VY3lVR1JTVDNGNVJUVk9kMXBOWlRRdE0zaHRkMTlzUzFFU0YyZEJjVVphTFRkT1FsQlRNWGRPTkZBeFNWTXhNRkZWR2lKQlJsaHlSV055TjFwNmFGVXlObVpvTFdSZlJrOU9ObmxrYlcwNWJXSnRUR2hCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer – HBS – Privacy",
            "company_name": "Booking.com",
            "location": "Amsterdam, Netherlands",
            "via": "Cool Jobs Clever Companies",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=m8sFW43TRIwLXMe_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3LMQrCMBSAYVx7BKe3uIg2IrioS4ugOIjgAUqaPJJomhfyQqmbd_AGHs2TSF3-b_qLz6TYV0EnchoO2KOniAm-rzec6tvfa3K9VE9YwplaYJRJWaAARyLjcbqzOUfeCsHsS8NZZqdKRZ2ggC0N4k4tj2nYyoTRy4zNerMayhjMfFYTPVww4wAuQNVxxqRlt4ALZovJy6D5BwsgzEelAAAA&shmds=v1_AUFQtONmaysmwnPcgaTxeEsBVvwhVuVXdk-UjUu-5U2jnmEq7Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=m8sFW43TRIwLXMe_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a812e786d8f0cc0571c/images/288dbf43550923637cfadac4a55901c78fc85b5d97d2eac4aa8a7fbe4e28b02e.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "It wasn’t so long ago that booking a trip so see the Eiffel Tower, stroll down New York’s iconic Madison Avenue or feel the sand between our toes on Copacabana Beach was simply a matter of a few taps on our smartphone. In fact, that’s what we do at Booking.com. We make it easier for everyone to experience the world. And while that world might feel a little farther away right now, we’re busy preparing for when the world is ready to travel once more. Across our offices worldwide, we continue to innovate. To solve for some of the most complex challenges in travel and technology, and to plan for the exciting developments that lie ahead. With strategic long-term investments into what we believe the future of travel can be, we are opening up new career opportunities that will have a strong impact on our mission. We are united in the belief that our very human desire to explore the planet’s beauty and discover more about other people and cultures will endure. The world is waiting for us. Together, we will be ready.\n\nThe Horizontal Business Services department is part of the Central Tech Organization at Booking.com. We have a team of highly skilled engineers whose mission is enabling all product verticals and business units to integrate, store, and access entities relevant to the whole connected trip, be them users and accounts, reservation transactions ranging from accommodation reservations to train reservations, etc. through our services. We are centrally connected to the application layers of different customer-facing business verticals, but also with back-office, compliance-ensuring, and business-intelligence systems such as Payments, FP&A, Billing, and Security.\n\nThe Identity platform track in the Horizontal Business Services department is part of the Central Tech organisation at Booking.com. We have a team of highly skilled engineers, products, and designers whose vision is to enable our business to know our customer by providing one account for everyone, through an Identity Platform that covers: identity and access management, centralised account management, consolidated storage of account data and compliant privacy consent management system so as to support the Connected Trip. Our strategy is to build a scalable identity and privacy management service to support all the business teams in the company either in the customer realm or partner realm, thus we work closely with all product verticals like flight/attraction/food/taxi/car/accommodation and any team relies on User Identity and privacy like marketing, genius, business booker and more.\n\nB.responsible\n\nOur guiding principle is that by helping our users we help our business, so we listen to our customers and give them features they want to use. As a developer in our mobile team you’ll be a key part of the idea generation process, working in a small start up-like group which takes full ownership of its part of our platform. You’ll be working on the iterative improvements we make as part of our high-speed release cycles, as well as looking ahead and implementing broader changes to our mobile app.\n\nImportant aspects of the job include:\n• Rapidly develop new features and A/B test them with our customers\n• Solve issues with the app, prioritizing based on customer impact\n• Collaborate with Back-end Developers, Product Owners and Designers to constantly improve our Android app\n• Contribute to Booking.com’s growth through interviewing, on-boarding, or other recruitment efforts.\n\nB.skilled\n\nWe expect our developers to know the ins and outs of the Android framework and to deliver polished products customers want to use. We need self-starters who are great at solving problems, initiate solutions and discussions and are not afraid of solving challenges due to our huge scale.\n\nWe have found that people who match the following requirements are the ones who fit us best:\n• 5+ years of experience as a developer using Java and other languages\n• At least 2-3 years of this experience must be from working with Android SDK\n• Strong interaction and design sense, excellent attention to detail\n• Self-motivated to explore new technologies, applications and environments\n• Self-starter, highly motivated, team-player\n\nBonus Points for:\n• Experience with Android Market place & Distribution Process\n• An approved Play store app\n• SQL knowledge and/or willingness to learn\n• Experience working with A/B testing\n• You are passionate about open source and contribute\n• You’re not afraid to solve deep technical challenges of a whole new level at a huge scale\n• You have an intrinsic curiosity in technological innovations and you are always on top of the latest trends\n\nB.offered\n\nWe are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential. We also offer what we call the “Booking Deal” with other competitive perks and benefits. The Technology department offers training and attends/speaks at global conferences.\n\nThis position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam. We have successfully relocated 300+ Technology professionals to Amsterdam in the last year!",
            "apply_options": [
                {
                    "title": "Cool Jobs Clever Companies",
                    "link": "https://job.coolever.life/job/booking-com-android-developer-hbs-privacy/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciDigJMgSEJTIOKAkyBQcml2YWN5IiwiY29tcGFueV9uYW1lIjoiQm9va2luZy5jb20iLCJhZGRyZXNzX2NpdHkiOiJBbXN0ZXJkYW0sIE5ldGhlcmxhbmRzIiwiaHRpZG9jaWQiOiJtOHNGVzQzVFJJd0xYTWVfQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTFRtVjBhR1Z5YkdGdVpITSJ9"
        },
        {
            "title": "Android development internship",
            "company_name": "DTT Multimedia",
            "location": "Amsterdam, Netherlands",
            "via": "DTT",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=SYbLC5oxabbFH8LrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU43imgjQhedCoIg6NS9pM3RpCR3IXdKv8ZvtS5vfdV3UzUtucLBgcMPRs4JSSGQYiHxIcMRHjyAoC2jBya4M08Rt1evmuVijEisJ1GrYaxHToYJB17MzIP86cXbgjlaxf7cnJY607Tf3boOnu-oIaELdu2gTbKWzqYDvFA9lmjJyQ8C-CyxoQAAAA&shmds=v1_AUFQtOOA5_c0YEPir3XguXYsBqnJ3Erxk1hoHBdxzmYZN2avbg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=SYbLC5oxabbFH8LrAAAAAA%3D%3D",
            "extensions": [
                "Internship"
            ],
            "detected_extensions": {
                "schedule_type": "Internship"
            },
            "description": "Would you like to work for an app developer in the center of Amsterdam? At DTT we are looking for a talented Android development intern. Do you have experience with Kotlin and would you like to contribute to the development of (inter)national applications? Then you are the Android trainee we are looking for.",
            "apply_options": [
                {
                    "title": "DTT",
                    "link": "https://www.d-tt.nl/en/vacancies/android-developer-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIGRldmVsb3BtZW50IGludGVybnNoaXAiLCJjb21wYW55X25hbWUiOiJEVFQgTXVsdGltZWRpYSIsImFkZHJlc3NfY2l0eSI6IkFtc3RlcmRhbSwgTmV0aGVybGFuZHMiLCJodGlkb2NpZCI6IlNZYkxDNW94YWJiRkg4THJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lMVG1WMGFHVnliR0Z1WkhNIn0="
        },
        {
            "title": "Ervaren Android-developer",
            "company_name": "Q42 | A happy place for nerds",
            "location": "Anywhere",
            "via": "Q42",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=cliUYp-DEOA9Mb3BAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOQQrCMBBFcdsjuJq12KYURdBVFyK4EDxBSZOxaUkzYSaUCh7IYxo3nwcPHr_4bor6yotmDNAGyzTa0uKCniIylHCnHgQ1GwcU4EY0eNxeXEpRzkqJ-GqQpNNoKkOzooA9rWqiXv7Ticvh6HXCrjnWaxXDsDs9Dw18oAWnY3xDtgbhRQwB2QqM-ccsKbOe9_DA5JC9DlZ-w6Hk4asAAAA&shmds=v1_AUFQtOMx6MNN5sFT6lOyDw7q9ky8etDyNgx7MrS0ek0tx49WBQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=cliUYp-DEOA9Mb3BAAAAAA%3D%3D",
            "extensions": [
                "€2.5K–€6.5K a month",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "€2.5K–€6.5K a month",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Meer weten? Bel 06-46465370!\n\nWij zijn Q42.\n\nQ42 bouwt digitale producten die het leven van mensen slimmer, beter en leuker maken.\n\nAl meer dan 20 jaar helpen we bedrijven als PostNL, Rijksmuseum, HEMA, AVROTROS, Philips Hue en de Efteling met het bedenken en maken van schaalbare producten. Apps, websites, connected devices, AI-toepassingen en meer. Van idee tot lancering.\n\nTech zit in de kern van alles wat we doen. Onze teams van developers en projectleiders zijn altijd bezig met snel uitproberen, leren en verbeteren. Totdat het product fijn is in gebruik, de business laat groeien én wij er zelf een glimlach van krijgen.\n\nEn we hebben een vacature voor Android-developers.\n\nWij zoeken Android-ontwikkelaars die het tof vinden om samen met andere engineers te werken aan een internationale app met miljoenen gebruikers en transacties. Naast de ontwikkeling van apps voor HEMA, PostNL en Wie is de Mol? gaat het hierbij om een nieuw project.\n\nFocus op de eindgebruiker\nAls voorbeeld van hoe we werken: de HEMA-app. Recent hebben we voor HEMA een native shop gebouwd met veel focus op een goede ervaring voor de eindgebruiker. Uitdaging nu is die ervaring nóg verder te verbeteren en nieuwe features toe te voegen.\n\nMultidisciplinair team\nHet autonome, multidisciplinaire team dat deze app bouwt, bestaat uit een kleine tien mensen. Vanuit Q42 zijn dat meerdere Android- en iOS-developers plus een projectleider. Het team wordt verder aangevuld met designers van Fabrique, een product owner en een businessanalist. Ook haken we standaard testers van Polteq aan. Natuurlijk doen we dit agile. Sinds corona werken we ook deels remote.\n\nNieuwste technieken\nAl vanaf het begin hebben we ervoor gekozen om de HEMA-app volledig native te bouwen met Kotlin op Android en Swift op iOS. Om de optimale werking van aparte native applicaties te koppelen aan het gemak van hybride development, hebben we gekozen voor server driven UI en een zogenaamde 'Backend for Frontend' gebouwd.\n\nInzicht en advies\nBouw en doorontwikkeling van een app doen we altijd in nauwe samenwerking met de klant. We bepalen dus samen de roadmap. Ons inzicht en advies spelen daarbij een belangrijke rol. Sterker nog: regelmatig nemen we zelf het initiatief om nieuwe features te ontwikkelen.\n\nAfwisseling gegarandeerd\nQ'ers die in een appteam zitten, werken af en toe ook mee aan zogenaamde jumpstarts van een week om nieuwe concepten te prototypen. Vaak is dat dan voor andere klanten van Q42. Aangezien we apps voor meerdere organisaties bouwen, zijn uitstapjes naar andere projecten sowieso altijd mogelijk en switchen Q'ers om de zoveel tijd naar een ander team. Zo kun je bijvoorbeeld de ene helft van het jaar aan een app voor een corporate werken en de andere helft aan een app voor een start-up. In die planning wordt altijd rekening gehouden met jouw wensen.\n\nVind je het tof om te bouwen aan grote Nederlandse én internationale apps? Laat hier je gegevens achter en we nemen snel contact met je op. Maar doorlezen mag natuurlijk ook - net als reageren op onze iOS-vacature. 😉\n\nPast Q42 bij jou?\n\nWil je weten of Q - zoals we Q42 meestal noemen - bij jou past? We kunnen je alvast vertellen, wat wij te bieden hebben en waar wij van houden. Dan kun jij inschatten of er voldoende overlap is voor een gesprek.\n• We bieden een all-in salaris tot 6.500 euro per maand, afhankelijk van jouw ervaring. Dat is inclusief een maximale pensioenregeling, vakantiegeld en internetvergoeding. (Hier lees je hoe we salaris, zelfbeoordeling en persoonlijke ontwikkeling aan elkaar koppelen.)\n• Wij bieden een omgeving die wij graag een happy place for nerds noemen. We houden dan ook niet zo van kaders. Veel Q'ers doen er iets bij naast het programmeren. Dat houdt Q lekker plat en geeft iedereen de mogelijkheid om mee te sturen én te groeien.\n• Met tachtig slimme developers is er genoeg te leren bij Q. Van Bedenktijdjes en Passietijd tot het schrijven voor ons Engineering Blog en samen leerzame conferenties bezoeken. Ook zijn diverse Q'ers als mentor nauw betrokken bij de persoonlijke ontwikkeling van collega's.\n• Ons werk is productontwikkeling: het allerbeste product neerzetten om de eindgebruiker te verbazen. Dat doen we met Wie is de Mol?, PostNL, Rijksmuseum, HEMA, Volkskrant, Radio 538, 9292, Kramp, de Efteling en andere mooie klanten en partners.\n• Maar we ontwikkelen ook eígen producten via onze ventures, zoals onze tech for good start-up Hack The Planet. Die ventures maken ons beter in productdenken, wat we weer kunnen toepassen in onze projecten. En vice versa.\n• Op onze stekkies in Amsterdam en Den Haag kunnen we fijn in the zone komen én heel goed feesten. Daar houden we sowieso wel van, samen leuke dingen doen: van het jaarlijkse Q-uitje en onze hackathon tot pubquizzes en bordspelavonden in onze eigen bruine kroeg.\n• Wil je nog meer weten? Kom eens langs tijdens een van onze openbare meetups of lees ons uitgebreide verhaal op de pagina met alle vacatures!\n• Ook relevant: onze arbeidsvoorwaarden.\n\nPas jij bij Q?\n\nErvaring is mooi meegenomen, maar niet het belangrijkste. Jouw technische potentie en de match wegen zwaarder.\n• Hou je van mooie dingen bouwen met Kotlin en Compose?\n• Heb je gebruiksvriendelijkheid hoog in het vaandel staan?\n• Spreekt onze happy place for nerds jou aan?\n\nPlease note: we don't hire applicants living outside the European Union.\n\nJe ziet voldoende overlap?\n\nLaten we dan eens kletsen! Je bent van harte welkom op ons kantoor in Amsterdam of Den Haag. Klik op de button hieronder, dan plannen wij een gesprek in. Of bel direct Maurice om even een afspraak te maken: 06-46465370.\n\nOnze sollicitatieprocedure.\n\n\"Een wat? Een procedure?\" Ja, we weten ’t, wij houden er ook niet van. Hebben we gelukkig ook niet zoveel. Maar omdat nieuwe mensen aannemen best wel heel erg superbelangrijk is, hebben we een manier bedacht om dit écht goed te doen. Komt-i:\n• Klik op 'Ik wil kennismaken!' en maak er een mooi verhaal van.\n• We organiseren een gesprek om te kletsen over jou én over Q. Bedenk ook van tevoren of je wat code kunt laten zien, iets waar je trots op bent. Dat is veel leuker om naar te kijken dan een CV.\n• Daarna doen we nog een gesprek. Maar dit keer krijg je eerst huiswerk mee: een leuke programmeeropdracht die je mag uitvoeren in de taal die je zelf het beste vindt passen.\n• De laatste stap is een pair-programming-middag. Je haakt dan zo'n drie uur lang aan bij twee developers. Leuk voor jou om een stel Q’ers beter te leren kennen en ons werk van dichtbij te zien. Leuk voor ons omdat we graag zo veel mogelijk Q’ers betrekken bij de sollicitaties. We stellen hun achteraf de vraag: \"Zou je balen als we haar/hem niet aannemen?\" Als ze dan 'ja' zeggen, weten we genoeg. 😊\n• We doen je een aanbod, we krabbelen, en je komt hier lol en verschil maken.\n\nIn deze blogpost geven we meer uitleg over ons sollicitatieproces, de verschillende stappen, hoe we beoordelen, wat we zoeken in een kandidaat, et cetera.\n\nOh, en recruiters: wij zijn zelf heel goed in het vinden van nieuwe collega’s. Jullie hulp is dus niet nodig én niet gewenst.\n\nDe mensen van Q42\n\nOnze mensen noemen we Q'ers. Hieronder zie je er een aantal. Mocht je graag alle Q'ers willen zien en willen filteren op allerlei relevante en volslagen irrelevante punten, dat kan ook!",
            "apply_options": [
                {
                    "title": "Q42",
                    "link": "https://werkenbij.q42.nl/android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFcnZhcmVuIEFuZHJvaWQtZGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiUTQyIHwgQSBoYXBweSBwbGFjZSBmb3IgbmVyZHMiLCJhZGRyZXNzX2NpdHkiOiJBbXN0ZXJkYW0sIE5ldGhlcmxhbmRzIiwiaHRpZG9jaWQiOiJjbGlVWXAtREVPQTlNYjNCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTFRtVjBhR1Z5YkdGdVpITSJ9"
        },
        {
            "title": "Android Developer with growth mindset",
            "company_name": "CONG",
            "location": "Utrecht, Netherlands",
            "via": "CATSone",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=UGNxeXMv90BN0oMpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7COJws2gjgou6iELBoU7OJU2PJJLmwt1hfRXf1rr83_hX30V1vuSBKQ5wwzcmKsgwRQ3gmaaZMeZBUGELd-pB0LILQBkaIp9weQqqRY7GiKTai1qNrnY0GsrY08e8qJd_OgmWsSSr2O0Pu09dsl-vro-2gZjhqYwu6AZa1ICc7Pz8AZI8-T6cAAAA&shmds=v1_AUFQtOPoQ5Dupn4DSGp313f2z2bk_6t5b2Xw3rBttYJN_LJeuQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=UGNxeXMv90BN0oMpAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Being a developer in this team means you will be part of a young and growing team where your experience, skills and ideas are a key part of success. You will make a difference by improving the codebase, processes and of course the team itself.\n\nWHERE YOU WILL LAND\n\nA place with the atmosphere and freedom of a scale-up, combined with the professionality and resources of an established company.This organization enables travelers to enjoy Europe’s rail network in 31 countries. With a multicultural and passionate team, believing that creative thinking and diversity helps to improve the brand and ultimately create a unique experience for customers.\n\nWORK TO BE DONE\n\n· Develop new features for the Planner Android app;\n\n· Work across disciplines with designers, content creators, product owner and test engineers;\n\n· Active participation in planning and design decisions.\n\nABOUT YOU\n\nYou are an experienced developer with preferably a Bachelor’s or Master’s degree in Computer Science or a related field with several years of experience with native Android development in Java. You have a solid understanding of object-oriented programming, design patterns, data structures, algorithms and mobile design principles. You’re up-to-date with the latest technologies related to Android development and features. You have experience with GIT (version control, github/gitlab/bitbucket/etc.) and with the Scrum Agile way of working. You’re able to work in cross functional teams and have strong communication skills. Understanding user feedback is one of your talents as well as interpreting user requirements. Experience or interest in Kotlin, Flutter, react native or with location-sensitive apps would be very cool.\n\nWHY JOIN?\n\nThis is a growing organization that likes to help colleagues to grow as well. The work-life balance is awesome. It is a very positive and informal environment which helps to develop.\n\nWE OFFER\n• A very international and diverse environment where everyone is treated equally;\n• Office within a 5 minute walking distance from Utrecht CS;\n• An attractive salary and free train travels through The Netherlands and Europe;\n• Full support to enjoy a good work-life balance;\n• Relocation package; 2 night stay in our CONG HOME Hotel, Visa, Housing, financial & fiscal support;\n• CONG Club Membership, being part of our global Tech, Digital, Data support network.\n\nABOUT CONG\n\nHi, we are CONG! We aren't just about bringing modern organizations together with the best developers, creators, makers and builders – CONG is a lifestyle! We facilitate, inspire and transform, while at the same time putting great importance on (job) satisfaction. That’s because people are more creative, more innovative and stronger when they’re feeling happy. We bring out the best in people, projects and organizations because the best results then follow. That’s why we are here, for you. That’s what makes us feel good!",
            "apply_options": [
                {
                    "title": "CATSone",
                    "link": "https://cong.catsone.nl/careers/5789-General/jobs/650948-Android-Developer-with-growth-mindset?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciB3aXRoIGdyb3d0aCBtaW5kc2V0IiwiY29tcGFueV9uYW1lIjoiQ09ORyIsImFkZHJlc3NfY2l0eSI6IlV0cmVjaHQsIE5ldGhlcmxhbmRzIiwiaHRpZG9jaWQiOiJVR054ZVhNdjkwQk4wb01wQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTFRtVjBhR1Z5YkdGdVpITSJ9"
        },
        {
            "title": "Software Developer - Android Developer – Internship(EN)",
            "company_name": "Van Lanschot Kempen",
            "location": "Amsterdam, Netherlands",
            "via": "LinkedIn",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=SEuN_ZlrSwEm8s-GAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_02NOwrCQBBAsfUIVlOqaCKCjVaCIn4IgmAbNpsxG9nMLDuDWnoH7-NhPImxs3nF48Hrvjvd44kvejcRYYU39BwwwhiWVEauyz_3eb5gS4qRxNWhv84GbbbjAgRNtA6YYMNceewtnGqQeZqK-KQSNVrbxHKTMmHBj_TKhfyQi2u3wRvFfDqbPJJA1XB8NgQHQ2IdK-yxCUhQEywbad-laUaQoTqM3lApXwVfgVvBAAAA&shmds=v1_AUFQtON9REW148Tad0GVcgod4HVJSi9r-eKfKE9_OmI98uddyg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=SEuN_ZlrSwEm8s-GAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a812e786d8f0cc0571c/images/288dbf43550923636bc0dc7b1286810f7f447dd16f0cabffff3b372b998983b6.gif",
            "extensions": [
                "14 days ago",
                "Internship"
            ],
            "detected_extensions": {
                "posted_at": "14 days ago",
                "schedule_type": "Internship"
            },
            "description": "Create your own future\n\nAs an intern, you will support the Digital Innovation & Analytics, Android team in the day-to-day development of our Android apps. You will work in a dynamic environment with a multidisciplinary native developers in our client tooling cluster for the Private Banking organisation.\n\nYou will use your talents as a Software Developer at Van Lanschot Kempen to inspire, support, and learn in your scrum team. You will work with other highly qualified people who are all focused on delivering value by developing our Android applications. Our values are: Personal, Specialised, Entrepreneurial and Decisive. Values you identify with.\n\nYou have the following tasks:\n• Contribute to Product Backlog Items (PBIs) with your coding skills;\n• Perform code reviews;\n• Take part in the Quality Assurance process;\n• Participate in all Scrum activities of the team you are part of, such as the daily stand-up, planning, retrospective, refinement, and sprint reviews.\n\nYour talents\n\nCreative, innovative, and digital savvy. This is how we can best describe you in the position of aspiring Software/Android Developer. Talents that you use to guide our users in a constantly changing world, every day. By thinking out-of-the-box and asking questions, you add value to the team you are part of.\n\nIn addition:\n• You are a third- or fourth-year Bachelors or Master's student in software development (or similar);\n• Analytical, result-oriented and have a hands-on mentality;\n• You have development skills;\n• You are open to learn Kotlin/Jetpack-Compose skills or have them already\n• You are passionate about innovative technology and tools;\n• You are people minded and eager to learn;\n• You are available at least 32 per week for a minimum of 5 months;\n• You have good mastery of English, both oral and written.\n\nMove ahead at Van Lanschot Kempen\n\nInvesting in a more future-oriented, sustainable, and data-driven way with various clients. Both nationally and internationally. With almost 300 years of experience, we make this ambition a reality at Van Lanschot Kempen. We do this with some 2,000 colleagues in various fields of expertise.\n\nThe Digital Innovation & Analytics (DIA) department is a start-up-like environment within Van Lanschot Kempen. This means a work environment that offers both the energetic and ambitious character of a start-up and a large company's solid benefits. DIA was founded to help the organisation with its continuous digital and AI (Artificial Intelligence) transformation.\n\nAn organisation's degree of innovation and agility also depends on the diversity of its workforce. Our differences make us stronger together. We promote an inclusive work environment where all colleagues feel at home. With us, you can be yourself. And we are proud of that.\n\nCurious about the stories of colleagues and how they experience working at Van Lanschot Kempen? Go to People & Projects and find out more!\n\nTurning talent into value!\n\nThat’s what we do. The fact is, if you add value, you can obviously expect the same from us in return. A good work-life balance with our 'hybrid way of working' is a good example of this. In the Software Developer Internship, you will also be given:\n• Compensation of € 850,00 gross per month (based on 40h per week);\n• A company laptop;\n• A cool start-up like environment where you cooperate with highly performing teams that build front-end applications for our clients and internal Private Banking colleagues;\n• A lot of responsibility and a large amount of autonomy;\n• An enthusiastic internship supervisor that is a senior in their field of expertise;\n• The opportunity to work with the latest technologies (Angular, Azure, Github- and Microsoft Copilot and many more);\n• Our custom CodeKickers program that offers a wide range of courses and workshops to allow you to hit the ground running and quickly update your technical knowledge;\n• An environment to learn, make mistakes and develop yourself;\n• The opportunity to have an impact in one of the largest Wealth Managers in The Netherlands.\n\nWorking on tomorrow's capital\n\nJust the vacancy you were looking for? Please contact us.\n\nDo you have any questions about the recruitment process? Please get in touch with Florencia Uhart, Campus Recruiter, f.uhart@vanlanschotkempen.com",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://nl.linkedin.com/jobs/view/software-developer-android-developer-%E2%80%93-internship-en-at-van-lanschot-kempen-4094752571?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://nl.bebee.com/job/5ddb8dd369a95484cb4f3c7076a86ebe?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobted",
                    "link": "https://www.jobted.nl/job/a1ac822649f080224bc30f603839a831?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wZXIgLSBBbmRyb2lkIERldmVsb3BlciDigJMgSW50ZXJuc2hpcChFTikiLCJjb21wYW55X25hbWUiOiJWYW4gTGFuc2Nob3QgS2VtcGVuIiwiYWRkcmVzc19jaXR5IjoiQW1zdGVyZGFtLCBOZXRoZXJsYW5kcyIsImh0aWRvY2lkIjoiU0V1Tl9abHJTd0VtOHMtR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUxUbVYwYUdWeWJHRnVaSE0ifQ=="
        },
        {
            "title": "Android Developer",
            "company_name": "Social Deal",
            "location": "'s-Hertogenbosch, Netherlands",
            "via": "Werken Bij Social Deal",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=3vmchdR_LQD-UGz1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU63KdI2IrjoJAiKg4sfUJL0SFLiXcgd0h_xf63LW1_zXTXbC42V0whX_GDmghU6eLADQVt9BCa4MYeM63NULXIyRiT3QdRq8r3nt2FCx7OZ2MmfQaKtWLJVHA7H_dwXCrv2xT7ZvCwLiWAj3R2rckByLD628ESNWLOlUX4PdxppmAAAAA&shmds=v1_AUFQtOMZxhHZec3KdE_hTJ7KQGDyj4ugdkZKkJEuCLnImj_6Ag&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=3vmchdR_LQD-UGz1AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Waar houd je je zoal mee bezig als Android Developer bij Social Deal?\n• Je maakt onze native apps voor Android\n• Je denkt nieuwe features uit en bouwt deze\n• Je voert design changes door en lost eventuele bugs op\n• Je maakt testplannen in samenwerking met andere afdelingen\n• Je prioriteert je eigen werk in samenspraak met je team en met de Product Owner\n• Je presenteert demo’s aan stakeholders, zoals de directie en andere afdelingen\n• Je overlegt elke dag met andere Android en iOS Developers, onder andere over het tackelen van bugs voor een optimaal eindresultaat en het invoeren van nieuwe features\n\nMet wie ga je dat doen?\n\nJe komt terecht in een gezellig team van 30 developers. Vaak wordt er serieus en geconcentreerd gewerkt, maar er is ook zeker ruimte voor een geintje. Een biertje en borrel staan regelmatig op de planning.\n\nCollega Android Developer Jamam Witwit:\n\n“Bij Social Deal werk ik in een multidisciplinair team aan de app om ervoor te zorgen dat onze klanten elke dag de beste deals kunnen vinden. Mijn werk is zeer gevarieerd; soms ben ik bezig met het bouwen van componenten, het ontwikkelen van nieuwe features, of het refineren van tickets voor de backlog. Hoewel het hard werken is, krijg je er veel voor terug: de leukste uitjes, fijne collega's, en een geweldige werksfeer. Daarnaast heb ik ook de ruimte om mezelf te ontwikkelen. Elke vrijdag kan ik bijvoorbeeld deelnemen aan een hackathon en werken aan onderwerpen die ik interessant vind. Kortom, er is veel mogelijk bij Social Deal\"\n\nWat vinden wij belangrijk?\n• Dat jij met plezier naar je werk gaat!\n• Ruime kennis van Android, Kotlin en Java\n• Dat je ervaring hebt met design patterns, zoals MVVM en MVC\n• Ervaring met Jetpack Compose is een grote pre\n• Flexibiliteit. Je kunt snel schakelen tussen verschillende werkzaamheden en kunt taken van teamleden oppakken waar nodig\n• Dat je ad hoc kan reageren op de behoeften van onze consumenten\n• Dat je probleemoplossend en zelfstandig te werk gaat en een echte teamplayer bent\n• Dat jij uitdaging bij ons vindt en jezelf blijft ontwikkelen! Daarom is er elke vrijdagmiddag een Hackathon waarin je jouw eigen ideeën kunt uitwerken\n\nWat krijg je van ons?\n• Een salaris passend bij jouw werkervaring, 8% vakantiegeld, reiskostenvergoeding en pensioenopbouw\n• 25 betaalde vakantiedagen en de mogelijkheid om 25 vakantiedagen onbetaald op te nemen (o.b.v. fulltime)\n• Wij werken met een jaarlijkse gesprekscyclus waarbij we kijken naar jouw persoonlijke ontwikkeling en groei! En die groeidoelstellingen, die maak je hier zelf middels jouw Social Growth ontwikkelplan\n• De mogelijkheid om (gedeeltelijk) thuis te werken\n• Een arbeidsovereenkomst voor 32 tot 40 uur per week bij een van de snelst groeiende internetbedrijven van Nederland. Wist je dat Social Deal 2 keer op een rij is uitgeroepen tot Beste Werkgever door Indeed?\n• Gezamenlijke lunch verzorgd door een topcateraar, gratis gebruik van onze gym, een gameroom voor de nodige ontspanning en vrijdagmiddagborrels aan onze eigen bar of op ons dakterras!\n• 10% korting op alle Social Deals\n• Legendarische feesten, unieke evenementen, teamuitjes en gezellige borrels\n• Gratis de allertofste Deals, speciaal voor medewerkers; van sportlessen tot proeverijen en van massages tot workshops. Alles met de focus op teambuilding, persoonlijke ontwikkeling en natuurlijk ontspanning\n• Een werkplek die aan al je verwachtingen voldoet in een schitterend kantoor op een toplocatie in ’s-Hertogenbosch, direct achter het Centraal Station\n\nMeer over Development bij Social Deal\n\nDe afgelopen tijd zijn we druk bezig geweest met het opzetten van compleet nieuwe native apps en het doorvoeren van een nieuw design in de Social Deal-app. Daarnaast werken we altijd aan nieuwe features, zodat we de concurrentie voor blijven en de app optimaal werkt. Elke minuut worden er gemiddeld 20 vouchers verkocht en jij zorgt er met je team voor dat het koopproces via de app soepel verloopt. Daarnaast werken jij en het team nauw samen om ambitieuze deadlines te halen.\n\nDenk jij dat jij de persoon bent die wij zoeken? Mooi! Stuur dan een e-mail inclusief CV, motivatie en foto naar jobs@socialdeal.nl óf klik HIER om direct te solliciteren!\nBinnen vijf werkdagen krijg je van ons een reactie! Heb je nog vragen? Bel of app dan met onze Recruiter Sanne via 088-2050508.",
            "apply_options": [
                {
                    "title": "Werken Bij Social Deal",
                    "link": "https://werk.socialdeal.nl/l/fr/o/android-developer-10?lang=nl&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://nl.indeed.com/viewjob?jk=5d1fc5bc8beabc18&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Werkzoeken.nl",
                    "link": "https://www.werkzoeken.nl/vacatures-in/den-bosch/12882638-android-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Nationale Vacaturebank",
                    "link": "https://www.nationalevacaturebank.nl/vacature/3f6c5964-f255-5799-96a8-03c51c2f241c/social-deal-android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Vacatures.nl",
                    "link": "https://www.vacatures.nl/android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monsterboard.nl",
                    "link": "https://www.monsterboard.nl/banen/android-developer-s-hertogenbosch--2df35d82-da32-4bcf-979c-8e7e74b4395b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ProPursuit",
                    "link": "https://propursuit.io/job/s-hertogenbosch-netherlands-3-android-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AltFi",
                    "link": "https://jobs.altfi.com/job-board/job/android-developer-at-haystack-people-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNvY2lhbCBEZWFsIiwiYWRkcmVzc19jaXR5IjoiJ3MtSGVydG9nZW5ib3NjaCwgTmV0aGVybGFuZHMiLCJodGlkb2NpZCI6IjN2bWNoZFJfTFFELVVHejFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lMVG1WMGFHVnliR0Z1WkhNIn0="
        },
        {
            "title": "Senior Android Engineer",
            "company_name": "Way2b1",
            "location": "America, Netherlands",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=E_KhSVyhkKacljBiAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CQ5ys2iiBRedOojg4OLgWJL0SCLpXbjLUD_Cfxbf8LrvqjNPpMwCA03CeYIrxUyIAnu4swdFJyEBE9yYY8H1JbVW9WytajFRm2s5mMCzZULPi32z13-jJidYi2s49qfDYirF7eblPr0_QiYYZpQc3A4e2BJKcTTpD3lFFMSQAAAA&shmds=v1_AUFQtOMEMOR5YPKe2VgOXGhxm9B47WB8sXaWq_mi91u70JtKAA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=E_KhSVyhkKacljBiAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a812e786d8f0cc0571c/images/288dbf43550923632cb14c664c4ad2bf6fd7c14dc3ef95e595576baa41025f1b.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Mobile Engineer (Android)\n\nRemote\n\nOur Company and the Role\n\nWay2B1 is a collaborative platform that helps families and their extended network of trusted people manage all aspects of life. With the Way2B1 platform, you organize all your family information in one, secure hub, simplify the logistics of daily life, and manage access to your family data with total control. The platform strengthens the connections and creates an audit history with trusted sources, such as family members, property managers, captains, crew, lawyers, tax advisers and investment managers.\n\nIn this role, you will develop the next version of our mobile applications for the Android platform. We are transitioning from React Native into Swift, which is already advanced and a couple of months out from publication, and Kotlin to deploy platform-native, next-generation applications. You’ll take on the design, architecture, initial implementation, and rollout of this new application for Android, following similar patterns as the iOS application. This role is expected to focus primarily on the Android Kotlin-based application, but experience with Swift, SwiftUI and iOS is also highly valued.\n\nOur ideal candidate has\n• 4+ years of engineering experience\n• Prior experience as a Senior or lead-level engineer in Android native projects.\n• 4+ years experience working with Kotlin\n• Previously has shipped applications to the Google Play Store\n• Experience collaborating with backend teams\n• Strong verbal and written communication skills.\n\nBonus points for\n• Swift and iOS experience.\n• Backend development experience using JavaScript, Node, Express\n• Prior SaaS experience.\n\nSalary range: 72-96k USD per year",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-engineer-at-way2b1-1170?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/nl-limburg-america-senior-android-engineer-way2b1-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IldheTJiMSIsImFkZHJlc3NfY2l0eSI6IkFtZXJpY2EsIE5ldGhlcmxhbmRzIiwiaHRpZG9jaWQiOiJFX0toU1Z5aGtLYWNsakJpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTFRtVjBhR1Z5YkdGdVpITSJ9"
        },
        {
            "title": "Android developer (Kotlin / MVVM / TDD / React native)",
            "company_name": "Apollo IT",
            "location": "Netherlands",
            "via": "Indeed",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=-HRTN6qk5TZMXZq_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCMBBAce0XiNONKtiI4KJToSAqdZDSVdLkaCpnLuRC6Rf5ncblveXBK76Loqm8jTxasDghccAI6zsnGj0oaLquyWrrOvOJ2iTwOo0TbmAHN-5BUEfjgD1cmAfC1dmlFOSklAiVg6Rcm9LwR7HHnmf15l7-eInTEQPphK_DcT-XwQ_bZRWYiOHaQt4_MDmMpL2VHxG7S4upAAAA&shmds=v1_AUFQtOMWfTE0a-qFLoFW60qLK7Qxy7dFGvLokGO_tdwjoiRsQQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=-HRTN6qk5TZMXZq_AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Introductie\n\nWe are looking for an experienced Freelance Android developer for developing a high traffic platform.\n\nLocation: Hybride / Rotterdam (50/50)\nPeriod: 6+ months\nProject start date: ASAP\n\n#android #softwaredeveloper #kotlin #MVVM #reactinative\n\nDeveloping mobile apps is what makes you excited and you take great pride and responsibility to deliver the best products to our millions of customers together with the team that you will be working with. On a daily basis our content reaches millions of users. We have built a white-label platform for web and app which serves the 2 biggest national news brands as well as 8 regional brands in the Netherlands and Belgium.\n\nOrganisatie\n\nYou will be part of a cross-functional and agile web development team that consists of 9 people from the Netherlands and Belgium. We speak English to communicate with each other in the team. Our home base is our Rotterdam office close to our editorial staff and other digital teams that work on this platform.\n\nCurrently, we embrace a hybrid working model. We are one/two days per week in the office, the rest we work from home.\n\nFunctie\n\nWhat are you going to do?\n– Contribute to building the best possible platform for our readers and users.\n– You have the opportunity to contribute to the news and to inform more than 1 million people daily.\n– Your focus is primarily on the development of mobile Android apps.\n– As part of the Scrum team, you’ll play an important role between development, the product owner and our (UX) designers.\n– We work with DevOps – “You build it, You Run it”!\n\nFunctie-eisen\n\nJob requirements\n– You are an Android / Kotlin expert with 5+ years of experience.\n– You understand the principles of MVVM and you have practical experience.\n– You have experience with CI / CD, dependency injection, concurrency, networking, unit testing.\n– You love learning new things, and you keep a close eye on technological developments.\n– You have an Agile mindset and experience with Scrum or other Agile methodologies\n– You are team-oriented, curious, open-minded and willing to learn.\n– You are positively critical and always looking for the “why” of things;\n– You put Test Driven Development into practice\n– You are fluent in English\n\nExtra bonus points for:\n– Knowledge of Jira and Confluence.\n– Knowledge of advertising and / or media.\n– Have worked with high traffic apps.\n– Knowledge of React Native, Test Driven Design, Performance Testing / Optimization and everything related to hybrid functionalities.\n\nInlichtingen\n\nMichel Koning 06 – 34657362",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://nl.indeed.com/viewjob?jk=0e9c2a1ce708d69b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "House Of Talent Job Board",
                    "link": "https://talent.thenextweb.com/job/senior-frontend-developer-react-react-native-yYnP_NJu56-at-your-talent-agency-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "NN Group",
                    "link": "https://www.nn-globalcareers.com/vacature/1101/sw-engineer-react-react-native?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIGRldmVsb3BlciAoS290bGluIC8gTVZWTSAvIFRERCAvIFJlYWN0IG5hdGl2ZSkiLCJjb21wYW55X25hbWUiOiJBcG9sbG8gSVQiLCJhZGRyZXNzX2NpdHkiOiJOZXRoZXJsYW5kcyIsImh0aWRvY2lkIjoiLUhSVE42cWs1VFpNWFpxX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUxUbVYwYUdWeWJHRnVaSE0ifQ=="
        },
        {
            "title": "Senior Android Developer, Amsterdam",
            "company_name": "Aquablu",
            "location": "Amsterdam, Netherlands",
            "via": "LinkedIn",
            "share_link": "https://www.google.nl/search?ibp=htl;jobs&q=Android+developer&htidocid=6MEdx5rfustxT1swAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0XNsQrCMBAAUFz7CU7nKrURwaVOhYLg4OIHlKQ5mkh6F-9S6cf4seLk8tZXfTZV-0CKLNCRF44eenxj4oxSQzdrQfF2hgPc2IGilTEAE1yZp4TbSygla2uMamomLbbEsRl5NkzoeDVPdvpj0GAFc7IFh9P5uDaZpv2uey3WpQUi_aca7lgCSrLk9Qt90IP0nwAAAA&shmds=v1_AUFQtOPfolqpDmUgnfyq20w_bo7weub8RPFyIGoRn1H3Gz_7Ag&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6MEdx5rfustxT1swAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a812e786d8f0cc0571c/images/288dbf43550923637974b71a47f7dccd9a65a66fe13848bb04dc467abdf1e1ce.gif",
            "extensions": [
                "24 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "24 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "🌊Who are we?\n\nAt Aquablu we’re disrupting the marketplace with a revolutionary (flavored) water system. Brought to life in 2018, our founders Marnix and Marc promised a healthy but tasty alternative to soft drinks. Today, our water is tapped in almost 16 countries. And we continue to make waves by teaming up with industry leaders like Heineken, Adyen and Marriott Hotels. Join us in our mission to save one billion plastic bottles by 2030!\n\n“That might sound really ambitious, but our team is part of an inspiring movement in an industry that’s thirsty for change.” - Marc, Co-founder of Aquablu\n\nAt Aquablu, we’re on a mission to revolutionize the way we interact with sustainable solutions, and we’re looking for a Senior Android Developer to guide in-house development of Android applications as hardware interfacing platforms for our future products.\n\nWhat You’ll Be Doing\n• Set up and maintain a cutting-edge Android environment and architecture to serve as a flexible foundation for our upcoming smart dispensing products.\n• Design and implement user interfaces with attention to detail, ensuring seamless interaction with our systems.\n• Develop IoT integrations to connect Android applications with existing online environments, ensuring robust hardware interfacing.\n• Share your expertise, shaping our Android development capabilities and mentoring junior Android Developers as the team grows.\n\nStart date: Preferably March 2025\n\nLocation: On-site in Amsterdam\n\nAbout You\n• 3+ years of recent experience developing Android applications, including building from scratch and working with modern UI frameworks.\n• Skilled in interfacing with web and system APIs and working with multidisciplinary teams in a Git environment.\n• Experience with Kotlin\n• Able to lead the way in Android development with clear communication and a proactive attitude.\n• Ready to contribute your expertise and help shape a growing team.\n\nNice-to-Haves\n• Experience setting up Android applications in kiosk mode.\n• Comfortability working with hardware interfaces.\n\nWhy Aquablu?\n\nYou will be part of a young, fun and ambitious team which aims to change the way people consume water!\n• 🌴 26 paid holiday days.\n• ☀️ Beautiful and bright office in Amsterdam (Houthavens).\n• 🌱 Healthy (heavily discounted) lunches (+ biweekly BBQs).\n• 🎉 Monthly team nights (karaoke, boat rides, bootcamp etc.).\n• 🌍 Be part of an exciting growth phase of a scaling company.\n• 👴 A pension plan by Zwitserleven (50/50).\n• 💧 Endless amount of our very own flavoured water!\n• 🎵 What kind of vibe can you expect at our office? Check out our very own Spotify playlist \"Akwablues\"\n\n5cd8a0b9cc68f9ffa4c9253553278a55wer",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://nl.linkedin.com/jobs/view/senior-android-developer-amsterdam-at-aquablu-4106235371?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIsIEFtc3RlcmRhbSIsImNvbXBhbnlfbmFtZSI6IkFxdWFibHUiLCJhZGRyZXNzX2NpdHkiOiJBbXN0ZXJkYW0sIE5ldGhlcmxhbmRzIiwiaHRpZG9jaWQiOiI2TUVkeDVyZnVzdHhUMXN3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTFRtVjBhR1Z5YkdGdVpITSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMHh4UjFOMVEwOW5SM3BwZFU5ZmFIaElSR1ZWVGpWdGNGOW9WakZCZEhaQk5qZFpWbkZhT0cwemFuRXdPVUZMUjE5aVNFbHpjRkJDUXpORmVXaDRiRmhTYWxkb2VXUk5Va2x2VkhacWFYWlFSWFY2VDNKTmFUbGplRjh4U0dSclpIcFJlVFJyTW10SE5GOUJSblptUW1wblRscDNUMmxtTVZObVJHMWpibGh0YzFKVk4wNVpTSEZvUzB4VWN6UnJSMEZvVHpCa1NrazBPVWM1VFY5amJuVXhhbHBVV21OVkxYQlhSa0p3UmtSblVEUjJlRnBXY0hWS1RFUlRiMjh6VERKYVMyOVRaMWR2VFZjMmRuZzBWVUprWmw5WFkya3lhVkJWTW1RNFZFOHpaWE5QWTA5elFrVjBRVkJ5YVRkalJXbEtSa2hxU2pWaU1WQmhPVGRqZURVeWMyZzBOeElYWjFGeFJsbzNTM1JNYjBOWGQySnJVRzVRUkRCdFVUUWFJa0ZHV0hKRlkyOXVYekkwWTNkbVJVbENWM0ZtTkc5bGJtaENSVTh5TTFWNVQwRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.nl&location=Netherlands&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMHh4UjFOMVEwOW5SM3BwZFU5ZmFIaElSR1ZWVGpWdGNGOW9WakZCZEhaQk5qZFpWbkZhT0cwemFuRXdPVUZMUjE5aVNFbHpjRkJDUXpORmVXaDRiRmhTYWxkb2VXUk5Va2x2VkhacWFYWlFSWFY2VDNKTmFUbGplRjh4U0dSclpIcFJlVFJyTW10SE5GOUJSblptUW1wblRscDNUMmxtTVZObVJHMWpibGh0YzFKVk4wNVpTSEZvUzB4VWN6UnJSMEZvVHpCa1NrazBPVWM1VFY5amJuVXhhbHBVV21OVkxYQlhSa0p3UmtSblVEUjJlRnBXY0hWS1RFUlRiMjh6VERKYVMyOVRaMWR2VFZjMmRuZzBWVUprWmw5WFkya3lhVkJWTW1RNFZFOHpaWE5QWTA5elFrVjBRVkJ5YVRkalJXbEtSa2hxU2pWaU1WQmhPVGRqZURVeWMyZzBOeElYWjFGeFJsbzNTM1JNYjBOWGQySnJVRzVRUkRCdFVUUWFJa0ZHV0hKRlkyOXVYekkwWTNkbVJVbENWM0ZtTkc5bGJtaENSVTh5TTFWNVQwRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}