{
    "search_metadata": {
        "id": "67850a8f1c208be68ff7ca45",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/5aac38f3f2c4664a/67850a8f1c208be68ff7ca45.json",
        "created_at": "2025-01-13 12:43:59 UTC",
        "processed_at": "2025-01-13 12:43:59 UTC",
        "google_jobs_url": "https://www.google.pl/async/callback:550?q=Android+developer&uule=w+CAIQICIGUG9sYW5k&udm=8&fc=EuICCqICQUpHOUprUGF5LUFtMXA3eTQ5YmwyUk5YdVdsb2IxQ3dBZ2d1T0M2N0dMUkhZeU9Ra3NOT1VuNXBrUi1aY21JVHdCY1hnYmtydUhmMmZDUUhSUnJsTHByYXlJeG5QRkV0UnVsbHBucW1fbTNtOXRZZVBGdEdsUGVEVjdJckVheHNJZEFpVmNITmdyZ2Jva2pKZXpLQ1VKOE5qWW96TmdfWmpMbXplcDg2WjZBMS14a2F3ckthWEk0QmsyV3VuQTdSUE1PZ2tFLUhiR01UZnR4MXl0QkI4dUx0ZVRSWjFPWFpzSDB1aVZydUZIdmR6UDZTOGRpU2tHMk5CWm41MGY3N081UUMyXzY5MmJYZVpkVV9SOHMyOWlsS2tmRTdRUlZ2bFESF2p3cUZaXzd1Qk5PeWt2UVAtZWl1eVF3GiJBRlhyRWNwOFRPV3pYMjZzWUxrb21vX0xZSHJmM0dhOEtn&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/5aac38f3f2c4664a/67850a8f1c208be68ff7ca45.html",
        "prettify_html_file": "https://serpapi.com/searches/5aac38f3f2c4664a/67850a8f1c208be68ff7ca45.prettify",
        "total_time_taken": 1.15
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Poland",
        "location_used": "Poland",
        "google_domain": "google.pl",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVR0Y1TFVGdE1YQTNlVFE1WW13eVVrNVlkVmRzYjJJeFEzZEJaMmQxVDBNMk4wZE1Va2haZVU5UmEzTk9UMVZ1TlhCclVpMWFZMjFKVkhkQ1kxaG5ZbXR5ZFVobU1tWkRVVWhTVW5Kc1RIQnlZWGxKZUc1UVJrVjBVblZzYkhCdWNXMWZiVE50T1hSWlpWQkdkRWRzVUdWRVZqZEpja1ZoZUhOSlpFRnBWbU5JVG1keVoySnZhMnBLWlhwTFExVktPRTVxV1c5NlRtZGZXbXBNYlhwbGNEZzJXalpCTVMxNGEyRjNja3RoV0VrMFFtc3lWM1Z1UVRkU1VFMVBaMnRGTFVoaVIwMVVablI0TVhsMFFrSTRkVXgwWlZSU1dqRlBXRnB6U0RCMWFWWnlkVVpJZG1SNlVEWlRPR1JwVTJ0SE1rNUNXbTQxTUdZM04wODFVVU15WHpZNU1tSllaVnBrVlY5U09ITXlPV2xzUzJ0bVJUZFJVbFoyYkZFU0YycDNjVVphWHpkMVFrNVBlV3QyVVZBdFpXbDFlVkYzR2lKQlJsaHlSV053T0ZSUFYzcFlNalp6V1V4cmIyMXZYMHhaU0hKbU0wZGhPRXRuIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "TechSee: YL. V Sn Android Developer",
            "company_name": "Adaptiq",
            "location": "Poland",
            "via": "Adaptiq",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=s2MW09at37fozGRZAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFy7uTrdLJiI4BKngiCIg1ARnEp-jiYS72IuSB_Chxa_4eu-i87c0McB0cDjouAOA0FPoXIKcMQPZi5YYQNndiBoq4_ABCfmKePqEFsrYrQWyWqSZlvyyvNLM6HjWT_Zyb9Roq1Ysm047vbbWRWa1ss-2NLSGxLBlbOl8AMC96pSjwAAAA&shmds=v1_AUFQtOPA2F6skDLIcDKSBlUcN91H9Hpoz0g-HGR-tRiOJUrppw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=s2MW09at37fozGRZAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Senior Android Developer\n\nWho we are:\n\nAdaptiq is a technology hub specializing in building, scaling, and supporting R&D teams for high-end, fast-growing product companies in a wide range of industries.\n\nAbout the Product:\n\nOur client TechSee is the market leader in Augmented Visual Support. It develops a web-based technology that uses AI, augmented reality, and mobile visual technologies to help customer service representatives (CSRs) and self-service apps guide customers through technical issues. It was the first company to bring remote visual support to the mass market with eight patents on AI and augmented reality.\n\nToday TechSee’s multi-sensory generative AI can see, hear, and guide humans with visual instructions all delivered through a smartphone or PC. It supports hundreds of the world's leading companies including Vodafone, Orange, Hitachi, and dozens of Fortune 500 companies and is backed by leading venture capital firms like Salesforce Ventures, Scale Ventures, and OurCrowd.\n\nAbout the Role:\n\nWe are looking for an experienced Senior Android Developer to join our dynamic team. In this role, you will be responsible for developing high-quality mobile applications and collaborating with cross-functional teams to deliver cutting-edge features for our multi-sensory AI products.\n\nResponsibilities:\n• Take active part in research and development of cutting-edge innovative Android applications leveraging computer vision and AR technologies.\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Integrate AI vision models for detecting and tracking real-world objects in real-time.\n• Optimize application performance for smooth and efficient operation.\n• Share expertise by conducting code reviews and providing guidance to junior developers.\n• Stay updated with the latest industry trends and technologies to ensure our applications remain at the forefront of innovation.\n\nRequirements:\n• 5+ years of mobile development experience, with a focus on Android (Java, Kotlin) - must\n• Strong understanding of computer vision concepts and experience with relevant libraries (e.g., OpenCV, ML Kit) - must\n• Proficiency in AR development using ARCore - must\n• Knowledge of 3D computing and rendering technologies - big advantage\n• Bachelor’s or Master’s degree in Engineering, Computer Science, Information Systems, or a related field.\n• Experience with cross-platform development frameworks. (advantage).\n• Background in developing SDKs and working with third-party integrations. (advantage).\n• Experience with AI and machine learning models, particularly in vision-related applications (advantage).\n• Solid understanding of software engineering principles, including version control (Git), testing, and continuous integration (advantage).\n• Familiarity with backend technologies and APIs (advantage).\n• Excellent problem-solving skills and attention to detail.\n• Strong communication skills and the ability to work effectively in a team environment.\n\nWhy Us?\n\nWe utilize a remote working model, providing a powerful workstation and co-working space of your choice in case you need it\n\nWe offer a highly competitive package\n\nWe provide 20 days of vacation leave per calendar year (plus official national holidays of a country you are based in)\n\nWe prioritize the professional growth and well-being of our team members. Hence, we organize various social events throughout the year to foster connections and promote wellness.",
            "apply_options": [
                {
                    "title": "Adaptiq",
                    "link": "https://adaptiq.breezy.hr/p/aa8b865d4c8f-techsee-yl-v-sn-android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJUZWNoU2VlOiBZTC4gViBTbiBBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFkYXB0aXEiLCJhZGRyZXNzX2NpdHkiOiJQb2xhbmQiLCJodGlkb2NpZCI6InMyTVcwOWF0Mzdmb3pHUlpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVUc5c1lXNWsifQ=="
        },
        {
            "title": "Android Developer (Kotlin)",
            "company_name": "Experis",
            "location": "Poland",
            "via": "Experis",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=3e0hRU3CPdBMZw-2AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNOwoCMRAAUGy3s7WaUgUTFWzWSlAEbbzBks-QROJMyARJ78XV5rVv-MyG3Yl85eThjG_MXLDC8s4tJ1rBBm5sQdBUF4EJrswh4-IYWysyai2SVZBmWnLK8UszoeWun2zlzyTRVCzZNJz2h21XhcJ6fum_IwkkggdnQ_4LiLOwHYYAAAA&shmds=v1_AUFQtOP7QBRiyHCv6KM-IO933Jh1NiLS_7Kkl9VPgk7mlepKew&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=3e0hRU3CPdBMZw-2AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45bfe06beb6b8a2aaa52547e06dde37290a2c7c8db031872e98.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join the project for our Client which specializes in creating navigation systems such as satellite navigation devices, smartphone navigation apps, GPS sports watches, action cameras, fleet management systems, and other geolocation-based services.\n\nTasks:\n• Perform triage and categorize reported software bugs\n• Monitor and coordinate bug fixing efforts and the preparation of software for release\n• Manage the software release process, ensuring timely and successful deployment to clients\nRequirements:\n• Min 4 years of software engineering experience as an Android Developer using Kotlin\n• Fundamental understanding of the Technical Skills of a Software Engineer through college education\n• Working knowledge of basic concepts and procedures\n\nOffer:\n• Workplace: 100% remote\n• MultiSport Plus\n• Group insurance\n• Medicover Premium\n• e-learning platform",
            "apply_options": [
                {
                    "title": "Experis",
                    "link": "https://www.experis.pl/pl/jobb/16158/android-developer-kotlin-?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://pl.jooble.org/jdp/966178719122893825?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/pl/job/android-developer-kotlin--lodz--e9bc307519f5c629a88bc63d81c019c5e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Czy Jest Eldorado?",
                    "link": "https://czyjesteldorado.pl/praca/75114-android-developer-kotlin-experis-polska?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoS290bGluKSIsImNvbXBhbnlfbmFtZSI6IkV4cGVyaXMiLCJhZGRyZXNzX2NpdHkiOiJQb2xhbmQiLCJodGlkb2NpZCI6IjNlMGhSVTNDUGRCTVp3LTJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVUc5c1lXNWsifQ=="
        },
        {
            "title": "Mobile Developer (iOS & Android) - Wrocław (Poland)",
            "company_name": "Algoteque",
            "location": "Wrocław, Poland",
            "via": "Jobposting",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=LbmLInxwZYj7fV70AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_z3NMQrCMBSAYVx7BEF4k1TRRgQXnQqCoIiCg2NJ0kcaeebFJGpnb-NBvJeo4PIP__Jlz0622bKyhLDEGxJ7DJDb3QH6ULo6sK0HMIZjYP16yDvkeybpvm_NCiLKoBtgBytmQ9hdNCn5OBciRipMTDJZXWg-C3aouBUnVvGTKjYyoCeZsJrOJm3hnRn2SjKc8HJFsO5vjuBnvgHVLdvTrAAAAA&shmds=v1_AUFQtOOOZwU-dtZx6tCIWMrU1IZBCwB9UXdF9_T9XBBbD2crwA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=LbmLInxwZYj7fV70AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45b1f07d0c2e24230d92119f24529b351a4cc273ee02c754753.gif",
            "extensions": [
                "12 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "12 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About company :\n\nALGOTEQUE is an IT consultancy firm that helps startups, mid-sized and large corporations to create and deliver innovative technologies.\n\nOur team has a successful track record in designing, developing, implementing, and integrating software solutions (AI, ML, BI, Web, Automation) for Telecom, Energy, Bank, Insurance, Pharma, Automotive, Industry, e-commerce. We deliver our services both in fixed-price and time-and-materials models, helping our customers achieve their business and IT strategies.\n\nJob Description :\n\nWe are seeking for a proactive and dynamic Mobile Developer to join ALGOTEQUE and be a part of international team of our client from Netherlands.\n\nThe company is a stable and well-established educational software firm, currently operates seven platforms but is looking to consolidate everything into a single, unified SaaS platform. This ambitious project involves a complete rebuild from scratch using AWS and microservices. They aim to refresh and modernize the entire system, creating a cohesive, interconnected platform from the ground up.\n\nThe team is searching for proactive, dynamic professionals—more than just coders—who can bring real value to the project.\n\nWe are looking for people who can think strategically and contribute to the project's vision, rather than simply executing tasks.\nRequired qualifications :\n\nMust Have\n\n- Proficiency in Both iOS and Android Development: Skilled in developing native mobile applications for both platforms, with senior- level expertise in one platform and strong proficiency in the other.\n\n- App Store and Play Store Submissions: Experience with submitting at least 3-4 applications on both the App Store and Google Play, demonstrating a full development and deployment lifecycle.\n\n- Fluent Polish speaker that can commute to Wroclaw (hybrid).\n\nNice to Have\n\n- Cross-Platform Experience: Knowledge of using React Native for building scalable, performant cross-platform applications.\n\n- UI/UX Principles: Familiarity with mobile design principles and UI/UX best practices.\n\n- CI/CD for Mobile: Experience with setting up CI/CD pipelines for mobile application development, including automated testing and deployment processes.",
            "apply_options": [
                {
                    "title": "Jobposting",
                    "link": "https://www.jobposting.pro/emploi-2018453-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIChpT1MgXHUwMDI2IEFuZHJvaWQpIC0gV3JvY8WCYXcgKFBvbGFuZCkiLCJjb21wYW55X25hbWUiOiJBbGdvdGVxdWUiLCJhZGRyZXNzX2NpdHkiOiJXcm9jxYJhdywgUG9sYW5kIiwiaHRpZG9jaWQiOiJMYm1MSW54d1pZajdmVjcwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1VHOXNZVzVrIn0="
        },
        {
            "title": "Software Development Engineer III, Android, Navigation SDK",
            "company_name": "Mapbox",
            "location": "Poland",
            "via": "Jobs",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=qio9Lo5lgqpallcPAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCMBRFce3k7PRm0UYEF52EilRRlH5ASdtnGknfC3mh9nv8UuNyh8M53Ow7y54Vv-JHB4QCR3TsB6QIJzKWEAOUZbmCI3WBbbeCux6t0dEyQVVcYQ0XbkBQh7aHxM7MxuHi0MfoZa-UiMuNxBS0ecuDYsKGJ_XmRv5TS59-vdMR6-1uM-WezHJ-0z5JYAke7DR1P9X8U_mlAAAA&shmds=v1_AUFQtOPcJBymqPqkjAoPDKdTi_yKrqPJyrkclCM9djPSAy11EQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=qio9Lo5lgqpallcPAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Mapbox is the leading real-time location platform for a new generation of location-aware businesses. Mapbox is the only platform that equips organizations with the full set of tools to power the navigation of people, packages, and vehicles everywhere. More than 3.5 million registered developers have chosen Mapbox because of the platform’s flexibility, security and privacy compliance. Organizations use Mapbox applications, data, SDKs and APIs to create customized and immersive experiences that delight their customers.\n\nWhat We Do\n\nThe Navigation SDK team builds frameworks and applications that power navigation everywhere. Customers of our SDK include automotive, logistics and consumer apps on Android, iOS and Linux, small and large. Our developers build apps and navigation experiences that top the App Store and Play Store rankings, and we are constantly working together to help them build what’s next, whether that’s an Augmented Reality app, an AI powered experience, a popular consumer app, or an autonomous driving experience.\n\nWhat You'll Do\n\nIn this role, you will play a critical part in defining architectural direction, leading technical initiatives, and designing scalable features. Your primary focus will be on developing innovative solutions that integrate multiple Mapbox SDKs (Navigation, Maps, and Search), enabling customer applications to deploy quickly and efficiently.\n\nYour responsibilities will include:\n• Defining and Overseeing the implementation of large-scale, cross-functional projects and initiatives.\n• Ensuring quality by driving improvements in our development processes, code quality standards, and best practices across teams\n• Engaging in technical conversations and decisions that affect long-term strategic direction and scalability.\n• Acting as a technical mentor and resource for the team, fostering professional development and knowledge-sharing.\n\nIn addition, you’ll actively participate in hands-on development work to maintain high-quality standards across our SDKs:\n• Design expressive and user-friendly APIs for developers using our SDKs.\n• Delivering high-quality features in collaboration with peers and cross-functional teams.\n• Implementing improvements to our SDK's functionality and developer experience.\n• Dive into the cross-platform implementations underlying our frameworks to ensure seamless integration and functionality.\n• Debugging, profiling, and optimizing performance issues.\n\nWhat We Believe are Important Traits for This Role\n• Demonstrated history of shipping complex Android applications and SDKs.\n• Experience with native technologies, such as Kotlin and Java.\n• Experience with testing methodologies and frameworks.\n• Focus on usability and great user experience.\n• Desire to build frameworks and developer tools.\n• Desire to learn and to teach.\n• Passion to earn and keep customer trust.\n• Readiness to go deep in the Android stack and navigate AOSP code when needed.\n• Experience debugging and profiling to resolve performance issues is a plus.\n• Familiarity with or a desire to learn more about C++ is a plus.\n\nWhat we Value\n\nIn addition to our core values, which are not unique to this position and are necessary for Mapbox leaders:\n• We value high performing creative individuals who dig into problems and opportunities.\n• We believe in individuals being their whole selves at work. We commit to this through supportive health care, parental leave, flexibility for the things that come up in life, and innovating on how we think about supporting our people.\n• We emphasize an environment of teaching and learning to equip employees with the tools needed to be successful in their function and the company.\n• We strongly believe in the value of growing a diverse team and encourage people of all backgrounds, genders, ethnicities, abilities, and sexual orientations to apply.\n\nBy applying for this position, you acknowledge that you have received the Mapbox Non-US Privacy Notice for applicants, which is linked here. Completing this application requires you to provide personal data, such as your name and contact information, which is mandatory for Mapbox to process your application.\n\nMapbox is an EEO Employer - Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity",
            "apply_options": [
                {
                    "title": "Jobs",
                    "link": "https://jobs.ashbyhq.com/mapbox/e0564091-1c48-4c37-a671-2ac04f7a25cd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ua.jooble.org/jdp/-7097475715389385805?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs | Foundry Job Board",
                    "link": "https://jobs.foundry.vc/companies/mapbox/jobs/42224991-copy-of-software-development-engineer-iii-android-navigation-sdk?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://pl.linkedin.com/jobs/view/software-development-engineer-iii-android-navigation-sdk-at-mapbox-4072280704?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Praca Trabajo.org",
                    "link": "https://pl.trabajo.org/zawod-3167-91b7b6077afad3d35b2c4e6f7c5351fe?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs - Space Talent",
                    "link": "https://jobs.spacetalent.org/companies/mapbox/jobs/42224991-copy-of-software-development-engineer-iii-android-navigation-sdk?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "DFJ Growth Job Board",
                    "link": "https://careers.dfjgrowth.com/companies/mapbox/jobs/37123236-software-development-engineer-iii-android-navigation-sdk?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Employbl",
                    "link": "https://www.employbl.com/jobs/software-development-engineer-iii-androi-mapbox-844667?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBFbmdpbmVlciBJSUksIEFuZHJvaWQsIE5hdmlnYXRpb24gU0RLIiwiY29tcGFueV9uYW1lIjoiTWFwYm94IiwiYWRkcmVzc19jaXR5IjoiUG9sYW5kIiwiaHRpZG9jaWQiOiJxaW85TG81bGdxcGFsbGNQQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1VHOXNZVzVrIn0="
        },
        {
            "title": "Mobile Engineer - Android (Engage)",
            "company_name": "Transfergo",
            "location": "Warsaw, Poland",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=k8F8tIjoSo6tMI6hAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCQAwAUFz7CeKQUUV7Ijiok4MIguAgOJZcm15PzqQkB_ZL_F7r8oZXfCfF_iY-JoIzh8hECms4caMSG5iPh4EWY13FgxFq3YEwXERCoumxy7m3g3NmqQyWMce6rOXthMnL4F7i7U9lHSr1CTNV291mKHsOy9lDka0lDQKR4Ylq-FnBXRJy8wNfUocJmQAAAA&shmds=v1_AUFQtOPWmdlT_j0CYcrbDSTg0VNoqKApU7-K0PWhxb8uywxmGw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=k8F8tIjoSo6tMI6hAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45b0aabfc75948cf41644498ab8a26f7f9e9dc1c61649783766.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "TransferGo is a growing fintech scale-up on a mission to make the world a fairer place for migrants. We strive to provide tailored, more affordable financial services that make people's hard-earned money go further. Now in our 12th year, with over 370 employees in offices across Europe, we’re crafting a brilliant, relevant product that makes a difference in people's lives and the well-being of their families.\n\nWe’ve come this far by building a talented, diverse workforce on a fair culture and our strong values. Having this strong team of employees, we can serve those who really need our product to make their lives better.\n\nThe Engage Team is pivotal in transforming the booking and pricing landscapes. We're dedicated to ensuring the best user experience for all our customers. To achieve this, we are seeking a talented Android Engineer to join our dynamic Engage Team.\n\nHere’s what you’ll be doing as Android Engineer:\n• Collaborate with developers and stakeholders to build smooth and scalable Android applications\n• Participate in team processes (Standups, refinements, sprint plannings, retros)\n• Identify areas for improvement to enhance the quality of our application\n• Stay updated with the latest industry trends and technologies to create engaging, trendy, and innovative user experiences\n• Support existing features and deliver new one\n\nYou’ll report to our Engineering Manager.\n\nHere’s what we’d love from our new Android Engineer:\n• Expertise in Kotlin\n• Experience with reactive programming (RxJava)\n• Proficiency in MVVM architectural pattern\n• Skilled in RESTful API integration\n• Familiarity with AndroidX libraries\n• Adept at networking and working with RESTful APIs\n• Hands-on experience with Git and JIRA\n• Fluent in English\n• Minimum 2 years of experience in object-oriented and protocol-oriented programming\n\nAnd if you can also do this stuff, even better:\n• Experience with code quality tools: lint, sonarqube, circle CI\n• Gradle knowledge\n• Have experience with Dependency Injection (Dagger)\n• Understanding the Clean Architecture and Modularization\n\nWe are looking for an ambitious and bright engineer who is eager to build and run services for moving money across the globe. You’ll be joining our Customer Journey tribe, responsible for ensuring best pricing and smooth booking experience. You’ll have a chance to help us build the best user experience for our customers. If you're looking for a company where you can grow fast both professionally and personally, you might have just found one!\n\nAs a Back-End Engineer you will:\n• Design, build and operate services in a cloud-native, service-oriented environment, which will be used by multi-platform applications and hundreds of thousands of users;\n• Enjoy a great level of end-to-end autonomy, contributing to system design, implementation approach and production operations of your services. We truly believe in the “Builders mindset”;\n• Work closely with product managers and UX designers to build modern and scalable software;\n• Work in a team of strong professionals - a great chance to learn from senior software engineers, engineering and product managers.\n\nPlease take a look at our tech stack in detail on stackshare.io.\n\nMonthly salary starting from 3600 € (gross) depending on the level of experience. B2B contract only.\n\nAt TransferGo, we are committed to the equal treatment of all current and prospective employees. We will not tolerate discrimination on the basis of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, marriage, civil partnership or any other protected category. We are proud of our diverse and inclusive culture and we strongly encourage suitably qualified applicants from a wide range of backgrounds to apply and join TransferGo. We look forward to meeting you!",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/mobile-engineer-android-engage-at-transfergo-917?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "No Fluff Jobs",
                    "link": "https://52.59.226.141/job/senior-android-engineer-warsaw-link-group-warszawa-zcqoceyv?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/pl-warszawa-mobile-engineer-android-transfergo-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIgLSBBbmRyb2lkIChFbmdhZ2UpIiwiY29tcGFueV9uYW1lIjoiVHJhbnNmZXJnbyIsImFkZHJlc3NfY2l0eSI6IldhcnNhdywgUG9sYW5kIiwiaHRpZG9jaWQiOiJrOEY4dElqb1NvNnRNSTZoQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1VHOXNZVzVrIn0="
        },
        {
            "title": "Android Developer with Kotlin",
            "company_name": "Fieldbee",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=bnsHfRNzNwRbS1xrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNOwrCQBAAUGxzBG2mFs2KaKOVIAa08QZhP0N2wriz7Cwmx_DIavPa13wWzeGSQhEKcMU3smQsMFGN8JDKlGALd3GgaIuPIAk6kYFxeY61Zj0Zo8rtoNVW8q2Xl5GETmYzitM_vUZbMLOt2O-Pu7nNaVivboQcHCL8go5pIo8beArbFL7ZDNhYkwAAAA&shmds=v1_AUFQtOOu3OQNNeVZxJ8j4GMyCQ8JCN0nYVFxXO-pMdjx29jhXQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=bnsHfRNzNwRbS1xrAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45bc02cb865543a477408dd847a8b8dc121b673dd6cb84119d4.gif",
            "extensions": [
                "13 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "13 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Developer with Kotlin\n\nLooking for an Android Java/Kotlin developer to work on Android applications for farmers, agricultural machines, and Agri robots. Our company has developed one of the best farming apps on Google Play. All levels of experience are encouraged to apply.\n\nWe are looking for colleagues who want to help every farmer to feed the world by facilitating the transition to more productive and sustainable arable and orchard farming. By providing accessible intelligence and machine automation for high-quality fieldwork on every farm and under all conditions.\n\nAbout the role\n\nAs a Native Android developer, you will develop and integrate new innovative features in the user interface and user flow of the Android application for farmers.\n\nWhat You Will Be Doing:\n• Integration with external devices (Bluetooth SPP/BLE, WiFi, Sockets, CAN BUS, GPS High precision devices, protocols with IOT sensors).\n• Integration with back-end and high-loaded systems (RESTFul API, OAuth 2.0).\n• Working with maps (GIS, Polygons, Heatmaps, custom tile providers, GeoJSON).\n\nSkills:\n• Strong experience in creating Android applications with Kotlin. Java and C++ as plus;\n• Good knowledge of JavaCore;\n• OpenGl 2.0 as plus;\n• Understanding of architectural approaches MVVM and MVI;\n• Design Patterns;\n• Experience working with the development of Android APP from 1 year;\n• Coroutines/RxJava;\n• SQLite, room;\n• Understanding of ООP, SOLID;\n• Understanding of architectural approaches MVVM;\n• Experience working with HTTP, JSON, XML та REST APIs;\n• Experience working with Git (Git Flow);\n• Agile / Scrum methodology approach.\n\nWhat we offer:\n• A fast-growing, dynamic company\n• A strong social and ecological mission: we help farmers, we help the environment\n• Competitive salary\n• Flexible working hours\n• Hybrid / working in an office\n• Vacation and paid holidays according to legislation\n• Remote type of working",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://pl.indeed.com/viewjob?jk=b690b4fa1c71f4d7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciB3aXRoIEtvdGxpbiIsImNvbXBhbnlfbmFtZSI6IkZpZWxkYmVlIiwiYWRkcmVzc19jaXR5IjoiR2xpd2ljZSwgUG9sYW5kIiwiaHRpZG9jaWQiOiJibnNIZlJOek53UmJTMXhyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1VHOXNZVzVrIn0="
        },
        {
            "title": "Senior Android Developer – financial industry",
            "company_name": "Sii Sp. z o.o.",
            "location": "Mstów, Poland",
            "via": "HitPraca.pl",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=5i00hirFDVghvhl9AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQkCMRQAUGxvBKtfiyYi2GgliIIgCDfAkUu-d5H4f8iPelq5g0M4gCO4iZOozWtf8ewVqxLJc4IFucTewRLPGDhigs_9AXtPhqw3ATy5k-R0hRFsuAZBk2wLTLBmbgL2523OUWZaiwTVSDbZW2X5qJmw5k4fuJY_lbQmYQwmYzWZjjsVqRlA6T2UUcENWLH6ZbCV_H5dhrDjYMh9AdDJOFuqAAAA&shmds=v1_AUFQtOO8pWd0M0DYVg2orYbu8Sj5VT9l8MYj6POwGVdMqmEIDA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5i00hirFDVghvhl9AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45b12a47e455e359b2c81473d0186c7b5609ba45ff711eb01f3.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Android Developer – financial industryMiejsce pracy: CzęstochowaTechnologies we useExpectedAndroidKotlinAndroid Studio toolsCoroutinesDaggerHiltMVI architectureMVVMAbout the projectAre you a talented Senior Android Developer passionate about building high-quality mobile applications? Do you thrive in a collaborative environment where innovation and excellence are valued? Are you ready to work with a leading global financial institution shaping the future of banking technology? If so, we want to hear from you!We are currently seeking a skilled Senior Android Developer to join our team and work with our prestigious client. In this role, you will develop cutting-edge mobile applications that enhance the digital banking experience. This is a fantastic opportunity to leverage your technical expertise and contribute to impactful projects in the financial services industry. Please note: this role requires working from the client’s office in Kraków 4-5 times monthly.Your responsibilitiesDesigning and implementing mobile applications for the Android platformDeveloping new functionalities using Kotlin/JavaCollaborating with cross-functional teams to design innovative solutionsEnsuring high-quality, clean, and maintainable codeTesting developed functionalities to maintain reliabilityCreating project documentation in compliance with industry standardsOur requirementsMin. 5 years of experience in developing mobile applications for the Android platformExcellent knowledge of Kotlin and Android Studio toolsStrong understanding of Coroutines, Dagger/HiltFamiliarity with Android Jetpack componentsSolid experience with MVI architecture, MVVM, and Clean ArchitectureProven expertise in user interface design patterns and principlesGood knowledge of spoken and written English to communicate effectivelyWillingness to work on-site in Kraków 4-5 times per monthWhat we offerGreat Place to Work since 2015 - it’s thanks to feedback from our workers that we get this special title and constantly implement new ideasEmployment stability - revenue of PLN 2.1BN, no debts, since 2006 on the marketWe share the profit with Workers - over PLN 60M has already been allocated for this aim since 2022Attractive benefits package - private healthcare, benefits cafeteria platform, car discounts and moreComfortable workplace – class A offices or remote workDozens of fascinating projects for prestigious brands from all over the world – you can change them thanks to Job Changer applicationPLN 1 000 000 per year for your ideas - with this amount, we support the passions and voluntary actions of our workersInvestment in your growth – meetups, webinars, training platform and technology blog – you chooseFantastic atmosphere created by all Sii Power PeopleRecruitment stagesSend your CV Talk to us about your expectations Learn more about our projects and choose the best Start your adventure with Sii!Sii Sp. z o.o.Sii is the leading technology consulting, digital transformation, engineering, and business services vendor in Poland. We already employ more than 7 500 professionals and implement projects in a variety of industries for clients from many countries around the world.The Great Place to Work title, won 10 times in a row, proves that at Sii we create a friendly work environment. In a survey, as many as 90% of our employees responded that Sii is a great place to work, and 95% of them think we have a great atmosphere here.",
            "apply_options": [
                {
                    "title": "HitPraca.pl",
                    "link": "https://www.hitpraca.pl/oferta/senior-android-developer---financial-industry-plnv8a90f92619e4d67/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIg4oCTIGZpbmFuY2lhbCBpbmR1c3RyeSIsImNvbXBhbnlfbmFtZSI6IlNpaSBTcC4geiBvLm8uIiwiYWRkcmVzc19jaXR5IjoiTXN0w7N3LCBQb2xhbmQiLCJodGlkb2NpZCI6IjVpMDBoaXJGRFZnaHZobDlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVUc5c1lXNWsifQ=="
        },
        {
            "title": "Junior Software Engineer - Android / Kotlin",
            "company_name": "TomTom",
            "location": "Łódź, Poland",
            "via": "Lever",
            "share_link": "https://www.google.pl/search?ibp=htl;jobs&q=Android+developer&htidocid=6fue4Ndd-mGFnqyyAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNMQrCQBBFsc0NtJpaNCuCjVYKIsRG0D5ssuNmZTMTdlZM6z28hZ2t5F6u8HnFK97PXqNsV9zJcYAzX-NDB4Q9WUeIAeawJRPYGVBw5OgdJVVwBYI61A0wwYHZepxsmhg7WSsl4nMrUUdX5zW3igkr7tWNK_mjlCY9dF5HLJerRZ93ZKfjC7dpkPLD8_s2w2cGJ_aazA-T01XpnwAAAA&shmds=v1_AUFQtOP-qyZENlu-WcEQ4lAAQvltaALVbf4mgwUmdzCqjiBeZg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6fue4Ndd-mGFnqyyAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a8f1c208be68ff7ca45/images/fc12ced32d85f45ba582264da05194aff2bc64969060e3de6ef7527dcec78976.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Are you passionate about building mobile apps that redefine navigation for everyday drivers?\n\nJoin our distributed development team and work on applications that deliver cutting-edge navigation experiences. Your work will directly impact millions of users worldwide by improving driver experiences and advancing our navigation technologies.\n\nWhat you’ll do:\n• Develop high-quality Android software as part of a collaborative and agile team.\n• Partner with product managers to define, prioritize, and implement features that delight users.\n• Leverage Agile and Kanban methodologies to deliver solutions efficiently in a dynamic environment.\n• Write clean, maintainable code and participate in code reviews to foster shared learning and ensure quality.\n• Create and maintain automated tests to guarantee functionality and prevent regressions.\n• Collaborate with cross-functional teams, including routing, traffic, map visualization, and warnings, to deliver seamless integration and innovation.\n\nWhat you’ll bring:\n• Experience: 1–3 years (or more) of professional Android development experience.\n• Technical Skills: Proficiency in JVM and Kotlin (preferred).\n• Education: A degree in Computer Science, Software Engineering, or related fields.\n• Best Practices: Solid understanding of design patterns, object-oriented programming, and scalable software systems.\n• Collaboration: Strong teamwork and communication skills in a cross-functional environment.\n• Problem-Solving: Excellent analytical skills for troubleshooting complex technical difficulties.\n• Version Control: Familiarity with Git or similar systems.\n• This position is based in Lodz. Therefore, we can only accept candidates that already live in or already are in the process of relocating to Lodz, Poland.\n\nBonus points:\n• Experience with UI development or an interest in building seamless user interfaces.\n• Knowledge of Swift or cross-platform development.\n• Familiarity with CI/CD pipelines and build tools.\n\nWhat we offer\n\nA competitive compensation package, of course.\n\nTime and resources to grow and develop, including a personal development budget and paid leave for learning days, as well as paid access to e-learning resources such as O’Reilly and LinkedIn Learning.\n\nTime to support life outside of work, with enhanced parental leave plus paid leave to care for loved ones and volunteer in local communities.\n\nWork flexibility, where TomTom’ers, in agreement with their manager and team, use both the office and home to focus, collaborate, learn and socialize. It’s all about getting the best out of both worlds – we ask TomTom’ers to come to the office two days a week, and the remaining three are free to be worked in either location.\n\nImprove your home office with a setup budget and get extra support with a monthly allowance.\n\nEnjoy options to work from your home country and abroad for a set number of days each year, to visit family and friends, or to simply explore the world we’re mapping.\n\nTake the holidays you want with a competitive holiday plan, plus an extra day off to celebrate your birthday.\n\nJoin annual events like our Hackathon and DevDays to bring your ideas to life with talented teammates from around the world.\n\nBecome a part of our inclusive global culture and have the chance to collaborate with a diverse community – we have over 80 nationalities at TomTom!\n\nFind out more about our global benefits and enjoy additional local benefits tailored to your location.\n\nMeet your team\n\nWe're the Driver Apps & Web Product Unit. We redefine what navigation means for drivers using mobile, cloud and machine learning technology. By helping build the next generation of driving apps, you and your team will reshape the way people see and find their way in the world.\n\nAt TomTom...\n\nYou’ll help people find their way in the world. In 2004, TomTom revolutionized how the world moves with the introduction of the first portable navigation device. Now, we intend to do it again by engineering the first-ever real-time map, the smartest and most useful map on the planet.\n\nWork with a team of 3,700 unique, curious and passionate problem-solvers. Together, we’ll open up a world of possibilities for car manufacturers, enterprises and developers to help people understand and get closer to the world around them.\n\nAfter you apply\n\nOur recruitment team will work hard to give you a meaningful experience throughout your journey with us, no matter the outcome. Your application will be screened closely and you can rest assured that all follow-up actions will be thorough, from assessments and interviews all the way through onboarding. To find out more about our application process, check out our hiring FAQs.\n\nTomTom is an equal opportunity employer\n\nTomTom is where you can find your place in the world. Every day we welcome, nurture and celebrate differences. Why? Because your uniqueness is what makes you, you. No matter your culture or background, you’ll find your impact at TomTom. Research also shows that sometimes women and underrepresented communities can be hesitant to apply for positions unless they believe they meet 100% of the criteria. If you can relate to this, please know that we’d love to hear from you.",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.eu.lever.co/tomtom/eca22ce1-8547-42e5-ba88-a2c61be6335b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "HitPraca.pl",
                    "link": "https://www.hitpraca.pl/oferta/junior-software-engineer-android-kotlin-plnvd3e446ea4e4cb4c/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs - Space Talent",
                    "link": "https://jobs.spacetalent.org/companies/tomtom/jobs/42649534-junior-software-engineer-android-kotlin?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=88947135684190918&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WhatJobs",
                    "link": "https://pl.whatjobs.com/job-for-Junior-Software-Engineer-in-%C5%82%C3%B3d%C5%BA-%C5%82%C3%B3dzkie-coop15828166?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/pl-d-junior-software-engineer-android-kotlin-tomtom-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBBbmRyb2lkIC8gS290bGluIiwiY29tcGFueV9uYW1lIjoiVG9tVG9tIiwiYWRkcmVzc19jaXR5IjoixYHDs2TFuiwgUG9sYW5kIiwiaHRpZG9jaWQiOiI2ZnVlNE5kZC1tR0ZucXl5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1VHOXNZVzVrIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJVRlpzUm5abllqTjVaMWRmUVVab1JXbG9WbFZNYUhOcVJGRlBZWFJPWVVsRmJYQnZTSFZRYjBWTU5ESXRObUpqWW01Q1J5MVhjbk5zTWxSVE9YZGpRbGR2WWtOVExUQjZXRXBHV0hOTlUxbEdOakJuWVUwNU1EaExUM1ZuUm04NVJtdFJiRGxSWDJWRFJVOVhVRVZmUkhVeFVqUm5XRUZNUVdkVmJIcGZPVGxIU0ROdWVXMTFUWGhIZG5GNmN5MVBSVzVHUVZsR2RuTlZRMll4VjJnMlNUTnRlRkpsVjE5MGVXMVlhMU5wWjBwUmVrRjZOM1pYVFMxUVoyc3lTRWRNU1RWWExVZFlabG8yWlc1b04wc3RjUzFyUVhJek1XeEdSVnBXTkZCV1dWaFZVMWx0YW5seGFHZDNkblZoU0RKNFZSSVhhMEZ4UmxvNVYwWktUMjU1TUZCRlVEbGlTRXB0VVVVYUlrRkdXSEpGWTI4MlJFOUliM2xwY1haTWJtdFFSVGhOVDNoWk9GOUVNRkZKVkZFIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.pl&location=Poland&next_page_token=eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJVRlpzUm5abllqTjVaMWRmUVVab1JXbG9WbFZNYUhOcVJGRlBZWFJPWVVsRmJYQnZTSFZRYjBWTU5ESXRObUpqWW01Q1J5MVhjbk5zTWxSVE9YZGpRbGR2WWtOVExUQjZXRXBHV0hOTlUxbEdOakJuWVUwNU1EaExUM1ZuUm04NVJtdFJiRGxSWDJWRFJVOVhVRVZmUkhVeFVqUm5XRUZNUVdkVmJIcGZPVGxIU0ROdWVXMTFUWGhIZG5GNmN5MVBSVzVHUVZsR2RuTlZRMll4VjJnMlNUTnRlRkpsVjE5MGVXMVlhMU5wWjBwUmVrRjZOM1pYVFMxUVoyc3lTRWRNU1RWWExVZFlabG8yWlc1b04wc3RjUzFyUVhJek1XeEdSVnBXTkZCV1dWaFZVMWx0YW5seGFHZDNkblZoU0RKNFZSSVhhMEZ4UmxvNVYwWktUMjU1TUZCRlVEbGlTRXB0VVVVYUlrRkdXSEpGWTI4MlJFOUliM2xwY1haTWJtdFFSVGhOVDNoWk9GOUVNRkZKVkZFIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}