{
    "search_metadata": {
        "id": "6785026272c8da365da55220",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/be61576034a35b5e/6785026272c8da365da55220.json",
        "created_at": "2025-01-13 12:09:06 UTC",
        "processed_at": "2025-01-13 12:09:06 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EswCCowCQUpHOUprT0xCa01MLVlfVmk2NTBoVk5mdldnMHkxNDlyNHcteUZMSk9PUkF5WG5OWU1odHo4NndIbGluaU8tUTk3a2FjMzVtc3FOaXRnWEo3U20zMkpFN2l5RXl1V0J0QlY4QVFhX1ZjMVRTMElKcXRFMktPWUlaV2lYZmRCT1p6c1ZrVVUwWkp1N29zSl9TbGRSZW5rTWJrVzNjelQ4U1loeDhzRzFfUE8wdUZHaUpBQWM1R2NWbDZ6dE96NUZrRk5tbjI5OFhaU0N4Ui1PVGhGT1FlaUx2MlRZUHVfUk1wcmdXV3Y4OTFfSExjZUJweTBxOUtTaURuR1hFM183VWl3VzhaY19GdmZPchIXWVFLRlpfT1pJNmVkcHRRUHRZYno2QVUaIkFGWHJFY3AzYThMcnRzX1pjUlJQNkNPSUxEOGtsR3JONFE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/be61576034a35b5e/6785026272c8da365da55220.html",
        "prettify_html_file": "https://serpapi.com/searches/be61576034a35b5e/6785026272c8da365da55220.prettify",
        "total_time_taken": 0.5
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMHhDYTAxTUxWbGZWbWsyTlRCb1ZrNW1kbGRuTUhreE5EbHlOSGN0ZVVaTVNrOVBVa0Y1V0c1T1dVMW9kSG80Tm5kSWJHbHVhVTh0VVRrM2EyRmpNelZ0YzNGT2FYUm5XRW8zVTIwek1rcEZOMmw1UlhsMVYwSjBRbFk0UVZGaFgxWmpNVlJUTUVsS2NYUkZNa3RQV1VsYVYybFlabVJDVDFwNmMxWnJWVlV3V2twMU4yOXpTbDlUYkdSU1pXNXJUV0pyVnpOamVsUTRVMWxvZURoelJ6RmZVRTh3ZFVaSGFVcEJRV00xUjJOV2JEWjZkRTk2TlVaclJrNXRiakk1T0ZoYVUwTjRVaTFQVkdoR1QxRmxhVXgyTWxSWlVIVmZVazF3Y21kWFYzWTRPVEZmU0V4alpVSndlVEJ4T1V0VGFVUnVSMWhGTTE4M1ZXbDNWemhhWTE5R2RtWlBjaElYV1ZGTFJscGZUMXBKTm1Wa2NIUlJVSFJaWW5vMlFWVWFJa0ZHV0hKRlkzQXpZVGhNY25SelgxcGpVbEpRTmtOUFNVeEVPR3RzUjNKT05GRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Android Software Developer - Automotive Infotainment",
            "company_name": "CIeNET International",
            "location": "Markham, ON, Canada",
            "via": "Ladders",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=q1NhF1C64oJzyxdSAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNPQ8BQRBAo_UTVFP7uBWJhkoQQVDQy9zduFt2Zza749w_8_ec5jUvL6__7fWPKy6j2BKu8tAPRoINNeQkUIQJrN4qXtQ2BHt-iKJlT6ydOUgOiTAWNQjDTqRyNFjWqiEtjEnJZVVSVFtkhXgjTLm05il5-uOe6u4UHCrdZ_NpmwWuhqP1ns7bWzdSitylwujAMpwwvmr0Y7icx7BGxhJ_CawI4boAAAA&shmds=v1_AUFQtONbMcC2g2TeoOjd5yeY4r66dqq0ptVvABza1OYB9EIZXg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=q1NhF1C64oJzyxdSAAAAAA%3D%3D",
            "extensions": [
                "86,732–130,099 a year",
                "Full-time"
            ],
            "detected_extensions": {
                "salary": "86,732–130,099 a year",
                "schedule_type": "Full-time"
            },
            "description": "Location: Markham, Ontario, Canada\n\nPosition Title: Android Software Developer - Automotive Infotainment\n\nCIeNET is a mobile, automotive, telecom and enterprise software services and solutions research, engineering and development company founded in the U.S. in the year 2000. We currently have over 2,400 employees worldwide, supporting customers in North America, Asia and Europe. We have over ten locations across US, Canada, Mainland China and Taiwan. CIeNET has been named Global Outsourcing 100 in fifteen consecutive years. CIeNET has become an ALTEN Group Company in 2021.\n\nCIeNET is expanding its presence in Canada to better serve our industry leading customers in the automotive industry. We are working on state-of-the-art technologies and products that will bring automotive information and entertainment, mobile internet, telematics services and ADAS to life in the years to come.\n\nCIeNET Canada is looking for intelligent, creative, enthusiastic and diligent professionals to join our team and shape the great future of your career with us.\n\nRole SummarySoftware developers will contribute to the development of the advance Infotainment systems. Their contribution will enable customers to connect their personal consumer devices to vehicle infotainment systems. These software developers and engineers will be important members of a fast growing software group in Canada, which is part of the larger global Engineering team across continents.\n\nWe accept applications across several technical domains including connectivity, user interface and core application and services, framework and personalization, and multimedia and audio, diagnostics. You are encouraged to apply for these positions if you have expertise in any one of the following domains:\n\no User Interface and core applications and services:\n\nThe developer for this domain will be responsible for feature development and maintenance of core applications and services such as calling, contacts, settings, and messaging. Prior UI/UX experience is required to develop user friendly applications\n\no Framework and Personalization:\n\nThe framework developer will be responsible for the customization and enhancement of Android framework components such as, windows manager, activity manager, package manager, system UI and customization widgets, to realize the automotive requirements and features. The developer/engineer for personalization will own the development and maintenance of the Android multi-user framework and all personalization related features\n\no Multimedia:\n\nThe developer for this domain will enhance the entertainment sub-system based on the existing Android multimedia framework, including audio/video playback, controlling the vehicle by voice command, and operating a mobile phone via the vehicle infotainment system. This developer/engineer will leverage their prior software development experience in industry standard multimedia solutions, such as playback engine, audio system, codec, camera, speech, and screen casting, to implement the In-vehicle infotainment multimedia system\n\no Connectivity:\n\nThe developer for this domain will enhance Bluetooth, Wifi, USB sub-systems based on the existing Android source code and 3rd part code, including Voice Call and Music Stream over Bluetooth, Discovery, connect and disconnect Wifi AP, provide Wifi hotspot, supporting connect mobile phone via USB connection. These developers will leverage their prior software development experience in industry standard Bluetooth, Wifi, USB solutions to implement the In-vehicle infotainment system\n\nKey Responsibilities\n• Contribute to develop infotainment solutions for In-vehicle devices. Responsible for the deliverables of the assigned domain such as requirements, system design, development, deployment, and maintenance of the infotainment software\n• Participate in the design of a best-in-class in-vehicle platform for automotive infotainment systems\n• Participate in architecture, requirements, and design, coding and test case reviews\n• Participate in new feature development, maintenance of existing features and bug fixes\n• Participate in feature requirement and design reviews and all relevant software development activities\n• Participate in test case design reviews and conceive bug prevention proposals\n• Provide clear and complete documentation based on the definition of the software development process\n• Collaborate with team members in software development activities using the Scrum/Agile development process\n• Senior member resumes ownership of each project, propose technical solutions, make design and implementation decisions and coach junior members\n\nRequirements\n\nQualifications\n\nRequired Skills and Experiences:\n• Minimum three years of software development experience in related domains\n• Minimum two years of software development experience in Android platform\n• Software development experience in Linux platform\n• Software design and implementation experience in an object-oriented environment\n• Development experience with Java, C++, C, Android Application frameworks\n• Development experience with unit test frameworks such as AndroidTestFramework, monkeyrunner, Robolectric\n• Development experience with Android development toolkit and process\n• Experience with Development tools such as Eclipse IDE and ADT plug-in, Android Studio\n• Experience with software build tools such as makefile, ant, maven, gradle\n• Experience with SCM tools such as GIT, Gerrit, Jenkins, JIRA, or ClearCase\n• Practice with Scrum/Agile software development process\n• Ability to perform diagnostic and investigate issues based on limited information\n• Experience in developing and deploying commercial products in global market is a plus\n• Excellent verbal and written communication skills\n• Creative, disciplined, strong sense of responsibility to delivery result to meet schedule and commitment\n• Good team player with strong interpersonal skills to work effectively in a geographically dispersed environment\n• Effective communication skills and a strong problem solver\n\nRequired Domain Knowledge and Experiences\n• User Interface and core applications and services\n\no Experience in Android application and user interface development\n\no Excellent knowledge of Android core applications and services (telephone, message etc.)\n\no Prior UI/UX development experience of consumer product\n• Framework & Personalization domain:\n\no Development experience in Android UI framework, system UI and widgets\n\no Development experience with Android window manager, activity manager, and package manager.\n\no Android multi-user domain knowledge and development experience\n• Multimedia domain\n\no Development experience in Android Multimedia framework\n\no Solid working knowledge of current Android platform technologies, including media playback engine, streaming, codec, media capturing, audio framework, voice recognition, and screen sharing\n\no Demonstrated in-depth and breadth understanding of software technologies, including rendering, simulation, relational database, and user interface development\n• Connectivity\n\no Development experience with implementing Bluetooth Stack, Chipset and Firmware\n\no Development experience with Android/Linux Wifi Stack including wpa_supplicant, wifi and network driver, chipset and firmware\n\no Development experience with Android/Linux USB Stack\n\no Demonstrated in-depth and breadth understanding of low level software technologies, such as driver, dma, interrupt, I/O, serial port etc.\n\no Solid working knowledge of Linux platform\n\no Experience with BSP development is a plus\n\nPreferred Skills and Experiences:\n• Software development experience in a variety of OS environments is a plus\n• Experience with the integration of Android framework and device bring up is a plus\n• Experience with the porting of Android ROM is a plus\n• Experience with the development of automotive infotainment solutions is a plus\n• Experience with automotive and/or portable consumer electronic devices is a plus\n• Successful Track record in applying advanced technology to enhance the usability of complex systems is a plus\n\nEducation and Training:\n• Bachelor's degree in Computer Science, Software Engineering, or related field.\n• Graduate degree is preferred\n• Professional Engineering designation is a plus\n\nBenefits\n\nGroup Insurance, Employer RRSP match, 15 days annual vacation.\n\nCIeNET offers equal opportunities to people. Accommodation is available for applicants with disabilities upon required. We would like to thank all applicants for expressing interest. However only those selected for interviews will be contacted. Reference check of certain positions will be conducted with your permission.",
            "apply_options": [
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/android-software-developer-automotive-infotainment-ci-dot-net-international-markham-on_77648897?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIERldmVsb3BlciAtIEF1dG9tb3RpdmUgSW5mb3RhaW5tZW50IiwiY29tcGFueV9uYW1lIjoiQ0llTkVUIEludGVybmF0aW9uYWwiLCJhZGRyZXNzX2NpdHkiOiJNYXJraGFtLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJxMU5oRjFDNjRvSnp5eGRTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Sr. Android Developer, Infotainment",
            "company_name": "Rivian and VW Group Technology",
            "location": "Vancouver, BC, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Ldv8lue9rrMX1VjmAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOsQrCMBAAUFz7CU43S21FEKFOWqHoqFLHck3ONpLehSQt9bf8QnF580u-i6S4-wyOrL0YDWeayIojn8KFXxLR8EAcYQ1XaSEQetWDMFQinaXloY_RhSLPQ7BZFyJGozIlQy5Mrcz5W9rwpwk9enIWIzXb3WbOHHer_c1MBhmQNdRPqLyMDh6kehYr3QcMQ42sZJz-nVOZQomMGn_LJUX5tQAAAA&shmds=v1_AUFQtOMxQpKxIFjBQaNHi558LihnyGL2rdk9BNa1PlDbWKURuA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Ldv8lue9rrMX1VjmAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "About Us:\n\nRivian and Volkswagen Group Technologies is a joint venture between two industry leaders with a clear vision for automotive’s next chapter. From operating systems to zonal controllers to cloud and connectivity solutions, we’re addressing the challenges of electric vehicles through technology that will set the standards for software-defined vehicles around the world.\n\nThe road to the future is uncharted. By combining our expertise across connectivity, AI, security and more, we’ll map a new way forward. Working together, we’ll create a future that’s more connected, more intelligent, more sustainable for everyone.\n\nRole Summary:\n\nThe Vancouver Infotainment team is chartered to develop in-vehicle infotainment applications and user experiences for our products and composed of developers of all backgrounds with experience in Android, SDKs, IoT, Bluetooth, and Security... and we are growing!\n\nOutside of work our team is chock full of adventure seekers in all senses of the phrase. We have lived and travelled around the world, we ski and snowboard, we camp and hike, we take up adventurous hobbies like bagpipe playing, we live in adventurous places like floathouses, some of us have joined the adventure of raising kids - and some of us have joined the equally adventurous world of raising pets...\n\nBut the most adventurous thing we have all done recently is jump ship from the safety of corporate jobs to come together and become Vancouver Rivian and Volkswagen Group Technologies!\n\nResponsibilities:\n• Design and develop infotainment applications on Android Automotive OS\n• Create modular and scalable software that can adapt to a variety of different products and use cases\n• Create designs pattern and libraries to facilitate application developments\n• Collaborate with cross-functional teams, including product and UI/UX design teams to define application features\n• Identify potential problems and resolve application bottlenecks for performance optimizations\n• Perform code reviews and practice continuous integration and development\n• Write test code to test for quality, robustness, and functional correctness, including edge cases\n• Design and implement subsequent application updates and releases\n• Investigate AAOS codebase for better application performance and integration\n• Develop sample and demo applications, making use of our technology\n• Grow your skills with continual learning, workshops, conferences, and talks\n\nQualifications:\n• Bachelor’s degree in Computer Science or Software Engineering (MS preferred)\n• Proven Android application developer with 5+ years of experience\n• Proficiency in Kotlin, Java, and C++\n• Ability to manage your workload with minimal supervision\n• Proficiency in using Android and Android Jetpack APIs, including knowledge of Android NDK and JNI\n• Knowledge of Android design principles and application interface guidelines\n• Knowledge of Android’s performance and testing framework\n• Familiarity with embedded Android framework services\n• Experience with developing mapping, multi-media, and Bluetooth solutions is a plus\n• Familiarity with push notifications, APIs and cloud messaging\n• Excellent coding and proofreading skills\n• Familiarity with the best in class Software development practices\n• Proficient in code versioning tools including Git, Gitlab and others\n• Experience with continuous integration tools, such as Jenkins\n• Familiarity with Agile Scrum practices\n• Excellent inter-personal skills with the ability to collaboratively work with and influence cross-functional teams\n• Top-notch teamwork and communication skills\n\nCompany Statements:\nEqual Opportunity\n\nRivian and Volkswagen Group Technologies is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law. We are also committed to ensuring compliance with all applicable fair employment practice laws regarding citizenship and immigration status.\n\nRivian and Volkswagen Group Technologies is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at candidateaccommodations@rivian.com.\n\nCandidate Data Privacy\n\nRivian and VW Group Technologies (“Rivian and Volkswagen Group Technologies”) may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Rivian and Volkswagen Group Technologies may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.\n\nRivian and Volkswagen Group Technologies may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our People Team, Finance, Legal, and the team(s) with the position(s) for which you are applying; (ii) Rivian and Volkswagen Group Technologies affiliates; and (iii) Rivian and Volkswagen Group Technologies’ service providers, including providers of background checks, staffing services, and cloud services.\n\nRivian and Volkswagen Group Technologies may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.\n\nPlease note that we are currently not accepting applications from third party application services.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=8e221332afbceb58&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Rivian Careers",
                    "link": "https://careers.rivian.com/careers-home/jobs/20275?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/sr-android-developer-infotainment-rivian-and-vw-group-technology-JV_IC2278756_KO0,33_KE34,64.htm?jl=1009528786575&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/sr-android-developer-infotainment-at-rivian-and-volkswagen-group-technologies-4094023479?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Climate Change Jobs",
                    "link": "https://climatechangejobs.com/jobs/76872300-sr-android-developer-infotainment?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://fr.simplyhired.ca/job/s0GY3rA-IZneMGYg4QzTdAjpvGZ4dq_Xthx5SGsc6fvM1JuN5S5x_w?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/1950564324122660928?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ClimateTechList",
                    "link": "https://www.climatetechlist.com/job/rivian-sr-android-developer-infotainment-ZbucxaUGHSGRgn?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBEZXZlbG9wZXIsIEluZm90YWlubWVudCIsImNvbXBhbnlfbmFtZSI6IlJpdmlhbiBhbmQgVlcgR3JvdXAgVGVjaG5vbG9neSIsImFkZHJlc3NfY2l0eSI6IlZhbmNvdXZlciwgQkMsIENhbmFkYSIsImh0aWRvY2lkIjoiTGR2OGx1ZTlyck1YMVZqbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "15h Left Android Developer, Key",
            "company_name": "Amazon",
            "location": "Canada",
            "via": "BeBee Canada Meet Opportunities",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=VFVloVuje-8o09eKAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFw7OTvdLJqoUIc6FQVB_Ydybc-kkuZC7pDqD_jb6vLGV3xmxX5berjRXaGOfeahhxM9KXCivIIrvWANF25BCHPngSOcmV2gxcGrJqmsFQnGiaIOnel4tByp5ck-uJU_jXjMlAIqNbtyM5kU3XJej_j-XUOEI0bs8QvPxFF5igAAAA&shmds=v1_AUFQtOO5uSxLOVaqB0d6xvnNkcrcI9IQ8nr2BYGXxquu36S_LA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=VFVloVuje-8o09eKAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d98509ca4227c2f17ec6a3eda0346642e9346af15345ee1fb88.gif",
            "extensions": [
                "3 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Transform Everyday Problems with Innovative Technology\n\nAs a member of the Amazon Key team, you'll have the opportunity to tackle a set of complex problems requiring significant innovation. Our patented building access technology supports Amazon Last Mile in the US, with international expansion plans.\n\nWe're seeking a motivated and multi-talented engineer who is passionate about technological and business innovation. You will be part of an inter-disciplinary team of hardware, firmware, software (mobile, backend and frontend), and system engineers to develop and integrate cutting-edge technologies from IoT, wireless, and cloud computing into pragmatic solutions for Ring customers, package transportation, logistics, and delivery.\nDuties and Responsibilities\n• Research, design, implementation, documentation, and maintenance of new and existing systems and the creation of software services and tools to drive the software development process towards higher quality.\n• Working with product and UX team to solve the customer problem by proposing engineering solutions and trade-offs.\n• Working with engineering team members to investigate design approaches, prototype new technology and evaluate technical feasibility.\n• Working in an Agile/Scrum environment to deliver high quality software.\n• Engaging with the Android development community across Amazon to share learnings and grow.\nKey Job Responsibilities\n• Responsible for the design of Android mobile application, development and maintenance of systems.\n• Design new, secure, and reliable features that drive real-time data, video, and audio solutions.\n• Utilize modern Android development design patterns.\n• Propose innovative tools, frameworks, automations and processes that are used by the entire Android team for development.\n• Participate in hiring and developing the team.\nRequirements\n• BASIC QUALIFICATIONS\n• 3+ years of non-internship professional software development experience\n• 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n• Experience programming with at least one software programming language\n• PREFERRED QUALIFICATIONS\n• 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n• Bachelor's degree in computer science or equivalent\n\nEstimated Salary: $120,000 - $180,000 per year\n\nCompany: Amazon",
            "apply_options": [
                {
                    "title": "BeBee Canada Meet Opportunities",
                    "link": "https://ca.bebee.com/job/fc2709fd47d8c774e0f84a8cc1dadc73?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIxNWggTGVmdCBBbmRyb2lkIERldmVsb3BlciwgS2V5IiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiYWRkcmVzc19jaXR5IjoiQ2FuYWRhIiwiaHRpZG9jaWQiOiJWRlZsb1Z1amUtOG8wOWVLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Sr. Android Developer",
            "company_name": "General Motors Canada",
            "location": "Markham, ON, Canada",
            "via": "HackerX",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=plVLgloI35Yo8J3XAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3IsQrCMBAAUFz7CU43S0xEcNFJFApCdfADyrU9mmp6F-6C-Cv-rQgub3jVZ1G5u3o48qAyDXCmFyXJpLCGi3RghNpHEIZaZEy0PMRSsu1DMEt-tIJl6n0vcxCmTt7hIZ39aC2iUk5YqN3uNm-feVy5mpgUEzRSRA1OyDggTAwN6jPi7OB2df_-Ag86z5OcAAAA&shmds=v1_AUFQtONQgAJrMF1WvGQY-bUlctUk74x0s7tlmiQy4_puh9Wt6w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=plVLgloI35Yo8J3XAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d98d7fa0af42a9e980c224d7202066dc78f65d8a356647d3508.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Do you have what it takes to reinvent an industry?\n\nThe auto industry is developing today’s cutting edge technologies in the fields of connectivity, multimedia, self-driving and much more. You can be part of a growing, young, dynamic team of multi-disciplinary software developers and engineers that are reinventing the industry as we speak. General Motors is leading the pack in this field.\n\nIf you want to make history happen, bring your skills and energy to General Motors’ Canadian Technical Centre’s Software Infotainment team today and be part of a revolution.\n\nWe are waiting to be wowed.\n\nThe Opportunity\n\nCore application developers and engineers will contribute to the development of GM’s Infotainment systems. Your contribution will enable customers to connect their personal consumer devices to vehicle infotainment systems. The Core Application developer will be responsible for feature development and maintenance of core applications and services such as: calling, contacts, settings, and messages.\n\nWhat We Need You To Do\n\nContribute as designer and developer to building infotainment solutions for consumer devices. Responsible for the entire life cycle of the assigned domain, including requirements, system design, development, deployment, and maintenance of the infotainment software\n\nParticipate in the design of a best-in-class in-vehicle platform for GM infotainment systems\n\nParticipate in architecture, requirements, and design, code, and test case reviews\n\nParticipate in new feature development, maintenance of existing features and bug fixes\n\nParticipate in feature requirement and design reviews and all regular software development activities\n\nParticipate in test case design reviews and make bug prevention proposals\n\nProvide clear and complete documentation based on the definition of the software development process\n\nCollaborate with team members in software development activities using the Scrum/Agile development process\n\nSenior members will take ownership of each project, need to make design and implementation decisions autonomously and mentor junior members\n\nQualifications\n\nWho We Are Seeking\n\n5+ years of experience programming in Java, C++ or Object C\n\n3+ years of experience developing applications or middleware for mobile platforms like Android or iOS\n\nObject-oriented software development experience with a solid grasp of algorithms and data structures\n\nExperience working with large code bases, developing entirely new code and maintaining existing code\n\nExperience providing guidance, leadership, and mentoring to team members\n\nExperienced working with SCM tools like GIT, SVN or ClearCase\n\nExperienced working with Agile/Scrum development process and tools\n\nAbility to perform diagnostic and investigate issues based on limited information\n\nExcellent verbal and written communication skills\n\nCreative, disciplined, strong sense of responsibility, delivery and schedule commitment\n\nStrong leadership and interpersonal communication skills are required for senior position\n\nBachelor’s degree in Computer Science, Software Engineering or equivalent field\n\nAdvanced degrees preferred\n\nOther Skills Preferred\n\nExperienced with Android Open Source Project development\n\nSoftware development experience in Linux platform\n\nSoftware development experience in a variety of embedded system\n\nExperience with scripting, tool development and test automation framework\n\nExperience with the development of automotive infotainment solutions\n\nExperience with vehicle communication network protocols including CAN, MOST",
            "apply_options": [
                {
                    "title": "HackerX",
                    "link": "https://hackerx.org/job/general-motors-canada-markham-2-recruiter/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJHZW5lcmFsIE1vdG9ycyBDYW5hZGEiLCJhZGRyZXNzX2NpdHkiOiJNYXJraGFtLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJwbFZMZ2xvSTM1WW84SjNYQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Android Developer Intern",
            "company_name": "Waygo Visual Translator",
            "location": "Toronto, ON, Canada",
            "via": "Jobbio",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=VsTzKZryK0wGJ9aiAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCQAwAUFz7CU6Zpd6J4KKTKIgOuhQdS9qG9uRMjuSU-jN-q7q86RWfSeG33KmEDvb0oiiJFI6cSRnmcJIGjFDbAYThINJHmm6GnJOtvTeLrreMObSulYcXpkZGf5fG_tQ2oFKKmKlerhajS9zP3A3fvcA12BMjVIpsvyAKgaESFc5SwuVcwg4ZO_wCEeb3c6EAAAA&shmds=v1_AUFQtOMLBrtgkae9gU4XLqk-QXTpeTuDrodyHRgLS_-iRPDU6A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=VsTzKZryK0wGJ9aiAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d9879cdbd2157b8bab3a86f448fd3bc7acdb8041cc0ea9d70a7.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Android Developer Intern Job Description We are looking for an Android intern to help build and improve Waygo for Android. This is an unpaid internship but the hourly commitment is flexible and you can get college credit! Waygo app has already helped our users make over 3.5M translations. Your contribution will directly improve a Waygo user’s experience traveling abroad. All of our software engineers have around 10 years of experience developing and are eager to help you learn and reach your education/career goals. You’ll be working under an experienced developer that will help you along the way. If you perform well, there is an opportunity for a full-time position after graduation. This is a remote position as we are a distributed team of 6 so the majority of communication will be through email and video chat. Qualifications Android SDK experience Java experience Git experience Excellent communication skills Ability to meet deadlines Passion for startups, travel, and mobile technology Apply Now!",
            "apply_options": [
                {
                    "title": "Jobbio",
                    "link": "https://jobbio.com/companies/waygo-visual-translator/jobs/android-developer-intern?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBJbnRlcm4iLCJjb21wYW55X25hbWUiOiJXYXlnbyBWaXN1YWwgVHJhbnNsYXRvciIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6IlZzVHpLWnJ5SzB3R0o5YWlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Android Developer",
            "company_name": "Lorven Technologies",
            "location": "Calgary, AB, Canada",
            "via": "Talent.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=4iXza3xhtwyMvOcFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHsQrCMBAAUFz7CU43SqmNCC46VQVBHN3LNT2SlHgXcqHU7_CH1eXBqz6ratPxmCWMcKWZoiTKsIW7DKCE2XoQhpuIi7Q--VKSHo1Rja3TgiXY1srLCNMgi5lk0D-9esyUIhbq94fd0iZ2df2QPBPDk6xnieICKQSGC0aH-d1Ad25-YRzxC07svOqWAAAA&shmds=v1_AUFQtON-BpaVzaXF30_MaeWbWH_F1Pmz6RxEw_fCe7nSnAEEeA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=4iXza3xhtwyMvOcFAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d983ee5cec1a9c48bef5bca16cd27e4d3975de673d646d788f8.gif",
            "extensions": [
                "CA$55–CA$65 an hour",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "CA$55–CA$65 an hour",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Our client is looking Android developer for long term project in Calgary, AB - CAN (Onsite) Below is the detail requirement.\n\nRole : Android developer\n\nLocation : Calgary, AB - CAN\n\nJob description\n• 6+ years of Mobile app development experience\n• Strong proficiency with Android application development, Kotlin programing language\n• Hands on experience with Android Studio, Mobile application debugging\n• Proficient understanding of code versioning tools, such as GitHub and Bitbucket\n• Knowledge of cordova plug ins, node modules, mobile web view will be a plus.\n• Experience in high volume production scenario\n• Understanding accessibility and security compliance",
            "apply_options": [
                {
                    "title": "Talent.com",
                    "link": "https://ca.talent.com/en/view?id=9a33ca0309ee&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Venus Consultancy",
                    "link": "https://venushiring.ca/job/android-developer-in-calgary/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee Canada Meet Opportunities",
                    "link": "https://ca.bebee.com/job/c9b76c4a974646aba111545f423c4718?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/calgary/canada/software_development/3824473810/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobdash.ca",
                    "link": "https://jobdash.ca/job/android-developer-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Edajobs.com",
                    "link": "https://ca.edajobs.com/job/23047/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkxvcnZlbiBUZWNobm9sb2dpZXMiLCJhZGRyZXNzX2NpdHkiOiJDYWxnYXJ5LCBBQiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiI0aVh6YTN4aHR3eU12T2NGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Android Engineer",
            "company_name": "Finix",
            "location": "Toronto, ON, Canada (+1 other)",
            "via": "Lever",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=enTo0108fHEXKHTMAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CeJwmyA1EcHFTiIqOOjiXi7tkZzUu5DL0A_ww8U3vOa7aNYnGYvyCBeJLEQFtnDXAEZYhgQqcFONEy27VGu2o_dmk4tWsfLgBv14FQo6-7cG-9dbwkJ5wkr9_rCbXZa4WV1ZeAYWeGlRqdrC89HCGQVH_AF6_JhghwAAAA&shmds=v1_AUFQtON3D_nEfKnCio7dZeK0-B0BrmQQvuINVDBN51GbDE0Ajg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=enTo0108fHEXKHTMAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Us\n\nMove money. Make money. Finix processes billions of dollars every year for leading SaaS, marketplace, and e-commerce platforms. With one developer-friendly API, Finix helps companies accept payments, manage payouts, and onboard merchants—everything you need to enable payment processing, and grow revenue.\n\nFinix has raised over $100M from American Express Ventures, Bain Capital Ventures, Homebrew, Inspired Capital, Lightspeed Venture Partners, Sequoia Capital, Visa, and others.\n\nAbout the role\n\nThe mobile engineer owns the development of mobile apps and SDK responsible for enabling transactions on Android-compatible devices. This specific role will implement and develop an SDK that integrates with Finix APIs and payment providers to collect payments using various terminals. This role will be involved in developing SDK for developing accepting credit card, ACH, and Google Pay payments.\n\nYou Will\n• Work with product management to create specifications.\n• Work with various vendors to understand specifications and implement their libraries.\n• Work with native payment methods, Bluetooth functionality, Storage, location, and various features.\n• Own the implementation, best practices, and infrastructure within your domain. Develop close relationships with product management and peer engineers.\n• Proactively improve our architecture, frameworks, tooling, automation, and best practices.\n\nYou Are\n• Comfortable continuously delivering code, infrastructure, and tests throughout the product development lifecycle.\n• Able to lead proposals, design, and architect systems through research into use cases\n• Obsessed with finding edge cases, understanding requirements, and design implications.\n• Proactive in monitoring running systems and troubleshooting production issues.\n• Committed to communicating and working cross-functionally with other teams to ensure the delivery of quality code and features.\n\nYou Have\n• 3+ years of experience working on mobile applications development\n• Professional experience developing publicly available Android apps using Kotlin/Java supported by RESTful web services\n• Participation from inception to launch using automated tooling of at least one publicly available app\n• Experience with Dependency Injection with tools such as Koin\n• Experience with memory storage, management, and persistence\n• Experience with Jetpack Libraries, Navigation, and Compose\n• Experience with Test Driven Development, and Test Automation\n• Experience working on developing Android SDK/libraries\n• Experience developing MVVM + Clean Architecture applications and developing libraries suited for varied app architectures\n• AOSP experience is a bonus\n\nFinix is an equal opportunity employer and values diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status, or any other protected class.\n\nRole: Android Engineer\n\nLevel: IC3\n\nLocation: San Francisco\n\nBase Salary Range: $120,000/yr to $160,000/yr + equity + benefits\n\nOur salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries at our headquarters in San Francisco, California. Individual pay is determined by work location, job-related skills, experience, and relevant education or training.\n\n#LI-EH1",
            "job_highlights": [
                {
                    "title": "Qualifications",
                    "items": [
                        "Comfortable continuously delivering code, infrastructure, and tests throughout the product development lifecycle",
                        "Able to lead proposals, design, and architect systems through research into use cases",
                        "Obsessed with finding edge cases, understanding requirements, and design implications",
                        "3+ years of experience working on mobile applications development",
                        "Professional experience developing publicly available Android apps using Kotlin/Java supported by RESTful web services",
                        "Participation from inception to launch using automated tooling of at least one publicly available app",
                        "Experience with Dependency Injection with tools such as Koin",
                        "Experience with memory storage, management, and persistence",
                        "Experience with Jetpack Libraries, Navigation, and Compose",
                        "Experience with Test Driven Development, and Test Automation",
                        "Experience working on developing Android SDK/libraries",
                        "Experience developing MVVM + Clean Architecture applications and developing libraries suited for varied app architectures",
                        "AOSP experience is a bonus"
                    ]
                },
                {
                    "title": "Benefits",
                    "items": [
                        "Base Salary Range: $120,000/yr to $160,000/yr + equity + benefits",
                        "Our salary ranges are determined by role, level, and location"
                    ]
                },
                {
                    "title": "Responsibilities",
                    "items": [
                        "Finix processes billions of dollars every year for leading SaaS, marketplace, and e-commerce platforms",
                        "The mobile engineer owns the development of mobile apps and SDK responsible for enabling transactions on Android-compatible devices",
                        "This specific role will implement and develop an SDK that integrates with Finix APIs and payment providers to collect payments using various terminals",
                        "This role will be involved in developing SDK for developing accepting credit card, ACH, and Google Pay payments",
                        "Work with product management to create specifications",
                        "Work with various vendors to understand specifications and implement their libraries",
                        "Work with native payment methods, Bluetooth functionality, Storage, location, and various features",
                        "Own the implementation, best practices, and infrastructure within your domain",
                        "Develop close relationships with product management and peer engineers",
                        "Proactively improve our architecture, frameworks, tooling, automation, and best practices",
                        "Proactive in monitoring running systems and troubleshooting production issues",
                        "Committed to communicating and working cross-functionally with other teams to ensure the delivery of quality code and features"
                    ]
                }
            ],
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/finix/f7b16796-2332-4934-bb73-83199dbdcc23?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=8813d19e8e714f84&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Finix/Job/Android-Engineer/-in-Toronto,ON?jid=c3ad81d6bde49208&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-engineer-at-finix-151?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/android-engineer-at-finix-3995452460?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/android-engineer-capgemini-JV_IC2281069_KO0,16_KE17,26.htm?jl=1009460317134&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/-818192303258621207?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/canada/job/full-time/others/android-engineer-137295033?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRmluaXgiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJlblRvMDEwOGZIRVhLSFRNQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "iOS & Android Developer",
            "company_name": "BLAX",
            "location": "Quebec, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Z_A0rBgvo2vnYc0FAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7AQ5ONzmIJiK42KkqCCKIuLiVS3I0kZgLuSj9Af9bfMNrvpNGhesd5tAlVzg4ONKHImcqsIIzGxDCYj1wghPzEGnW-lqz7LQWiWqQijVYZfmlOZHhUT_ZyL9ePBbKESv1m-16VDkNi-n-0j0gJLi9yZBdwgETOvwBpd1bVIgAAAA&shmds=v1_AUFQtON3U1A4BrxiteGeEAkAl5bJ0Zp-8bBYIQHOKSGRkgEuxQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Z_A0rBgvo2vnYc0FAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d98d6f7745e4f3a7cff15860b8fb97b2665607754b18ada0e0c.gif",
            "extensions": [
                "25 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "25 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Job Description\n\nUnder the responsibility of the CTO, the iOS and Android Developer has the responsibility of producing and developing native iOS and Android applications of all kinds in accordance with the requirements of managers and specifications while incorporating a healthy dose of personal initiative. Should be comfortable with evolutive project management process that vary from one project to another and must be able to work in teams on issues of different magnitudes.\n\nResponsibilities\n\nDevelop native iOS and Android application of all kinds respecting frames and specifications required for mobile applications. Perform quality assurance tests. Ensure the various stages of publication on the AppStore and the Google Play Store.\n\nRequirements\n• 3-5 years experience in a similar position\n• Thorough knowledge SDK iOS and Android\n• Be familiar with the versioning development\n• Bachelor’s degree in Computer Science or other relevant training\n• Mastery of the publishing process AppStore and Google Play Store\n• Interest and skills in computer graphics for the interface design\n• Portfolio and/or online references mandatory\n\nAssets\n• Blackberry knowledge\n• Knowledge of Phonegap\n• Bilingual. French/English\n\nAbout Us\n\nBlax Web & Design is a digital agency with a human dimension, specializing in the strategy, design and production of websites, mobile applications and brand platforms. Our offices are located in the Greater Montreal Area (Montreal and Boucherville on the South Shore). Only selected candidates will be called for an interview. We sincerely want to thank all applicants for showing an interest in this position. Blax promotes employment equity.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=88fdd5cc6f803cc4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/-6lvV-Z9y53UewqhXawPTExHUUYxNdfxlfETiCDpAYieEY8LmYtL5A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgXHUwMDI2IEFuZHJvaWQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQkxBWCIsImFkZHJlc3NfY2l0eSI6IlF1ZWJlYywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJaX0EwckJndm8ydm5ZYzBGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Android Software Developer - Automotive Infotainment",
            "company_name": "CIeNET International",
            "location": "Markham, ON, Canada",
            "via": "Ladders",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=wM9tr3kQxp7vAGieAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNPQ8BQRBAo_UTVFP7uBWJhkoQQVDQy9zduFt2Zza749w_8_ec5jUvL6__7fWPKy6j2BKu8tAPRoINNeQkUIQJrN4qXtQ2BHt-iKJlT6ydOUgOiTAWNQjDTqRyNFjWqiEtjEnJZVVSVFtkhXgjTLm05il5-uOe6u4UHCrdZ_NpmwWuhqP1ns7bWzdSitylwujAMpwwvmr0Y7icx7BGxhJ_CawI4boAAAA&shmds=v1_AUFQtONbMcC2g2TeoOjd5yeY4r66dqq0ptVvABza1OYB9EIZXg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=wM9tr3kQxp7vAGieAAAAAA%3D%3D",
            "extensions": [
                "86,732–130,099 a year",
                "Full-time"
            ],
            "detected_extensions": {
                "salary": "86,732–130,099 a year",
                "schedule_type": "Full-time"
            },
            "description": "Location: Markham, Ontario, Canada\n\nPosition Title: Android Software Developer - Automotive Infotainment\n\nCIeNET is a mobile, automotive, telecom and enterprise software services and solutions research, engineering and development company founded in the U.S. in the year 2000. We currently have over 2,400 employees worldwide, supporting customers in North America, Asia and Europe. We have over ten locations across US, Canada, Mainland China and Taiwan. CIeNET has been named Global Outsourcing 100 in fifteen consecutive years. CIeNET has become an ALTEN Group Company in 2021.\n\nCIeNET is expanding its presence in Canada to better serve our industry leading customers in the automotive industry. We are working on state-of-the-art technologies and products that will bring automotive information and entertainment, mobile internet, telematics services and ADAS to life in the years to come.\n\nCIeNET Canada is looking for intelligent, creative, enthusiastic and diligent professionals to join our team and shape the great future of your career with us.\n\nRole SummarySoftware developers will contribute to the development of the advance Infotainment systems. Their contribution will enable customers to connect their personal consumer devices to vehicle infotainment systems. These software developers and engineers will be important members of a fast growing software group in Canada, which is part of the larger global Engineering team across continents.\n\nWe accept applications across several technical domains including connectivity, user interface and core application and services, framework and personalization, and multimedia and audio, diagnostics. You are encouraged to apply for these positions if you have expertise in any one of the following domains:\n\no User Interface and core applications and services:\n\nThe developer for this domain will be responsible for feature development and maintenance of core applications and services such as calling, contacts, settings, and messaging. Prior UI/UX experience is required to develop user friendly applications\n\no Framework and Personalization:\n\nThe framework developer will be responsible for the customization and enhancement of Android framework components such as, windows manager, activity manager, package manager, system UI and customization widgets, to realize the automotive requirements and features. The developer/engineer for personalization will own the development and maintenance of the Android multi-user framework and all personalization related features\n\no Multimedia:\n\nThe developer for this domain will enhance the entertainment sub-system based on the existing Android multimedia framework, including audio/video playback, controlling the vehicle by voice command, and operating a mobile phone via the vehicle infotainment system. This developer/engineer will leverage their prior software development experience in industry standard multimedia solutions, such as playback engine, audio system, codec, camera, speech, and screen casting, to implement the In-vehicle infotainment multimedia system\n\no Connectivity:\n\nThe developer for this domain will enhance Bluetooth, Wifi, USB sub-systems based on the existing Android source code and 3rd part code, including Voice Call and Music Stream over Bluetooth, Discovery, connect and disconnect Wifi AP, provide Wifi hotspot, supporting connect mobile phone via USB connection. These developers will leverage their prior software development experience in industry standard Bluetooth, Wifi, USB solutions to implement the In-vehicle infotainment system\n\nKey Responsibilities\n• Contribute to develop infotainment solutions for In-vehicle devices. Responsible for the deliverables of the assigned domain such as requirements, system design, development, deployment, and maintenance of the infotainment software\n• Participate in the design of a best-in-class in-vehicle platform for automotive infotainment systems\n• Participate in architecture, requirements, and design, coding and test case reviews\n• Participate in new feature development, maintenance of existing features and bug fixes\n• Participate in feature requirement and design reviews and all relevant software development activities\n• Participate in test case design reviews and conceive bug prevention proposals\n• Provide clear and complete documentation based on the definition of the software development process\n• Collaborate with team members in software development activities using the Scrum/Agile development process\n• Senior member resumes ownership of each project, propose technical solutions, make design and implementation decisions and coach junior members\n\nRequirements\n\nQualifications\n\nRequired Skills and Experiences:\n• Minimum three years of software development experience in related domains\n• Minimum two years of software development experience in Android platform\n• Software development experience in Linux platform\n• Software design and implementation experience in an object-oriented environment\n• Development experience with Java, C++, C, Android Application frameworks\n• Development experience with unit test frameworks such as AndroidTestFramework, monkeyrunner, Robolectric\n• Development experience with Android development toolkit and process\n• Experience with Development tools such as Eclipse IDE and ADT plug-in, Android Studio\n• Experience with software build tools such as makefile, ant, maven, gradle\n• Experience with SCM tools such as GIT, Gerrit, Jenkins, JIRA, or ClearCase\n• Practice with Scrum/Agile software development process\n• Ability to perform diagnostic and investigate issues based on limited information\n• Experience in developing and deploying commercial products in global market is a plus\n• Excellent verbal and written communication skills\n• Creative, disciplined, strong sense of responsibility to delivery result to meet schedule and commitment\n• Good team player with strong interpersonal skills to work effectively in a geographically dispersed environment\n• Effective communication skills and a strong problem solver\n\nRequired Domain Knowledge and Experiences\n• User Interface and core applications and services\n\no Experience in Android application and user interface development\n\no Excellent knowledge of Android core applications and services (telephone, message etc.)\n\no Prior UI/UX development experience of consumer product\n• Framework & Personalization domain:\n\no Development experience in Android UI framework, system UI and widgets\n\no Development experience with Android window manager, activity manager, and package manager.\n\no Android multi-user domain knowledge and development experience\n• Multimedia domain\n\no Development experience in Android Multimedia framework\n\no Solid working knowledge of current Android platform technologies, including media playback engine, streaming, codec, media capturing, audio framework, voice recognition, and screen sharing\n\no Demonstrated in-depth and breadth understanding of software technologies, including rendering, simulation, relational database, and user interface development\n• Connectivity\n\no Development experience with implementing Bluetooth Stack, Chipset and Firmware\n\no Development experience with Android/Linux Wifi Stack including wpa_supplicant, wifi and network driver, chipset and firmware\n\no Development experience with Android/Linux USB Stack\n\no Demonstrated in-depth and breadth understanding of low level software technologies, such as driver, dma, interrupt, I/O, serial port etc.\n\no Solid working knowledge of Linux platform\n\no Experience with BSP development is a plus\n\nPreferred Skills and Experiences:\n• Software development experience in a variety of OS environments is a plus\n• Experience with the integration of Android framework and device bring up is a plus\n• Experience with the porting of Android ROM is a plus\n• Experience with the development of automotive infotainment solutions is a plus\n• Experience with automotive and/or portable consumer electronic devices is a plus\n• Successful Track record in applying advanced technology to enhance the usability of complex systems is a plus\n\nEducation and Training:\n• Bachelor's degree in Computer Science, Software Engineering, or related field.\n• Graduate degree is preferred\n• Professional Engineering designation is a plus\n\nBenefits\n\nGroup Insurance, Employer RRSP match, 15 days annual vacation.\n\nCIeNET offers equal opportunities to people. Accommodation is available for applicants with disabilities upon required. We would like to thank all applicants for expressing interest. However only those selected for interviews will be contacted. Reference check of certain positions will be conducted with your permission.",
            "apply_options": [
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/android-software-developer-automotive-infotainment-ci-dot-net-international-markham-on_69479587?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Mobot, Inc.",
                    "link": "http://mobotinc.com/office/job/android-software-developer-automotive-infotainment-at-cienet-international-markham-on-ZE00Rm9kVmVyYlhDYzY1Z1ZncEdIdnFDcHc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Audio Mint",
                    "link": "https://audiomint.net/library/job/android-software-developer-automotive-infotainment-at-cienet-international-markham-on-N0MxQ2VmdGpWbXBhY3JmcVlxVnpPSzV2SkE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GeoMati Systems",
                    "link": "https://geomatisystems.com/library/job/android-software-developer-automotive-infotainment-at-cienet-international-markham-on-VC92SENvVVZYMis0UG5TUU1UU1htQ2prUEE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIERldmVsb3BlciAtIEF1dG9tb3RpdmUgSW5mb3RhaW5tZW50IiwiY29tcGFueV9uYW1lIjoiQ0llTkVUIEludGVybmF0aW9uYWwiLCJhZGRyZXNzX2NpdHkiOiJNYXJraGFtLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJ3TTl0cjNrUXhwN3ZBR2llQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Software Engineer, Android",
            "company_name": "DoorDash Canada",
            "location": "Toronto, ON, Canada",
            "via": "Greenhouse",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=b8BxdjyNsv86iAdFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3MMQrCQBBGYWxzBKupLCRmVbDRSowIFlpoHybJZnclzh92FsxRPK4KNq_4ipe9J9nqhi69OFo6igtibcxpL21EaGlBZ9SklmPjCUInwPV2uvMpDbo1RrUvnCZOoSkaPA3E1hjNA7X-Uqn_foeek63Wm-VYDOLmsxKIJaunAwu3TEHojghJyOl6yf_8AQqawRGbAAAA&shmds=v1_AUFQtOPrRiqF1jxLG7EWP9hcNUKxQ0ZIIgDoKVIARPuKuTcvsw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=b8BxdjyNsv86iAdFAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785026272c8da365da55220/images/d8612d9ef8ba7d98c693e9141272e8342b2a3a42b00d4764d17136d8ecd8906a.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "About the Team\n\nDoorDash is building the world's most reliable on-demand, logistics engine for delivery! We're looking for experienced engineers to join our fast-growing engineering team to help us develop a 24x7, global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers.\n\nAbout the Role\n\nWe're looking for Android engineers who want to work on an app used by millions of people. We've seen significant growth, in our codebase and number of developers, and we'd love for you to bring a piece of your culture and experience into ours so that we can continue to improve our processes and architecture. Whether you're an engineer interested in scaling our Android infrastructure or building awesome product features, we'd love to talk to you!\n\nYou're excited about this opportunity because you will...\n• Develop the architecture of our Android applications\n• Scale our test infrastructure and automate releases\n• Introduce tools and best practices that accelerate our development process\n• Build awesome product features to improve our marketplace\n\nWe're excited about you because you have...\n• B.S., M.S., or PhD. in Computer Science or equivalent\n• 2+ years developing with Android SDK in a production environment\n• Systems and OOP knowledge\n• Expert knowledge of Android testing frameworks and best practices for testing\n• High bar for code quality\n\nNotice to Applicants for Jobs Located in NYC or Remote Jobs Associated With Office in NYC Only\n\nWe use Covey as part of our hiring and/or promotional process for jobs in NYC and certain features may qualify it as an AEDT in NYC. As part of the hiring and/or promotion process, we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound from August 21, 2023, through December 21, 2023, and resumed using Covey Scout for Inbound again on June 29, 2024.\n\nThe Covey tool has been reviewed by an independent auditor. Results of the audit may be viewed here: Covey",
            "apply_options": [
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/doordashcanada/jobs/5619611?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Wellfound",
                    "link": "https://wellfound.com/jobs/3166180-software-engineer-android?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=65e6fc9dff8213ef&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "RippleMatch",
                    "link": "https://app.ripplematch.com/v2/public/job/b6995282?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Puck",
                    "link": "https://app.careerpuck.com/job-board/lyft/job/7753860002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Lyft/Job/Software-Engineer,-Android/-in-Toronto,ON?jid=a111955e1b8454c6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Muse",
                    "link": "https://www.themuse.com/jobs/doordash/software-engineer-android-ad5b7c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/Square/743999909392183-android-software-engineer-retail-grocery?trid=386b24f8-f995-4ef6-bfdb-197532f544ee&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgQW5kcm9pZCIsImNvbXBhbnlfbmFtZSI6IkRvb3JEYXNoIENhbmFkYSIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6ImI4QnhkanlOc3Y4NmlBZEZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUWHBaYmxKRVVrcEJTWFo0T0hKYWVGRjVNR3cxTm5rMU1IQjRWMGwzWVdaalV5MTRjbTlEVFVaVFYwZGphVXRGU25jd2JVRmtSWGh3YzNaUVpYZFRPRkJOVjNsbGJ6QnRSazFTYWxoUWNWcElkbXhCUnpSNGFtaG5kbTlYY0doeGRtSkxjMlJ3UjNsVGMwaDZaREJxYlVwTFdGOVphRWxuVkVwUlFXSlJSMVJuT0VWcll6bG5VVmR5Tm5WS1RXbHZTRGsxUjNaMlFUbGtWRkJKZWxoT1J6WlVUWGxOYkRsVFJXcHllV1JvYUd3elpqWldUVXRHUm5ST1psVjBaMFU0T1RocmNVMXJRM2xYY1ZWVmMyOUdNa2t4VDNwTU5YaERTbGx2Ykd4NGN6Qk1OM2xhTFVVNGJteHdNRGxqUkhNeFZsbHVlRWRJWTJvMFpHZzNSazVoYlRGYVdtSkpVVGRuV2xSWVRtTjFlVEUxVlhkclRuazNXbEI2T0hjU0YxbG5TMFphT1MxMVNYWnhWM2RpYTFCc2MwZFJNRkZKR2lKQlJsaHlSV052ZUZSMlkxQllkREZsVVZGT2EyZENhRXMyY2s5a05rWTRkbVpCIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Canada&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUWHBaYmxKRVVrcEJTWFo0T0hKYWVGRjVNR3cxTm5rMU1IQjRWMGwzWVdaalV5MTRjbTlEVFVaVFYwZGphVXRGU25jd2JVRmtSWGh3YzNaUVpYZFRPRkJOVjNsbGJ6QnRSazFTYWxoUWNWcElkbXhCUnpSNGFtaG5kbTlYY0doeGRtSkxjMlJ3UjNsVGMwaDZaREJxYlVwTFdGOVphRWxuVkVwUlFXSlJSMVJuT0VWcll6bG5VVmR5Tm5WS1RXbHZTRGsxUjNaMlFUbGtWRkJKZWxoT1J6WlVUWGxOYkRsVFJXcHllV1JvYUd3elpqWldUVXRHUm5ST1psVjBaMFU0T1RocmNVMXJRM2xYY1ZWVmMyOUdNa2t4VDNwTU5YaERTbGx2Ykd4NGN6Qk1OM2xhTFVVNGJteHdNRGxqUkhNeFZsbHVlRWRJWTJvMFpHZzNSazVoYlRGYVdtSkpVVGRuV2xSWVRtTjFlVEUxVlhkclRuazNXbEI2T0hjU0YxbG5TMFphT1MxMVNYWnhWM2RpYTFCc2MwZFJNRkZKR2lKQlJsaHlSV052ZUZSMlkxQllkREZsVVZGT2EyZENhRXMyY2s5a05rWTRkbVpCIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}