{
    "search_metadata": {
        "id": "67850288e2c54f751b8e2639",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/2a8abfc65df65ae8/67850288e2c54f751b8e2639.json",
        "created_at": "2025-01-13 12:09:44 UTC",
        "processed_at": "2025-01-13 12:09:44 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIGRnJhbmNl&udm=8&fc=EuICCqICQUpHOUprTTJJTENsRWFGWWp5YTBKb1BLcFJXejZ2VlBvdWRlVFN0UFY2TVhmMHFIOVNwX3ZHZHBTX0tTdGU2Qi12NUdFU25lRDNTUWFIV252M295R1lfOWxBQlNMdFV3TXN4Wmo4aGFZdm10MTlkS21tQzJOSi1zcXdzZFVqVEpYcDVKLXNvNlk3aDh4d3U3SkgwYXdISnpFV3BtaXBzWGcyUkVpaGl0OVFGOGVQSVNNTTBQZm5FTEN6YU5fbDdzaHJtYzJiNXV5ZExIdVA3WVJzRUdPU3VoWXkycW5pdG5FTTNFcUFLZXRjNkJvOVRWZTNVSy1tSzlFQnVSVFJMbUZTYTB4VnNlUXlXMW5VZkJZYzZkQTRQbmx2WmQzcUNJb3cSF2lBS0ZaOGlnQ09MbjVOb1B3b2F3NlFNGiJBRlhyRWNwczBoNzJvanEtTnl2T2Z3MHNjTGtET1BiNGd3&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/2a8abfc65df65ae8/67850288e2c54f751b8e2639.html",
        "prettify_html_file": "https://serpapi.com/searches/2a8abfc65df65ae8/67850288e2c54f751b8e2639.prettify",
        "total_time_taken": 0.37
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "France",
        "location_used": "France",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUVEpKVEVOc1JXRkdXV3A1WVRCS2IxQkxjRkpYZWpaMlZsQnZkV1JsVkZOMFVGWTJUVmhtTUhGSU9WTndYM1pIWkhCVFgwdFRkR1UyUWkxMk5VZEZVMjVsUkROVFVXRklWMjUyTTI5NVIxbGZPV3hCUWxOTWRGVjNUWE40V21vNGFHRlpkbTEwTVRsa1MyMXRRekpPU2kxemNYZHpaRlZxVkVwWWNEVktMWE52TmxrM2FEaDRkM1UzU2tnd1lYZElTbnBGVjNCdGFYQnpXR2N5VWtWcGFHbDBPVkZHT0dWUVNWTk5UVEJRWm01RlRFTjZZVTVmYkRkemFISnRZekppTlhWNVpFeElkVkEzV1ZKelJVZFBVM1ZvV1hreWNXNXBkRzVGVFRORmNVRkxaWFJqTmtKdk9WUldaVE5WU3kxdFN6bEZRblZTVkZKTWJVWlRZVEI0Vm5ObFVYbFhNVzVWWmtKWll6WmtRVFJRYm14MldtUXpjVU5KYjNjU0YybEJTMFphT0dsblEwOU1ialZPYjFCM2IyRjNObEZOR2lKQlJsaHlSV053Y3pCb056SnZhbkV0VG5sMlQyWjNNSE5qVEd0RVQxQmlOR2QzIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Engineer, App Analysis",
            "company_name": "Data Theorem",
            "location": "Paris, France",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=-BTj7j0zAuTCebJKAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFz7CIJws2gjQhedCv6Ak4N7uaZHEknvwl2G-hy-sPgNX_NdNV3Pk0qa4MohMZHuoC8Fesb8sWSwh4eMYITqIwjDXSRkWp9jrcVOzpnlNljFmnzrZXbCNMri3jLav8EiKpWMlYZjd1jawmG7uWBFeEUSpRkSwxM12Q5uiuzpB51x5ZmWAAAA&shmds=v1_AUFQtOPmHQjiFAH0mYhZtucFEpBFnsuNiriPpc4mKRbvqD9j8w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=-BTj7j0zAuTCebJKAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850288e2c54f751b8e2639/images/6b00a34132705d8aad4472fb6b7322b62e16f25e31c1522ccc260938e47562e2.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Remote\n\nFull Time\n\nMid Level\n\nData Theorem is an exciting company focused on creating a more secure world for data. Rooted in a strong engineer first culture, every employee has an impact on product and direction. We are searching for exceptional talent pursuing an opportunity to grow and take ownership of the projects that resonate most with them.\n\nAs an Android engineer, you will be responsible for improving our automated platform for analyzing Android applications at scale, and help Data Theorem’s customers build better, more secure, and more private applications.\n\nYou will:\n• Work with the mobile team on a set of tools we've built to statically analyze APK's in order to find security or privacy issues.\n• Improve our dynamic analyzer, which instruments Android applications in order to study their behavior while running on a device, and detect dangerous actions that could lead to security problems.\n• Collaborate with the security research team to build new security checks to be added to our scanning platform, so we can help customers build more secure Android apps.\n• Be an active member of Data Theorem's engineering team, which is spread across the United States, England, France, and Canada.\n• Be amazed at your opportunity for growth within a top cybersecurity startup.\n\nWe’re looking for someone who has:\n• Significant experience implementing Android applications and tools.\n• A good understanding of the Android runtime, or a strong interest in becoming more familiar with the runtime.\n• Bonus points: some experience with Flutter writing tools in Python.\n• Bonus points: some experience with taking apart Android software in order to understand and/or modify it. This includes experience with tools such as Xposed, Frida, apktool, androguard, etc.\n\nQualifications:\n• Bachelor's degree in Engineering or equivalent work experience in related field.\n• 3 plus years of experience working with mobile technologies.\n• No information security experience required - we are more interested in software engineering backgrounds.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://fr.indeed.com/viewjob?jk=c8326bea4543fb7c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/android-engineer-app-analysis-data-theorem-JV_IC2281069_KO0,29_KE30,42.htm?jl=1009229734328&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyLCBBcHAgQW5hbHlzaXMiLCJjb21wYW55X25hbWUiOiJEYXRhIFRoZW9yZW0iLCJhZGRyZXNzX2NpdHkiOiJQYXJpcywgRnJhbmNlIiwiaHRpZG9jaWQiOiItQlRqN2owekF1VENlYkpLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1JuSmhibU5sIn0="
        },
        {
            "title": "Android Developer (IT) / Freelance",
            "company_name": "confidential",
            "location": "Montpellier, France",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=PgC41ll_OYNuI_CzAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCQAwAUFz7CU4BFxXtieCgToIoCm7u5XpN25OYHJcg_Rn_Vbu89RXfSbE_cZMlNnDGD5IkzDC_PRfg4JIRyXNAWMNdalD0OfQgDFeRjnB67M2SHpxTpbJT8xZDGeTthLGWwb2k1pFKe58xkTestrvNUCbulrMg3MYG2aIniAwPYUtIFDGv_vcY_wAfAjknoAAAAA&shmds=v1_AUFQtOM9VIsFtYVvAOVwEjoDe0oWMWIBG2LzABANTUNc8yWDPA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=PgC41ll_OYNuI_CzAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Description de l'offre\n\nNous poursuivons notre développement et recrutons un Développeur tests automatisés F/F sur Montpellier (34). A ce titre, vous serez en charge de : Concevoir et réaliser des scénarios de tests automatisés selon les plans définis par l'équipe fonctionnelle, Suivi des cas de test dans Squash, en fonction des implémentations, Suivi des résultats des tests et vérification de la non régression, Déclaration, suivi et gestion dans Jira des anomalies détectées, Maintenance et mise à jour des scénarii automatisés existants, Reporting régulier à l'équipe de développement et définition des KPIs pertinents. Profil candidat: Fort d'une première expérience sur des fonctions similaires, vous êtes diplômé(e) d'un Bac+2, ou équivalent, en informatique. Vous maîtrisez des outils d'automatisation : WebdriverIO, Appium, Mocha (ou outil équivalent) et l'environnement de développement : VScode / Selenium / Chai / Mocha. Vous maîtrisez également les langages Javascript, Node JS et avez des notions de Postgres, Kubernetes, Postman, Jenkins. Vous avez été amené à travailler sur les outils de reporting et suivi : Jira (ou autre gestionnaire d'anomalies), Squash (ou autre gestionnaire d'anomalies). Application cible : web et mobile (Android et iOS).",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://fr.jooble.org/rjdp/-8131933924058318690?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoSVQpIC8gRnJlZWxhbmNlIiwiY29tcGFueV9uYW1lIjoiY29uZmlkZW50aWFsIiwiYWRkcmVzc19jaXR5IjoiTW9udHBlbGxpZXIsIEZyYW5jZSIsImh0aWRvY2lkIjoiUGdDNDFsbF9PWU51SV9DekFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "Android (Kotlin) Developer - Freelance",
            "company_name": "Veepee",
            "location": "Nantes, France",
            "via": "Okko Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=4V5eJjehjWDgbvraAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBRGYVz7BOJ0RxVtRHCpOAiioODoWtL0p43Ee0NukD6Jz2u7HM72Fb9ZcTpzm8S3tHxIDp5XdMEXQSISbemagGDZYfy7NKSwyfUkTDeRLmBx7HOOWhmjGspOs83elU4-RhiNDOYtjU6ptbcJMdiMen_YDWXkbj1_AREgz_S0nKGbEZy0P1FkbcyZAAAA&shmds=v1_AUFQtOP3Xv8hP57EWnLV690y7MD796-gfwZwHGZfB80n932jhQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=4V5eJjehjWDgbvraAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "The vente-privee group has consolidated its various European brands, together made up of 6000 employees, under one unified conglomerate: Veepee(e)This coalescence marks a new chapter in its European history.\n\nWith Privalia, vente-exclusive, Designer & Friends, Eboutic and vente-privee, Veepee achieved a 3.7 billion Euro turnover as of 2018(e)Present in 14 countries now, Veepee is taking a leading role in the European digital commerce landscape.\n\nOur 6000 employees have chosen a job at Veepee to spice up their daily lives! Our teams implement new technologies to fuel our strategies, offering our customers the best possible experience.\n\nAre you eager to learn? Veepee offers you a variety of trades to develop your career, enabling you to renew your skills constantly(e)Tech, logistics, sales, marketing, sales production: join us on an exciting, digital-centered journey.\n\nBeing an Android engineer in vpTech is :\n- To be a part of a distributed fully agile team of 8-10 engineers;\n- To support and improve the quality of the Android application, adding new features to it in order to enhance users’ experience;\n- To create special additional tools for developers, and to contribute to the mobile community.\n\nResponsibilities:\n• Propose and work on new solutions with respect to the technical and functional needs of a given project;\n• Maintain high quality of code, as well as solve appearing challenges with respect to the team guidelines and conventions;\n• Ensure high level of functional and technical compliance of the features with the help of unit/integration test;\n• Improvement of the UX;\n• Making sure that CI processes are followed alongside with overall availability, stability and good performance level of the application;\n• Being an active participant of the process of creation of prototypes and supporting innovation within Veepee;\n• Actively contribute to code reviews.\n\nYour profile:\n• At least 3 years of experience in building Android applications;\n• Being passionate about software development and problem solving;\n• Solid experience with both Kotlin and Java;\n• Good knowledge of Android Studio and Android SDK;\n• Knowledge of software design patterns;\n• Experience with dependency injection (with Dagger, for ex.);\n• Strong skills with unit testing;\n• Good knowledge of MVVM architecture;\n• Experience with reactive programming (RxJava);\n• Ability to apply Continuous integration techniques;\n• You have strong verbal and written English language skills.\n\nWhat we offer:\n• Large amount of good quality data (over 1M visitors per day)\n• The variety of self-education courses on our e-learning platform\n• A dynamic and creative working environment\n• Fun and open international teams\n• State of the art technologies and tools\n• Participation in Veepee meetups and events\n• Remote friendly opportunities.\n\nBelonging to Veepee, is one of the biggest tech communities in Europe with more than 800 IT collaborators.\n\nFrom Warsaw to Barcelona, through Lyon, Nantes, Tel Aviv, Brussels, Nice, Amsterdam, and Paris, all our projects are developed in a functional environment with a wide skills variety where you’ll be sure to find your place, no matter the technology you want to work with.\n\nIf you love to try things why don’t you jump on this new adventure?\n\nNeed more info > https://careers.veepee.com/vptech/\n\nVente-privee.com processes the collected data to handle the recruitment process, to evaluate your ability to carry out the job offered and your professional skills(e)You can learn more about our use of your data and your rights by reading our recruiting privacy policy.",
            "apply_options": [
                {
                    "title": "Okko Jobs",
                    "link": "https://okkojobs.com/android-kotlin-developer-freelance-veepee-hLtrRNAA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIChLb3RsaW4pIERldmVsb3BlciAtIEZyZWVsYW5jZSIsImNvbXBhbnlfbmFtZSI6IlZlZXBlZSIsImFkZHJlc3NfY2l0eSI6Ik5hbnRlcywgRnJhbmNlIiwiaHRpZG9jaWQiOiI0VjVlSmplaGpXRGdidnJhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1JuSmhibU5sIn0="
        },
        {
            "title": "Technical Lead Android",
            "company_name": "Mojo Video",
            "location": "Anywhere",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=mMNke75fPwnVYBo5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CbrcLDYRwUWnLgqi4CCu5ZIcTUq8C7kM_QX_WnzD676rrn-Rj5w8ZrgTBhg4VEkBeriJAyWsPoIwXEWmTOtzbK3oyVrVbCZt2JI3Xj5WmJwsdhan_0aNWKlkbDQejvvFFJ62m4fMAu8USCAxPLEm3cGlInv6AaZkaJuMAAAA&shmds=v1_AUFQtONJYH8GwLuwHPbihyE8v9AFaiG_L_IsX5mV0rugY-ebrw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mMNke75fPwnVYBo5AAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "Mojo is a mobile app for creating incredible animated social content. Users can choose from hundreds of animated templates, customize them to their needs and share them on all social platforms.\n\nMojo was launched in 2018 and is now the #1 app for creating animated content for social media.\nThe app reached over 40M installs with an average rating of 4.9 out of 5 and hundreds of thousands of paying subscribers.\n\nAt Mojo, we believe that creating great visual content should not require technical skills.\n\nThat’s why we want to put a design agency in every pocket.\n\nWith a designer in hand, we make it easier for people to become creators, shop owners, marketers, or artists - and earn a living from it.\n\n---------------\n\n🎯 Missions\n• *CANDIDATES MUST BE BASED IN EUROPE OR UK**\n\nAs Mojo's Android Technical Lead, you'll collaborate closely with Satyan and Pierre-Elie, driving the evolution of our leading app. Your mission is to convert innovative concepts into exceptional Android experiences, while overseeing app performance and team metrics. Your role is pivotal in blending technical expertise with strategic leadership to keep Mojo at the forefront of digital content creation.\n\nAs an Android Tech Lead, you will:\n・ Own the development of new features, going from the technical specifications, discussion with the product and the design to the monitoring of their success. You could work on advanced editing features, such as a powerful timeline, or on synchronizing the user's projects and medias seamlessly.\n・ Lead the Android team in delivering high-quality code and features, setting the bar for excellence.\n・ Develop and articulate a clear technical vision for our Android app that aligns with our business goals and user needs\n・ Help our Android team continuously improve the processes (release, support …) to ship faster and better\n・ Balance hands-on problem-solving with effective delegation, empowering team members to contribute to complex tasks while ensuring project timelines and quality standards are met.\n・ Collaborative leadership: Encourage open communication, teamwork, and collective problem-solving.\n\nHere's an idea of the indicative distribution of time for the role:\n・Code & Operations (65%)\n・Leadership & Mentorship (15%)\n・Quality assurance on what is shipped (10%)\n・Cross-functional team collaboration (10%)\n\n---------------\n\n✨ Skills\n\nThe codebase you will be working on is 98% written in Kotlin. We primarily work with local data and prioritize delivering the best user experience. As we migrate the code, we follow best practices and use the latest libraries recommended by Google, such as Coroutines, Dependency Injection with Hilt, Compose, Flow, and View Model.\n\nHere are the skills and experience it takes to be a good fit:\n- 5+ years of professional experience in Android applications development and good knowledge of the common Android tools and practices (Kotlin, Compose, Clean Architecture, Flow, Coroutines)\n- Previous experience in a technical leadership role in a team of 3+ engineers.\nPassion and experience in building consumer-facing products\n- Experience working on a high-traffic Android application (we have millions of monthly active users 📈)\n- Ensuring the right level of quality and scalability for features you implement (architecture, unit testing)\n- You are experienced with asynchronous code and safety.\n- You know how to maximize performance despite the wide variety of Android devices\n- You are a high-energy doer, quick thinker, and an excellent team player\n- Comfortable working remote and in an asynchronous configuration (status updates, team communication, weekly sync, Pull Requests, code reviews …)\n- You already worked on a legacy codebase and deeply participated in refactoring.\n- Fluent in English 🇬🇧\n\n---------------\n✨ Nice to have✨\n\nThe following list of skills and traits are not required, but will be a plus. If you have some of them, feel free to tell us more:\n- You have already worked with analytics tools and used them daily\n- Previous experience in the Video editing world is a big plus\n- Experience in Graphic Programming (OpenGL, Metal, Vulkan) or Media Codec is a plus\n- Knowledge in Computer Vision, Computer Graphics, Machine Learning, AI\n- Experience building a cross-platform framework / SDK\n\n---------------\n\n💻 Our work style\n\nWe are a small team of 29 people. Almost all of us are based in Europe. We have an office in Paris where half of us go weekly. The rest of the team works remotely and usually comes monthly to the office.\n\nWe gather every six months for team offsites and regularly host team events in Paris.\n\nWe work in English. Our communication is mainly written.\n\nMost of our major initiatives are organized in autonomous squads.\n\nChoose My Company has awarded us the HappyIndex AtWork and the TechAtWork labels for 2023.\n\n---------------\n\n💎 Our core values\n\n💪 We have a doer mentality. We love taking initiatives to drive visible results for the company. We also cultivate a strong sense of autonomy and ownership for all topics.\n\n🚀 We are excited about the change and always move forward with big ambitions.\n\n❤️ We deeply care about other people, whether they are our teammates or Mojo creators. We advocate transparency and candid feedback. We want to become a B-corp within the next year, aiming for a more fair, inclusive, and sustainable world.\n\n---------------\n\n💰 Compensation & benefits\n\n・Competitive salaries based on upper-range market data\n💶The salary range for this role is 90k€-110k€ depending on the profile, we can adapt if the cost of living is higher than in Paris.\n・Stock Options aligned with US market practices\n・A minimum of 5 weeks of paid vacation for all, no matter the country of residency, and 10-week fully paid parental leave.\n・Health and disability insurance are covered at 100% by the company\n・Pension fund contribution is tailored locally to provide the best coverage\n\n---------------\n\n🍒 Perks\n\n🌳 Up to 3 days for your learning initiatives with a dedicated budget, and 🇬🇧 English lessons to perfect your language skills.\n🎉 Team events: we do team offsites twice a year, plus frequent team gatherings at our Paris HQ.\n\n---------------\n\n📍 Hiring process\n\nOur hiring process can be as short as two weeks, and here are the 3 main steps:\n・Screening interview (45min)\n・2-hour of Technical live test (3 different technical tests (around 30mins) run by different people in the team)\n・Final interview (1h30)\n\n---------------\n\n🤝 Diversity, Equity, Inclusion, and Belonging\n\nWe are committed to enabling everyone to feel included and valued at the workplace. We believe the company and its culture are strongest when composed of diverse experiences and backgrounds.\n\nWe welcome applications from people with disabilities. If you are an individual with a disability and require assistance, please let us know so we can talk about how we can best support you and make any adjustments that may be needed.\n\nAll qualified applicants will receive consideration for employment regardless of age, color, family, gender identity, marital status, national origin, physical or mental disability, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/technical-lead-android-at-mojo-video-206?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobmljYWwgTGVhZCBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiTW9qbyBWaWRlbyIsImFkZHJlc3NfY2l0eSI6IlBhcmlzLCBGcmFuY2UiLCJodGlkb2NpZCI6Im1NTmtlNzVmUHduVllCbzVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUm5KaGJtTmwifQ=="
        },
        {
            "title": "Senior Mobile Application Developer - Real-Time Geolocation Expert",
            "company_name": "Opus Recruitment Solutions",
            "location": "France",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=SUyOlzOq6yvrTe3pAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y2NsQrCMBRFce0nOL3BSWgjgotOgloQRLAuTiUJjzbymhfyUunX-W2m4HKHe-7lFN9F8WrQO45wY-MI4RgCOauTYw8n_CBxwAglPFBT-XQDQo1M_F-cp0xTxlc2IKij7SHXNXNHuDz0KQXZKyVCVScpf2xleVDs0fCk3mxkjlZ6HTGQTthud5upCr5br-5hlKy1cXRpQJ-gYRpnq4DzcInaW_wBasl1ucEAAAA&shmds=v1_AUFQtOMcUHHbe5T-_NlJv1rm4kGAXYlGhSLRT6SrjldT4LA9Tw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=SUyOlzOq6yvrTe3pAAAAAA%3D%3D",
            "extensions": [
                "10 hours ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 hours ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At Opus Recruitment Solutions, we're looking for a highly skilled Senior Mobile Application Developer to join our team.\nAbout the Role\n\nWe're seeking an experienced Android Developer with expertise in Kotlin, Compose, and RxJava. The ideal candidate will have a strong understanding of clean architecture principles, including Test-Driven Development (TDD). As this is a globally used dating application, fluency in French is required.\nJob Description\n\nYou'll be working on a renowned mobile application with over 126 million registered users worldwide. Your primary responsibilities will include:\n• Developing high-quality Android applications using Kotlin, Compose, and RxJava;\n• Collaborating with cross-functional teams to design and implement new features;\n• Maintaining and improving existing codebase to ensure scalability and performance;\n• Participating in code reviews and contributing to the improvement of the development process.\nWhat We Offer\n\nThis is an excellent opportunity for a seasoned developer looking to take their career to the next level. You'll be part of a dynamic team that values innovation, collaboration, and professional growth. Our company offers a competitive salary package, estimated at £65,000 - £80,000 per annum, commensurate with experience and qualifications.\nRequirements\n\nTo succeed in this role, you should have:\n• A minimum of 3 years of experience in Android app development;\n• Proficiency in Kotlin, Compose, and RxJava;\n• In-depth knowledge of clean architecture principles and TDD;\n• Fluency in French;\n• Excellent communication and problem-solving skills.\n\nIf you're a motivated and talented developer looking for a challenging opportunity, please submit your application. We look forward to hearing from you!",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://fr.bebee.com/job/bb1bded443de2671b0f002f210fe4de7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIEFwcGxpY2F0aW9uIERldmVsb3BlciAtIFJlYWwtVGltZSBHZW9sb2NhdGlvbiBFeHBlcnQiLCJjb21wYW55X25hbWUiOiJPcHVzIFJlY3J1aXRtZW50IFNvbHV0aW9ucyIsImFkZHJlc3NfY2l0eSI6IkZyYW5jZSIsImh0aWRvY2lkIjoiU1V5T2x6T3E2eXZyVGUzcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "DÉVELOPPEUR ANDROID : RX JAVA, PWA",
            "company_name": "Numerys",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=TMVpzrz_Rv3VAUnYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_-PqYeSycjncGebq4x8Q4BoapODo5xLk7-miYKUQFKHg5RjmqKMQEO6ooKvglZ-kUJyaWJScoZCfp-Cen5-ekyplnVFSUlBspa9fXJyjl15ckliSmayXnJ-rn5-XmpRfoZ-Vn1QMIuKLMxKLUgtyEktS441MDSr0CvLStQT9SnNTiyqLFTLzFNyKEvOSUwHBnlYZjwAAAA&shmds=v1_AUFQtOO9ebcq76w2H3eihqoNBBq9PceBkUhVbNTWfIACY7YuJg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=TMVpzrz_Rv3VAUnYAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850288e2c54f751b8e2639/images/6b00a34132705d8a27252541b9f53acd9ad9cddf051431e45266b764f2fee25e.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "This a Full Remote job, the offer is available from: France\n\nNumerys recrute pour le compte de l'un de ses clients un Développeur Android : RX JAVA, PWA.\n• Mobilité: Paris / Remote (Hybride)\n• Taux journalier: 325 - 365 / Jour (ƒ Exp)\n• Expérience: +2 ans\n• Date dé début: 12/09/2022\n• Permis de travail: France / Européen\n\n﻿﻿Descriptif de la mission:\n• ﻿Développement Android\n• Références professionnelles sur la Play Store\n• Développement d'applications natives complexes\n• Interactions entre site et app native (bridge javascript)\n• Compréhension / expertise PWA\n• Intégration de SDK externes et appels de webservices\n• Guidelines Ux /pratiques de développement poussé par Google\n• Utilisation de gestionnaires de sources GIT, intégration continue, Maven / Gradle\n• Tests unitaires JUnit , Mockito , Monkey test\n• Technologies usuelles de streaming video sur mobiles et tablettes\n• Maitrise de Framework de développement fonctionnel RxJava\n\nGood fit ? Postulez maintenant, on vous contact sous 48h !\n\nNumerys | +33 (0) 1 84 80 37 54 | talent@numerys.io\n\nThis offer from \"Numerys\" has been enriched by Jobgether.com and got a 72% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66826962276bee8ed36de08b-developpeur-android-rx-java-pwa?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEw4lWRUxPUFBFVVIgQU5EUk9JRCA6IFJYIEpBVkEsIFBXQSIsImNvbXBhbnlfbmFtZSI6Ik51bWVyeXMiLCJhZGRyZXNzX2NpdHkiOiJGcmFuY2UiLCJodGlkb2NpZCI6IlRNVnB6cnpfUnYzVkFVbllBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUm5KaGJtTmwifQ=="
        },
        {
            "title": "Dev Android – TAG Heuer Connected Watch (F/H)",
            "company_name": "The LVMH",
            "location": "Paris, France",
            "via": "Iitjobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=6LwgndYzNERWwk8VAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIMQrCQBAAQGzzA622VNGcCDZaBSUJomARtAyXy5I7ibvh9pSU_sEP-DZfojZTTPQeROkOH5BQ7dnV8Hm-oEgyyPGOHrZMhCZgDRcdjIVxqvIJzGHPFQhq_ysmyJibFkcbG0Ina6VE2riRoIMzseGbYsKKe3XlSv6UYrXHrtUBy-Vq0ccdNdNhYREO52MOjuCkvZMZpF6TwS-rYDYpowAAAA&shmds=v1_AUFQtONAtD6Or0iTXxjyT4mZSkhqmx-Cfe4h4_vmrxF5--GKNQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6LwgndYzNERWwk8VAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850288e2c54f751b8e2639/images/6b00a34132705d8a009487f0bada6d63c93fc80493b103b65ab3a6ddc285c621.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "PROFILEVous avez 5 ans d’expérience en tant qu’ingénieur mobile.Vous avez une solide expérience de développement en Kotlin et une très bonne compréhension du Framework Android.Vous aimez résoudre des problèmes et rendre simple les choses compliquées.Vous travaillez de manière organisée, et vous vous tenez informé des dernières nouveautés.Vous savez communiquer et travailler avec une équipe agile pluridisciplinaire.Niveau d’anglais Courant (documentation et tickets en anglais) ADDITIONAL INFORMATION ? La stack technique se veut proches des standards Android :100% KotlinArchitecture MVVM by GoogleDagger / HiltCoroutine / FlowRetrofit / Room / ProtobufNouvelles fonctionnalités développées en ComposeNos méthodes et notre philosophie de développement prônent la qualité, la bienveillance et le pragmatisme : Code review, pair programming, étude de faisabilité, proof of concept, CI, tests unitaires, partage régulier avec l’ensemble des devs Android.",
            "apply_options": [
                {
                    "title": "Iitjobs",
                    "link": "https://www.iitjobs.com/job/dev-android-tag-heuer-connected-watch-fh-paris-france-the-lvmh-9179?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXYgQW5kcm9pZCDigJMgVEFHIEhldWVyIENvbm5lY3RlZCBXYXRjaCAoRi9IKSIsImNvbXBhbnlfbmFtZSI6IlRoZSBMVk1IIiwiYWRkcmVzc19jaXR5IjoiUGFyaXMsIEZyYW5jZSIsImh0aWRvY2lkIjoiNkx3Z25kWXpORVJXd2s4VkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "Senior Android Engineer",
            "company_name": "Fabulous",
            "location": "Paris, France",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=GjN3VrJXhhiu5ObLAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7BzrdLJqI4KKTgxWcBD-gXNIjjcS7cJdCP8HPFt_wuu-qcy_iLApXHlXyCDdOmYkU9vCQAEaocQJhuIukQpvL1Fq1s_dmxSVr2HJ0UT5emIIs_i3B_g02oVIt2Gg4ng6Lq5y26x7DXGQ2yAxP1Gw76BU50g8IooBkiwAAAA&shmds=v1_AUFQtOMws4zJDsbFvyCmQ-zC6bFTgOlqov3GcgKA6i3GDTVOGw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=GjN3VrJXhhiu5ObLAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "The Fabulous Company is looking for a Senior Android Developer who wants to see their code used by millions of people around the world. This is an opportunity to work on a fast-growing product with a large user base that is frequently among the Top 10 most downloaded Health and Fitness apps that makes real change in people's lives. Joining Fabulous means you’ll be working in our senior level team of Android Developers and cooperating with an experienced CTO and an award-winning designer. We are a world-class Android team with a shared code between iOS and Android using J2OBJC. Kotlin is used in the day to day dev. Kotlin multiplatform is what we're going toward. We are a remote team with minimum meeting policy, trust, no daily standup, and remote since day 1 (founded 7 years ago).\n\nResponsibilities\n• Applying your technical knowledge across all stages of feature development\n• Delivering high quality, modular and testable code, including business logic being shared with iOS app\n• Taking part in preparing relevant project documentation\n• Creating user interfaces based on mock-ups prepared by our UI/UX designers, including some neat animations\n• Taking part in improving of our processes and standards\n\nRequirements\n• Deep Knowledge of Android Java and Kotlin. Kotlin is Fabulous’ language.\n• Great understanding of clean architecture, design patterns, and clean code.\n• Experience developing, releasing and maintaining native Android applications.\n• Capacity to work efficiently as part of a team; able to give and receive feedback.\n• Capacity to write a succinct email and to communicate effectively in English.\n\nNice to have:\n• Any experience with Jetpack Compose\n• Knowledge of MVI pattern\n• iOS app development experience\n• Java Script basics (used for tooling\n\nBenefits\n\nAbout Us\n\nAn award-winning health, wellness, & coaching company that creates apps which fall the top ten internationally. Our science-based approach sits squarely in the tech-for-good lane, helping people live their best lives. Everyone who has joined this company is committed to using evidence-based research to find the absolute best ways to change lives for the better.\n\nOur History\n\nThree co-founders created the Fabulous app: Sami, Amine, and Taylor. Growing up in Tunisia, Sami and Amine were only 16 when they met. With their early iteration, they reached out to Taylor, an award-winning designer in Malaysia. Their vision was welcomed into an incubation lab for startups at Duke University led by world-renowned Behavioral Economics Professor Dan Ariely. Our Chief Storyteller Jaz co-founded the Introductory Psychology program at Stanford University.\n\nOur Approach\n\nWe use a behavioral economics lens to help individuals find that 'on switch' inside them to achieve their fullest potential. What has emerged is a system that transforms tiny habits into profound long-term changes. A world in which people with ADHD thrive. A method for gratitude to reach through difficulty. A sanctuary to seek out your true purpose. A fountain of knowledge. A space for rest and self compassion.\n\nOur Mission\n\nHelp every individual discover the wonderful person inside themselves by creating: beautiful, evidence-based, life-changing products.\n\nOur Environment\n\nThe first thing that sets us apart is that we’re not a place at all. While we’re a remote company, it’s not unusual to feel you know your teammates better than those you’ve shared an office with in the past. Ours is a professionally nourishing environment that is flexible and fully remote. Team members enjoy in house challenges and Slack event and work across a variety of tools. Meetings are kept to a minimum and deep work is encouraged.\n\nOur Awards\n• Apple Best Apps of 2018\n• Editor’s app choice in more than 30 countries\n• Winner of Google’s Material Design Award\n• Best App Finalist in Google Play Awards\n• Consistently ranking in the top ten Health & Fitness apps\n• Backed by Facebook Startup Lab and Microsoft Venture\n\nOur Norms\n\nOwnership : Be the CEO of your tasks. No one is watching over your shoulder. Be the proof.\n\nOpen Communication: Constructive ideas are always flying across time zones.\n\nDeep Work: Disconnect. Find your flow. Become industrious. It’s about the work here.\n\nAlways Offer Context: Sharing rationale works wonders in asynchronous conversations.\n\nImpeccable Agreement: Promise, then follow through. Everyone relies on everyone.\n\nEgos are checked at the door. Those who join our workforce place themselves in service of our members.\n\nOur Values\n\n#collaboration #craftsmanship #feedback #respect #responsibility #simplicity #speed\n\nOur Future\n\nTo this day, over 30 million people have started their journey to better themselves with our apps. We are creating a generation of change-makers, with the same drive to help others, each in their own way.\n\nOur Invitation\n\nAt Fabulous, every team member is a sculptor in their own right. Together, we help millions of users step out of their block of stone and step into the fullest version of their life through behavioral science. Tell us what drives you; if you were to pick up your tools, what would you contribution look like?",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://fr.jooble.org/jdp/-5709484095333717098?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://fr.indeed.com/viewjob?jk=9084fcec028e1699&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/too-good-to-go/senior-android-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-android-engineer-aviv-group-5941707?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-engineer-at-happn-210?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Emplois Trabajo.org",
                    "link": "https://fr.trabajo.org/offre-2893-5d194df47aeaac199a0edcf6f60f2dff?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Okko Jobs",
                    "link": "https://okkojobs.com/senior-android-engineer-trainline-KDxhJKty?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Meritocracy",
                    "link": "https://meritocracy.is/de/blablacar/senior-android-engineer-60814?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkZhYnVsb3VzIiwiYWRkcmVzc19jaXR5IjoiUGFyaXMsIEZyYW5jZSIsImh0aWRvY2lkIjoiR2pOM1ZySlhoaGl1NU9iTEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "Lead developer mobile iOS & Android | Bateau connecté",
            "company_name": "Octopus IT",
            "location": "Paris, France",
            "via": "Octopus IT",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=5h9IQGIM6vj_r3hMAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQrCMBQGYFx7BF3-yUG0FcFFJx0URamge0nTRxtJ80JeKh28UM_hxdTlG79kGCXXC6kKFb3IsqeAlktjCSa_Y4qdqwKbCm_sVSTVQbNzpONnwAJnLiGkgm7ADkfm2tJ428ToZZNlIjatJapodKq5zdhRyX325FL-FNKoQN7-2mK1Xvapd_VskuvIvhOcHjAONxWMzHEIymn6Aovl09GsAAAA&shmds=v1_AUFQtOM7hM7lYzfXsgsnMYKArcDoM82aA0Oi5sbF216wgXF86A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5h9IQGIM6vj_r3hMAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850288e2c54f751b8e2639/images/6b00a34132705d8a5ffad94c5cb0e19f85f9b01931b4bf7564036646e73c4e59.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "La société\n\nCette startup est une pionnière dans les solutions de bateau connecté, que ce soit pour des bateaux privés (qui vont du modeste bateau de plaisance au yacht de plusieurs millions d'euros) ou bien pour des flottes entières d'entreprises maritimes. Elle propose également son CRM en marque blanche dans lequel toutes les données sont centralisées et dans lequel on retrouve notamment un dashboard d'analytics et de suivi en temps-réel. Plusieurs contrats d'envergure ont été récemment signés et ils souhaitent accélérer leur développement pour devenir leader sur ce marché très porteur.\nLe poste\n\nVous serez responsable du développement des nouvelles fonctionnalités sur l'appli mobile sortie récemment, en vous occupant à la fois des plateformes iOS et Android. Les fonctionnalités existantes incluent le suivi des itinéraires, diverses statistiques de navigation, le contrôle à distance (lumières, climatisation, sécurité...) et peut également être couplée à d'autres accessoires et capteurs sans fils (smart caméras, qualité de l'air, contrôle de l'électronique, etc.) Au delà du développement pur, vous participerez enfin à la réflexion des nombreuses fonctionnalités à venir.\nLa stack\n\nSwift, Objective-C, Kotlin, Java, Angular/Ionic, C#\n\nVotre profil\n\nVous avez de l'expérience à la fois sur iOS et Android\nVous êtes Lead ou développeur confirmé avec une appétence pour le Lead\nBonus : compétences en IoT\nAnglais courant requis\n\nSalaire & Avantages\n• 50-65K€ selon profil\n• Variable\n• Stock options\n• Mutuelle à 70%\n• Remote 1J (flexible)\nCe qu'on aime\n\nTravailler dans un secteur privilégié\nAvoir des parts dans une société à l'avenir radieux\nAvoir l'opportunité d'évoluer sur du Lead\nÊtre impliqué dans les phases de conception\n\nPowered by Octopus IT, cabinet spécialisé en Recrutement Tech (CDI et clients finaux uniquement) – Retrouvez toutes nos opportunités: www.octopusit.fr",
            "apply_options": [
                {
                    "title": "Octopus IT",
                    "link": "https://jobs.octopusit.fr/jobs/3738855-lead-developer-mobile-ios-android-bateau-connecte?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.fr/details/4618994511?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://fr.jooble.org/jdp/-5117041512324764953?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba",
                    "link": "https://www.jobijoba.com/fr/annonce/54/9c5edca665f7856c4e9f198fa8d04e60?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The BIG Jobsite",
                    "link": "https://fr.thebigjobsite.com/details/6E0CE94A752CA03BF9F8987853ABFDF3/lead-developer-mobile-ios---android---bateau-connect?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/fr-paris-lead-developer-mobile-ios-android-bateau-connect-octopus?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIGRldmVsb3BlciBtb2JpbGUgaU9TIFx1MDAyNiBBbmRyb2lkIHwgQmF0ZWF1IGNvbm5lY3TDqSIsImNvbXBhbnlfbmFtZSI6Ik9jdG9wdXMgSVQiLCJhZGRyZXNzX2NpdHkiOiJQYXJpcywgRnJhbmNlIiwiaHRpZG9jaWQiOiI1aDlJUUdJTTZ2al9yM2hNQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1JuSmhibU5sIn0="
        },
        {
            "title": "Développeur.se Android – Robotique IOT – Essonne /Nantes (H/F/D)",
            "company_name": "Kicklox - Plateforme de matching entre talents tech & porteurs de projets",
            "location": "Saint-Pierre-du-Perray, France",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=ef7Ydsa99O7LxQ0-AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x1Py0rEQBAEj_sJnvokupiMCF70tLCuL9CgexSWyaRNZnfSPU53JN48evcr_A7_xC9x4qUoqooqava5N3te_ny_YeAYcUilICyoSewb-P34gkeuWf3rgHDzsP5XLkWYCMHcW1IUOLw2K7M8ggJuuQZBm1wHTHDF3Abcv-hUo5wbIxLKVtSqd6Xj3jBhzaPZci0TbKSzCWOwipvTs5OxjNTOd3fe7QKPubyanBdOPUKD0Ft1nacWkDQhqA2ZCCjm7QOInDR_kSkZE28xW57gyXrSovKYEhbNUFSZ2PdjWCVLDv8A28aPYgsBAAA&shmds=v1_AUFQtOOizZAjEX1Cm2B9oR7MrUGBNEG-nXPgK2TYDnwawhTb1A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ef7Ydsa99O7LxQ0-AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850288e2c54f751b8e2639/images/6b00a34132705d8af7e6d7d28a724fa10704f04bc7aa74ffe0d87a7359a01798.gif",
            "extensions": [
                "27 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time"
            },
            "description": "L'offre\n\nSecteurs\n\nMachines & Industrie Lourde\n\nMissions à réaliser\n\n## Missions\n• En tant que Développeur.se Android au sein de notre\n\nÉquipe, Vos Missions Principales Seront :\n• Prendre en charge directement les besoins des clients\n\ninternes et externes.\n• Participer activement à la conception et l'architecture\n\nlogicielle.\n• Assurer le développement et la maintenance des nouvelles\n\nfonctionnalités.\n• Suivre les livraisons et accompagner les utilisateurs dans\n\nla mise en œuvre des solutions développées.\n\n## Missions annexes :\n• Contribuer à l'amélioration continue de la qualité de\n\nservice (QoS) du produit.\n• Participer à des ateliers pour retranscrire les besoins en\n\nsolutions techniques performantes.\n\nModalités\n• Date de démarrage : dès que possible\n• Candidats recherchés : 1\n• Expérience : 3+ ans\n• Type de contrat : CDI, Temps complet\n• Rémunération : 40000 € - 45000 € par an selon expérience\n• Localisation : 91280 Saint-Pierre-du-Perray, France\n\nLe profil recherché\n\nCompétences requises\n\nDéveloppeur mobile, React Native, Kotlin\n\nDescription Du Profil\n\n## Contexte du poste\n\nNotre société, basée dans l’Essonne et Nantes, est\n\nspécialiste dans la fourniture de solutions technologiques avancées dédiées à\n\nla mobilité et à la digitalisation des entreprises. Nous intervenons dans les\n\nsecteurs du transport, de la logistique, de l'industrie, de la santé, et du\n\nretail, proposant des services et produits variés tels que des matériaux\n\nd'impression, des caméras intelligentes, et des robots autonomes. Notre équipe,\n\nen pleine croissance, est au cœur de projets innovants et diversifiés, visant à\n\naméliorer la traçabilité, le flux des données, et l'efficience opérationnelle\n\nde nos clients.\n\nDans l'optique de renforcer notre département de\n\ndéveloppement, nous recherchons un.e developpeur.se mobile capable de\n\ncontribuer significativement à nos objectifs d'innovation et d'excellence.\n\n## Missions\n• En tant que Développeur.se Android au sein de notre\n\nÉquipe, Vos Missions Principales Seront :\n• Prendre en charge directement les besoins des clients\n\ninternes et externes.\n• Participer activement à la conception et l'architecture\n\nlogicielle.\n• Assurer le développement et la maintenance des nouvelles\n\nfonctionnalités.\n• Suivre les livraisons et accompagner les utilisateurs dans\n\nla mise en œuvre des solutions développées.\n\n## Missions annexes :\n• Contribuer à l'amélioration continue de la qualité de\n\nservice (QoS) du produit.\n• Participer à des ateliers pour retranscrire les besoins en\n\nsolutions techniques performantes.\n\n## Stack technique\n• À maîtriser\n• Kotlin\n• React Native\n• Environnement Technique Global :**\n• C#, Java, Python\n• SQL, MySQL, MongoDB\n• Frameworks et outils de développement mobile (Android SDK,\n\netc.)\n• API REST/JSON, interfaces de communication machine to\n\nmachine\n\n## Profil recherché\n• Que vous soyez autodidacte ou issu.e d’une école\n\nd’ingénieur, vous attestez de 3 ans d’expérience en développement mobile.\n• Vous avez une expérience significative en React Native,\n\nvous avez déjà touché au Kotlin et connaissez une de ces 3 technologies : C#,\n\nJava, Python\n• Vous avez une volonté de partage, vous êtes curieux.se,\n\nadaptable, ouvert.e d’esprit, polyvalent.e\n\n## Avantages\n• RTT\n• Voiture de fonction\n• Ordinateur portable\n• Formation interne à la prise de poste\n\n## Pourquoi nous rejoindre ?\n• Diversité des projets : Engagez-vous dans une variété de\n\nprojets innovants et enrichissants.\n• Croissance et challenges : Apportez votre pierre à\n\nl’édifice dans une entreprise en pleine croissance, face à des challenges\n\ntechnologiques stimulants.\n• Équipe et ambiance : Rejoignez une équipe soudée, dans un\n\nclimat propice à l’épanouissement professionnel et la montée en compétences.\n• Liberté et reconnaissance : Profitez d’un cadre de travail\n\noù votre avis compte et vos réussites sont valorisées.\n\nLangues\n\nFrançais\n\nCatégories\n\nDéveloppeur Mobile\n\nÀ propos de l'entreprise\n\nLes secteurs d'activité\n\nAutomobile, Aéronautique, Spatial, Défense & Sécurité, Ferroviaire, Télécommunications, Energie, Services & Systèmes d'Informations, Chimie / Pétrochimie, Digital & E-Commerce, Naval, Machines & Industrie Lourde, Pharmaceutique / Biotechnologie, Banque & Assurance, BTP\n\nPrésentation\n\nExpert en Assistance Technique, Recrutement et Formation dans les secteurs IT, Électronique & IoT. Nous propulsons votre carrière et accélérons vos projets IT & Industrie 4.0 avec des solutions sur mesure. Transformez vos ambitions en réalité avec notre accompagnement dédié.\n\nTaille de l'entreprise\n\nEntre 15 et 50 salariés",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://fr.linkedin.com/jobs/view/d%C3%A9veloppeur-se-android-%E2%80%93-robotique-iot-%E2%80%93-essonne-nantes-h-f-d-at-kicklox-plateforme-de-matching-entre-talents-tech-porteurs-de-projets-4102267571?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEw6l2ZWxvcHBldXIuc2UgQW5kcm9pZCDigJMgUm9ib3RpcXVlIElPVCDigJMgRXNzb25uZSAvTmFudGVzIChIL0YvRCkiLCJjb21wYW55X25hbWUiOiJLaWNrbG94IC0gUGxhdGVmb3JtZSBkZSBtYXRjaGluZyBlbnRyZSB0YWxlbnRzIHRlY2ggXHUwMDI2IHBvcnRldXJzIGRlIHByb2pldHMiLCJhZGRyZXNzX2NpdHkiOiJTYWludC1QaWVycmUtZHUtUGVycmF5LCBGcmFuY2UiLCJodGlkb2NpZCI6ImVmN1lkc2E5OU83THhRMC1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUm5KaGJtTmwifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUalUwVjNoaU0wdERVSEZpZUZOVE5qbFZiR0Y2TTFGSlpESXRVVU4zZGpjeVJURkNjbmxuZEd0S1dWQlhjbGxwUkRkM2JrdExkRTFvY3pocmJHb3dkWEF5VVZoUVQxTnlkR2RvVXpsdVpXZ3hZbXR5V2xFMFpWWXdiM2RLZUU5a1NVVlBSR2czU0d4bVF6WkxjbmhOYlVSeVpHSllWRXRwV1U5M1VXVnpjbDh3TkUxNmQxUTBhMnBQUlZrMVNGTjBiRVZ5V2psRVozVnpUREJUVGpWa00yRlpVMDltZEZOMU1IRm1ibDlEVnprNFN6VmtYMVoyUVhZM1oweG5XRlZ4YTFCTlRGQklMVk5UV1VjMVZYQm1jblZCT1RaNVEyc3pOMUZoYkRGeVdFZ3liMWN6TW5KMFlWOHpPVFYxUmtwRGFFVlVlWEZXYmxwRWNUUkVSRXhsUjBzeWIxSjFXbkZ2ZVZWblVqTkRWVnBsY1ZWYVRYbE1SM2N6UlZFU0YybEJTMFphWDBReFQzWkxkVFZPYjFCeFMySlZObEZyR2lKQlJsaHlSV053U0ZjNVMzQjBNRlpJTUdjdE9FRm5PR0pPVERoQ1UwVnlNSHBuIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=France&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUalUwVjNoaU0wdERVSEZpZUZOVE5qbFZiR0Y2TTFGSlpESXRVVU4zZGpjeVJURkNjbmxuZEd0S1dWQlhjbGxwUkRkM2JrdExkRTFvY3pocmJHb3dkWEF5VVZoUVQxTnlkR2RvVXpsdVpXZ3hZbXR5V2xFMFpWWXdiM2RLZUU5a1NVVlBSR2czU0d4bVF6WkxjbmhOYlVSeVpHSllWRXRwV1U5M1VXVnpjbDh3TkUxNmQxUTBhMnBQUlZrMVNGTjBiRVZ5V2psRVozVnpUREJUVGpWa00yRlpVMDltZEZOMU1IRm1ibDlEVnprNFN6VmtYMVoyUVhZM1oweG5XRlZ4YTFCTlRGQklMVk5UV1VjMVZYQm1jblZCT1RaNVEyc3pOMUZoYkRGeVdFZ3liMWN6TW5KMFlWOHpPVFYxUmtwRGFFVlVlWEZXYmxwRWNUUkVSRXhsUjBzeWIxSjFXbkZ2ZVZWblVqTkRWVnBsY1ZWYVRYbE1SM2N6UlZFU0YybEJTMFphWDBReFQzWkxkVFZPYjFCeFMySlZObEZyR2lKQlJsaHlSV053U0ZjNVMzQjBNRlpJTUdjdE9FRm5PR0pPVERoQ1UwVnlNSHBuIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}