{
    "search_metadata": {
        "id": "6785028c2397f16d8cfbfdab",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/f4481a2d53643615/6785028c2397f16d8cfbfdab.json",
        "created_at": "2025-01-13 12:09:48 UTC",
        "processed_at": "2025-01-13 12:09:48 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIHR2VybWFueQ&udm=8&fc=EuICCqICQUpHOUprTU1CdDJzcXhzOGxDdDBjUWoxZUx2SzdsRDZzbFRHY0pWbkN2OHYxck04NjY0TXhObGVOTGVKTXNueUw4MFNfR0kwdVJ3dV94QUt3QUdjVEQySEFydEZJS1JNN3NXdTF5R1VuWUFZZ1NXMTlTZmQ3TTNyQzVUVG5yTHlyMXVCTFpScTQ5ZXFJV0xnV0VHREZYNFhPeGJXZW5IcDk1ZF8tenlFRnhVczRvTHBya2t4eTBTaUxTZFo5UGR1WFk3dGQ2eGx4bkgweWlpT2owWWctZ1p4YnNnLTF3d2FpNHNXWkRBV0JFckhGWURBOUswc1FUcGZRTUhmZDFEelFTMk1hbDhwQmo0dHc5VVd6SE51d2lBMnJIUmJGYU9TaHcSF2l3S0ZaN2VhSnNqTHA4NFBqdjZUdVFVGiJBRlhyRWNwd0VkNTVXYUVERXI3dm8tRDJfMlNJcFdWTDlR&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/f4481a2d53643615/6785028c2397f16d8cfbfdab.html",
        "prettify_html_file": "https://serpapi.com/searches/f4481a2d53643615/6785028c2397f16d8cfbfdab.prettify",
        "total_time_taken": 1.44
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Germany",
        "location_used": "Germany",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUVTFDZERKemNYaHpPR3hEZERCalVXb3haVXgyU3pkc1JEWnpiRlJIWTBwV2JrTjJPSFl4Y2swNE5qWTBUWGhPYkdWT1RHVktUWE51ZVV3NE1GTmZSMGt3ZFZKM2RWOTRRVXQzUVVkalZFUXlTRUZ5ZEVaSlMxSk5OM05YZFRGNVIxVnVXVUZaWjFOWE1UbFRabVEzVFROeVF6VlVWRzV5VEhseU1YVkNURnBTY1RRNVpYRkpWMHhuVjBWSFJFWllORmhQZUdKWFpXNUljRGsxWkY4dGVubEZSbmhWY3pSdlRIQnlhMnQ0ZVRCVGFVeFRaRm81VUdSMVdGazNkR1EyZUd4NGJrZ3dlV2xwVDJvd1dXY3RaMXA0WW5ObkxURjNkMkZwTkhOWFdrUkJWMEpGY2toR1dVUkJPVXN3YzFGVWNHWlJUVWhtWkRGRWVsRlRNazFoYkRod1FtbzBkSGM1VlZkNlNFNTFkMmxCTW5KSVVtSkdZVTlUYUhjU0YybDNTMFphTjJWaFNuTnFUSEE0TkZCcWRqWlVkVkZWR2lKQlJsaHlSV053ZDBWa05UVlhZVVZFUlhJM2RtOHRSREpmTWxOSmNGZFdURGxSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Senior Android Developer (f/m/d)",
            "company_name": "applike group",
            "location": "Hamburg, Germany",
            "via": "Lever",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=_adjavB1ZhPUGqd1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQrCMBAAQLz2CZ7Wm4o2IoigJ0GoePUBsmnXNJpkw24q9Sn-VpzDVN9Jtb9R8ixwSp2w7-BMbwqcSWD-MNF0C1jDlS0oobQ9cIKG2QWaHvtSsh6MUQ2104LFt3XL0XAiy6N5stV_d-1RKAcsdN_uNmOdk1vOMOfgXwROeMjgE1ww2kHcChqSiOnzA79k3fKcAAAA&shmds=v1_AUFQtOMZIAKsAKzLoZsVygIXYmSx9dxZpJhWok4aWyKkVvtZGA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=_adjavB1ZhPUGqd1AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b4c51d9594526702775b1bedb294e802fc35bc2e663837ec85.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "adjoe is a leading mobile ad platform developing cutting-edge advertising and monetization solutions that take its app partners’ business to the next level. Part of the applike group ecosystem, adjoe is home to an advanced tech stack, powerful financial backing from Bertelsmann, and a highly motivated workforce to be reckoned with.\n\nMeet Your Team: Programmatic Supply\n\nIn a competitive adtech market, adjoe stands for greater transparency and fairness for app publishers and advertisers – and a more relevant and enjoyable experience for users.\n\nIt’s exactly for this reason that adjoe’s Programmatic team has built its own mediation platform WAVE. It’s not only driven by a backend application that decides which ad to show but also by our Android and iOS SDKs. These render the ads for the user and provide useful tracking events to the backend.\n\nThe WAVE SDK serves millions of in-app ads a day in different formats, and our backend system handles a few billion auctions in real-time every day to help game developers monetize their apps.\n\nWant to be a part of this industry-first adtech solution? Join our discussions, explore implementation, and put your problem-solving skills to the test in our cross-functional Programmatic team!\n\nOur mobile tech stack\n\nAndroid Studio, Kotlin, Java, Gradle, okHTTP, Wire, gRPC, Protobuf, XCode, Swift, Objective-C, Cocoapods, SPM, Unity, C#, React Native, JavaScript/TypeScript, GitLab CI, Maven, Sentry, Google Firebase.\n\nAnd we’re always open to new technologies & tools that will benefit the product.\n\nWhat You Will Do\n• You will develop the WAVE SDK by creating new features and innovative ad formats. The views you build will be seen by billions of mobile users all over the world every day.\n• You will be responsible for cross-platform mobile development by ensuring our SDKs’ compatibility with other development frameworks like Unity, React Native, and Flutter. Thanks to that, our product will be integrated into top mobile games and apps in the industry.\n• You will implement mechanisms to improve the technical stability, performance, and maintenance of WAVE SDK. Your goal is to make it as easy and smooth as possible for app developers to integrate and utilize adjoe’s technologies.\n• You will use your system design knowledge to come up with the optimal solutions compatible with different frameworks and our backend.\n• You will align with advertising industry standards & best practices to keep our product up to date.\n• You will contribute to our CI/CD pipelines to efficiently and effortlessly distribute our SDK to thousands of app developers.\n\nWho You Are\n• You have 3+ years of work experience as a mobile developer working with Kotlin.\n• You have hands-on experience with developing Android libraries and SDKs.\n• You keep up to date with trends in mobile development and are aware of UX & UI best practices.\n• You are open to relocating to Hamburg, Germany.\n• Plus: You have basic knowledge of C++ and working with the NDK.\n• Plus: You have knowledge of React Native (JavaScript), Unity (C#), Flutter (Dart), or similar cross-platform development frameworks.\n• Plus: You have iOS development experience as well.\n• Plus: You have experience with build/deployment tooling (such as Gradle, Maven, and GitLab CI).\n\nHeard of Our Perks?\n• Work-Life Package: 2 remote days per week, 30 vacation days, 3 weeks per year of remote work, flexible working hours, dog-friendly kick-ass office in the center of the city.\n• Relocation Package: Visa & legal support, relocation bonus, reimbursement of German Classes costs and more.\n• Happy Belly Package: Monthly company lunch, tons of free snacks and drinks, free breakfast & fresh delicious pastries every Monday\n• Physical & Mental Health Package: In-house gym with personal trainer, various classes like Yoga with expert teachers.\n• Activity Package: Regular team and company events, hackathons.\n• Education Package: Opportunities to boost your professional development with courses and trainings directly connected to your career goals\n• Wealth building: virtual stock options for all our regular employees\n\nSkip writing cover letters. Tell us about your most passionate personal project, your desired salary and your earliest possible start date. We are looking forward to your application!\n\nWe welcome applications from people who will contribute to the diversity of our company.",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/applike/d91d8fbb-13da-4df5-a1a0-78a164ecda63?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=4a8c71aebf7a664b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/android-developer-fmd/3282800?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/hamburg-senior-android-developer-129029527?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Arbeitnow",
                    "link": "https://www.arbeitnow.com/jobs/companies/applike/senior-android-developer-hamburg-345515?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JOIN",
                    "link": "https://join.com/companies/adjoe/13178461-senior-android-developer-f-m-d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/NEOGEN25/743999666655999-senior-venture-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-developer-at-applike-1164?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKGYvbS9kKSIsImNvbXBhbnlfbmFtZSI6ImFwcGxpa2UgZ3JvdXAiLCJhZGRyZXNzX2NpdHkiOiJIYW1idXJnLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJfYWRqYXZCMVpoUFVHcWQxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Lead Developer Mobile Apps (iOS / Android) for Digital Health - Consulting",
            "company_name": "EY",
            "location": "Cologne, Germany",
            "via": "EY Careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=2qJkl2D7PUZZ9Y0nAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ4BQRCA4Wg9gEI1JcKtSDRUghAhCpVK5u7G3sqY2ews4c08Hpo_-aq__Wm1cU9Yw4qexBopwUHLwASLGA164XgCBwupk4a6D1dNsAo-ZGTYEnJuYARLFXtwDuJ_2GkJRpiqBlRgo-qZuvMm52gz58y48JYxh6qo9O5UqNSXu2lp_1yswUSRMdNlMh2_iih-0FmfIcjvwuqFhrChdEd5fwGp2aPXuwAAAA&shmds=v1_AUFQtONIKLYqyyKzfqqXL84hC9cBaIi_fctWYqN30DyKhde72g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2qJkl2D7PUZZ9Y0nAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b455b653aae818df0968f635c6764ce2d3cc9455f3a6685a1e.gif",
            "extensions": [
                "12 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "12 days ago",
                "schedule_type": "Full-time"
            },
            "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\n\nYou will be part of EY’s EMEIA-based Digital Health Excellence Center (DHEC). Our mission is to improve health outcomes and patient experiences. As the DHEC, we bring our expert knowledge and delivery power to industry-leading healthcare providers in collaboration with the local firms.\n\nThe opportunity\n\nAs a senior developer, you will work alongside a team of international experts in technology, business and the healthcare industry. The end-to-end development and implementation of mobile apps is at the core of the DHEC, with you we want to further strengthen our technical expertise.\n\nYour key responsibilities\n\nAs a senior developer, you are responsible for the development and implementation of innovative mobile software solutions for our healthcare clients. In your role, you will collaborate with clinical teams, administrators, and other healthcare professionals to prioritize and address health-specific software needs.\n\nAs technical expert, you work together with the development team in the creation of customer journey and user stories, you coordinate with UI/UX designers, and you collaborate with the software architects to implement functionality that is suitable for specific client needs. Additionally, you will be responsible for near- and off-shore technical teams, vendors, and external partners to ensure our products are consistent and reliable, as well as provide training and support in business development.\n\nSkills and attributes for success\n• Strong written and verbal communication, presentation, client service and technical writing skills for both technical and business audiences.\n• Fluency in English and Proficiency in the local language of your country of residence is required.\n• Knowledge of additional languages will be appreciated.\n• Strong analytical, problem solving and critical thinking skills.\n• Ability to work under tight timelines for multiple project deliveries in parallel.\n• Ability/flexibility to travel.\n\nTo qualify for the role, you must have\n• Bachelor’s degree in informatics, Mathematics, (Software) Engineering or other related field with strong IT focus. Master's or further certification are advantageous.\n• Minimum of 2 years of working experience in a healthcare context and particular focus on implementing custom applications on mobile operating systems.\n• Deep understanding of development in iOS and Android using e.g. Swift, SwiftUI, Kotlin, and Jetpack Compose. Basic understanding of both operating systems is a prerequisite.\n• Expert knowledge of software architecture on all levels, i.e. network, infrastructure, security, persistence, application, and frontend.\n• Proven work experience in driving international development teams and managing different stakeholder groups, e.g. project managers, Scrum masters, product owners, business analysts, developers, and infrastructure and security architects.\n• Deep understanding of programming patterns (e.g. MVC, MVVM), tools, and frameworks for development (e.g. Declarative UI, Angular, Xamarin, React).\n\nIdeally, you’ll also have\n• A reliable network in the healthcare industry and a consulting track record.\n• A good overview of industry technology trends and emerging technologies, understand how they apply to our healthcare clients and can drive their adoption into our projects.\n• A solid understanding of health-specific interoperability formats, e.g. HL7/FHIR, SNOMED, OMOP, openEHR.\n• A good knowledge of system integration in medical system landscapes between software products of various clinical domains, e.g. Electronic Medical Records (EMR), Clinical Information Systems (CIS), Clinical Data Repositories (CDR), Laboratory Information Management Systems (LIMS), communication servers and interoperability platforms.\n\nWhat we look for\n\nWe are looking for an experienced Senior Developer with strong technical skills and a proven track record working in a healthcare context.\n\nWhat working at EY offers\n\nAs part of this role, you'll work in a highly integrated, global team with the opportunity and tools to grow, develop and drive your career forward. Here, you can combine global opportunity with flexible working. The EY benefits package goes above and beyond too, focusing on your physical, emotional, financial and social well-being. Your recruiter can talk to you about the benefits available in your country.\n\nHere’s a snapshot of what we offer:\n• Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next.\n• Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.\n• Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.\n• Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\n\nAbout EY\n\nIf you can confidently demonstrate that you meet the criteria above, please contact us as soon as possible.\n\nEY | Building a better working world\n\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\n\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\n\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\n\nDHEC_FY25",
            "apply_options": [
                {
                    "title": "EY Careers",
                    "link": "https://careers.ey.com/ey/job/Paris-Lead-Developer-Mobile-Apps-%28iOS-Android%29-for-Digital-Health-Consulting-75009/1138091301/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/lead-developer-mobile-apps-ios-android-for-digital-health-consulting-at-ey-4074568845?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talentify",
                    "link": "https://www.talentify.io/job/lead-developer-mobile-apps-ios-android-for-digital-health-consulting-koln-nw-de-ey-careers-1555147?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs In Köln",
                    "link": "https://koln.jobde.org/jobs/view/1882345.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIERldmVsb3BlciBNb2JpbGUgQXBwcyAoaU9TIC8gQW5kcm9pZCkgZm9yIERpZ2l0YWwgSGVhbHRoIC0gQ29uc3VsdGluZyIsImNvbXBhbnlfbmFtZSI6IkVZIiwiYWRkcmVzc19jaXR5IjoiQ29sb2duZSwgR2VybWFueSIsImh0aWRvY2lkIjoiMnFKa2wyRDdQVVpaOVkwbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Senior Android Developer, KMP - Point-of-Sale Tribe",
            "company_name": "SumUp",
            "location": "Berlin, Germany",
            "via": "SumUp",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=3T9-8aVUWJTURjdpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7BeJ0s7SNCC46KUKhIhSqc0naaxtJ78IlSv0ef1Rd3vCSzyIpayTLAkfqhG0HZ3yhY4-SwuVaQQYVW4oZ91mtHcJNrMHflmwgoJZ2BCYomAeHq8MYow97pUJw-RCijrbNW54UExqe1YNN-NOEUQt6pyM2291mzj0N62X9nO4eLMEJxVlKoUCZNL2_nNIEYqYAAAA&shmds=v1_AUFQtOOchJXqeCax0by6S7wSJMQMpNCa7XgLc-4YGtQ_4mTCHw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=3T9-8aVUWJTURjdpAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About the team\n\nSumUp’s Point-of-Sale (POS) solution empowers cafes, shops, bars, hair salons, and other businesses to operate efficiently and grow. It offers a wide range of features, including product catalogs, inventory management, business analytics, compliance support, and loyalty tools.\n\nOur POS solution integrates seamlessly into the SumUp SuperApp, which supports both our proprietary register hardware and mobile devices like tablets and phones.\n\nAs a Senior Android Developer, you’ll collaborate with a dynamic, cross-functional team of Product Managers, Product Designers, Engineering Managers, and fellow engineers.\n\nYou’ll contribute to the Item Catalog value stream - a core component serving the needs of almost all teams at SumUp.\n\nAbout the role\n\nWe’re evolving toward a Kotlin Multiplatform (KMP) strategy, enabling shared development across Android and iOS. In this role, you’ll learn, refine, and help implement this technology, shaping the future of our mobile apps.\n\nYou’re a developer who values user-centric design, precision, and seamless collaboration. You bring structure to communication and thrive in a cross-functional environment.\n\nThis role is on-site in Berlin, where face-to-face interactions spark innovation and teamwork.\n\nWhat you’ll do\n• Build new features for the item catalog within the SumUp SuperApp\n• Help improve the architecture of the application\n• Enhance and maintain our unified android app, distributed across 60+ countries, ensuring high-quality, scalable solutions\n• Shape the product’s evolution by identifying opportunities for improvement and contributing to daily decision-making\n• Write thorough documentation and implement robust testing for features before shipping\n• Collaborate closely with Designer, Product Manager and Android engineers to deliver a unified UX experience across platforms\n• Coach and mentor other engineers\n\nYou’ll thrive in this role if:\n• You have 5+ years experience in mobile engineering with Android/Kotlin.\n• You have 2+ years of experience working with Jetpack Compose.\n• You have a solid understanding of software design patterns (e.g., MVVM, MVP) and expertise in building modular, scalable app architectures.\n• You have good knowledge of reactive programming (Flow, Coroutines and Concurrency).\n• You have a strong grasp of testing best practices: knowing what to test, why, and how to write resilient tests.\n• You strive for clean code, and you are flexible to balance pragmatism and perfection.\n• You have a keen interest in multi-platform development using Kotlin Multiplatform.\n\nWhy you should join SumUp\n• The opportunity to work on large scale fintech products used by millions of small businesses around the world\n• A dedicated annual Learning & Development budget for attending conferences and/or advancing your career through further education\n• Enrollment onto our virtual stock ownership program - you will own a stake in SumUp’s future success\n• A corporate pension scheme\n• 28 days’ paid leave\n• You’ll attend global offsites and/or hackathons.\n• You'd enjoy other great benefits such as Urban Sports Club subsidy, Kita placement assistance, subsidized office lunches and other location-tailored benefits, Babbel language platform subscription and more!\n\nAbout SumUp\n\nBe empowered to do more that matters.\n\nAt SumUp, we're on a mission to empower small businesses across the globe by providing simple and affordable tools that allow them to thrive. Today, over 4 million businesses in 36 markets rely on SumUp as their financial partner to manage payments, finance and customer relationships.\n\nOur commitment to small businesses is reflected in our diverse team of over 3,000 SumUppers from over 90 nationalities, united by global collaboration and an innovative mindset. Our core values lay the foundation for who we are and what we stand for, shaping our work culture and driving our success. We foster inclusivity and a continuous learning culture, providing a safe space for personal and professional growth. Our differences make us unique and strong as we strive to create an environment where everyone belongs and feels supported, no matter how they identify.\n\nSumUp is proud to be an Equal Employment Opportunity employer, actively seeking and embracing diversity in our workforce. We don't make hiring or employment decisions based on race, colour, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age or any other basis protected by applicable laws or prohibited by company policy. Our commitment extends beyond recruitment to creating a safe and respectful workplace where harassment of any form is strictly prohibited.\n\nExplore career opportunities with us and join a team driven by collaboration, innovation, and a shared vision of creating a world where everyone can build a thriving business. Discover more about our vibrant and inclusive work culture and how we work on our careers website, and follow our journey on LinkedIn and Instagram.\n\nSumUp is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. SumUp does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age, or any other basis protected by applicable laws or prohibited by company policy. SumUp also strives for a healthy and safe workplace and strictly prohibits harassment of any kind.\n\nSumUp will not accept unsolicited resumes from any source other than directly from a candidate.",
            "apply_options": [
                {
                    "title": "SumUp",
                    "link": "https://www.sumup.com/careers/positions/berlin-germany/android/senior-android-developer-pointofsale-tribe/7423583002/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/embed/job_app?for=sumup&token=7423583002&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Welcome To The Jungle",
                    "link": "https://www.welcometothejungle.com/en/companies/sumup/jobs/senior-android-developer-point-of-sale-tribe_berlin_SUMUP_gw3a6XN?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/senior-android-developer-point-sale-tribe/2709259?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/senior-android-developer-kmp-point-of-sale-tribe-at-sumup-3932715711?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "B2venture Job Board",
                    "link": "https://jobs.b2venture.vc/companies/sumup-2/jobs/43923722-senior-android-developer-kmp-point-of-sale-tribe?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=75740118765183686&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Play",
                    "link": "https://startupplay.com/job/senior_android_developer_kmp__pointofsale_tribe_sumup_berlin_germany_5905642002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIsIEtNUCAtIFBvaW50LW9mLVNhbGUgVHJpYmUiLCJjb21wYW55X25hbWUiOiJTdW1VcCIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoiM1Q5LThhVlVXSlRVUmpkcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Android Developer - International Social Media App",
            "company_name": "Baldur Connect",
            "location": "Hamburg, Germany",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=8xzklfRmwC5BU81MAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWLQQrCMBAA8doneFo8ijYieNFTVagVPPmAskmXNJLuhiSV-icfab3MXGaK76JoKu6iuA6u9CYvgSJsoeFMkTE7YfTwFONmPahzCFUIc3AXDYkwmh6EoRaxnpanPueQjkql5Eub8vyb0sighEnLpF6i0x9t6jFS8Jip3R92UxnYrldn9N0Y4SLMZDI4hhsOeox2AzXFAfnzA5UL7AOvAAAA&shmds=v1_AUFQtONLI3PnJ0-aVFu3CVI7cHTs7gzIufLZResGYgY1N3e_7A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=8xzklfRmwC5BU81MAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b43b6f2ac464c54c72ccee0ca54b11549e215ed0a018128c3e.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Recruitment Consultant\n\ncareer@baldurconnect.com\n\n+49 89 262 002 60\n\nApply now\n\nBack to vacancies\n\nMy client is in an unending pursuit to build and integrate technology that will bring people together. Human connection is our most fundamental need and as such it is the catalyst for everything we do.\n\nDue to strong company growth, they are looking to hire an Android Developer. Your main mission is: fixing the current state of social media and bringing people all over the world together.\n\nThe Company You Could Be Joining\n• An international social media company with a global presence\n• Their platform focuses on two primary segments: connecting people and live video. Currently, their platforms send over 2.5 billion monthly user messages\n• Offices in locations such as Los Angeles, Berlin, London, Hamburg, and Amsterdam\n\nThe Role And Requirements\n\n(This is a general description since we are looking from Juniors to Seniors)\n• You call yourself an Android Developer\n• You ideally have knowledge and experience working with Android Studio, Git and Kotlin\n• A good user experience is just as important to you as good code quality\n• You have experience working in Agile teams\n• You are able to work independently, but at the same time you are a team player\n• You would like to continuously expand your knowledge and like to share it with your colleagues\n• You have good English skills and basic knowledge of German\n\nWhat is on offer?\n• Salary up to €75k Eur base/year\n• One day each month to work on your own projects / off-work time\n• Work on a product that matters and has a purpose\n• Private company pension scheme\n• Transport ticket\n• Remote working with ideally one day per week in our modern Hamburg office\n• Budget to spend on training courses\n• A safe and stable Job in a booming Industry\n\nReach Out At\n\nd.alzate@baldurconnect.com\n\n\" Baldur Connect is acting as an Employment Agency in relation to this vacancy. Baldur Connect is committed to being an equal opportunities employer, and encourages applications from candidates regardless of sex, race, disability, age, sexual orientation, gender reassignment, religion or belief, marital status, or pregnancy and maternity status. \"",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/android-developer-international-social-media-app-at-baldur-connect-4120581886?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs In Hamburg",
                    "link": "https://hamburg.jobde.org/jobs/view/1887511.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAtIEludGVybmF0aW9uYWwgU29jaWFsIE1lZGlhIEFwcCIsImNvbXBhbnlfbmFtZSI6IkJhbGR1ciBDb25uZWN0IiwiYWRkcmVzc19jaXR5IjoiSGFtYnVyZywgR2VybWFueSIsImh0aWRvY2lkIjoiOHh6a2xmUm13QzVCVTgxTUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Android Developer (m/f/d) - Create the Future of Connected Fitness in Königs Wusterhausen",
            "company_name": "AUGLETICS GmbH",
            "location": "Wildau, Germany",
            "via": "The Local Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=_4z5pCxtzfC6KnfjAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOMW4CMRAAlZYnpFq6BME5ipQGKnTAkZAuIErkOy9nI9_u4V0j8rF8IE_IhwLNlDMz-HsYnOfkEgcHC7xg5B4TPHXmaNwzTKBMaBVBPcIqa04IfISSibBRdLAKSigCgWDz-0OhFdhnUUzeZkG6CT64BkGbGg9MUDG3ER9nXrWXqTEisWhFrYamaLgzTFjz1Zy4ljsO4m3CPt4WDq9vL9eip3Y0nO-qz-X2vfyCqqvX9_Y-RGfzGCpMnaXvf7_ok3_WAAAA&shmds=v1_AUFQtONKxaUNakFZzBMmlPdG3bgaEzAmuIuy0PAxcKtM-p4I0A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=_4z5pCxtzfC6KnfjAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b4d028e91f63d13150e92c532ea11af826c1a7d5ea35be41c5.gif",
            "extensions": [
                "19 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "19 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Augletics GmbH is a leader in innovation for sports equipment. We are a young and growing team based in Königs Wusterhausen, and with the Augletics Eight, we have developed the perfect home fitness device: top design, versatile, efficient, and quiet. With the motto “This is Fitness Today,” we aim to revolutionize the fitness market in terms of efficiency. We have big plans—and your role is key to making them happen!\n\nIf you also have big plans, you’ll fit right in with us! To support our growth, we are continuously expanding our company. That’s why we are looking for you to join our development team as an Android Software Developer (m/f/d) in a full-time position.\n\nYour work will directly shape the user experience for our fitness enthusiasts and help us revolutionize the home fitness market. As part of our team, you’ll have the opportunity to grow both personally and professionally, with support for further training and certifications in software development.\n• Develop and optimize Android applications in Java and Kotlin using modern frameworks and tools like RESTful APIs, Git, and Gradle.\n• Collaborate closely with our hardware team to integrate new features.\n• Optional: Support in hardware-related programming (C++).\n• Contribute to the conceptualization of new product ideas and features.\n• Perform technical documentation and quality assurance.\n• You’ll have the chance to grow into leadership roles as we expand, but the focus will always be on developing your technical skills and making a difference in our team.\n• At least one year of experience in Android development using Java and Kotlin.\n• Optional: Experience with hardware-related programming in C++.\n• A keen interest in sports and an understanding of the needs of our fitness-focused users.\n• Strong command of English, with German being a plus.\n• You work independently, communicate effectively, and thrive in a team environment where innovation is key.\n• We value a collaborative atmosphere where innovation and creativity are encouraged, and every team member’s input is valued.\n• Full integration into an ambitious, dynamic team.\n• Creative freedom to realize your ideas in a collaborative and open-minded environment.\n• Exciting and innovative field of work in developing modern sports equipment.\n• At Augletics, you’ll have the opportunity to grow both personally and professionally, with support for further training and certifications.\n• A large part of your work will take place on-site in Königs Wusterhausen, but we offer flexibility when needed. If desired, you can receive a rowing machine for use in your home office to support your development work.",
            "apply_options": [
                {
                    "title": "The Local Jobs",
                    "link": "https://jobs.thelocal.com/jobs/android-developer-mfd-create-the-future-of-connected-fitness-in-k%C3%B6nigs-wusterhausen-in-wildau-brandenburg-de/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAobS9mL2QpIC0gQ3JlYXRlIHRoZSBGdXR1cmUgb2YgQ29ubmVjdGVkIEZpdG5lc3MgaW4gS8O2bmlncyBXdXN0ZXJoYXVzZW4iLCJjb21wYW55X25hbWUiOiJBVUdMRVRJQ1MgR21iSCIsImFkZHJlc3NfY2l0eSI6IldpbGRhdSwgR2VybWFueSIsImh0aWRvY2lkIjoiXzR6NXBDeHR6ZkM2S25makFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Senior Android HMI/Kotlin Developer - with experience in Java+Kotlin development in Android",
            "company_name": "Luxoft Germany",
            "location": "Berlin, Germany",
            "via": "Recruit.net",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=HR2clYXv8dU7y9HPAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zVOuw6CQBCMLZ9gtbYqnDGx0UpjgqJWfgA5YIUzxy65WxH_0w8SojaTzCMzE7xHgbsiGXawpcKxKeBwOaoTizUEe2zRcoMOQngaqQC7nhikHKG3E93q2S9afKM1kgzWvyyEhDPwqF1eARPEzKXF8aYSafxaKe9tVHrRYvIo51oxYcadunPmB0h9pR02Vgumy9Wiixoqp5Pzo-ObQIyu1vQa5nbo-hPzv_QBXti4VNcAAAA&shmds=v1_AUFQtONJ4RuF_AKn_hyofw7y7uCLLCBaM2GpCCy6-IUlHdDsSw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=HR2clYXv8dU7y9HPAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b42895283e900e4cd4faf15f3b3c8f11fa517bded2e21119dc.gif",
            "extensions": [
                "12 hours ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "12 hours ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Project description\n\nThis is a good opportunity to participate in the new in-vehicle infotainment (IVI) project for one of the biggest European car maker. This is a very fast growing project which require talented software developers who likes challenges and new cutting edge technologies. Our team is involved into development of one of the core functionality of IVI such as Tuner, Audio Management, Telephony, Multimedia, Text Messaging, Speech Dialog System, Projection technologies provided by Apple and Google. Applicant will have the possibility to gain experience in development or integrating of these functionalities. Candidate will be the part of the international team and have the opportunity to work with latest software technologies like Android Automotive OS.\n\nResponsibilities\n• Participate in requirement analysis.\n• Design, create, and maintain efficient, reusable, and reliable C++/Java code from scratch.\n• Implement performance and quality services.\n• Identify bottlenecks and bugs, and implement solutions to these problems.\n• Maintain code quality.\n\nSkills\n\nMust have\n• 5+ years of experience in Java & 3+ in Kotlin development on Android\n• Understanding of Android Application Framework\n• Excellent understanding of UI placement, layout & Wireframes.\n• Development experience with Android Services, AIDL & Binders.\n• Usage of Design Patterns on Android (MVP, MVVM)\n• Hands-on experience with Android Studio, SDK, Gradle & AVD\n• Experience writing Unit tests and Automated Tests using JUnit, Mockito, etc.\n\nNice to have\n• Experience with AOSP development and Android NDK.\n• Experience with creating System Applications and Home Screen applications.\n• Experience with framework components like Telephony, Dialer, Network, etc.\n• Development experience with System UI and Service Manager\n• Android Automotive experience and exposure\n\nLanguages:\n\nEnglish C1 - Fluent",
            "apply_options": [
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/android-hmi-kotlin-developer-experience-jobs/567D841A131101A7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBITUkvS290bGluIERldmVsb3BlciAtIHdpdGggZXhwZXJpZW5jZSBpbiBKYXZhK0tvdGxpbiBkZXZlbG9wbWVudCBpbiBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiTHV4b2Z0IEdlcm1hbnkiLCJhZGRyZXNzX2NpdHkiOiJCZXJsaW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6IkhSMmNsWVh2OGRVN3k5SFBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Android Developer (DE, HR, PL, PT, RO, RS)",
            "company_name": "Troido GmbH",
            "location": "Düsseldorf, Germany",
            "via": "Easyhire.me",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=FmpDbGydwmaSqDmHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNQQqCQBSAYdp6hFYP2lSYE0GbWgmGEkFh7mVGX2qM84Z5Q9iBukW7LpYuvn_7B59ZEMemdtTVkOALNVl0sExOIWR5CLfLqAghv47uK9jAmRQwSle1QAZSokbj_Nh6b_kgBLOOGvbSd1VUUS_IoKJBPEnxlJJb6dBq6bHc7bdDZE2zXhTTnSDtVQadgeT3ZUZdk3uEkKLrpXn_AdR2GSKoAAAA&shmds=v1_AUFQtONA8LR_6xAMnlsApg7N58gjm0jCx_e4shsYCm_GCi6KWA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=FmpDbGydwmaSqDmHAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for an experienced Java/Android Software Engineer to join our development team. If you enjoy working with other talented developers on creating a new way of communication this could be your next challenge. It’s an exciting, long term project that will challenge you as a developer and will result in work that you can be proud of. We’re seeking someone who writes beautiful Java/Android code, keeps end-user in mind, and loves learning new things.",
            "apply_options": [
                {
                    "title": "Easyhire.me",
                    "link": "https://interview.easyhire.me/job/details/5d1ca3f72741e7440e516bf9/apply?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoREUsIEhSLCBQTCwgUFQsIFJPLCBSUykiLCJjb21wYW55X25hbWUiOiJUcm9pZG8gR21iSCIsImFkZHJlc3NfY2l0eSI6IkTDvHNzZWxkb3JmLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJGbXBEYkd5ZHdtYVNxRG1IQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Mobile Android Engineer Position (f/m/x)",
            "company_name": "Yassir Gmbh",
            "location": "Berlin, Germany",
            "via": "Smart Recruiters Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=i6zQ1N0rB2pY3uuBAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7CQ5yo4o2IrjoIApSEARXp5K0Z3KS3JVchvozfqu6vOFVn0l1vImjiHDiPgv1cGFPjJjhLkqFhGH-NMmMC1jDVRwo2twF-H0j4iNOD6GUQffGqMbaa7GFurqTZITRyWhe4vRPq8FmHKIt2G53m7Ee2C9nD6tKGZrkAhDDGXMkXkGDOVl-fwGyGkZRoQAAAA&shmds=v1_AUFQtOMzkBV_XZ2XdLMiuZ4RXGo6xcnR4HM7UnJoJKC6zLafrA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=i6zQ1N0rB2pY3uuBAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785028c2397f16d8cfbfdab/images/a7d95ba38e13e0b41c34da7bed7adaf7f227c995f623c06bf4863d0ae447e45f.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Company Description\n\nAbout Yassir\n\nYassir is the leading super App for on-demand and payment services in the Maghreb region set to change the way daily services are provided. It currently operates in 26 cities across Algeria, Morocco, and Tunisia with recent expansions into France, Canada, and Sub-Saharan Africa. It is backed (+$43M in funding) by VCs from Silicon Valley, Europe, and other parts of the world including Y Combinator, which is the precursor of the likes of Airbnb, Stripe, Dropbox, and Doordash, among others.\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally. Helping usher the continent into a digital economy era.\n\nWe’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.\n\nJob Description\n\nABOUT THE ROLE\n\nWe are looking for a senior Android developer to join our tech hub in Berlin and support our growth and expansion. You will be part of the engineering team, working with a high-quality code base and the latest tools, where you will promote your skills to be an expert in complex frontend development in Android. Your primary focus will be the development of mobile applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure.\n\nQualifications\n\nAbout your role as Android Developer\n• Design and build mobile applications for Android.\n• Ensure the performance, quality, and responsiveness of applications\n• Collaborate with a team to define, design, and ship new features\n• Identify and correct bottlenecks and fix bugs\n• Help maintain code quality, organization, and automatization\n• Participate in brainstorming sessions and contribute ideas to our technology, algorithms and products.\n• Work with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n• Dive into difficult problems and successfully deliver results on schedule\n\nAbout your experience\n• Must have technical skills\n• A minimum of 2 years of experience\n• Language: Android, Kotlin\n• Familiarity with cloud message APIs and push notification\n• Web architecture: Rest and restful APIs, micro-services\n• Version control: GIT\n• Nice to have technical skills (Strongly advised)\n• Containers: Docker, kubernetes\n• Caching, Redis server\n• Scaling, Web load balancing\n• Experience in a rapidly growing company in the mobility, on-demand, or fintech space is a plus\n• BSc/MSc in Engineering, Computer Science or relevant field\n\nAdditional Information\n• 😎 You will be part of one of the first Algerian startups to go through the Y Combinator program and one of the fastest-growing tech companies in North Africa. We are current in +25 cities (Algeria, Tunisia, Morocco, Paris, Berlin, and launching West Africa)\n• 🤙🏽Have a lasting impact on our company's culture - you'll be one of the first staff in our Europe office\n• 🎉 At Yassir we celebrate everything. OKR´s party!\n• 🕟 Flexible working hours, because we care about your outcome and not output\n• 💻 24/7 Office\n• 📱 Mobile office - Office in all our sites 4 weeks at any location\n• 🚉 Subsidized public transit pass\n• 💬 Languages courses\n• 📚 Yassir's academy\n• 🚀 Perfect timing with renowned investors to build something great\n• 🎯 Outstanding mentors who will assist you in your growth\n• 💸 Attractive salary and you even get a stake in the company\n• 📈 Extremely steep learning curve with own responsibility and intensive guidance\n• 📣 Learn to be pragmatic and make the right and sustainable decisions\n• 👌🏽Very strong team cohesion with daily and weekly activities\n• 💯 Make a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans\n• 👍🏽 Attractive offer with a well-paying salary\n• ✈️ Relocation package and visa provision if you are moving to Berlin\n• 🤝 Buddy program\n• ⚖️ As a company, we are passionate for diversity and inclusion, 40% of our team are women leaders in the tech sector\n\nDo you want to become part of our first-class team? Then you absolutely have to send us your application. 🚀\n\nPS: And if you want to stand out in your application, just let us know in your cover letter why we should have in our team. 💡\n\nDiversity & Inclusion & Engagement:\n\nWe celebrate diversity and are committed to creating an inclusive environment for all employees, as we believe diverse teams are more successful in the long term. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, and we encourage all people equally to apply for jobs with us.",
            "apply_options": [
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/YassirGmbh/743999820690733-mobile-android-engineer-position-f-m-x-?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=90e94bfc949aca8b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Simplyhired.de",
                    "link": "https://www.simplyhired.de/job/z_VUzek4Jikjot9vbx3flSPMkSF9CKPA6YdUn_tvQSIYBCdmS-_IVg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobbörse Job.fish",
                    "link": "https://www.job.fish/stellenanzeige/sonstiges/yassir-gmbh/mobile-android-engineer-position-fmx/52947347?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQW5kcm9pZCBFbmdpbmVlciBQb3NpdGlvbiAoZi9tL3gpIiwiY29tcGFueV9uYW1lIjoiWWFzc2lyIEdtYmgiLCJhZGRyZXNzX2NpdHkiOiJCZXJsaW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6Imk2elExTjByQjJwWTN1dUJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Android Developer (Berlin) job at Resident Advisor",
            "company_name": "Arbeitnow",
            "location": "Berlin, Germany",
            "via": "Salary.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=m3_G_5QJFd1VbZVlAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yWOMQrCQBAAsc0TxGJLFU1EsNEqIgQt_YBccktyctk9dpcYP-Q7jdhMMzBM9pll15K8cPBwwQEjJxRYnlFioBU8uQZncEcNHsmg9ENQFtjCbTKKTpoOmKBibiPOT51Z0mNRqMa8VXMWmrzhvmDCmsdiyukPD-2cYIrO8LE_7MY8UbtelFJjMOIXBIL_wQYqlN7R-wt9czRgqQAAAA&shmds=v1_AUFQtOPSmZ9jd1w8QwqtSPDm5TcLXferL68AcOdVWt4wXZpolg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=m3_G_5QJFd1VbZVlAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Founded in 2001, Resident Advisor (RA) is one of the world's longest-running music media brands and a cornerstone of the dance, electronic and DJ ecosystem. The site's audience of over 6 million monthly users is drawn in by a combination of news, editorial, club listings and ticketing, RA-branded events at venues and festivals worldwide, original films and a weekly mix series that has run for 18 years.\n\nPurpose of the role:\n\nRA’s first app is for customers to browse events and purchase tickets, known as “RA Guide”, which is available on iOS and Android. An “RA Ticket Scanner” app for promoters to scan tickets and manage their events is available for iOS only. This position is for working on the “RA Guide” Android app.\n\nKey responsibilities:\n• Developing the “RA Guide” Android app, used by thousands of users every single day\n• Implementing new features and improving existing features according to the product roadmap\n• Working to implement designs to improve the look and feel of the app\n• Integrating with new APIs and services\n• Working with web development and product teams to shape new features\n• Keeping up to date with technologies and frameworks\n• Monitoring bugs and crashes and releasing updates to fix them\n\nWe’re looking for:\n• Someone who wants to learn new things and can self-direct their learning\n• Commercial or personal experience releasing highly used apps to the Google Play store\n• Experience working across various parts of app development from visual elements to integrating with device hardware or external systems\n• Experience in Kotlin codebases and familiarity with language best practices\n• Experience creating testable, maintainable, modular code\n• Experience working in an agile environment with embedded product managers\n• Experience with the following concepts / technologies is a plus: Jetpack Compose, GraphQL, Reactive programming, A/B testing, phased rollout\n\nWhat we offer you:\n• Generous annual leave policies, including a company-wide closure period at year-end, aimed at promoting work-life balance.\n• Flexibility in working arrangements, offering hybrid or remote work options based on role requirements and location.\n• Matching pension schemes and/or 401k.\n• Comprehensive staff wellbeing initiatives, featuring regular activities and workplace programmes to support mental and physical health. This includes provisions such as Mental Health Days, subsidized therapy, discounted Classpass memberships, and custom-fitted earplugs.\n• Company-led social events, team lunches, and discounts on RA merch.\n• Paid annual volunteering allowance, encouraging contributions to community projects and charities you care about.\n• Regular company-wide Q&A’s with senior leadership, along with ongoing virtual educational training sessions for all staff.\n• A transparent internal company culture committed to diversity, equity, and inclusion (see: https://ra.co/about/diversity).\n• Active involvement in community projects within the electronic music community (see: https://ra.co/about/community).\n\nMore about RA:\n\nAs an independent company run by devoted dance music enthusiasts, our mission is to bring together the world's electronic music communities. Our Global Contributor Network (GCN) and international teams help us establish connections with hyper-niche local scenes.\n\nWe became B-Corp certified earlier this year, which counts us among businesses leading a global movement for an inclusive, equitable, and regenerative economy; and part of a community that meets high social and environmental impact standards.\n\nWe especially welcome applicants from diverse backgrounds, abilities, ethnicities, experiences, gender identities, and sexual orientations. We aim for our team to reflect the communities we engage with. We ensure everyone is valued and respected by actively promoting equality, diversity, and inclusion in our workplace.\n\nOur values:\n• Electronic music is art.\n• We celebrate the progressive values that underpin electronic music.\n• We advocate for a more inclusive and equitable electronic music community.\n• We honour the past, present and future of electronic music.\n• We use innovation to empower the community.\n• We choose honesty over gain and purpose over profit.\n• We're always front left.\n\nThis role is a full time and permanent position and the expected salary is €55,000 - €75,000 per annum. If you have questions about the role, please contact [email protected].\n\nThis listing will be open for a minimum of three weeks from 7th November. Please be sure to add [email protected] to your contacts and check your junk/spam folder for emails from us.",
            "apply_options": [
                {
                    "title": "Salary.com",
                    "link": "https://www.salary.com/de-job/arbeitnow/android-developer-berlin-job-at-resident-advisor/j202411250705198879853?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Peerlist",
                    "link": "https://peerlist.io/company/framen/careers/android-developer-kotlin-fmd/jobh7bjdgddjdaarm39mnl97lgm7mo?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoQmVybGluKSBqb2IgYXQgUmVzaWRlbnQgQWR2aXNvciIsImNvbXBhbnlfbmFtZSI6IkFyYmVpdG5vdyIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoibTNfR181UUpGZDFWYlpWbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRzlZWnpWVU9HRmFhRU4yVEZrdGFUaHFSVTFxTFdaa2FWWXlXSEp1ZW5OSldIZHNZVVJNVGtGelVVaGxOVm90VFVacFdWVklaVTB5TUhsU1ZFUXpPRzB4TkhSZmJXRlRTR3d5WlRGUFJsSk1SVXhwVUZCak1WRkpieTFrYWxsTFQzbzVTekZ0WDBWclpYQmhTbVJpTFZSUVMzQk5NMm80U214bGRsbHVTMmQ0ZEZsdmEwOWxObWR2U1ZoaWNHSmFORFpFYkVzeWNraHpNa2xmTW1GSmN6VlljMDFEUW5GeVlWZzBaRGRoVlZGcGVFMVlRVGhDVmpVd1UyTmFTWGN4WWt0MVJ6bHVUV3BSWkhWS1QwdGxlbGx1Tlc0d1pFSllSRWRHWlY4M2FHVllNVWRuYTNsblZWWnVjRGhrY0VwYVRqRnZOR1pVYUZFM1lYUkRNR3hhWW0xVFMwYzBSQklYYWxGTFJsbzJTR2RFTldsNmNIUlJVRFZQYmpSMVFUQWFJa0ZHV0hKRlkzRldkRFJSTmpaQ1owNU5hUzE2YWpOcGJHOW5SaTFNZVdoaGRsRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Germany&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRzlZWnpWVU9HRmFhRU4yVEZrdGFUaHFSVTFxTFdaa2FWWXlXSEp1ZW5OSldIZHNZVVJNVGtGelVVaGxOVm90VFVacFdWVklaVTB5TUhsU1ZFUXpPRzB4TkhSZmJXRlRTR3d5WlRGUFJsSk1SVXhwVUZCak1WRkpieTFrYWxsTFQzbzVTekZ0WDBWclpYQmhTbVJpTFZSUVMzQk5NMm80U214bGRsbHVTMmQ0ZEZsdmEwOWxObWR2U1ZoaWNHSmFORFpFYkVzeWNraHpNa2xmTW1GSmN6VlljMDFEUW5GeVlWZzBaRGRoVlZGcGVFMVlRVGhDVmpVd1UyTmFTWGN4WWt0MVJ6bHVUV3BSWkhWS1QwdGxlbGx1Tlc0d1pFSllSRWRHWlY4M2FHVllNVWRuYTNsblZWWnVjRGhrY0VwYVRqRnZOR1pVYUZFM1lYUkRNR3hhWW0xVFMwYzBSQklYYWxGTFJsbzJTR2RFTldsNmNIUlJVRFZQYmpSMVFUQWFJa0ZHV0hKRlkzRldkRFJSTmpaQ1owNU5hUzE2YWpOcGJHOW5SaTFNZVdoaGRsRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}