{
    "search_metadata": {
        "id": "678502a4c80545def172971c",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/29fff69e0e5b1258/678502a4c80545def172971c.json",
        "created_at": "2025-01-13 12:10:12 UTC",
        "processed_at": "2025-01-13 12:10:12 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIHSHVuZ2FyeQ&udm=8&fc=EuICCqICQUpHOUprUEVhN2RHQ1k5UURRZFY5RjhZRkNvTy1IM05VX25tV1N2LXlXYTdqZGZRNGZUN3ZXY09ZaGJJeGNaYTZ1WG82ekVSZjdVeDYwZjhPZmR3UmlweHpQNXJvbjhOX3lJTUdnUXBHRVM2YTZFUGRjR2tLTFFBbERyU3lLUlFIcWdkS091QnMtNVNCZkx4TjFURzhZb2l5eUJ2NlNra3IzVVFYc2dsUmFIU0Zaakg4ZFFqWExyOXhzb1JHcjg0cGhMeXRkQUpNX0VPQkxFbjRxSklOSkdhTUdxMndhTUpnQmpJOTVLenpIeWZXWmQzbC1HeXJURW9WVmUtOHRtZWNNRDJoSGtmVXBEMGlfZ1RSbWE4dVYxd245TUZDUVY4REESF293S0ZaOTZxTWNyZmtQSVB4T2Z0Z0FzGiJBRlhyRWNyZERyUVpVR2twemlqTjhnY0phVlVOcjBOTXlR&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/29fff69e0e5b1258/678502a4c80545def172971c.html",
        "prettify_html_file": "https://serpapi.com/searches/29fff69e0e5b1258/678502a4c80545def172971c.prettify",
        "total_time_taken": 1.42
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Hungary",
        "location_used": "Hungary",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRVZoTjJSSFExazVVVVJSWkZZNVJqaFpSa052VHkxSU0wNVZYMjV0VjFOMkxYbFhZVGRxWkdaUk5HWlVOM1pYWTA5WmFHSkplR05hWVRaMVdHODJla1ZTWmpkVmVEWXdaamhQWm1SM1VtbHdlSHBRTlhKdmJqaE9YM2xKVFVkblVYQkhSVk0yWVRaRlVHUmpSMnRMVEZGQmJFUnlVM2xMVWxGSWNXZGtTMDkxUW5NdE5WTkNaa3g0VGpGVVJ6aFpiMmw1ZVVKMk5sTnJhM0l6VlZGWWMyZHNVbUZJVTBaYWFrZzRaRkZxV0V4eU9YaHpiMUpIY2pnMGNHaE1lWFJrUVVwTlgwVlBRa3hGYmpSeFNrbE9Ta2RoVFVkeE1uZGhUVXBuUW1wSk9UVkxlbnBJZVdaWFdtUXpiQzFIZVhKVVJXOVdWbVV0T0hSdFpXTk5SREpvU0d0bVZYQkVNR2xmWjFSU2JXRTRkVll4ZDI0NVRVWkRVVlk0UkVFU0YyOTNTMFphT1RaeFRXTnlabXRRU1ZCNFQyWjBaMEZ6R2lKQlJsaHlSV055WkVSeVVWcFZSMnR3ZW1scVRqaG5ZMHBoVmxWT2NqQk9UWGxSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Sr. Android Engineer",
            "company_name": "ITExpert",
            "location": "Hungary",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=hAChqIc0FTTsf4B5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEPQ8CIQwA0P1WN6fOGsGYuOjkcPFj1f0CXAMYbEmLCU7-deMb3vAd1ncxcKJZOM8wUsyEKLCBG3tQdBISMMGZORZcHlNrVQ_WqhYTtbmWgwn8skzoudsne_03aXKCtbiG026_7aZSXC2uj7FXlAaZ4PKm6OTzA-2xtkaBAAAA&shmds=v1_AUFQtOP-J8IkLvZWJGXfzMWeGeHbbZHHVAssLL9lHlWfny4rlQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=hAChqIc0FTTsf4B5AAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Fingerprint empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).\n\nWe have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman , Apollo.io, MinIO , Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar &Gradle ).\n\nWho We Are Looking For: We are looking for a Senior Android Engineer with a solid background in Information Security. The ideal candidate will have experience building Android applications or libraries from scratch and will be skilled in security frameworks, cryptography, and network protocols. The role requires strong expertise in Kotlin, and familiarity with Jetpack Compose is preferred.\n\nKey Responsibilities:\n• Design, develop, and optimize native Android applications and libraries, focusing on security, scalability, and performance.\n• Collaborate with cross-functional teams to implement security protocols and ensure that applications align with best security practices.\n• Build developer tools that enhance productivity and streamline the development process.\n• Contribute to the maintenance and advancement of security frameworks for mobile applications.\n• Provide mentorship to junior team members and contribute to their technical development.\n\nRequirements:\n• Education: Degree in Computer Science, Information Security, or equivalent experience.\n• Experience:\n• 5+ years as a Senior Android Engineer (prior experience in a Senior Android role is required).\n• Strong Information Security background, with practical experience in:\n• Network protocols and secure coding practices\n• Cryptography and security framework development\n• Proven experience in building Android applications from the ground up, with expertise in Kotlin and vanilla Android SDKs. Experience with Jetpack Compose is preferred.\n• Experience with Android NDK is a plus.\n• Contributions to Open Source projects on GitHub are a bonus.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nDue to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location .\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.\n\nIf you are applying as a resident of California, please read our CCPA notice here\n\nIf you are applying as a resident of the EU, please read our GDPR notice here",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://hu.jooble.org/jdp/-1677337641120300291?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IklURXhwZXJ0IiwiYWRkcmVzc19jaXR5IjoiSHVuZ2FyeSIsImh0aWRvY2lkIjoiaEFDaHFJYzBGVFRzZjRCNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTSFZ1WjJGeWVRIn0="
        },
        {
            "title": "Principal Developer - Cross Platform Mobile & Desktop",
            "company_name": "ABBYY",
            "location": "Hungary",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Ns2QXMqtFhwer40qAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVw7OTvd5CDYiOCik1VQRKFrp5KEM42muXAXpT6M72pd_unjL76T4lqzj9YnHeCIbwyUkGEJByYRqIPOd-IebmR8QJiPRp6Z0iguZEBQs-2AIpyIXMDZrss5yVYpkVA6yTp7W1rqFUU0NKgHGfmnlU4zpnGP7XqzGsoU3WK6r6qmAR_h_IpO8-cHp54cyqAAAAA&shmds=v1_AUFQtOP8XR-JTMvTHtiUEouJsnOcZR3xCRPkj8vHHQK5Chd7KA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Ns2QXMqtFhwer40qAAAAAA%3D%3D",
            "extensions": [
                "24 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "24 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join ABBYY and be part of a team that celebrates your unique work style. With flexible work options, a supportive team, and rewards that reflect your value, you can focus on what matters most – driving your growth, while fuelling ours.\n\nOur commitment to respect, transparency, and simplicity means you can trust us to always choose to do the right thing.\n\nAs a trusted partner for intelligent automation, we solve highly complex problems for our enterprise customers and put their information to work to transform the way they do business. Innovation and excellence run through our veins, and you will work with experts who are creating market-leading technologies, using Machine Learning and Artificial Intelligence, and an advanced and sophisticated tech stack.\n\nWe are looking for a passionate and skilled Software Engineer who thrives in a hands-on technical role with a focus on owning the quality of the code and systems they develop. The ideal candidate will be responsible for driving the end-to-end delivery of features and systems, ensuring high standards of quality, performance, and maintainability throughout the development lifecycle. If you are committed to shipping reliable and scalable solutions, and enjoy solving complex problems, this is the role for you.\n\nResponsibilities:\n• End-to-End Development: Own the design, development, testing, deployment, and support of features and services from concept to delivery.\n• Quality Ownership: Ensure high code quality, performance, and maintainability by following best practices and conducting thorough code reviews, automated testing, and performance monitoring.\n• Collaboration: Work closely with cross-functional teams, including product managers, designers, and fellow engineers, to define and deliver features that meet both business and technical objectives.\n• Continuous Improvement: Proactively identify areas for improvement within the codebase, infrastructure, and development process. Drive solutions that increase team efficiency and code quality.\n• System Reliability: Monitor the health and performance of services and ensure timely resolution of issues and bugs.\n• Technical Innovation: Stay current with new technologies and trends to ensure the systems you build are modern, scalable, and aligned with industry best practices.\n\nRequired Qualifications:\n• Cross-Platform Development Frameworks: Proficiency with tools like Flutter, React Native, and Ionic to build performant mobile and desktop applications.\n• Web Technologies: Strong knowledge of JavaScript, HTML5, CSS3, and modern front-end frameworks (e.g., React or Vue.js) for building cross-platform user interfaces.\n• Mobile Development: Experience with iOS (Swift/Objective-C) and Android (Java/Kotlin) native development for deep platform integrations.\n• Desktop Development: Familiarity with Electron, Tauri, or other tools for building cross-platform desktop applications.\n• APIs and Backend Integration: Experience with REST and GraphQL APIs, or other backend services to sync and store data.\n• Responsive and Adaptive Design: Ability to create UIs that scale across different screen sizes and resolutions, including mobile, tablet, and desktop.\n• Cross-Platform UI/UX Standards: Understanding of Material Design and iOS Human Interface Guidelines to build consistent, intuitive, and platform-appropriate user experiences.\n• Testing and Debugging: Proficiency with testing frameworks like Jest, Mocha, or Flutter Test and familiarity with Device Emulators and Browser DevTools for debugging.\n• Performance Optimization: Skills in optimizing for performance across different devices and platforms, including memory management and rendering optimization.\n• Version Control: Experience with Git and collaboration platforms like GitHub or GitLab for code management and version control.\n• Continuous Integration and Deployment (CI/CD): Knowledge of tools like GitHub Actions, Bitrise, or Fastlane for automating builds, testing, and deployment.\n• App Store and Play Store Publishing: Familiarity with the publishing process for the Apple App Store and Google Play Store, including app review guidelines and release management.\n\nDesired Qualifications:\n• Ownership Mindset: Passion for taking full ownership of features and ensuring their quality from concept through to production.\n• Performance and Optimization: Experience with profiling applications, identifying bottlenecks, and optimizing performance for scale.\n• Collaboration Skills: Comfortable working in a collaborative, Agile environment, with an emphasis on communication and team success.\n\nSalary Range:\n• The anticipated base salary range for this position is between $190,000 and $215,000. Base salary ranges may vary by geographic location and relevant experience, education, certifications, and seniority as compared to others doing substantially similar work. There is no guarantee an offer will be at the top of the posted range based on the salary analysis.\n\nHere are some of our local benefits:\n• Three week's paid time off on top of 12 paid holidays, floating holidays, and holiday allowance increase based on tenure\n• Gym membership subsidy\n• Medical and dental insurance\n• Pet insurance\n• Employee Assistance Program\n• College Savings Plan\n• Travel assistance\n• 401(k) with up to 4% employer match\n\nAt ABBYY you will:\n\nLove how you work\n• We provide remote and hybrid working options to fit all lifestyles.\n• We use flexible hours across most of our teams to allow you to find your own definition of balance.\n• Encouraging a culture of giving, we provide two paid volunteering days off every year so you can take time to contribute to the causes you care about.\n• To ensure your family is cared for, we offer paid parental leave in all our locations.\n\nLove whom you work with\n• We are a global team of 800+ colleagues, spread across 15 countries on four continents.\n• With 30+ nationalities and ages ranging from 21 to 80, our workforce reflects the world.\n• Innovation and excellence run through our veins.\n• Our teams gather the expertise which has garnered ABBYY more than 140 technology patents.\n• We are guided by the values of respect, transparency, and simplicity. \"Team Environment\" is in the top three highest-scoring drivers of engagement across all of our departments.\n\nLove what you work on\n• We are a company with more than 30 years of experience in the technology market.\n• Over 10,000 customers trust ABBYY, including many Fortune 500 ones, with names such as DHL, Johnson & Johnson, FDA, DMV, PwC, KeyBank, Spotify, and H&R BLOCK in our client portfolio.\n• ABBYY has modernized the way companies leverage their data in documents by creating the first low-code/no-code Intelligent Document Processing platform.\n• Our Machine Learning, Natural Language Processing, Computer Vision Technologies, and a Marketplace built with AI, can transform any document in any process.\n• Top Analyst firms recognize ABBYY's market leadership, including Gartner, Everest PEAK Matrix ® Assessment, ISG Intelligent Automation Lens, and NelsonHall, amongst others.\n\nABBYY is an Equal Employment Opportunity employer that values the strength that diversity brings to the workplace. To learn more about our commitment to Diversity and Inclusion, check out the careers section on our website.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://hu.indeed.com/viewjob?jk=ce8563c97b2f2b92&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgRGV2ZWxvcGVyIC0gQ3Jvc3MgUGxhdGZvcm0gTW9iaWxlIFx1MDAyNiBEZXNrdG9wIiwiY29tcGFueV9uYW1lIjoiQUJCWVkiLCJhZGRyZXNzX2NpdHkiOiJIdW5nYXJ5IiwiaHRpZG9jaWQiOiJOczJRWE1xdEZod2VyNDBxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNIVnVaMkZ5ZVEifQ=="
        },
        {
            "title": "Senior Android Developer (REF3358Q)",
            "company_name": "Deutsche Telekom IT Solutions",
            "location": "Pécs, Hungary",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=_b4-k7Mj5rGkIL1eAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXESw6CMBAA0LjlCK5mqUapkZAYXJngd6XCnpQygWrpkE4xeCS9hhczvsULPqMgydBqcrC1lSNdQYpPNNShg8ltt4-ieH2dwgLOVAKjdKoBsnAgqg2ON433HSdCMJuwZi-9VqGiVpDFkgZxp5L_FdxIh52RHotVvBzCztYzkWLvWTUIORp8UAunHDIyvddkGbSFy_eteA7H3tbSvX5PN8gBrQAAAA&shmds=v1_AUFQtOMhZKKFVtu_sWSNqHVceX1bYVsOavmNdMVqjQfwh8Eyeg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=_b4-k7Mj5rGkIL1eAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad65d87c8fb85838587ef8b3ce478ebc31b69b623464b185c9.gif",
            "extensions": [
                "10 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time"
            },
            "description": "A Deutsche Telekom IT Solutions (korábban IT Services Hungary, ITSH) Magyarország legnagyobb ICT-munkaadója, a Deutsche Telekom Csoport tagja. A 2006-ban alakult, több mint 5000 fős cég az informatikai és telekommunikációs szolgáltatások széles körét nyújtja. A vállalat 2019-ben elnyerte a Nemzeti Befektetési Ügynökség (HIPA) legjobb oktatási együttműködésért járó díját, a PwC Magyarország független felmérése alapján a legvonzóbb magyarországi munkahelyek közé tartozik, és a legetikusabb multinacionális vállalat címét is megkapta. A cég folyamatosan fejleszti négy – budapesti, debreceni, pécsi és szegedi – telephelyét, és várja képzett informatikai szakemberek jelentkezését a csapatába.\nSenior Android Developer (REF3358Q)\n\nA Deutsche Telekom MMS GmbH 2019 óta ügyfele és üzleti partnere vállalatunknak és alapvetően a DTAG csoport meghatározó innovációs és digitalizációs szolgáltatója.\nA projektünk célja német egészségbiztosító cégeknek és nemzetközi kereskedelmi ügyfeleinknek a szolgáltatásait támogassuk web elemzéssel és személyre szabott megoldásokkal.\n\nAmennyiben szereted a kihívásokkal teli, változatos munkakört, hétköznapjaid az agilis munkavégzés jegyeiben töltöd és szívesen használod a nyelvtudásod a mindennapi kommunikáció során, Te vagy a mi emberünk!\n\nFeladataid lesznek:\n• Haladó Android alkalmazások fejlesztése\n• Az alkalmazások teljesítményének, minőségének javítása\n• Szoros együttműködés a designerekkel és fejlesztőkkel a zökkenőmentes felhasználói élmény érdekében\n• Kódfelülvizsgálatokban való részvétel és építő jellegű visszajelzés nyújtása\n\nElvárások\n• Minimum 5+ év Android fejlesztésben\n• Tech Stack: Kotlin, Java, Android Studio, Android SDK\n• API integrációk és 3rd party library-k használatával való tapasztalat\n• Mobil UI/UX tervezési alapelvek és legjobb gyakorlatok ismerete\n• Hard skillek: Android Studio, Git, CI/CD, MVVM architektúra, unit testing\n• Magabiztos angol nyelvtudás\n\nElőny, de nem feltétel:\n• Jetpack Compose tapasztalat\n• Kotlin Multiplatform tapasztalat\n• Mobil tesztelési tapasztalat\n• Ismeretek alkalmazásbolti publikálásról és életciklus menedzsmentről\nMunkavégzés helye\nBudapest,Debrecen,Pécs,Szeged",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://hu.jooble.org/jdp/1884847029874918807?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs",
                    "link": "https://globalworkly.com/jobs.php?job=Senior+developer&country=Hungary&city=P%C3%A9cs&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKFJFRjMzNThRKSIsImNvbXBhbnlfbmFtZSI6IkRldXRzY2hlIFRlbGVrb20gSVQgU29sdXRpb25zIiwiYWRkcmVzc19jaXR5IjoiUMOpY3MsIEh1bmdhcnkiLCJodGlkb2NpZCI6Il9iNC1rN01qNXJHa0lMMWVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        },
        {
            "title": "Senior Android Developer (REF3358Q)",
            "company_name": "Deutsche Telekom IT Solutions",
            "location": "Szeged, Hungary",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=7kT0lua2eKgl76BVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQ6CMBAA4LjyCE43qlFKJCYGJxP83RR2UuDSVkuP9IpBX8mXNH7DF30nUVagM-Rh71pPpoUcX2ipRw-z--GYppvtbQ4ruFINjNI3GsjBiUhZnO50CD1nQjDbWHGQwTRxQ50ghzWN4kE1_6tYS4-9lQGr9SYZ496pRZLjELjRCCVafFIHlxIKskMw5BiMg-KDCtslnAenpH__ADhxkKmuAAAA&shmds=v1_AUFQtOOzx_9FtOW2QJNOHQ1Ax4JUYwKZbO34iJ1EsgL8cXWCnA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=7kT0lua2eKgl76BVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad7b00580fd5a8018781b7672090ad49a873e8d9e862eb71b5.gif",
            "extensions": [
                "10 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time"
            },
            "description": "A Deutsche Telekom IT Solutions (korábban IT Services Hungary, ITSH) Magyarország legnagyobb ICT-munkaadója, a Deutsche Telekom Csoport tagja. A 2006-ban alakult, több mint 5000 fős cég az informatikai és telekommunikációs szolgáltatások széles körét nyújtja. A vállalat 2019-ben elnyerte a Nemzeti Befektetési Ügynökség (HIPA) legjobb oktatási együttműködésért járó díját, a PwC Magyarország független felmérése alapján a legvonzóbb magyarországi munkahelyek közé tartozik, és a legetikusabb multinacionális vállalat címét is megkapta. A cég folyamatosan fejleszti négy – budapesti, debreceni, pécsi és szegedi – telephelyét, és várja képzett informatikai szakemberek jelentkezését a csapatába.\nSenior Android Developer (REF3358Q)\n\nA Deutsche Telekom MMS GmbH 2019 óta ügyfele és üzleti partnere vállalatunknak és alapvetően a DTAG csoport meghatározó innovációs és digitalizációs szolgáltatója.\nA projektünk célja német egészségbiztosító cégeknek és nemzetközi kereskedelmi ügyfeleinknek a szolgáltatásait támogassuk web elemzéssel és személyre szabott megoldásokkal.\n\nAmennyiben szereted a kihívásokkal teli, változatos munkakört, hétköznapjaid az agilis munkavégzés jegyeiben töltöd és szívesen használod a nyelvtudásod a mindennapi kommunikáció során, Te vagy a mi emberünk!\n\nFeladataid lesznek:\n• Haladó Android alkalmazások fejlesztése\n• Az alkalmazások teljesítményének, minőségének javítása\n• Szoros együttműködés a designerekkel és fejlesztőkkel a zökkenőmentes felhasználói élmény érdekében\n• Kódfelülvizsgálatokban való részvétel és építő jellegű visszajelzés nyújtása\n\nElvárások\n• Minimum 5+ év Android fejlesztésben\n• Tech Stack: Kotlin, Java, Android Studio, Android SDK\n• API integrációk és 3rd party library-k használatával való tapasztalat\n• Mobil UI/UX tervezési alapelvek és legjobb gyakorlatok ismerete\n• Hard skillek: Android Studio, Git, CI/CD, MVVM architektúra, unit testing\n• Magabiztos angol nyelvtudás\n\nElőny, de nem feltétel:\n• Jetpack Compose tapasztalat\n• Kotlin Multiplatform tapasztalat\n• Mobil tesztelési tapasztalat\n• Ismeretek alkalmazásbolti publikálásról és életciklus menedzsmentről\nMunkavégzés helye\nBudapest,Debrecen,Pécs,Szeged",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://hu.jooble.org/jdp/-1996591912987862221?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKFJFRjMzNThRKSIsImNvbXBhbnlfbmFtZSI6IkRldXRzY2hlIFRlbGVrb20gSVQgU29sdXRpb25zIiwiYWRkcmVzc19jaXR5IjoiU3plZ2VkLCBIdW5nYXJ5IiwiaHRpZG9jaWQiOiI3a1QwbHVhMmVLZ2w3NkJWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNIVnVaMkZ5ZVEifQ=="
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMPQ6CQBBA4dhyBKqpTWSNiY2WKv4kVNiTBcZlzTqz2RkiHsebis3r3pd9F1lZ-b4PaGokzwkqbn1AKMOoiglqfujbJoQTOU-ISWAFN25B0KZuACY4M7uA-X5QjbIzRiQUTtSq74qOX4YJW57Mk1v5p5Fh9mKwis1mu56KSG6ZX493OHCKnOZvRj3BZSRn0-cHe_1BiKQAAAA&shmds=v1_AUFQtOOSZ-2RQRMv10OKjK55vcGuj0Dd8rlEyHtYi7jxPM-H5w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad84138bcc5530dd952eafe8ddb61dd86e4c782a4e92eb5017.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6Ikh1bmdhcnkiLCJodGlkb2NpZCI6IlQxeHZ0bGpKbmNkMW91MGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        },
        {
            "title": "React Native Mobile Developer",
            "company_name": "IQVIA",
            "location": "Anywhere",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=MBKvyiWb-epI9s0qAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBAAUFz7CZ1uFm1EdNFJEbSCgg6u5RKPtBJzIXeW-hX-srq87RWfUbG4EjqFM2rXE5zYdoFgRz0FTpRhCke2IITZtcAR9sw-ULluVZOsjBEJlRf9bVc5fhqOZHkwD7byp5EWM6WASs18ORuqFP24rC-3egNdhO3rjolEJ3B4RY_5_QXgPJdKkgAAAA&shmds=v1_AUFQtOMYFsjQs1TfQ8AUSfXTcF3lLLSMaGi6W4wTj3WIsjsBbA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=MBKvyiWb-epI9s0qAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad419c4275681e00cc47b97c92c9301a41a66e0b9bf37aed1c.gif",
            "extensions": [
                "29 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "29 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join Us at IQVIA!\n\nWe are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment (eCOA) platform. Our fast, flexible, and proven solution enhances efficiencies, delivers real-time data, and sharpens insights, all while providing a superior patient experience.\n\nWho we’re looking for:\n\nYou will be part of a growing team of developers located across the world, focused on building new and modern software that’s positioned to disrupt the clinical trial space. In this remote role, you’ll be empowered and encouraged to think “outside the box” to develop innovative solutions to drive business and the industry forward. You believe that pushing yourself out of your comfort zone is the only way to grow. You love the idea of owning a product, from developing new mobile app features to scaling to meet market demands. Not only are you fluent with React Native, but you’re an expert with JavaScript/TypeScript.\n\nPosition overview:\n\nWe’re seeing immense growth in the industry, and our core focus is scaling our native application’s feature set. Bring your talent and drive to our team of passionate, creative, and innovative thinkers, focused on developing a sophisticated product that uses modern JavaScript. We have the support and resources of a large company but operate with a start-up culture. You’ll thrive in a fast-paced and agile environment, during which you see real-time results. As we work to rapidly expand our team, you’ll have the opportunity to grow your career in the direction that’s right for you.\n\nRESPONSIBILITIES:\n• Serve as critical development resource on cross platform mobile application\n• Work collaboratively and efficiently across functional teams in a fast-paced startup-like environment.\n• High standard of engineering quality through source control, code reviews, continuous integration, and unit tests.\n• Extend our platform to handle an expanding set of features.\n• Improve infrastructure and application development\n• Review and refactor legacy code\n• Provide input on the establishment of development best practices and standards for the organization\n\nSKILLS:\n• Expert in React Native, React, and Redux\n• Expert in JavaScript and TypeScript\n• Experience with SQL databases (SQLite/Postgres)\n• Experience with Swift, Objective-C, Java, and Kotlin are a plus\n• Experience with mobile application deployments (Android/iOS)\n• Experience with data/event streams (Amazon Kinesis/Apache Pulsar)\n\nIQVIA is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. We create intelligent connections to accelerate the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide. Learn more at https://jobs.iqvia.com",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://hu.linkedin.com/jobs/view/react-native-mobile-developer-at-iqvia-4101855172?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJSZWFjdCBOYXRpdmUgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IklRVklBIiwiYWRkcmVzc19jaXR5IjoiQnVkYXBlc3QsIEh1bmdhcnkiLCJodGlkb2NpZCI6Ik1CS3Z5aVdiLWVwSTlzMHFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        },
        {
            "title": "Principal Developer, SDK & Developer Tools",
            "company_name": "ABBYY",
            "location": "Hungary",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=a5mMYH6NMu6wX3bFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0XIsQrCMBAAUFw7OTvd5CCaiOCiU0tB0UXQpVO5hiOJxFzIRam_4ReLk8sbXvWZVPUl-2h8wgAtvShworyEa3uG-T_gxhwEVnDiAYQwGwcc4cBsA832rpQkO61FgrJSsHijDD80Rxp41Hce5EcvDjOlgIX6zXY9qhTtYlo3TdeBj3B8Rov5_QXMWFrilQAAAA&shmds=v1_AUFQtOMncnbzgEViYOzMFDguv6N2QBV-UqX91lBMwXbk3wvFaw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=a5mMYH6NMu6wX3bFAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join ABBYY and be part of a team that celebrates your unique work style. With flexible work options, a supportive team, and rewards that reflect your value, you can focus on what matters most – driving your growth, while fuelling ours.\n\nOur commitment to respect, transparency, and simplicity means you can trust us to always choose to do the right thing.\n\nAs a trusted partner for intelligent automation, we solve highly complex problems for our enterprise customers and put their information to work to transform the way they do business. Innovation and excellence run through our veins, and you will work with experts who are creating market-leading technologies, using Machine Learning and Artificial Intelligence, and an advanced and sophisticated tech stack.\n\nWe are looking for a passionate and skilled Software Engineer who thrives in a hands-on technical role with a focus on owning the quality of the code and systems they develop. The ideal candidate will be responsible for driving the end-to-end delivery of features and systems, ensuring high standards of quality, performance, and maintainability throughout the development lifecycle. If you are committed to shipping reliable and scalable solutions, and enjoy solving complex problems, this is the role for you.\n\nResponsibilities:\n• End-to-End Development: Own the design, development, testing, deployment, and support of features and services from concept to delivery.\n• Quality Ownership: Ensure high code quality, performance, and maintainability by following best practices and conducting thorough code reviews, automated testing, and performance monitoring.\n• Collaboration: Work closely with cross-functional teams, including product managers, designers, and fellow engineers, to define and deliver features that meet both business and technical objectives.\n• Continuous Improvement: Proactively identify areas for improvement within the codebase, infrastructure, and development process. Drive solutions that increase team efficiency and code quality.\n• System Reliability: Monitor the health and performance of services and ensure timely resolution of issues and bugs.\n• Technical Innovation: Stay current with new technologies and trends to ensure the systems you build are modern, scalable, and aligned with industry best practices.\n\nRequired Qualifications:\n• Proficient in Multiple Programming Languages: Strong coding abilities in languages commonly used for SDKs and tooling, such as JavaScript/TypeScript, Python, C#, Swift, Kotlin, and/or Java.\n• SDK Development: Proven experience building SDKs and libraries that enable developers to integrate with products seamlessly and efficiently.\n• Developer Tooling: Knowledge of developer tools, such as CI/CD, package managers (e.g., npm, NuGet, Maven), testing frameworks, and code editors (e.g., VS Code, IntelliJ).\n• Open Source Contribution and Community Building: Familiarity with open-source development practices and ability to engage with and support developer communities.\n• Version Control Systems: Proficiency with Git and platforms like GitHub or GitLab, including workflows (e.g., branching strategies, pull requests, code reviews).\n• Debugging and Performance Optimization: Skills in debugging, profiling, and optimizing code to improve reliability and efficiency of SDKs and tools.\n• Technical Documentation and Communication: Ability to create clear, thorough documentation, sample applications, and tutorials for a diverse developer audience.\n• Cross-Platform Development: Experience with cross-platform SDKs or tools that work across mobile (iOS, Android), web, and potentially other platforms (e.g., React Native, Flutter).\n• User-Centric Design: Understanding of developer pain points and the ability to design tools and SDKs with a focus on simplicity, reliability, and developer experience.\n• Testing and Automation: Experience with unit and integration testing for SDKs, automated testing setups, and quality assurance to maintain stability and robustness.\n• Semantic Versioning (SemVer): Deep understanding of SemVer principles and experience in maintaining SDK versions and release management to ensure compatibility and stability for users.\n\nDesired Qualifications:\n• Ownership Mindset: Passion for taking full ownership of features and ensuring their quality from concept through to production.\n• Performance and Optimization: Experience with profiling applications, identifying bottlenecks, and optimizing performance for scale.\n• Collaboration Skills: Comfortable working in a collaborative, Agile environment, with an emphasis on communication and team success.\n\nSalary Range:\n• The anticipated base salary range for this position is between $190,000 and $215,000. Base salary ranges may vary by geographic location and relevant experience, education, certifications, and seniority as compared to others doing substantially similar work. There is no guarantee an offer will be at the top of the posted range based on the salary analysis.\n\nHere are some of our local benefits:\n• Three week's paid time off on top of 12 paid holidays, floating holidays, and holiday allowance increase based on tenure\n• Gym membership subsidy\n• Medical and dental insurance\n• Pet insurance\n• Employee Assistance Program\n• College Savings Plan\n• Travel assistance\n• 401(k) with up to 4% employer match\n\nAt ABBYY you will:\n\nLove how you work\n• We provide remote and hybrid working options to fit all lifestyles.\n• We use flexible hours across most of our teams to allow you to find your own definition of balance.\n• Encouraging a culture of giving, we provide two paid volunteering days off every year so you can take time to contribute to the causes you care about.\n• To ensure your family is cared for, we offer paid parental leave in all our locations.\n\nLove whom you work with\n• We are a global team of 800+ colleagues, spread across 15 countries on four continents.\n• With 30+ nationalities and ages ranging from 21 to 80, our workforce reflects the world.\n• Innovation and excellence run through our veins.\n• Our teams gather the expertise which has garnered ABBYY more than 140 technology patents.\n• We are guided by the values of respect, transparency, and simplicity. \"Team Environment\" is in the top three highest-scoring drivers of engagement across all of our departments.\n\nLove what you work on\n• We are a company with more than 30 years of experience in the technology market.\n• Over 10,000 customers trust ABBYY, including many Fortune 500 ones, with names such as DHL, Johnson & Johnson, FDA, DMV, PwC, KeyBank, Spotify, and H&R BLOCK in our client portfolio.\n• ABBYY has modernized the way companies leverage their data in documents by creating the first low-code/no-code Intelligent Document Processing platform.\n• Our Machine Learning, Natural Language Processing, Computer Vision Technologies, and a Marketplace built with AI, can transform any document in any process.\n• Top Analyst firms recognize ABBYY's market leadership, including Gartner, Everest PEAK Matrix ® Assessment, ISG Intelligent Automation Lens, and NelsonHall, amongst others.\n\nABBYY is an Equal Employment Opportunity employer that values the strength that diversity brings to the workplace. To learn more about our commitment to Diversity and Inclusion, check out the careers section on our website.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://hu.indeed.com/viewjob?jk=141c71cd5739fa9a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJQcmluY2lwYWwgRGV2ZWxvcGVyLCBTREsgXHUwMDI2IERldmVsb3BlciBUb29scyIsImNvbXBhbnlfbmFtZSI6IkFCQllZIiwiYWRkcmVzc19jaXR5IjoiSHVuZ2FyeSIsImh0aWRvY2lkIjoiYTVtTVlINk5NdTZ3WDNiRkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTSFZ1WjJGeWVRIn0="
        },
        {
            "title": "Deutsche Telekom IT Solutions | Senior Android Developer (REF3358Q)",
            "company_name": "Deutsche Telekom IT Solutions",
            "location": "Csongrád, Hungary",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=cvyd60EfB3lX6Mz6AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_33OOwrCQBAAUGw9gtWUKpqIISBaifHbaaxswiYZNqvrTNjZiIKX8Sz2nkm8gM2rX_vTap8SbLwUFcIRLV74CtsjpGwbb5gEnpAiGXYwp9KxKSHBG1qu0UH3sFxFUTzZ92AIO85BULmiAiZYM2uLnVnlfS3TMBSxgRavvCmCgq8hE-Z8D8-cy49MKuWwtspjNo5H96Am3Y_-xwzBQpi0e7_KAWwa0so9vknCE1nRAAAA&shmds=v1_AUFQtOPOS_LvJTk-5wwMcX_NnmXthF5YSg0XkgvqchN_RXv4kw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=cvyd60EfB3lX6Mz6AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad430ae3b1a391e0b072fdc5873970d5ae105094139f4f210e.gif",
            "extensions": [
                "9 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "9 days ago",
                "schedule_type": "Full-time"
            },
            "description": "A Deutsche Telekom IT Solutions (korábban IT Services Hungary, ITSH) Magyarország legnagyobb ICT-munkaadója, a Deutsche Telekom Csoport tagja. A 2006-ban alakult, több mint 5000 fős cég az informatikai és telekommunikációs szolgáltatások széles körét nyújtja. A vállalat 2019-ben elnyerte a Nemzeti Befektetési Ügynökség (HIPA) legjobb oktatási együttműködésért járó díját, a PwC Magyarország független felmérése alapján a legvonzóbb magyarországi munkahelyek közé tartozik, és a legetikusabb multinacionális vállalat címét is megkapta. A cég folyamatosan fejleszti négy – budapesti, debreceni, pécsi és szegedi – telephelyét, és várja képzett informatikai szakemberek jelentkezését a csapatába.\n\nSenior Android Developer (REF3358Q)\n\nA Deutsche Telekom MMS GmbH 2019 óta ügyfele és üzleti partnere vállalatunknak és alapvetően a DTAG csoport meghatározó innovációs és digitalizációs szolgáltatója.\nA projektünk célja német egészségbiztosító cégeknek és nemzetközi kereskedelmi ügyfeleinknek a szolgáltatásait támogassuk web elemzéssel és személyre szabott megoldásokkal.\n\nAmennyiben szereted a kihívásokkal teli, változatos munkakört, hétköznapjaid az agilis munkavégzés jegyeiben töltöd és szívesen használod a nyelvtudásod a mindennapi kommunikáció során, Te vagy a mi emberünk!\n\nFeladataid lesznek:\n\nHaladó Android alkalmazások fejlesztése\nAz alkalmazások teljesítményének, minőségének javítása\nSzoros együttműködés a designerekkel és fejlesztőkkel a zökkenőmentes felhasználói élmény érdekében\nKódfelülvizsgálatokban való részvétel és építő jellegű visszajelzés nyújtása\n\nElvárások\n\nMinimum 5+ év Android fejlesztésben\nTech Stack: Kotlin, Java, Android Studio, Android SDK\nAPI integrációk és 3rd party library-k használatával való tapasztalat\nMobil UI/UX tervezési alapelvek és legjobb gyakorlatok ismerete\nHard skillek: Android Studio, Git, CI/CD, MVVM architektúra, unit testing\nMagabiztos angol nyelvtudás\n\nElőny, de nem feltétel:\n\nJetpack Compose tapasztalat\nKotlin Multiplatform tapasztalat\nMobil tesztelési tapasztalat\nIsmeretek alkalmazásbolti publikálásról és életciklus menedzsmentről\n\nMunkavégzés helye\n\nBudapest,Debrecen,Pécs,Szeged",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://hu.jooble.org/jdp/-1943209575199625921?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXV0c2NoZSBUZWxla29tIElUIFNvbHV0aW9ucyB8IFNlbmlvciBBbmRyb2lkIERldmVsb3BlciAoUkVGMzM1OFEpIiwiY29tcGFueV9uYW1lIjoiRGV1dHNjaGUgVGVsZWtvbSBJVCBTb2x1dGlvbnMiLCJhZGRyZXNzX2NpdHkiOiJDc29uZ3LDoWQsIEh1bmdhcnkiLCJodGlkb2NpZCI6ImN2eWQ2MEVmQjNsWDZNejZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFw7OjrdqEIbEVzsqGgRhIIfUJJyTSJpLtxFab_Fn1WXt77isyiaB0ZPDHcyPiCcmETKNug8EI9wxjcGSsiwvnhGowU3UMKNDAhq7h1QhCuRDbiqXc5JjkqJhMpK1tn3VU-jooiGJvUkI386cZox_Qrs9ofdVKVot8uWafLDDD5C84pW8_wF-7Of754AAAA&shmds=v1_AUFQtOO_RTLhpv0zc3f_aan6kW7MU2RYmofxc1-96DVYlrBJtQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502a4c80545def172971c/images/4cf13608c33dc3ad68a007b5a92ebb359d2791c702f4c731b6e6f246672f1420.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6Ikh1bmdhcnkiLCJodGlkb2NpZCI6IkQtNFpVcnFGVW1XNUZuVTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU0hWdVoyRnllUSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRXhWZWxkWWQxSTBkamhEVjAxVWVVMUZNbXBhVERRM2VFeEpiR001ZW1JNVdYbGhaM2hDYkVwdGNYQnlPR0ZuUmtOTlJYTTViMDlvWDJ0MlUwb3dXV2x6UTNGUVdVSnplV0ZaUmxOd2IxTmhabmQ1VTIxbWF6QTVTbEpaTVMxcmJESkdNamQxVFd4S2VXOUlSRXc1TTFkcllreFBhRTFPV0RSclprWjRXSE13VjB3NWNXVkdaRTVhVWtKRWJTMTBPRXBuUzBsVllrSnVWV051Y0ZsSmFtYzRiMFZZTVdGTVp5MXNhMXBSYkRkSWVrWmtjSEpDUzNSM2FWVTBOVmh4TUhVNFRVbzBSbXRwZGpsTGRWWm5PWFZaZW1oNldVZFlTbVY1Vm1sNVMzZExPRk5XYlZGc2RqRnFWMnh5VUdsTmNqSm9XR2RMYVcwM1F6WjBaSGwwTW5CdFpTMXpZaElYY0ZGTFJsbzJabXRMYzIxamExQkpVSE54WWxKelVWa2FJa0ZHV0hKRlkzQllZM1IwUjBocU5qVTNVbFJtVWxwNFVXVjFNVXBLYlV3MlduYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Hungary&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRXhWZWxkWWQxSTBkamhEVjAxVWVVMUZNbXBhVERRM2VFeEpiR001ZW1JNVdYbGhaM2hDYkVwdGNYQnlPR0ZuUmtOTlJYTTViMDlvWDJ0MlUwb3dXV2x6UTNGUVdVSnplV0ZaUmxOd2IxTmhabmQ1VTIxbWF6QTVTbEpaTVMxcmJESkdNamQxVFd4S2VXOUlSRXc1TTFkcllreFBhRTFPV0RSclprWjRXSE13VjB3NWNXVkdaRTVhVWtKRWJTMTBPRXBuUzBsVllrSnVWV051Y0ZsSmFtYzRiMFZZTVdGTVp5MXNhMXBSYkRkSWVrWmtjSEpDUzNSM2FWVTBOVmh4TUhVNFRVbzBSbXRwZGpsTGRWWm5PWFZaZW1oNldVZFlTbVY1Vm1sNVMzZExPRk5XYlZGc2RqRnFWMnh5VUdsTmNqSm9XR2RMYVcwM1F6WjBaSGwwTW5CdFpTMXpZaElYY0ZGTFJsbzJabXRMYzIxamExQkpVSE54WWxKelVWa2FJa0ZHV0hKRlkzQllZM1IwUjBocU5qVTNVbFJtVWxwNFVXVjFNVXBLYlV3MlduYyIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}