{
    "search_metadata": {
        "id": "678502c81b3d27e76b6229fd",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/5af2ac2a81c5009d/678502c81b3d27e76b6229fd.json",
        "created_at": "2025-01-13 12:10:48 UTC",
        "processed_at": "2025-01-13 12:10:48 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIGTWV4aWNv&udm=8&fc=EuICCqICQUpHOUprUHdReFVRWWFxcEJubkJDdWZLdG1CUHhkeTZaaHdDcU5zcm9aN0ZTSnFic0xiNHlsd21IMVNaazBxUENidHNzcDJUU0VPazY5RnJsa3VNTXE4a181aUdTZ0ZScnRoelFwbkFocl9yaUk2OGRhUFcxUlR3dXJJamNESktrczNHX2phR3MyWVViajFTR3JKRUFxR255enpMQW9LbW9IaExmMTgybDZNdWxmYzhURmFFNzVtNk95WFJpVzFuUGpqcUpsMVlSbUNCLVk2WHd5RjdkM3REdkVVOEhwaVFZcUZmd2M2aUJ5Rm9kYmgyVGMxWVRTUzU1UWVpYzBUSDByYXNFM2luNnpNdEhIMXl0NTRRcWY0dTdKc29wUUdCaGcSF3h3S0ZaOTctSmYydnB0UVA2TjI0MlE0GiJBRlhyRWNvdFUwQVNGX0p4YzBOekFwWkp2ZmlKMVpOc29B&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/5af2ac2a81c5009d/678502c81b3d27e76b6229fd.html",
        "prettify_html_file": "https://serpapi.com/searches/5af2ac2a81c5009d/678502c81b3d27e76b6229fd.prettify",
        "total_time_taken": 5.2
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Mexico",
        "location_used": "Mexico",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVSGRSZUZWUldXRnhjRUp1YmtKRGRXWkxkRzFDVUhoa2VUWmFhSGREY1U1emNtOWFOMFpUU25GaWMweGlOSGxzZDIxSU1WTmFhekJ4VUVOaWRITnpjREpVVTBWUGF6WTVSbkpzYTNWTlRYRTRhMTgxYVVkVFowWlNjblJvZWxGd2JrRm9jbDl5YVVrMk9HUmhVRmN4VWxSM2RYSkphbU5FU2t0cmN6TkhYMnBoUjNNeVdWVmlhakZUUjNKS1JVRnhSMjU1ZW5wTVFXOUxiVzlJYUV4bU1UZ3liRFpOZFd4bVl6aFVSbUZGTnpWdE5rOTVXRkpwVnpGdVVHcHFjVXBzTVZsU2JVTkNMVmsyV0hkNVJqZGtNM1JFZGtWVk9FaHdhVkZaY1VabWQyTTJhVUo1Um05a1ltZ3lWR014V1ZSVFV6VTFVV1ZwWXpCVVNEQnlZWE5GTTJsdU5ucE5kRWhJTVhsME5UUlJjV1kwZFRkS2MyOXdVVWRDYUdjU0YzaDNTMFphT1RjdFNtWXlkbkIwVVZBMlRqSTBNbEUwR2lKQlJsaHlSV052ZEZVd1FWTkdYMHA0WXpCT2VrRndXa3AyWm1sS01WcE9jMjlCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Software Engineer, Android - Mexico",
            "company_name": "Zillow Group, Inc.",
            "location": "Anywhere",
            "via": "Workday",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=7gr23vjskl7RQYIPAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zWNsQrCMBBAce0nON2q1EQEF51EpCg4ubmUND3Tk3gXkkjr__ihVtDl8d70ivek2FzklnsTEQ7siBFjCTtuo1ALCzjjQFZGOUkDCU20HQhDJeI8TrddziFttE7JK5eyyWSVlYcWxkYGfZcmfVGnbhwEbzLWq_VyUIHdfHYl76WHKsozlHBkq4D4f9xTfpW_-ACyD9IkpwAAAA&shmds=v1_AUFQtONTRcxm_nWvFhpA7-ARYYD6nwH1fi_1m0E_zTPpBRpQKQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=7gr23vjskl7RQYIPAAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "About the team Zillow Group develops a variety of apps from our consumer-facing Zillow Real Estate and Trulia apps to our industry-facing Premier Agent and Dotloop apps. Zillow started in 2006 and is the most visited real estate website in the United States with over 10.5 billion visits in 2022, and an average of 220 million monthly unique users. Zillow helps high-intent movers find and win their home through digital solutions and first class partners. Our Zillow Mexico team will work with our US tech teams to simplify and automate the buying, selling and renting experience to make home a reality for more and more people. We believe that creativity, collaboration, and innovation lead to success. We actively encourage our teams to learn about the business and share their ideas. We value and promote a diverse and inclusive workplace! About the role We're looking for a Software developer with strong object-oriented coding skills, excellent attention to detail, and someone who holds their code to high standards and who is not afraid to give feedback on the product. Customer focus and comfortability with cross-functional partnerships are a huge plus. You should be able to lead the teams’ technology stack to ensure we’re building more robust, scalable, and operable systems. We embrace agile software development practices and believe deeply in building teams composed of all skills needed to deliver value (SDE, PM, SDM, SQE, Design, DE, etc). We have a couple of teams working to give people the power to manage and ingest lots of media and data. Looking for an engineer who can help lead the teams’ technology stacks to ensure we’re building more robust, scalable, and affordable systems. Work on the latest Android technologies and architectural patterns to develop world-class mobile applications. Contribute to outstanding full-stack mobile application development from concept to launch Implement client-side features and server APIs and services to support planned mobile functionality Collaborate with an agile cross-team of developers, testers, designers & program managers to build features that engage our users and understand their outstanding expectations Consistently deliver performant, testable, scalable, highly-readable code using OO best practices This role has been categorized as a teleworker position. Teleworkers do not have a permanent corporate office workplace and, instead, work from a physical location of their choice which must be identified to the Company. Employees may live in any part of Mexico, but preferably in Mexico City, as we would encourage attendance for occasional in-office events. In addition to a competitive base salary and benefits, this position is also eligible for equity awards based on factors such as experience, performance and location. Who you are Wondering if we're the right team for you? You'll excel in this team if you thrive on autonomy, seek out persistent problems, implement effective solutions quickly, and you have: BS/MS in Computer Science (or equivalent experience) and 4+ yrs of experience 4+ years of Android experience (Strong knowledge of Java and Kotlin) Ability to mentor and coach Junior and Senior developers Ability to drive cross-team design and framework decisions Familiar with Compose for UI Development Strong architectural knowledge about MVVM and/or similar patterns Familiarity with modular Android architecture Ability to include and work closely with other engineers and other disciplines, most notably individuals in BE roles, product, and design. Experience delivering quality code on a deadline Strong experience profiling for optimizing performance and resource utilization. The ability to work well with product management, design, services to shape and define products Experience with Agile development processes The ability to work well in a team setting Fluent in English and Spanish (both written and spoken). Must be authorized to work in Mexico. Here at Zillow we value the experience and perspective of candidates with non-traditional backgrounds. We encourage you to apply if you have transferable skills or related experiences. Please note: This is an evergreen job post that accepts applications on an ongoing basis. We will consider your profile for any current and future openings that align with your expertise. Get to know us Zillow is reimagining real estate to make it easier to unlock life’s next chapter. As the most-visited real estate website in the United States, Zillow® and its affiliates help movers find and win their home through digital solutions, first class partners, and easier buying, selling, financing and renting experiences. Millions of people visit Zillow Group sites every month to start their home search, and now they can rely on Zillow to help make it easier to move. The work we do is helping people move from dreaming to transacting — and no matter what job you're in, you will play a critical role in making this vision a reality. Our efforts to streamline the real estate transaction are supported by a deep-rooted culture of innovation, our passion to redefine the employee experience, and a fundamental commitment to Equity and Belonging. We’re also setting the standard for work experiences of the future, where our employees are supported in doing their best work and living a flexible, well-balanced life. But don’t just take our word for it. Read recent reviews on Glassdoor and recent recognition from multiple organizations, including: the 100 Best Companies to Work For in 2022 list, Glassdoor Employees’ Choice Award, honoring the Best Places to Work in 2022, Bloomberg Gender-Equality Index 2022, Human Rights Campaign (HRC) Corporate Equity Index and Best Place to Work for LGBTQ Equality 2022, and TIME 100 Most Influential Companies list. Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, and gender identity. If you have a disability or special need that requires accommodation, please contact your recruiter directly. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable state and local law. That’s OK! Introduce yourself to our recruiting teams and give yourself greater potential of finding a role that is a fit. Receive early access to events, jobs, and insights into life at Zillow. Join Our Talent Network Giving our employees more flexibility can lead to a more diverse and representative workforce. Cloud HQ represents our commitment to flexible work at Zillow, and a positive work-life integration. It’s living where you want, and wrapping your work around your life instead of vice versa. Cloud HQ doesn’t mean eschewing offices or never seeing each other in person; the office just serves a different purpose now. We are more intentional about how and when we get together.",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://zillow.wd5.myworkdayjobs.com/en-US/Zillow_Group_External/job/Software-Engineer--Android---Mexico_P745715?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://mx.indeed.com/viewjob?jk=105cf747c14306ab&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/672aed4a361340dccea0674a-software-engineer-android---mexico?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://mx.linkedin.com/jobs/view/software-engineer-android-mexico-at-zillow-4094680625?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WKRN Jobs",
                    "link": "https://jobs.wkrn.com/jobs/software-engineer-android-mexico-san-jose-ciudad-de-aguascalientes/1546141975-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobServe",
                    "link": "https://www.jobserve.com/mx/en/extjob/SOFTWARE-ENGINEER-ANDROID-MEXICO-in-San-Gaspar-Mexico-MEX-19D00F0A536EDC836C/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SaluteMyJob",
                    "link": "https://salutemyjob.com/jobs/software-engineer-android-mexico-lomas-del-sol-juarez/1546140622-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Overseas Jobs",
                    "link": "https://www.overseasjobs.com/job/details/30175595/software-engineer-android-mexico?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgQW5kcm9pZCAtIE1leGljbyIsImNvbXBhbnlfbmFtZSI6IlppbGxvdyBHcm91cCwgSW5jLiIsImFkZHJlc3NfY2l0eSI6Ik1leGljbyBDaXR5LCBNZXhpY28iLCJodGlkb2NpZCI6IjdncjIzdmpza2w3UlFZSVBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Software Engineer - Android",
            "company_name": "Homebase",
            "location": "Guadalajara, Jalisco, Mexico",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=7wYUgh5IjS27pTW1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVz7CE43itRGCi46dRCl4OQDlEtypilpruQi5l18Wevy809f9d1U7ZNf-YOJ4Bqdj0QJDtBFm9jb9XrWIITJjMARbswu0PYy5rzIWSmR0DjJmL1pDM-KI2kuamIt_wwyrvASMNPQno6lWaLb7-48k0Yh8Cv4RosBJ0xYQ4_Bi-EaHlS84R8-d9zingAAAA&shmds=v1_AUFQtOPDNdWs277LmZwYbjCPtVL_efmItGjLjB0j9dcKLzDTnQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=7wYUgh5IjS27pTW1AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c81b3d27e76b6229fd/images/fd92e2c5ce0e0a5923a6b9c1ed07ab786cef0a7f9c05f49827d2e7eb54a83067.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Hi, Future Homie!\n\nAs a Homie, you'll be part of an unstoppable team that puts customers first, embraces each day with excitement, and strives for excellence in everything you do. We’re revolutionizing the way small businesses manage their teams and grow their business. What this means for you is a shared passion for innovation and making a difference for the people we serve. So what do you say, will you join us on our mission to empower small businesses?\n\nAs a Homie, you are a bar raiser, which means you come with\n• 4+ years of Mobile Software Engineering experience\n• Expert in Kotlin, Kotlin coroutines, and various common Android frameworks\n• Nice to have: Experience with Java and Jet pack components MVI & compose\n• Advanced understanding of object-oriented software design and design patterns, and how they apply to the frameworks listed above\n• Advanced understanding of performant code\n• Knowledge of Android UI design principles, patterns, and best practices\n• Experience with RESTful APIs and third-party libraries\n• Testing framework experience - unit, feature, and integration\n• Knowledge of Jira, Git, Github, CircleCI, and development using pull requests.\n• Strong systematic and problem-solving skills\n• Ability to work from the office weekly on Tuesdays and Wednesdays\n\nAs a Homie, you will make an impact by\n\nDesigning, building, and implementing incredible software solutions that enhance the value of the Homebase software platform to impact the lives of our customers. You will be a part of a passionate and dynamic community eager to take innovation to the next level. The ideal candidate is comfortable with ambiguity and failure, thrives in a fast-paced environment, and possesses a genuine passion for creating impactful solutions. If you are a risk-taking, scrappy, and unconstrained thinker who takes pride in ownership, we want you on our team.\n• You’ll drive product engineering end-to-end for the mobile to deliver value to our customers\n• You will contribute to the evolution of our current engineering strategy and development process\n• Rapidly prototype and iterate on ideas to validate assumptions and hypotheses\n• Take ownership of initiatives, measure key metrics, and examine results to inform choices with your partners\n• Embrace a mindset of continuous improvement, incorporating learnings from both successes and failures into future initiatives\n• Champion a culture of innovation, collaboration, and a bias for action within the team\n\nWhat to Expect During the Interview Process:\n• Meet the Talent Acquisition team, Mehreen M.\n• Meet with the Hiring Manager\n• Participate in two Technical Interviews (Live Coding/Systems Architecture)\n• Meet with the Director of Engineering, Ronnie C\n• Professional Reference Checks\n• Background Check + Offer Stage\n• Welcome to the team 💜🎉\n\nDiversity, Equity, and Inclusion at Homebase\n\nAt Homebase, we take pride in fostering a welcoming space where every Homie of every gender, age, orientation, culture and walk of life can be their full selves. Diverse perspectives empower us to build the best-in-class platform for small businesses and hourly shift workers. We recognize that experience comes in many forms, so if you think you’re close to what we’re looking for (even if you don’t meet 100% of the qualifications), we encourage you to apply!\n\nAbout Us\n\nWelcome to the exciting world of Homebase in Mexico! We are looking for passionate individuals like you to join our unstoppable team of developers. Can you imagine being one of the first members of this adventure?\n\nOur mission is to make small business teams unstoppable.\n\nHomebase is the everything app for hourly teams, with employee scheduling, time clocks, payroll, team communication, HR, and more. More than 100,000 small (but mighty) businesses rely on Homebase to make work radically easy and give their teams superpowers. As the leader in small business team management, Homebase tracked 1+ billion hours for 2.5+ million workers last year. Homebase is based in San Francisco, Houston, Denver, and Toronto. We are backed by leading venture investors L Catterton Growth, Emerson Collective, Notable Capital, Bain Capital Ventures, Khosla Ventures, Baseline Ventures, Cowboy Ventures, Bedrock Capital, and PLUS Capital.\n\nIf you're ready to join an exciting adventure and make an impact in the world of technology, now is the perfect time to become part of our team in Monterrey! Apply today and be a part of the future we are building together at Homebase!\n• *Interview Recording Notice\n\nBy participating in interviews with Homebase, you consent to the use of Metaview, a recording and transcription tool, during the interview process. Please be aware that all interviews may be recorded and transcribed for the purpose of evaluating candidates and ensuring the quality of our recruitment process. If you do not consent to being recorded, please inform the Talent Team at the beginning of the call, and appropriate arrangements will be made to accommodate your preference. Your privacy is important to us, and the recorded interviews will only be used for internal evaluation and assessment of candidates.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/software-engineer-android-at-homebase-1279?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://mx.bebee.com/job/e5db91683ae2ad8103775741d05703b4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEFuZHJvaWQiLCJjb21wYW55X25hbWUiOiJIb21lYmFzZSIsImFkZHJlc3NfY2l0eSI6Ikd1YWRhbGFqYXJhLCBKYWxpc2NvLCBNZXhpY28iLCJodGlkb2NpZCI6Ijd3WVVnaDVJalMyN3BUVzFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Android Developer (Remote)",
            "company_name": "Axented",
            "location": "Mexico City, Mexico",
            "via": "Recruit.net",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=yUR6sCQ4DjWcOoYiAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3HQQrCMBAFUNz2CC5kliraqOBGV0VBENx4AUnTTxtJMyEzSLyFRxbBzYNXfSbVtoldZt_RGS8ETsg0v2NkxYLWdOWWBDa7gTjShbkPmB4H1SQHY0RC3Yta9a52PBqOaLmYJ7fy4yGDzUjBKh67_abUKfbLWVMQFR35SDcU75hOXt-rf77hV5xrkwAAAA&shmds=v1_AUFQtOMmy1KcmKvDZHjVF5EXg55veifNTpxkXbDaLaMf0DvoDQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=yUR6sCQ4DjWcOoYiAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c81b3d27e76b6229fd/images/fd92e2c5ce0e0a59798afd06730ac1862d24828084a3b0b7b7f8832e3d83809e.gif",
            "extensions": [
                "4 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "4 days ago",
                "schedule_type": "Full-time"
            },
            "description": "We are looking for a Sr Android Developer to join the Engineering team. You will be working with our Engineers to develop and maintain high-quality mobile applications. If you're passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. As a Sr Android Developer you will collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment. Ultimately, you should be able to design and build the next generation of our mobile applications.\n\nResponsibilities\n• Proven work experience as a Sr Android Developer.\n• In-depth knowledge of Kotlin.\n• Experience with third-party libraries and APIs.\n• Familiarity with OPP design principles.\n• Excellent analytical skills with a good problem-solving attitude.\n• Ability to perform in a team environment.\n• BS degree in Computer Science or similar\n\nRequirements\n• Support the entire application lifecycle (concept, design, test, release, and support).\n• Produce fully functional mobile applications writing clean code.\n• Gather specific requirements and suggest solutions.\n• Write unit and UI tests to identify malfunctions.\n• Troubleshoot and debug to optimize performance.\n• Design interfaces to improve user experience.\n• Liaise with the Product Development team to plan new features.\n• Ensure new and legacy applications meet quality standards.\n• Research and suggest new mobile products, applications, and protocols.\n• Stay up-to-date with new technology trends.",
            "apply_options": [
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/android-developer-remote--jobs/C239767ED337E778?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Www.jobaliza.com",
                    "link": "https://www.jobaliza.com/mx/jobad/6cb75754a04500da/9307679650/8282504725/android-developer-remote-ciudad-de-mexico.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoUmVtb3RlKSIsImNvbXBhbnlfbmFtZSI6IkF4ZW50ZWQiLCJhZGRyZXNzX2NpdHkiOiJNZXhpY28gQ2l0eSwgTWV4aWNvIiwiaHRpZG9jaWQiOiJ5VVI2c0NRNERqV2NPb1lpQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Android Developer (Kotlin)",
            "company_name": "Pacifica Continental",
            "location": "Santiago de Querétaro, Querétaro, Mexico",
            "via": "Pacifica Continental - JazzHR",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=5V5U4AVcJHan2i-oAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1XHPQrCQBBAYWxzBKspVTSrgo1W_oCgCIoHCJPNmKysM8vuKLmSvTfwYmpp8_he9upkkyVXUVwFG3qQl0ARentR77gPI9hJCYkw2gaEYStSe-ouGtWQ5sak5PM6KaqzuZWbEaZSWnOVMv1SpAYjBY9KxXQ2bvPA9WB1ROsuziKshdUxsaIHx3DG72ItUBGc7hTfT8Uowz8fqHVWPjaRDpS3AAAA&shmds=v1_AUFQtOOGdlHRkoRzqfwmFzYusbaFGfPs5oC4DPPZ2J43kobLOg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5V5U4AVcJHan2i-oAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Nuestro cliente, una destacada empresa de tecnología en México, está en la búsqueda de un Desarrollador Android con experiencia en Kotlin para unirse a su equipo y desarrollar aplicaciones móviles de alta calidad y rendimiento.\n\nResponsabilidades:\n• Desarrollar y mantener aplicaciones Android para diversos dispositivos y orientaciones.\n• Implementar nuevas funcionalidades siguiendo especificaciones de diseño.\n• Construir y optimizar aplicaciones móviles desde cero.\n• Usar Kotlin y librerías clave del ecosistema Android (Room, Dagger Hilt, ViewModel, Coroutines).\n• Aplicar arquitecturas MVVM y Clean Architecture.\n• Colaborar con diseñadores y otros desarrolladores para asegurar interfaces de usuario atractivas y funcionales.\n\nRequisitos Técnicos:\n• 3+ años de experiencia en desarrollo Android en Kotlin.\n• Experiencia en librerías de Android como Room, Dagger Hilt, y Retrofit.\n• Conocimiento de arquitecturas MVVM y Clean Architecture.\n\nDeseable:\n• Experiencia con Jetpack Compose para diseño de interfaces.",
            "apply_options": [
                {
                    "title": "Pacifica Continental - JazzHR",
                    "link": "https://pacificacontinental.applytojob.com/apply/XucW3BogCt/Android-Developer-Kotlin?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.com.mx/details/4931663354?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://mx.jooble.org/jdp/-4090079591718927848?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/mx/job/android-developer-kotlin--santiago-de-queretaro--e1c3c15ba47d9cc284d366e1bf3898f4b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Expertini",
                    "link": "https://mx.expertini.com/jobs/job/android-developer-kotlin--santiago-de-queretar-pacifica-continental-68f5867850/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoS290bGluKSIsImNvbXBhbnlfbmFtZSI6IlBhY2lmaWNhIENvbnRpbmVudGFsIiwiYWRkcmVzc19jaXR5IjoiU2FudGlhZ28gZGUgUXVlcsOpdGFybywgUXVlcsOpdGFybywgTWV4aWNvIiwiaHRpZG9jaWQiOiI1VjVVNEFWY0pIYW4yaS1vQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Android Developer - REMOTE WORK",
            "company_name": "BairesDev",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Hx822X2Hnt_iYIXkAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1WNMQrCMBRAce0RnP4s2oiggk6KRVBKsQqO5Tf9pJGYH5IovZKLl_Bi1tHl8d70kvcgWWxs41k3sKMnGXbkYQJllheXDK5FeezrwDUEQi9bYAt7ZmVouG5jdGElRAgmVSFi1DKVfBdsqeZO3LgOP1ShRU_OYKRqNp92qbNqtNyi9hT6JWgLZ7RRo2JoCE4P8p9XRM_jP8-p05K_qfrFerEAAAA&shmds=v1_AUFQtOM-6XMi2FY_eEf6NFofJGQlMGX90iIQGESYRf4GWPVKBQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Hx822X2Hnt_iYIXkAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c81b3d27e76b6229fd/images/fd92e2c5ce0e0a59cef8e66c779f348675f0f9a1a655abfd4b9ee66a95f6f902.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.\n\nOur diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.\n\nWhen you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.\n\nAndroid Developer at BairesDev\n\nWe are looking for Android Developers to work from home and join our Development team and participate in different projects made up of multicultural teams distributed throughout the world. We are looking for proactive people, team players passionate about programming in this language and oriented to provide the best experience to the end user. This is an excellent opportunity for those professionals looking to develop in one of the fastest growing companies in the industry!\n\nThese developers will face numerous technical challenges, so they must use current technologies, get involved in the mobile world, web applications, devices, etc.\n\nWhat You’ll Do:\n• Able to work independently with minimal supervision, as well as collaborate with a diverse team.\n• Accountable for resolution of the most technically challenging issues facing the organization.\n• Write code with increasing quality and maintainability.\n• Guide the architecture of large features which impact all parts of the company, identifying issues and raising concerns/blockers for mitigation.\n• Research and introduce new technology to improve the applications and/or the development pipeline.\n\nHere’s what we are looking for:\n• 6+ years of experience in development.\n• 5+ years of experience in Android development.\n• Solid knowledge of design and architecture patterns.\n• Solid knowledge and management of programming fundamentals including algorithms and data structures.\n• Advanced English level.\n\nHow we make your work (and your life) easier:\n• 100% remote work (from anywhere).\n• Excellent compensation in USD or your local currency if preferred\n• Hardware and software setup for you to work from home.\n• Flexible hours: create your own schedule.\n• Paid parental leaves, vacations, and national holidays.\n• Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.\n• Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.\n\nJoin a global team where your unique talents can truly thrive!",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://mx.indeed.com/viewjob?jk=a887c11e236a2e4b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/67469becad55c72fab57a5f2-remote-mobile-developer-ios?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/android-developer-remote-work-bairesdev-JV_KO0,29_KE30,39.htm?jl=1009113227067&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/mexico/job/full-time/others/remote-android-mobile-developer-137484746?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Vacantes De Empleo, Trabajo",
                    "link": "https://mx.trabajo.org/oferta-2863-b35a8f74b37701088d3b410fc222a160?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://mx.sercanto.com/detail/a/angular-developer-remote-work_queretaro-de-arteaga_1850818?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Empleo Pro",
                    "link": "https://empleo.pro/job/Remote+Android+Developer/EmpleateMxmx1175246?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Kit Empleo",
                    "link": "https://www.kitempleo.com.mx/empleo/130059406/mobile-developer-ios-remote-work-jax376-guanajuato/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAtIFJFTU9URSBXT1JLIiwiY29tcGFueV9uYW1lIjoiQmFpcmVzRGV2IiwiYWRkcmVzc19jaXR5IjoiU2FudGlhZ28gZGUgUXVlcsOpdGFybywgUXVlcsOpdGFybywgTWV4aWNvIiwiaHRpZG9jaWQiOiJIeDgyMlgySG50X2lZSVhrQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Android Developer Intern",
            "company_name": "Kinedu",
            "location": "Monterrey, Nuevo Leon, Mexico",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=OLJvdvrSlotJwDF3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNTQrCMBAGUNz2CK5mJ4g2IrjRlSCIP_UKJU0_2kicCZm01JN4XenmbV_xWxTmzG0S39IFI4JEJLpxRmLa0l0aUtjkehKmq0gXsDz1OUc9GqMayk6zzd6VTj5GGI1M5i2NztTa24QYbEa9P-ymMnK3Xj08ox3IM1UyNwnfDb0GjEJPCG-owuSd_AH7QmYJmgAAAA&shmds=v1_AUFQtOMdoFyIe_uDi1gnBcHDgXLFghiGq86F7VuKqLYj-q5BHA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=OLJvdvrSlotJwDF3AAAAAA%3D%3D",
            "extensions": [
                "1 day ago",
                "Internship"
            ],
            "detected_extensions": {
                "posted_at": "1 day ago",
                "schedule_type": "Internship"
            },
            "description": "About Kinedu\n\nWe specialize in developing innovative products to support the growth of children. Additionally, we have created solutions for center-based early childhood development leaders (daycares, pre-Ks, etc), allowing them to streamline administrative tasks with a cloud-based back-office platform.\n\nWe are at an exciting phase of growth with a promising pipeline of new products.\n\nJob Responsibilities:\n\nAs our Android Developer, you will be part of our product team and lead various initiatives while collaborating with your peers to overcome technical challenges.\n\nYou will design, build, create, and analyze our efforts to deliver the best possible experience for our android users.\n\nRequirements:\n\nFamiliarity with data structures and algorithms\n\nKnowledge of Git\n\nKotlin programming language expertise\n\nBasic understanding of Android Concepts (ViewModel - Lifecycle - Fragments)\n\nExperience in building apps that consume REST APIs\n\nStrong organizational, analytical, and problem-solving skills\n\nDesirable Skills:\n\nAutomated testing experience\n\nDeep knowledge of Gradle and the Android build systems\n\nExperience with Google Billing Library, Firebase (Remote Config, In-App Purchases, and Push Notifications)\n\nWhat You'll Get:\n\nYou will join a company recognized by Endeavor, 500 Startups, and awarded by the App Store and Google Play teams.\n\nOpportunity to work with a talented, dynamic, and results-driven team\n\nA chance to contribute to a startup focused on improving early childhood development at scale, serving over 5 million users in more than 180 countries\n\nA competitive compensation package including health, dental, laptop, and life insurance benefits",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://mx.bebee.com/job/7b4a517870c6591f465e3809546b1dfc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Vacantes De Empleo, Trabajo",
                    "link": "https://mx.trabajo.org/oferta-2863-17d5db40d2aef209509305ca4009a800?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBJbnRlcm4iLCJjb21wYW55X25hbWUiOiJLaW5lZHUiLCJhZGRyZXNzX2NpdHkiOiJNb250ZXJyZXksIE51ZXZvIExlb24sIE1leGljbyIsImh0aWRvY2lkIjoiT0xKdmR2clNsb3RKd0RGM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdUV1Y0YVdOdiJ9"
        },
        {
            "title": "Android Developers - USA",
            "company_name": "Presidency Solutions",
            "location": "Mexico City, Mexico",
            "via": "Smart Recruiters Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=VcEaReVkBGXJoihiAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3HvQrCQAwAYFz7CE6Z_emJ4KJTURAEQSjOcr2GNnImxyVK-yy-rAouH3zFe1K4itss1MIBXxglYVZYwrWuvp6kAUWfQw_CcBTpIk53vVnSrXOqsezUvFEogzycMDYyuLs0-uOmvc-Yoje8rTeroUzczeaXjEotchihlvg0ElYghjMOFAT2ZOPinw_NTf3PngAAAA&shmds=v1_AUFQtOM4L0YY6SkJ6SkaEEwh4YfsTVECLtYfyTAVlWpbmV17Pw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=VcEaReVkBGXJoihiAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Company Description\n\nPresidency Inc. is a Software Development and IT Consulting company that provides practical and economical Software Solutions to its clients. We seek to present exceptional solutions and resources that today’s Technical as well as Financial decision makers appreciate.\n\nPresidency Inc. was incorporated by a group of Passionate Professionals who put together a team of talented developers and designers from around the globe. The motto is to maintain a high emphasis on quality, comprehensiveness, and usefulness goes into each solution provided to the client.\n\nPresidency Solutions is now providing development services to over 8 State Governments – helping them achieve deadlines for their healthcare insurance programs\n\nPresidency Solutions teams up with a multinational bank to provide data conversion and data warehousing services\n\nJob Description\n\nThis is an excellent opportunity for Mexicans Developers who are looking to join a well-established IT company and gain experience in a fast paced environment in USA.\n\nWe offer attractive salaries. We sponsor work visas for qualified candidates. (TN, H1B, Green Card)\n\nWe are currently looking for:\n• Android Developers\n\nQualifications\n\n3+ yrs of experience on Android development.\n\nYou are required to have a minimum of a Bachelors degree in Computer Science or related field.\n\nConversational English is required.\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\n\nPlease Note: This job requires relocation to USA and Visa Sponsorship can be provided.",
            "apply_options": [
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/PresidencySolutions1/110706919-android-developers-usa?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlcnMgLSBVU0EiLCJjb21wYW55X25hbWUiOiJQcmVzaWRlbmN5IFNvbHV0aW9ucyIsImFkZHJlc3NfY2l0eSI6Ik1leGljbyBDaXR5LCBNZXhpY28iLCJodGlkb2NpZCI6IlZjRWFSZVZrQkdYSm9paGlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Software Engineer - Android Platform Automation",
            "company_name": "Kunai",
            "location": "Mexico",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=C3PvNNg-iTQ2zKoNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCQBBEsU1jb7W1YE4EG61SREERBD8gXC6bu5NkN9xuMF_i93o2A8Mb3hTfVXF5ca8fmxBq8pEQE-ygoi5x7OA5WO05jVDNyqPVyJTpjVsQtMkFyP3K7AfcnIPqJCdjRIbSi-axKx2PhglbXsybW_lHIyGfTVmMzeG4X8qJ_HZ9n8lGiAQPXKLjH0aOxLmZAAAA&shmds=v1_AUFQtOPJyyXNgfjG1mZRoqxPtx71HlTMZbLxfI9mqXA-xwhs7g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=C3PvNNg-iTQ2zKoNAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Kunai is a fast-growing digital consultancy focused on banking, payments, and fintech powered by a global network that attracts the best and brightest people from all backgrounds and cultures, driven by innovation and experimentation, spread across almost every single continent. Over the past decade, we've shipped over 150 products for clients that include Visa, American Express, Capital One, WEX, Wells Fargo, Ernst & Young, and TOMS Shoes. Our founders built a previous agency (Monsoon) that was acquired by Capital One in 2015.\n\nKunai is currently engaged in the development of Android and iOS native applications for one of the largest Fintech environments in the world. Our mobile applications are used by over 30 million customers and are developed by hundreds of engineers on disparate teams across many independent lines of business. We are seeking Software Engineers with a background in automating the build, deployment and testing processes for Android platforms.\n\nJoin us as we build a Center of Excellence (CoE) aimed at consolidating and coordinating build, testing and deployment efforts across multiple business units. The CoE is currently developing a centralized platform to ingest and analyze testing and reliability data. This platform will empower application teams by providing actionable insights to enhance the effectiveness of existing tests, thereby improving the prevention, mitigation, and rollback of production incidents. Additionally, we will identify opportunities to optimize test suites and streamline deployment pipelines.\n\nSkills:\n• 3 years of experience in the development, deployment or automated testing of mobile applications\n• Knowledge of one or more of the following languages: Kotlin, Java, Python, JavaScript\n• Experience with Android SDK, Android Studio\n• Experience with Android automation deployment tools like Bazel, Gradle, Fastlane, etc.\n• Experience with automated testing frameworks such as Espresso, Appium, Calabash, etc.\n• Knowledge of data analytics and visualization tools like Spark or Superset\n• Proven track record in supporting large-scale deployment pipelines and automated testing initiatives.\n• Ability to collaborate effectively with cross-functional teams and stakeholders to achieve project objectives.\n• Strong problem-solving skills and proactive approach to identifying and implementing improvements in testing and deployment processes.\n\nAt Kunai, we have built deep relationships with our clients. Our bar is high, and our mission is to always exceed our client’s expectations. If you are fanatical about customer success and driven to work on and solve tough technical challenges, we would love to chat with you!",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/software-engineer-android-platform-automation-at-kunai-902?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEFuZHJvaWQgUGxhdGZvcm0gQXV0b21hdGlvbiIsImNvbXBhbnlfbmFtZSI6Ikt1bmFpIiwiYWRkcmVzc19jaXR5IjoiTWV4aWNvIiwiaHRpZG9jaWQiOiJDM1B2Tk5nLWlUUTJ6S29OQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Software Engineer Android",
            "company_name": "Google",
            "location": "Mexico City, Mexico",
            "via": "Taro",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=MjkuXbeHNyd9OxfaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3MMQoCMRBAUWz3CIIwtehmEWy0EhFBsPIAS5Idk0icWTIDxkt4ZhVtPvzmNa9J0134qg9bEA4UEiEW2NFQOA2whBM7ELTFR2CCI3PION1G1VE2xojkNohaTb71fDdM6LiaGzv5ppf4YcdsFfvVuqvtSGE--yGQCM5Yk2fYJ30u_vMGxQgDvJEAAAA&shmds=v1_AUFQtOObYbIn5GQ4NAod-0kZoazM90S2PrPdLw_cy4BQ6gngCA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=MjkuXbeHNyd9OxfaAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Mid-level Software Engineer position at Google, focusing on Android development and infrastructure optimization, requiring 2 years of experience and strong programming skills.",
            "apply_options": [
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/google/software-engineer-android-59ef253f/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiR29vZ2xlIiwiYWRkcmVzc19jaXR5IjoiTWV4aWNvIENpdHksIE1leGljbyIsImh0aWRvY2lkIjoiTWprdVhiZUhOeWQ5T3hmYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdUV1Y0YVdOdiJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVFJLT0hvMVJURlNVbU5HZG1adVlVaGxSeTF2ZEc1NGFITlFkRE51TkZWS1FUUktla2xuWTJvek0zbENXVXhJTkhGMWNYUTVSVXhsVjFkamRVOW9aVkpFZVdSblJFWlJhV2RYY1hBeWNHdEdVbGxNZFd0elNEQllXWFJWTmt0SWRtMURUM0pNYWs5WlFWQlVUSFF5T1Y5a1JGUmFkRjlOVjE5M1JXeFZZV2hUZHpkZlYxQnNYMDVDUVhCMlZXRmtiVkJYTjBaYWEzaFpSME5tTWtSUGVtVjFVREY0VjJ0VlNtVjFTSHBXY2pWTmJGTkhYMWgzTmpKM1gweFBRMEoyVEZkTFJuaHdjMHQzVUhocGVuWmhWV2hYTUVWR1lXOXpNa0ZuVURRMWVURXlXWG8wY0dOeFNsRkpRMlJwTlU4dE1VeElTMVl3TTFWR2VIa3habkZFTWxaRFIxQkJieElYZWxGTFJsbzFaalZFUzIxYWNIUlJVR2hmYmpRMFFXOGFJa0ZHV0hKRlkzRnZXVnBLUkdaNlgyRjZhUzFuVHpCWVpsUnpSMEY0TVZKb2NFRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Mexico&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVFJLT0hvMVJURlNVbU5HZG1adVlVaGxSeTF2ZEc1NGFITlFkRE51TkZWS1FUUktla2xuWTJvek0zbENXVXhJTkhGMWNYUTVSVXhsVjFkamRVOW9aVkpFZVdSblJFWlJhV2RYY1hBeWNHdEdVbGxNZFd0elNEQllXWFJWTmt0SWRtMURUM0pNYWs5WlFWQlVUSFF5T1Y5a1JGUmFkRjlOVjE5M1JXeFZZV2hUZHpkZlYxQnNYMDVDUVhCMlZXRmtiVkJYTjBaYWEzaFpSME5tTWtSUGVtVjFVREY0VjJ0VlNtVjFTSHBXY2pWTmJGTkhYMWgzTmpKM1gweFBRMEoyVEZkTFJuaHdjMHQzVUhocGVuWmhWV2hYTUVWR1lXOXpNa0ZuVURRMWVURXlXWG8wY0dOeFNsRkpRMlJwTlU4dE1VeElTMVl3TTFWR2VIa3habkZFTWxaRFIxQkJieElYZWxGTFJsbzFaalZFUzIxYWNIUlJVR2hmYmpRMFFXOGFJa0ZHV0hKRlkzRnZXVnBLUkdaNlgyRjZhUzFuVHpCWVpsUnpSMEY0TVZKb2NFRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}