{
    "search_metadata": {
        "id": "67850317ef792addf97f2e93",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/0ec2dc9023d1a4e8/67850317ef792addf97f2e93.json",
        "created_at": "2025-01-13 12:12:07 UTC",
        "processed_at": "2025-01-13 12:12:07 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=EuICCqICQUpHOUprTzJ5LTQ4Umx4RWNnc1VJVERTTzE2Z0VHQm43dk1LOWdLdnNTWDI1TnphMEZjTzFHN1ZjdGlGSFJZcEpHUUlPbkJDSFF2UXNDVXNwY2RuR3R0UWxNeEo4UHR1WTVrbllpSjdXQnBIOFgtVFZRbTZxN1RiZ1YwZ0t2MDdONmRYLUtsQ2tMSkduRVNtdVpsekF0UUlkN3lNRFA3b1Zqa1FFMjE1U19yN1h4dHFwLVF4RUdsQ0hYTzU3b2dOWXJCQkNIVjltRkZjWl9JSHNlcG9IYTVuQ2tYVm5xR2tqMFgxNXVPZjdYZHpiaEJqYVJFU3VfMVhEcHJsSXVyUDh4Z0sxZ245ZHhxeWEwdkhnLUdnNXdyU3BJU0V6MTJBZkESF0Z3T0ZaLWFSRTZHZ2lMTVBpb0xraVFFGiJBRlhyRWNyTHZHSnd1b19PN1hkUUh4cFFtdW93dWV5U2pB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/0ec2dc9023d1a4e8/67850317ef792addf97f2e93.html",
        "prettify_html_file": "https://serpapi.com/searches/0ec2dc9023d1a4e8/67850317ef792addf97f2e93.prettify",
        "total_time_taken": 1.51
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUeko1TFRRNFVteDRSV05uYzFWSlZFUlRUekUyWjBWSFFtNDNkazFMT1dkTGRuTlRXREkxVG5waE1FWmpUekZITjFaamRHbEdTRkpaY0VwSFVVbFBia0pEU0ZGMlVYTkRWWE53WTJSdVIzUjBVV3hOZUVvNFVIUjFXVFZyYmxscFNqZFhRbkJJT0ZndFZGWlJiVFp4TjFSaVoxWXdaMHQyTURkT05tUllMVXRzUTJ0TVNrZHVSVk50ZFZwc2VrRjBVVWxrTjNsTlJGQTNiMVpxYTFGRk1qRTFVMTl5TjFoNGRIRndMVkY0UlVkc1EwaFlUelUzYjJkT1dYSkNRa05JVmpsdFJrWmpXbDlKU0hObGNHOUlZVFZ1UTJ0WVZtNXhSMnRxTUZneE5YVlBaamRZWkhwaWFFSnFZVkpGVTNWZk1WaEVjSEpzU1hWeVVEaDRaMHN4WjI0NVpIaHhlV0V3ZGtobkxVZG5OWGR5VTNCSlUwVjZNVEpCWmtFU0YwWjNUMFphTFdGU1JUWkhaMmxNVFZCcGIweHJhVkZGR2lKQlJsaHlSV055VEhaSFNuZDFiMTlQTjFoa1VVaDRjRkZ0ZFc5M2RXVjVVMnBCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer – Private Wealth Management – London",
            "company_name": "Goldman Sachs",
            "location": "London, United Kingdom",
            "via": "Adzuna",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=EnT6iP9j2V2IkuVlAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y2NSwrCMBBAcdsjuJqdINqK4EZXglDwA4qIyzJthiSSzJQkFJfewdN4HU9iFTcPHm_xstcgO61ZBbEKNtSRk5YCvB9POAbbYSK4Erpk4ICMmjxx-tW9sBKGKWylhkgYGgO9lyLa0XBlUmrjsihidLmOCZNt8kZ8IUy13Iub1PGLKhoM1Lr-U80Xs3vesh6PSnHKI8MZGxPB8n82gQvbRAp2lrUS_wECw4QsvAAAAA&shmds=v1_AUFQtOOGzYdBwFArJRaiwa3JN77g75R8D5Qb1ty5sTkbN5Yzxw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=EnT6iP9j2V2IkuVlAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e3b98e82a90b25f0c521c9689eb6eaec2aa970f13683c2a659.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Consumer & Wealth Management Division:\n\nAcross Consumer and Wealth Management (CWM), Goldman Sachs helps empower clients and customers around the world reach their financial goals.\n• The Private Wealth management (PWM) business under Consumer Wealth Management division provides comprehensive Investment Management services and advice across a full-range of asset classes for very high net worth individuals. PWM leverages a global technology platform offering, an integrated suite of tools, and applications to service clients. This platform helps realize a client's goals and objectives, develops and implements an integrated wealth management plan and delivers first-class client service.\n• Our consumer business provides digital solutions for consumers to better spend, borrow, invest and save. Across CWM, our growth is driven by a relentless focus on our people, our clients and leading-edge technology, data and design.\n\nPrivate Wealth Management Digital Engineering Team:\n\nWe are looking for someone to join the PWM Digital Engineering team within CWM.\n\nPWM Digital team of engineers develops integrated, web & mobile based solutions and strategic middleware services that provide PWM Sales Teams and Clients with detailed information on their financial portfolio & analytics, social collaboration platform and access to GS services and insights. Our team of engineers builds solutions to the most complex problems and have the opportunity to work at the forefront of technology innovation alongside industry leaders and make significant contributions to the field.\n\nHOW YOU WILL FULFILL YOUR POTENTIAL\nThis role offers the opportunity to work with a nimble team of developers supporting the website, Goldman.com, used by firm’s ultra-high net worth clients. We are looking to build best in class communications experience and collaboration between clients and advisors. Candidates will work directly with a variety of stakeholders, including ultra-high net worth product team, visual design team, operations team, and highly skilled engineering team and help in evolving and executing on the firm’s digital strategy. The communications team is highly engaged in building a brand new Digital Vault, and continuously enhancing the Document Center so clients can review all their documents at one central place.\n\nPrivate Wealth Management\n\nThe Private Wealth Management (PWM) business provides end to end Investment Management services and advice across a large range of asset classes for high net worth individuals. PWM leverages a global technology platform offering, an integrated suite of tools, and applications to onboard clients. Our software helps realize a client's goals and objectives, develops and implements an integrated wealth management plan and delivers first-class client service.\n\nThe Private Wealth Management Group (PWM) within GS develops and manages relationships with wealthy individuals and family groups, advising them on ways in which to build and protect their financial assets through equity, fixed income, alternative investments and other financial instruments. The successful candidate will join the global PWM Digital team. We develop digital solutions to help clients connect and engage with Goldman Sachs. We work closely with our business partners to streamline business workflows and drive growth. Currently, we are focused on building out our next generation mobile products spanning both iOS and Android platforms.\n\nRESPONSIBILITIES AND QUALIFICATIONS\n\nThe PWM team is actively seeking a Head of Android with proven industry experience. The ideal candidate is a strong individual contributor, positive team player and willing to get things done.\n\n• Strong computer science fundamentals are key to success in this role\n\n• We need an Android expert who can build off the success of our Android Application and be a part of defining and building brand new features\n• We have a lot to build for our users, and as a new company with a fresh code base, we have many opportunities to build and establish great engineering practices and solutions on top of a solid foundation\n• Our goal in engineering is to facilitate the creative, iterative and data driven creation of best in class digital investment experience. Your ideas and input are valued and the code you write will be used by clients around the world and help redefine the firm. The more you are engaged and take ownership, the more you are able to guide and influence what we do.\n\nSKILLS AND EXPERIENCE WE ARE LOOKING FOR\n\n• Bachelor's Degree in Computer Science or related field of study\n• Demonstrated leadership experience\n• 5+ years of experience in software development\n• 3+ years of experience in native Android development\n• Strong knowledge of material design\n\nPreferred Qualifications\n\n• Ability to architect applications that interface with REST APIs, persist data and present information to complex UI layouts applying solid software patterns and architecture appropriate for Android\n• Experience building modular, reusable and tested code\n• Experience with unit, integration and UI testing\n• Experience avoiding massive activities and understanding of concurrency, memory management, retain cycles, data modeling and using stable third party libraries to build excellent solutions rapidly\n• Ability to lead features from inception to deployment and passion for getting your hands dirty in code and technical problems\n\n• Knowledge of the latest Android technologies\n\n• Experience with Kotlin\n\n• Extensive experience in all the core Android technologies and popular third party toolsets\n\nABOUT GOLDMAN SACHS\n\nAt Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.\n\nWe believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers.\n\nWe’re committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https://www.goldmansachs.com/careers/footer/disability-statement.html\n\n© The Goldman Sachs Group, Inc., 2021. All rights reserved.\nGoldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity",
            "apply_options": [
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/2237663940?title=Android_Developer_%E2%80%93_Private_Wealth_Management_%E2%80%93_London&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Diversity Jobs Group",
                    "link": "https://diversityjobsgroup.com/job/lead-bi-developer-london-greater-london/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Diversity-Friendly Employers",
                    "link": "https://www.jobs4lgbtqplus.com/job/lead-bi-developer-london-greater-london/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs4OverFifties",
                    "link": "https://www.jobs4overfifties.com/job/lead-bi-developer-london-greater-london/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciDigJMgUHJpdmF0ZSBXZWFsdGggTWFuYWdlbWVudCDigJMgTG9uZG9uIiwiY29tcGFueV9uYW1lIjoiR29sZG1hbiBTYWNocyIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkVuVDZpUDlqMlYySWt1VmxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior Android Engineer",
            "company_name": "ASOS.com",
            "location": "London, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=QiQ6_s3L68NrOINwAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAGYFx9BKfDUTQRwUWnDiKo4FCcS9oc6Ul7f8ll6Gv4xtLlm771b7V2NasgU6UxQyLdNIkyZzrQAy0Zh9z1BKU7kAbeXPtSJrt4bza4ZCUU6VyH0UO5xey_aG2hsT5knoZQuDmdj7ObNO22Vf2ul02i9IJG6J4-KoUjPUVTxPgHOXxDKpQAAAA&shmds=v1_AUFQtOPYzW4uMs-hX05dOXklyA-ZBvZUp4gZzxK5a1NqjJi0rA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=QiQ6_s3L68NrOINwAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e3664ed84d2f8c3e6ba860d5937a09bbfd15b1332ba938919c.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Company Description\n\nWe’re ASOS, the online retailer for fashion lovers all around the world.\n\nWe exist to give our customers the confidence to be whoever they want to be, and that goes for our people too. At ASOS, you’re free to be your true self without judgement, and channel your creativity into a platform used by millions.\n\nBut how are we showing up? We’re proud members of Inclusive Companies, are Disability Confident Committed and have signed the Business in the Community Race at Work Charter and we placed 8th in the Inclusive Top 50 Companies Employer list.\n\nEveryone needs some help showing up as their best self. Let our Talent team know if you need any adjustments throughout the process in whatever way works best for you.\n\nJob Description\n\nDue to an exciting expansion of our Mobile Development team, we're hiring multiple Mobile and QA Engineers across iOS and Android to join our team\n\nThe Web & Apps department is at the heart of ASOS Technology; our goal is to create the ultimate customer experience through inspiration, engagement and excitement for the fashion industry.\n\nAre you a Senior Android Engineer who takes pride in the success of the applications you work on? Do you enjoy seeing your apps featured with fantastic ratings on the Google Play Store, but strive to keep pushing for more?\n\nWe are looking for a Senior Android Engineer to join our Customer Experience team who can help further the success of our Android app. The app has more than 5M active users worldwide, an average app store review of 4.8 stars, and has over 99.9% crash-free sessions. Kotlin is upwards of 85% of our codebase and all new code is written in in it.\n\nHere are some early considerations:\n• App featured at Google I/O 2019 & 2024 Developer Keynotes\n• Kotlin first approach\n• Over 10M+ downloads\n• The codebase uses Arch Components (ViewModel, LiveData, Room etc) and not to forget RxJava & Coroutines\n• Make an impact on millions of customers\n• Never ending chance of experimenting with latest tech, including KMM, Jetpack Compose and more!\n• We have done some significant work to modularise the app and are continuing to follow best coding practices.\n• Working with Hilt dependency injection\n• Extensive UI and unit testing suites\n\nWhat You’ll Be Doing\n• Deliver top quality projects made using best practices and guidelines\n• Work with our design team to implement clean design that respects the platform\n• Work in an agile, cross-functional team taking joint responsibility for the engineering team deliverables\n• Take a proactive and hands-on approach in all features and tasks\n\nQualifications\n\nAbout you:\n• You are a passionate Senior Android developer\n• You are proficient with Kotlin\n• You know and have used RxJava / reactive programming techniques\n• You can lead discussions on technical architecture and design\n• You believe that all code is legacy code if it isn't unit tested\n• You have hands-on knowledge in writing unit, integration and UI tests\n• You love agile / scrum and can work as part of a smaller cross-functional & feature focused team\n• You are comfortable in taking ownership of big pieces of work, from the planning phase right through to execution and delivery\n• You want to learn new technologies and are comfortable discussing them with your peers and upskilling others on them\n• You have experience mentoring other engineers and enjoy this process\n\nAdditional Information\n\nBeneFITS’\n• Employee discount (hello ASOS discount!)\n• ASOS Develops (personal development opportunities across the business)\n• Employee sample sales\n• Access to a huge range of LinkedIn learning materials\n• 25 days paid annual leave + an extra celebration day for a special moment\n• Discretionary bonus scheme\n• Private medical care scheme\n• Flexible benefits allowance - which you can choose to take as extra cash, or use towards other benefits\n\nWhy take our word for it? Search #InsideASOS on our socials to see what life at ASOS is like.\n\nWant to find out how we’re tech powered? Check out the ASOS Tech Podcast here https://open.spotify.com/show/6rT4V6N9C7pAXcX60kzzxo. Prefer reading? Check out our ASOS Tech Blog here https://medium.com/asos-techblog.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/senior-android-engineer-at-asos-com-3994637600?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/bumbleinc/d4ad4efd-4300-41c3-82ff-4e4f3bfeecae?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/ASOS/744000005439296-senior-android-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Greenhouse",
                    "link": "https://boards.eu.greenhouse.io/nothing/jobs/4471759101?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/senior-android-engineer/asos-job103899900?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=70663938d82dd567&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/senior-android-engineer/3609279?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Dots",
                    "link": "https://the-dots.com/jobs/senior-android-engineer-234760?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkFTT1MuY29tIiwiYWRkcmVzc19jaXR5IjoiTG9uZG9uLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiUWlRNl9zM0w2OE5yT0lOd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Software Engineer (Android)",
            "company_name": "Lloyds Bank",
            "location": "Leeds, United Kingdom",
            "via": "Theround",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=ZH5p47UV-GjzU26RAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43OKhoIwUXnRRE0G7iXNLmmkbTu5I7sH6Jv6sub3zZZ5IVN271ZRPCiXwgxATzA7nEwS1gDReuQdCmpgMmODP7iNN9pzrIzhiRmHtRq6HJG-4NE9Y8mgfX8qeS7hcP0SpWxXYz5gP55ayM_HYCR0tPCAQlopMV3CkoOrgG8o77L_vMYvmaAAAA&shmds=v1_AUFQtONeO9cppdtVKacw0-KgSApyZIVKq2jUSO3g9UYy2E-RpA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ZH5p47UV-GjzU26RAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e354ee93aca5b021f121ff33a85aab71b4111feaad0d1a31d0.gif",
            "extensions": [
                "£68,202–£83,358 a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "£68,202–£83,358 a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "End Date\n\nThursday 18 July 2024\n\nSalary Range\n\n£68,202 - £102,303\n\nWe support flexible working – click here for more information on flexible working options\n\nFlexible Working Options\n\nHybrid Working\n\nJob Description Summary\n\n.\n\nJob Description\n\nJOB TITLE:\n\nSoftware Engineer (Android)\n\nLOCATION(S):\n\nLeeds\n\nHOURS:\n\nFull time\n\nWORKING PATTERN:\n\nHybrid, 40% (or two days) in the office per week\n\nSALARY:\n\n£68,202 - £83,358 pa. dependant on experience\n\nAbout this opportunity\n\nWe’re looking for Android Product Engineers to join our Mass Affluent Digital Experience (MADE) lab in Leeds.\n\nMass Affluent is the segment of customers with between £50,000 and £5 million in investable assets. We have close to three million Mass Affluent customers, and we are working hard to create greenfield personalised and tailored offering to ensure a beautiful banking experience. We want to provide a seamless digital experience, with the right products and services at our customers’ fingertips, but our face-to-face, telephone and secure messaging remain a vital part of our service.\n\nWhat do we need to see from applicants?\n\nWe like people who come from a diverse group of backgrounds that can bring new and challenging ways of thinking to the team. As a minimum to be considered we’ll need to see evidence of the following in your CV:\n\nEssential:\n• Excellent knowledge of Kotlin / Java\n• Strong knowledge of Android SDK, Android UI design principles, patterns, and best practices\n• Professional hands-on experience and working knowledge in designing a mobile experience for variable screen sizes in variable versions of Android phones and tablets\n\nDesirable:\n• Knowledge of the open-source Android ecosystem and the libraries available for common tasks and benchmarking and optimisation\n• Unit, UI and Snapshot Testing\n• Solid understanding of software architecture (MVVM), design patterns (SOLID, DRY) and best practices (specifically Google's Android design principles, interface guidelines)\n• In-depth knowledge and experience of interacting with RESTful APIs\n• Demonstrated experience collaborating with Product and Design colleagues to drive outcomes for customers\n• A good understanding of Git, source code management and managing change.\n• Knowledge and experience of agile development practices, continuous integration and test automation (e.g. TDD, BDD).\n• Excellent interpersonal and team working skills\n• Experience of technical guidance and mentoring.\n\nHere’s how you’ll make a difference:\n• Collaborating across the Bank to ensure seamless integration of Android applications with other systems\n• Having an excellent understanding of Agile software development and supporting continuous improvement of your team\n• Contribute to levelling up how we design, build and operate mobile native software as scale within the Bank through the wider engineering community\n• Technically mentor and develop your colleagues, providing clear and constructive feedback, through code reviews and design documents\n\nAbout working for us\n\nOur focus is to ensure we're inclusive every day, building an organisation that reflects modern society and celebrates diversity in all its forms\n\nWe want our people to feel that they belong and can be their best, regardless of background, identity or culture.\n\nWe were one of the first major organisations to set goals on diversity in senior roles, create a menopause health package, and a dedicated Working with Cancer initiative.\n\nAnd it’s why we especially welcome applications from under-represented groups.\n\nWe’re disability confident. So if you’d like reasonable adjustments to be made to our recruitment processes, just let us know.\n\nWe also offer a wide-ranging benefits package, which includes:\n• A generous pension contribution of up to 15%\n• An annual bonus award, subject to Group performance\n• Share schemes including free shares\n• Benefits you can adapt to your lifestyle, such as discounted shopping\n• 30 days’ holiday, with bank holidays on top\n• A range of wellbeing initiatives and generous parental leave policies\n\nReady for a career where you can have a positive impact as you learn, grow and thrive\n\nAt Lloyds Banking Group, we're driven by a clear purpose; to help Britain prosper. Across the Group, our colleagues are focused on making a difference to customers, businesses and communities. With us you'll have a key role to play in shaping the financial services of the future, whilst the scale and reach of our Group means you'll have many opportunities to learn, grow and develop.\n\nWe keep your data safe. So, we'll only ever ask you to provide confidential or sensitive information once you have formally been invited along to an interview or accepted a verbal offer to join us which is when we run our background checks. We'll always explain what we need and why, with any request coming from a trusted Lloyds Banking Group person.\n\nWe're focused on creating a values-led culture and are committed to building a workforce which reflects the diversity of the customers and communities we serve. Together we’re building a truly inclusive workplace where all of our colleagues have the opportunity to make a real difference.",
            "apply_options": [
                {
                    "title": "Theround",
                    "link": "https://www.theround.com/lloyds-bank-jobs/software-engineer-android/e827d6d4-af4d-47d1-bf0d-231cadfdff64?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQW5kcm9pZCkiLCJjb21wYW55X25hbWUiOiJMbG95ZHMgQmFuayIsImFkZHJlc3NfY2l0eSI6IkxlZWRzLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiWkg1cDQ3VVYtR2p6VTI2UkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Software Engineer - Android Development",
            "company_name": "Amazon",
            "location": "Cambridge, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=R5J1rJlJ8KUOdoI3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCMBBAce0nOB24iTYiuCgIRUXQUZxL0pxpJLkLyaHFz_FLrcsb3vBe9Z1U-xs_5K0zwomcJ8QMS2jIZvYWjvjCwCkiyWgvbKCgzl0PTHBmdgGnu14kla1SpYTaFdHiu7rjqJjQ8KCebMofbenHSQpasF1vVkOdyM1nTdSfseUJDjqa7K3DBdzJC1q4enKW4w8J5WVnpQAAAA&shmds=v1_AUFQtOPdns8FX6ekc6B0SQth9jQGIEuoYDdrOGcPL77ukRW5jg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=R5J1rJlJ8KUOdoI3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e3b5fce3c2024ef78b6d1ed0328fa295419cb1b1e37f875087.gif",
            "extensions": [
                "6 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "The Ring team is seeking a talented Android Software Development Engineer to design, develop and maintain world-class mobile applications.\nJob Description\n• Design, develop, and maintain our Android mobile applications.\n• Work with team members to investigate design approaches, prototype technology, and evaluate technical feasibility.\n• Lead architecture and design of features from conception to launch.\n\nThis role provides a unique opportunity to be part of shaping the core of Ring's offerings to customers. You will work across teams to prototype ideas and solve complex problems.\nAbout the Team\n\nWorking on exciting new features and fully owning some of the most visited and core experiences in the Ring app, our team is always looking to learn and innovate.",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/0008e9a2ec2aaf1d6c0137b1ee822acc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEFuZHJvaWQgRGV2ZWxvcG1lbnQiLCJjb21wYW55X25hbWUiOiJBbWF6b24iLCJhZGRyZXNzX2NpdHkiOiJDYW1icmlkZ2UsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJSNUoxckpsSjhLVU9kb0kzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Sr. Android Developer",
            "company_name": "eTeam Inc.",
            "location": "London, United Kingdom",
            "via": "Eteaminc.jobs.net",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=g4NGpB29ZBKq4oe3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEOwoCMRAAUGz3CFZTWMmaiGCj1YIgfjq1XrLJkESSmZAJstfwxuIrXvdddP2jKhjIVY4OTvjBxAUrbODKEwiaagMwwZnZJ1weQ2tFDlqLJOWlmRatspw1E0486zdP8m-UYCqWZBqOu_12VoX8eoVPNBkuZBVEgjuTY-rhRbGhg1sk7zj_AJt1pauUAAAA&shmds=v1_AUFQtONX4zT-J9sTP8vsRMQrsRh3QINJJB_6wZWLjqAVbMKtfA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=g4NGpB29ZBKq4oe3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e3ad6870d331be0e35b28c4af7344a18bacd6badd2246eeda8.gif",
            "extensions": [
                "25 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "25 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "• A Github/Stack Overflow/app portfolio!\n• Fintech experience\n• Active participation in tech meet-ups\n• Experience using Navigation libraries\n• Experience with flavour and whitelabeling\n• Experience working with multi module apps\n• Experience using NodeJS\n• Worked with Design Systems",
            "apply_options": [
                {
                    "title": "Eteaminc.jobs.net",
                    "link": "https://eteaminc.jobs.net/job/J3R6967758PCXY73RXH?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJlVGVhbSBJbmMuIiwiYWRkcmVzc19jaXR5IjoiTG9uZG9uLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiZzROR3BCMjlaQktxNG9lM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Mobile App Developer",
            "company_name": "Go Leady",
            "location": "Sheffield, United Kingdom",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=9aPPJnOX3AEEoJ-sAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEuwrCMBQGYFz7CE5ncfHSiOCikyAUvEziXJLmbxJJc0JPkPoYvrH4DV_1nVWrO5sQQaec6Yw3ImeMtKELGxLosfPEiRpmFzE_-lKyHJQSibWTokvo6o4HxQmGJ_ViI_9a8XpEjrqg3e23U52TWy4aphu0_VBI9PDo-4Bo1_RMocDSNSRnefgB52tJ_pQAAAA&shmds=v1_AUFQtONaQVjdIXNXuUPlk_mukrErL3iffKOMLB7ekRU6A-FtSA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=9aPPJnOX3AEEoJ-sAAAAAA%3D%3D",
            "extensions": [
                "10 days ago",
                "Part-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Part-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Overview\nWe are seeking a skilled Application Developer to join our dynamic team. The ideal candidate will be responsible for designing, developing, and maintaining applications across various platforms, including iOS and Android. This role requires a strong understanding of application development principles and the ability to work collaboratively in a fast-paced environment. If you are passionate about creating innovative solutions and have a keen eye for user interface design, we would love to hear from you.\n\nResponsibilities\n• Develop and maintain mobile applications for iOS and Android platforms.\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Integrate APIs and third-party libraries to enhance application functionality.\n• Ensure the performance, quality, and responsiveness of applications.\n• Conduct code reviews and provide constructive feedback to team members.\n• Troubleshoot and debug applications to optimise performance.\n• Stay up-to-date with the latest industry trends and technologies in application development.\n\nSkills\n• Proficiency in iOS development using Swift or Objective-C.\n• Experience with Android development using Java or Kotlin.\n• Strong knowledge of React Native for cross-platform application development.\n• Familiarity with RESTful APIs and integration techniques.\n• Solid understanding of UI/UX principles and best practices.\n• Experience with JavaScript for web-based application components.\n• Knowledge of C# is advantageous for backend integration tasks.\n• Excellent problem-solving skills and attention to detail.\n• Ability to work effectively both independently and as part of a team.\n\nIf you are ready to take your career to the next level as an Application Developer, we encourage you to apply. Join us in creating exceptional applications that make a difference!\n\nJob Type: Part-time\n\nPay: £6.40-£11.44 per hour\n\nExpected hours: 4 – 8 per week\n\nBenefits:\n• On-site parking\n\nSchedule:\n• Flexitime\n• Monday to Friday\n\nWork Location: In person\n\nReference ID: app dev",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=c084c6cb64eff814&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/mobile-app-developer-go-leady-JV_IC3414736_KO0,20_KE21,29.htm?jl=1009585918436&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.co.uk/job/Qo_pnqedJMQ2-4p5zSjNF2VFhR6OH58A74evLtB8GPtMNFRh2RAHkg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Job Fly",
                    "link": "https://jobfly.co.uk/listings/2251ddbc7d157e000add/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/corecom-consulting/mobile-developer-409982/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs",
                    "link": "https://jobs.uktech.news/job/mobile-developer-mWMkp7K6H--at-corecom-consulting-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/f2926ed9262fcd771a8f4aac6f6f919e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/sheffield/uk/info_technology/3858321313/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkdvIExlYWR5IiwiYWRkcmVzc19jaXR5IjoiU2hlZmZpZWxkLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiOWFQUEpuT1gzQUVFb0otc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Ada Meher | Android Developer – Remote (must be UK based) – £55k",
            "company_name": "Ada Meher",
            "location": "Edinburgh, United Kingdom",
            "via": "Remote Worker",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=eZVSTVhDt8w3Mwv8AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0WOMYoCMRhG2dYjbPVV4orOiDCNVoIiKDaCnSDJ5CeJzuQf8kexsPAOHsGb6E08ibs227zivea1nl-t7cQorMhRxAWTYCJ7gymdqOLm172uN6yp5kTo1EdJ0ITNEloJmZ9PfdyL4oA-FqwhpGLpwAFzZlvR99il1Mgoz0WqzEpSyZdZyXXOgTSf8z1r-cNOnIrUVCrRblgMzlkTbLf9v-YDZsYHfYzW9bAJPpHB0gdruH4DhUPfvcYAAAA&shmds=v1_AUFQtOPK5OfzYai9S3wTLtVsrlxqtxW83pGICuwPh5yuDxGkTg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=eZVSTVhDt8w3Mwv8AAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Developer – Remote (must be UK based) – £55k Fully remote | Kotlin / Jetpack Compose | Personal Development & Progression Plan | Flexible Hours | Evolving Digital Agency Ada Meher is currently working with a scaling digital agency as they look to recruit a Senior Android Developer to work on the development of a number of their exciting client projects. The successful applicant can expect to work on both greenfield development and BAU development project using Android and surrounding tech such as Kotlin & Jetpack Compose. This role would suit someone who is self-driven and ambitious enough to work independently as well as take advantage of the resources and expertise made available to them internally to aide their personal development. This is a real focus for the client and every member of staff has their own personal development plan and with this role there will be a clearly defined pathway into a Technical Lead role. Due to this self-started culture the business works with flexibility at its core and it happy to allow the team to work remotely, though you'll need to be based in the UK. They also offer flexibility in hours and holiday days, to ensure that employees are able to make the job work around their other life commitments. To Be Considered… Prior experience in Android Mobile App Development Experience working across multiple projects simultaneously in a fast paced environment Strong communication skills Experience with Kotlin, Jetpack Compose and PlayStore Experience with Rooms and Dependency Injection Experience with Unit Testing / TDD As mentioned, due to their commitment to continuous improvement, each employee in this business has a tailored personal development plan to help inspire their progression and growth with-in their role. As such, if you feel you tick most of the boxes required, with the exception of key a development area, please feel confident in making an application. We’re expecting a strong response for this Senior Android Developer role, and looking to screen candidates immediately ready to shortlist candidates ASAP. As such, please send a CV to matthew.coney@adameher.com or apply within ASAP to be considered.",
            "apply_options": [
                {
                    "title": "Remote Worker",
                    "link": "https://www.remoteworker.co.uk/jobs/357353015-ada-meher-android-developer-remote-must-be-uk-based-55k-at-ada-meher?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBZGEgTWVoZXIgfCBBbmRyb2lkIERldmVsb3BlciDigJMgUmVtb3RlIChtdXN0IGJlIFVLIGJhc2VkKSDigJMgwqM1NWsiLCJjb21wYW55X25hbWUiOiJBZGEgTWVoZXIiLCJhZGRyZXNzX2NpdHkiOiJFZGluYnVyZ2gsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJlWlZTVFZoRHQ4dzNNd3Y4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "bet365 | Senior Android Developer",
            "company_name": "bet365",
            "location": "Stoke-on-Trent, United Kingdom",
            "via": "The BIG Jobsite",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=3xHgoxNJ36zhfMxFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3NsQrCMBAAUFz7CU43ithGlErRSRAEHatzSZojjaZ3ITmkgz_jn4rg8tZXfGZFY1C2uxre0CJ5TnAkm9hbOOELA0dMUMKFDWTUqR-ACc7MLuD8MIjEvFcq51C5LFp8X_U8KiY0PKkHm_yjy4NOGIMW7Db1eqoiueXi33qCVviJJVN5S0iygjt5QQtXT87y-AVhnPgRpAAAAA&shmds=v1_AUFQtOM5jR9z4Y962MznO0juS42N2spvyE5ZcSZSBwlwL1Nr0w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=3xHgoxNJ36zhfMxFAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e32497e1469f0cb8b3979e1486ff2d06dd17008b8d15732f93.gif",
            "extensions": [
                "11 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "11 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who we are looking for A Senior Android Developer, who will be part of the site services team developing our Android Sports Native App, alongside our award-winning website.As part of the software development function, you will be working with a growing team of talented developers who are responsible for the Native App development, delivering award winning user interfaces, interactivity and unparalleled performance. You will work collaboratively with your team throughout all stages of the Software Delivery Lifecycle (SDLC) to ensure high quality delivery through to the Google Play Store, whilst acting as a leader and a mentor to other members of the team.You will be working with a large and ever expanding Kotlin codebase to enhance our Sports App. This will include feature development and enhancements, issue resolution and performance improvements, tooling production and automation.The day-to-day work is interesting, challenging and fast paced amidst a hardworking and delivery focused company ethos. We hire people with a broad set of technical skills who are ready to tackle some of technology’s greatest challenges.This role is eligible for inclusion in the Company’s hybrid working from home policy.Preferred Skills, Qualifications and Experience Extensive experience in writing code using Kotlin in Android Studio.Genuine passion for Android development.Proven working experience with modern Android libraries and APIs.Familiarity with RESTful APIs to connect Android applications to back-end services.Experience with unit testing including testing frameworks such as Espresso.Understanding of advanced source control concepts and tooling.Knowledge of web technologies, Chrome Web Inspector or Android web view APIs.Solid understanding of the full mobile development lifecycle.Ability to debug and address memory and performance issues.Previous experience in a senior role providing mentorship is essential.Main ResponsibilitiesMentoring and assisting in the development of junior members of the team.Architecting, designing and developing complex feature rich applications for the Android platform.Proactively finding issues and improvements within your product area.Keep up to date with Android and Google technologies to drive the product forward.Assisting with the investigation of live system issues.Performing QA of peer’s code.Implementing unit tests to improve and maintain app quality.Contributing to ever improving codebases and processes.“By applying to us you are agreeing to share your Personal Data in accordance with our Recruitment Privacy Policy - http://www.bet365careers.com/privacypolicy.pdf “",
            "apply_options": [
                {
                    "title": "The BIG Jobsite",
                    "link": "https://www.thebigjobsite.com/details/B767FCF52AF57448AAFE0B25816E1455/bet365---senior-android-developer?source=attbus&utm_source=googlejobs&utm_medium=api2&key=114BBC523AE0B92362064EB6A7B41720&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJiZXQzNjUgfCBTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJiZXQzNjUiLCJhZGRyZXNzX2NpdHkiOiJTdG9rZS1vbi1UcmVudCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IjN4SGdveE5KMzZ6aGZNeEZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Android Developer",
            "company_name": "Apply4U",
            "location": "London, United Kingdom",
            "via": "Apply4u.co.uk",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=x4D0VhPH9CRhVOl0AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAGYFz7CE7nJqKNiC46FQRBXTuXtDnSSHp_yAWpr-BTi9_wVd9FtW7EZQRHV35zROJMO7qjJ2Wbh5EgdAN85OVlLCXp2RjVWHsttoShHjAZCPeYzQu9_ut0tJlTtIW7w2k_10n8ZtWkFD_HloLQE-IgW2olFHb0COIdph_flHGvjQAAAA&shmds=v1_AUFQtOMktbkNm9r84zdbnUnXsHeGc8grZHGkDeL_J5sbiJ9Lng&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=x4D0VhPH9CRhVOl0AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850317ef792addf97f2e93/images/746d80eba3c106e302d445ee07c67db6c81e7b3cd2695537be8102892425b7b6.gif",
            "extensions": [
                "7 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Android Developer - £80k - £120k - Fully Remote I m collaborating with a forward-thinking fintech company that's transforming financial management for independent professionals and growing businesses. Their mobile business account, combined with intuitive financial tools, empowers users to take control of their finances effortlessly and efficiently. Responsibilities As a Senior Android Developer, you ll: Develop and maintain Android applications using the latest technologies and industry best practices. Design cutting-edge application architectures with MVP/MVVM patterns. Enhance user interfaces with Jetpack Compose. Manage dependency injection using Hilt to improve the development process. Handle asynchronous tasks with Rx or Coroutines to ensure seamless app performance. Create and maintain UI tests to uphold application quality standards. Collaborate with cross-functional teams to optimise user experience and interface design. Refactor legacy code as part of a broader architectural improvement initiative. Requirements To be successful in this role, you should have: 4 years of commercial Android development experience and a strong grasp of the Android SDK. Expertise in Jetpack Compose and solid knowledge of MVP/MVVM architectures. Experience with Hilt for dependency injection. Proficiency in asynchronous programming using Rx or Coroutines. Proven ability to create UI tests for Android applications. Familiarity with Flutter and the ability to evaluate and utilise it when necessary. Strong communication skills and experience working in Agile environments. Upper-Intermediate (B2) English proficiency or higher. Bonus Skills Experience working with REST APIs and Proto3. Knowledge of multi-module architecture. Skills in performance optimisation and user experience enhancements. Familiarity with CI/CD tools for automation.",
            "apply_options": [
                {
                    "title": "Apply4u.co.uk",
                    "link": "https://www.apply4u.co.uk/jobs/android-developer/23023722?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://www.sercanto.co.uk/detail/a/software-team-leader_cambridge_78908969?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/dcedb5eca640878c84c1f451748c6129?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobg8",
                    "link": "https://jobs.jobg8.com/jobs/android-developer-in-hammersmith-and-fulham-london-united-kingdom/5673-2876975804BC?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFwcGx5NFUiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJ4NEQwVmhQSDlDUmhWT2wwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVGxSZWxOd1VqQlNlWFpmWjJGb2VHWnhkR0ZHVjFRNE9UUTRiSEF0TW5sMmQzWmxNRFoyTTA5dFdGaG1VMkpmZUZaTFozVkJSV1JYZFd0WFUxWkxNMGx1YzE5Qk1IUTFWRjlZYkdScFNVNTJWVFZZV1d4RVEwdFVjR1puU3kxSlVEUkxjbUZKVW1kUE5HSTBjVFpUTjJ0QlN6SlJhRmRGYURaUE5YRlNaR1ZvYjFFNVRXcG9jVVY1VW5WbVZsbHdjbXBXZVVkVk5FWlhOVEpOYVhaaE4yaHhXRE5UU1MxTlduUm1UamM0TkhWNFlqSmtXbkpvVEZZelQwMTZjRUYxVFRSUlZUaDRSazkxUkVWNFNFOXVjREpzVUdKemEzWkVOM2wwTUY4NWVVOUxTaTF6TmpabGVIUkljelZVTkMxVWFsOW1aRkZ0Ykhac2FsUk5NMkZGWmw5ZmJXTklSeElYUjBGUFJsb3RaVFJOWTIweWNIUlJVRFZsYlhrNFFUUWFJa0ZHV0hKRlkzRTRXbk55YmpCUGVEUnJTSFV4ZEU5NE9HdDZVbmcyVm1sTlFVRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVGxSZWxOd1VqQlNlWFpmWjJGb2VHWnhkR0ZHVjFRNE9UUTRiSEF0TW5sMmQzWmxNRFoyTTA5dFdGaG1VMkpmZUZaTFozVkJSV1JYZFd0WFUxWkxNMGx1YzE5Qk1IUTFWRjlZYkdScFNVNTJWVFZZV1d4RVEwdFVjR1puU3kxSlVEUkxjbUZKVW1kUE5HSTBjVFpUTjJ0QlN6SlJhRmRGYURaUE5YRlNaR1ZvYjFFNVRXcG9jVVY1VW5WbVZsbHdjbXBXZVVkVk5FWlhOVEpOYVhaaE4yaHhXRE5UU1MxTlduUm1UamM0TkhWNFlqSmtXbkpvVEZZelQwMTZjRUYxVFRSUlZUaDRSazkxUkVWNFNFOXVjREpzVUdKemEzWkVOM2wwTUY4NWVVOUxTaTF6TmpabGVIUkljelZVTkMxVWFsOW1aRkZ0Ykhac2FsUk5NMkZGWmw5ZmJXTklSeElYUjBGUFJsb3RaVFJOWTIweWNIUlJVRFZsYlhrNFFUUWFJa0ZHV0hKRlkzRTRXbk55YmpCUGVEUnJTSFV4ZEU5NE9HdDZVbmcyVm1sTlFVRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}