{
    "search_metadata": {
        "id": "6785030fec498288be761ff0",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/7ad8598fa1148fbd/6785030fec498288be761ff0.json",
        "created_at": "2025-01-13 12:11:59 UTC",
        "processed_at": "2025-01-13 12:11:59 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=EuICCqICQUpHOUprTTVfaVBzWGtNQ21JQXphZnRxWmlJYWhSZDNZWDB4a0Z3Y25BdDFIUFNRSTJtUDR4OTBwY01ZZ1pEMEVQVE9QWkMzS09WdThYU2FIWVVKeTh5UmM2YW1vZlBxakRSbVcwUDNCejIwSm1HRXhSVHd3WmJrMW1UY25nRDBiZHlQakpsX1RTZVJDOGJEV1A4cjU4S0ltTHFqd3BFejVWSWNfOUFFWmUwY05XX2o0bF9EMllPYlhYRDdidkY3dHF2WVVwZllaWGVnVW42MW5IQjdVbHFkaGlRV0dSbWd1NC1DX3FQZ2Exa2dOQjVZR040R2JSanoxMXhHRDhGTUVyaGFmdU5WTXFVcmZMQnZJZDcwQXJTLTJ4QVJxUmxZQkESF0RnT0ZaOWZaSkxma3dONFB0X2JUNFFZGiJBRlhyRWNwc0h0eURSTWtuZHotSkdUeFFJdk9hUWdZY29R&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/7ad8598fa1148fbd/6785030fec498288be761ff0.html",
        "prettify_html_file": "https://serpapi.com/searches/7ad8598fa1148fbd/6785030fec498288be761ff0.prettify",
        "total_time_taken": 1.98
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUVFZmYVZCeldHdE5RMjFKUVhwaFpuUnhXbWxKWVdoU1pETlpXREI0YTBaM1kyNUJkREZJVUZOUlNUSnRVRFI0T1RCd1kwMVpaMXBFTUVWUVZFOVFXa016UzA5V2RUaFlVMkZJV1ZWS2VUaDVVbU0yWVcxdlpsQnhha1JTYlZjd1VETkNlakl3U20xSFJYaFNWSGQzV21Kck1XMVVZMjVuUkRCaVpIbFFha3BzWDFSVFpWSkRPR0pFVjFBNGNqVTRTMGx0VEhGcWQzQkZlalZXU1dOZk9VRkZXbVV3WTA1WFgybzBiRjlFTWxsUFlsaFlSRGRpZGtZM2RIRjJXVlZ3WmxsYVdHVm5WVzQyTVc1SVFqZFZiSEZrYUdsUlYwZFNiV2QxTkMxRFgzRlFaMkV4YTJkT1FqVlpSMDQwUjJKU2Fub3hNWGhIUkRoR1RVVnlhR0ZtZFU1V1RYRlZjbVpNUW5aSlpEY3dRWEpUTFRKNFFWSnhVbXhaUWtFU0YwUm5UMFphT1daYVNreG1hM2RPTkZCMFgySlVORkZaR2lKQlJsaHlSV053YzBoMGVVUlNUV3R1WkhvdFNrZFVlRkZKZGs5aFVXZFpZMjlSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer",
            "company_name": "Nextech Group Limited",
            "location": "West Kilbride, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=t4Pz-pWRppzsxc-XAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3MvwrCMBCAcVz7CE43imgjgg46CULBips4StIc6UmaC7lT-ja-qn-Wb_nBV70n1eyQfGHycMQXRs5YYAkndiBoS9cDJ2iYQ8TpvlfNsjNGJNZB1Cp1dceD4YSOR_NgJ7_cpbcFc7SK9_VmNdY5hfn2gqPi99cUfmY400CKHijBDUWhpegKeVzANf2hpRQ8Dx_Fb70rogAAAA&shmds=v1_AUFQtOPhorYnarjzpGaBIC4KcFH-Yy4wkgYD1qJD_oRbSDSeUA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=t4Pz-pWRppzsxc-XAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785030fec498288be761ff0/images/f8d95129de5aa52d777a244c70f796a3aaefe9c82ab691af64a16928cc6b49ff.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Developer - Greater Manchester - £50,000\n\nA leading and well-respected IT company based in Greater Manchester is seeking a talented Android Developer to join their dynamic team.\n\nAbout The Company\n\nRenowned for their innovative projects and cutting-edge technology solutions, this organisation has built a strong reputation for delivering exceptional digital products. Their collaborative work environment and commitment to professional development make them an employer of choice for tech professionals.\n\nThe Role\n\nAs an Android Developer, the successful candidate will be responsible for designing, developing, and maintaining high-quality Android applications. Working closely with cross-functional teams, they will contribute to the entire app lifecycle, from concept to release, ensuring seamless performance and user-friendly experiences.\n\nKey Responsibilities\n• Develop and maintain robust, scalable Android applications.\n• Collaborate with designers, product managers, and backend developers to bring ideas to life.\n• Write clean, efficient, and maintainable code while adhering to best practices.\n• Optimise application performance and troubleshoot bugs.\n• Stay up-to-date with the latest Android development trends and tools.\n\nAbout You\n\nThe ideal candidate will have a passion for mobile development and a proven track record of creating innovative apps. Key qualifications and skills include:\n• Proficiency in Kotlin and Java.\n• Experience with Android SDK and Android Studio.\n• Familiarity with RESTful APIs and third-party libraries.\n• Strong problem-solving abilities and attention to detail.\n• Excellent communication and teamwork skills.\n\nBenefits\n• Competitive salary of £50,000 per annum.\n• Opportunities for professional growth and career development.\n• A supportive, collaborative, and inclusive work culture.\n• Access to the latest technologies and exciting projects.\n\nHow To Apply\n\nIf you are an Android Developer looking to take the next step in your career with a company that values innovation and excellence, we'd love to hear from you!\n\nMake your mark in the tech world - apply today!\n\nAndroid Developer, Kotlin, Java, Android SDK, Android Studio, RESTful APIs, mobile development, app lifecycle, application performance, troubleshooting, software development, IT company, Greater Manchester, mobile applications, clean code, maintainable code, cross-functional teams, collaboration, innovation, problem-solving, attention to detail, communication skills, team player, technology solutions, professional growth, career development.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/android-developer-at-nextech-group-limited-4098747813?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6Ik5leHRlY2ggR3JvdXAgTGltaXRlZCIsImFkZHJlc3NfY2l0eSI6Ildlc3QgS2lsYnJpZGUsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJ0NFB6LXBXUnBwenN4Yy1YQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Ada Meher Android Developer - Remote (must be UK based) - £55k",
            "company_name": "Ada Meher",
            "location": "Leigh, United Kingdom",
            "via": "IT Job Board",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=G2TXpSGBKCrhwQaqAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0WOsQrCMBRFce0nOD2cVLQRoYtOBUGwugh1laR5JNEmr-RF6f_4Fa5-mXVyuQfOWW72HmWXUks4ocUIZdCRnIYdPrGlbjBLOKOnhDD1D06gEOoKlGTUs6F9XkVxH3ggBYwyNhYowJ7ItDje2pQ63gjB3OaGk0yuyRvyggIq6sWNFP_mylZG7FqZ8LouVn3eBTOf_E-5AEd0xi6gDi6hhsoFo8l_AaIBfqO8AAAA&shmds=v1_AUFQtOMhXGo-LK4rWA59RQD3rmrtmFmWAmHzzDp6qpruY2U_4Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=G2TXpSGBKCrhwQaqAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Developer - Remote (must be UK based) - £55k\n\nFully remote Kotlin / Jetpack Compose Personal Development & Progression Plan Flexible Hours Evolving Digital Agency\n\nAda Meher is currently working with a scaling digital agency as they look to recruit a Senior Android Developer to work on the development of a number of their exciting client projects. The successful applicant can expect to work on both greenfield development and BAU development project using Android and surrounding tech such as Kotlin & Jetpack Compose.\n\nThis role would suit someone who is self-driven and ambitious enough to work independently as well as take advantage of the resources and expertise made available to them internally to aide their personal development. This is a real focus for the client and every member of staff has their own personal development plan and with this role there will be a clearly defined pathway into a Technical Lead role.\n\nDue to this self-started culture the business works with flexibility at its core and it happy to allow the team to work remotely, though you'll need to be based in the UK. They also offer flexibility in hours and holiday days, to ensure that employees are able to make the job work around their other life commitments.\n\nTo Be Considered\n• Prior experience in Android Mobile App Development\n• Experience working across multiple projects simultaneously in a fast paced environment\n• Strong communication skills\n• Experience with Kotlin, Jetpack Compose and PlayStore\n• Experience with Rooms and Dependency Injection\n• Experience with Unit Testing / TDD\n\nAs mentioned, due to their commitment to continuous improvement, each employee in this business has a tailored personal development plan to help inspire their progression and growth with-in their role. As such, if you feel you tick most of the boxes required, with the exception of key a development area, please feel confident in making an application.\n\nWe're expecting a strong response for this Senior Android Developer role, and looking to screen candidates immediately ready to shortlist candidates ASAP. As such, please send a CV to or apply within ASAP to be considered.",
            "apply_options": [
                {
                    "title": "IT Job Board",
                    "link": "https://www.itjobboard.co.uk/job/16020059/ada-meher-android-developer-remote-must-be-uk-based-55k/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Remote Worker",
                    "link": "https://www.remoteworker.co.uk/jobs/357352177-android-developer-remote-must-be-uk-based-55k-at-ada-meher?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://www.sercanto.co.uk/detail/a/android-developer-remote-must-be-uk-based-55k_leigh_128826723?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/ada-meher-android-developer-must-jobs/DC33E40EF517CC94?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBZGEgTWVoZXIgQW5kcm9pZCBEZXZlbG9wZXIgLSBSZW1vdGUgKG11c3QgYmUgVUsgYmFzZWQpIC0gwqM1NWsiLCJjb21wYW55X25hbWUiOiJBZGEgTWVoZXIiLCJhZGRyZXNzX2NpdHkiOiJMZWlnaCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkcyVFhwU0dCS0NyaHdRYXFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Software Engineer, Android",
            "company_name": "Roku",
            "location": "Manchester, United Kingdom",
            "via": "Theround",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=25mOl7ctjKS6XMJ5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7CE6Ho2ijgotODiIoLopzSZNrEm3vSu7EPogPrF3-8fuL76RY37nRj80IRwqJEPMCDuQzJw9LOHMNgja7CExwYg4tTvdRtZedMSJtGUStJlc67gwT1jyYJ9cyppL4d_vWKlab7Wooewrz2Y1fb0gEV0suoug4fFBS9HBJFDx3Pzy3LYGXAAAA&shmds=v1_AUFQtOMSWpmyaLjuX8M70QjIJwfNdLKAuEZNdNZtCNiH9yIQRA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=25mOl7ctjKS6XMJ5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785030fec498288be761ff0/images/f8d95129de5aa52dc6b241ee1bfdeb7b76cefe6e7ba55ab32feaba11c67f660b.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Teamwork makes the stream work.\n\nRoku is changing how the world watches TV\n\nRoku is the #1 TV streaming platform in the US and Mexico, and we've set our sights on powering every television in the world. Roku pioneered streaming to the TV. Our mission is to be the TV streaming platform that connects the entire TV ecosystem. We connect consumers to the content they love, enable content publishers to build and monetize large audiences, and provide advertisers unique capabilities to engage consumers.\n\nFrom your first day at Roku, you'll make a valuable - and valued - contribution. We're a fast-growing public company where no one is a bystander. We offer you the opportunity to delight millions of TV streamers around the world while gaining meaningful experience across a variety of disciplines.\n\nAbout the Role\n\nAs a Software Engineer, Android at Roku, you will have the opportunity to be part of a team of skilled engineers and will have a chance to make your mark by designing and implementing new features and improving existing features. You must enjoy working on mobile apps at all levels, from networking up to user interfaces and anything in between. You are motivated from within, finding and taking on a feature or project simply because that problem needs to be solved and shipped. But that individual must work together with different engineering teams, UI design, product teams, and business leadership to make things happen, which means that engineers succeed here because they can maintain that independent spirit and motivation within a deeply collaborative environment. We are looking for a Software Engineer, Android experienced in building apps at scale to support that commitment. The mobile team is responsible for the architecture and implementation of services that support Roku's mobile applications. We are looking for someone who can help us keep up this pace and continue delivering high-quality app as we grow.\n\nAbout the Team\n\nAt Roku, you will be part of a mobile team that is passionate about creating delightful user experiences for millions of users. Roku's mobile application continues to grow in users and engagement. We are looking for Android Engineers who are excited about working with one of the most popular media apps. You will be joining a talented, high-performance team with a history of delivery. We are the pragmatic dreamers inventing and re-inventing the world of streaming media. With so many people using our products globally, we’ve become well-known for products that “just work” right out of the box and integrate almost by magic. That doesn’t happen by accident, which is why we are committed to making sure our products aren’t just intuitive, they’re obvious.\n\nWhat you'll be doing\n• Design and build advanced applications for the Android platform\n• Maintain and improve the performance of existing Android applications\n• Write and maintain tests using the JUnit/Espresso frameworks\n• Troubleshoot and debug Android applications\n• Write well-designed, testable, and efficient code\n• Contribute to the development of project plans and estimates\n• Collaborate with cross-functional teams to define, design, and ship new features for mobile devices, optimising for touch experiences.\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n\nWe're excited if you have\n• Strong understanding of the entire mobile development life cycle\n• 3+ years of experience in Android mobile development with a focus on IoT using Kotlin or Java, with a track record shipping high-quality app(s) to Google Play\n• Proficient in Kotlin or Java\n• Experience with third-party mobile libraries and APIs\n• Proficient in Android development toolset including Android Studio & Emulator\n• Experience with agile development methodologies\n• 5+ years of software engineering experience.\n• Strong problem-solving and communication skills\n• Bachelors or Masters/Ph.D. in Computer Science or equivalent experience\n\n#LI-AM3\n\nBenefits\n\nRoku is committed to offering a diverse range of benefits as part of our compensation package to support our employees and their families. Our comprehensive benefits include global access to mental health and financial wellness support and resources. Local benefits include statutory and voluntary benefits which may include healthcare (medical, dental, and vision), life, accident, disability, commuter, and retirement options (401(k)/pension). Our employees can take time off work for vacation and other personal reasons to balance their evolving work and life needs. It's important to note that not every benefit is available in all locations or for every role. For details specific to your location, please consult with your recruiter.\n\nThe Roku Culture\n\nRoku is a great place for people who want to work in a fast-paced environment where everyone is focused on the company's success rather than their own. We try to surround ourselves with people who are great at their jobs, who are easy to work with, and who keep their egos in check. We appreciate a sense of humor. We believe a fewer number of very talented folks can do more for less cost than a larger number of less talented teams. We're independent thinkers with big ideas who act boldly, move fast and accomplish extraordinary things through collaboration and trust. In short, at Roku you'll be part of a company that's changing how the world watches TV.\n\nWe have a unique culture that we are proud of. We think of ourselves primarily as problem-solvers, which itself is a two-part idea. We come up with the solution, but the solution isn't real until it is built and delivered to the customer. That penchant for action gives us a pragmatic approach to innovation, one that has served us well since 2002.\n\nTo learn more about Roku, our global footprint, and how we've grown, visit https://www.weareroku.com/factsheet.\n\nBy providing your information, you acknowledge that you have read our Applicant Privacy Notice and authorize Roku to process your data subject to those terms.",
            "apply_options": [
                {
                    "title": "Theround",
                    "link": "https://www.theround.com/roku-jobs/software-engineer-android/615d72c9-cc27-49bd-9f81-a2e43c7d732d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgQW5kcm9pZCIsImNvbXBhbnlfbmFtZSI6IlJva3UiLCJhZGRyZXNzX2NpdHkiOiJNYW5jaGVzdGVyLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiMjVtT2w3Y3RqS1M2WE1KNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Android Developer, Android Developer, Android Developer - Redditch",
            "company_name": "Octad Recruitment Limited",
            "location": "Redditch, United Kingdom",
            "via": "Smart Recruiters Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=jhOsKVeOG7C8GiNQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_42NMQoCMRBFsd0jWE0t60aEbbQSBEEFQbCwkmwyZCPJTEhG2Vt6JVcLa5vP-6951WtSXTdkM3sLW3xi4IS5hn8UzOGM1nox_Yh77qCgzuNhgh2zCzhd9yKprJQqJTSuiBZvGsNRMWHHg7pzVz5zK73OmIIWvC3bxdAkcrP2ZETbsWHyw0tEEjj66AUtePqla7jQ1x08OcvxDbG2M0rSAAAA&shmds=v1_AUFQtOPNCenmFNXiPAaxKT6cIkReFfJpnQDrsNVwR_DT4xqtpg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=jhOsKVeOG7C8GiNQAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Description\n\nMy client is a dynamic Software Company located in Redditch, Worcestershire. They develop a market leading ERP software product. In brief their products are amazing!!!\n\nThey’ve been established for 5 winning years, although their product has been in existence for over 10 years.\n\nDue to continued expansion they are seeking an Android Developer to join the team.\n\nExperience required:\n• They are seeking upwards of 3 years.\n\nSkills required:\n• Proven working experience in Android app development.\n• Experience with Android SDK\n• Experience working with remote data via REST and JSON\n• Experience with third-party libraries and APIs\n• Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies\n• Solid understanding of the full mobile development life cycle.\n• Desirable: any experience of Java, C# is a bonus\n\nThere are genuine opportunities for growth within this role for the right candidate, particularly on the mobile side of their business.\n\nThis role will allow this individual to have control of the full development of the Android project and make it their own. In time you’ll have the opportunity to manage/grow a team as their mobile division expands.\n\nThis role is paying up to circa £40k depending on experience + benefits and certified and ongoing training.\n\nIf you’re interested in this fantastic opportunity? It will be great to hear from you. You can either call me direct, or preferably in the first instance send me a copy your most recent CV and I’ll be in touch within 1 day.",
            "apply_options": [
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/OctadRecruitmentLimited/743999681363704-android-developer-android-developer-android-developer-redditch?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciwgQW5kcm9pZCBEZXZlbG9wZXIsIEFuZHJvaWQgRGV2ZWxvcGVyIC0gUmVkZGl0Y2giLCJjb21wYW55X25hbWUiOiJPY3RhZCBSZWNydWl0bWVudCBMaW1pdGVkIiwiYWRkcmVzc19jaXR5IjoiUmVkZGl0Y2gsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJqaE9zS1ZlT0c3QzhHaU5RQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Android Software Developer",
            "company_name": "TPP",
            "location": "Horsforth, United Kingdom",
            "via": "Find A Job",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=RIoiRIrWEJBIpgg3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43izYquOgkCIougjqXtLkmkfQu5A7td_jF6vLGV30m1WpPrnB0cONe37YgHPCFiTMWWMCZWxC0pQvABEdmn3C6C6pZtsaIpNqLWo1d3fFgmLDl0Ty5lT-NhN-Xk1Vs1pvlWGfyM7hfrxAJTlyk56JhDg-Kig4ukbzj4QuB3GoalQAAAA&shmds=v1_AUFQtONpAa9Swfp_eLlorgDY24t4fmPEQL2UVuO12NYnbt89Vg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=RIoiRIrWEJBIpgg3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785030fec498288be761ff0/images/f8d95129de5aa52d9858c173996d522a3d74b27c3df066077daf8c482c52b234.gif",
            "extensions": [
                "29 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "29 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for Android software developers with a passion for programming to help develop our global digital healthcare solution. As part of an agile development team, you will be working on apps used by hundreds of thousands of doctors and millions of patients across the world.\nYou will work on a wide variety of projects such as:\n• Developing smartphone apps that help patients manage their own care.\n• Writing electronic observations systems to capture vital signs and calculate risk scores for patients in hospital.\n• Deploying machine-learning algorithms to help with the symptom-checking and prevention of disease.\nDevelopers at TPP are involved in the full software life cycle, and work closely with all teams across the company.\nSkills and Qualities\n\nNatural ability, enthusiasm and desire to learn\nGreat problem solving skills\nExperience in Android development preferable\n\nSalary and Benefits\n\nWe will give you a minimum £60,000 starting salary (depending on experience). Regular pay reviews mean that you be rewarded well for you contribution and experience, with the potential for rapid salary increases and no crazy working hours!\n\nYou will also receive a range of benefits, including:\n• Fantastic holiday entitlement\n• Regular social events\n• Opportunities to travel internationally\n• Life insurance\n• BUPA Health, Dental and Travel cover\n• £300 birthday meal allowance\n• Pub Fridays\n\nTo read what it’s like to work at TPP and to see our full list of benefits, visit www.tpp-careers.com\n\nAcademic Prerequisites\n\n• 2:1 or above at degree level\n• A*AA at A-level (A* in Maths)\n\nInternational equivalents are accepted, see below for details.\n\nAbout TPP\n\nTPP is a world-leader in Digital Health. From apps enabling patients to manage their own care to comprehensive hospital solutions, TPP delivers technology that connects everyone involved in healthcare delivery. For over twenty years, we have been applying the most advanced technology to provide a safe and secure environment to deliver care. Our aim is to improve access to healthcare data, making sure it is available whenever and wherever it is needed. We want to help people make the best use of that data, to empower clinicians and citizens, and to create the healthcare systems of the future.\n\nTPP has been consistently recognised as an outstanding graduate employer. Since 2017, we have consistently featured in The Job Crowds’ “Top Company for Graduates to Work For”, and were the overall winners for 2024 in addition to awards for 'Best Salary', 'Benefits' and 'Responsibility’. We have also been consistently named in the Times Top 100 Graduate Employers list.\n\nApplication Process\n\nTo apply, please visit https://tpp-careers.com/roles/software-developer/\n\nIf you pass the initial selection criteria then you will be required to sit a Logic & Reasoning test.\n\nSuccessful candidates will usually be contacted within two weeks. Please be aware that applications will be kept on file for up to 12 months.\n\nInternational Equivalents\n\nDegree Level\n• GPA of 3.5 or above\nA Level\n• 39 or above in the International Baccalaureate\n• AAAAA at Higher / AAB at Advanced Higher\n• 550/750 or above in Gaokao\n\nPlease note: Recruitment for this role is ongoing, however we are looking for candidates available to start as soon as possible.",
            "apply_options": [
                {
                    "title": "Find A Job",
                    "link": "https://findajob.dwp.gov.uk/details/15750677?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://uk.jooble.org/jdp/7144608161028241845?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRQUCIsImFkZHJlc3NfY2l0eSI6IkhvcnNmb3J0aCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IlJJb2lSSXJXRUpCSXBnZzNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "(Senior) Android Developer - Design System",
            "company_name": "SumUp",
            "location": "London, United Kingdom",
            "via": "Taro",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=D5PHsn8HHosQ96-dAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHsQrCMBCAYVz7CC7eqKKNCC51KgiCupXOJW2ONJLchVyU-ji-qXX5-f7iuyjqdYPkOG2gJpPYGbjgGz1HTLCfLc4SNB_JGOa_cQ-COg0jMMGV2Xpcnseco1RKifjSStbZDeXAQTFhz5N6ci__dDLqhNHrjN3xdJjKSHa7al6hjeAIHkyGaQctuYwG7o6s4fADTHeKv6QAAAA&shmds=v1_AUFQtOPX8tf-PWKrIZnRGZB5t3EnYBKvCjOtKrDI4JGq1_hfqQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=D5PHsn8HHosQ96-dAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join SumUp as a (Senior) Android Developer - Design System in London, UK. Build and maintain high-quality components for SumUp's Android Design System, driving its architecture and enhancing user experiences.",
            "apply_options": [
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/sumup/senior-android-developer-design-system/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://www.sercanto.co.uk/detail/a/senior-lettings-negotiator_grantham_63202020?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Play",
                    "link": "https://startupplay.com/de/job/senior_ios_developer__design_system_sumup_london_united_kingdom_5460125002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBBbmRyb2lkIERldmVsb3BlciAtIERlc2lnbiBTeXN0ZW0iLCJjb21wYW55X25hbWUiOiJTdW1VcCIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkQ1UEhzbjhISG9zUTk2LWRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Android Developer (SC Cleared) – 3 Month Contract – Fully Remote",
            "company_name": "Stealth IT Consulting Limited",
            "location": "Seaford, United Kingdom",
            "via": "StudySmarter - Talents",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=GQJv_xDkvYz_d6EmAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2NMU7DQBBFRZsjUP0SUGJHICREqsgIBCENDhVFtPYO9qLxjrU7Rk6XO-RqnICTZJPmFe_r603-LiZfS2-DOIsn-iWWngKuygIFkwlkr_G_P-AOa_HaokgMptazfB6Yd_igTpQww5tUiOlTtxCPF5GG6XLRqvbxMc9j5KyJatTVWS1dLp4qGfMfqeIJ29imWs9GaXt7Px-z3jc3D6WS4ZR93ZzKcWB1vsG765yShfMoyXxLsFN8-rNapd1KdwTCcWEa1wAAAA&shmds=v1_AUFQtOMfEiEaruqRwgOHlcA0GSAdLKoHW0N48cJwT4zlJ87_zw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=GQJv_xDkvYz_d6EmAAAAAA%3D%3D",
            "extensions": [
                "28 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Our client is a top tier Digital Consultancy looking for an Android Developer with active SC clearance. We have a budget of £500.00-550.00 (Outside IR35) and will be an initial 3 month contract period (possibility of an extension) on a fully remote basis (some ad hoc client site travel to London may be required). Key Responsibilities Develop and maintain Android applications using Kotlin and Java. Col... Considering making an application for this job Check all the details in this job description, and then click on Apply. JBLK1_UKTJ Remote working/work at home options are available for this role.",
            "apply_options": [
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/stealth-it-consulting-limited/android-developer-sc-cleared-3-month-contract-fully-remote-299177/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoU0MgQ2xlYXJlZCkg4oCTIDMgTW9udGggQ29udHJhY3Qg4oCTIEZ1bGx5IFJlbW90ZSIsImNvbXBhbnlfbmFtZSI6IlN0ZWFsdGggSVQgQ29uc3VsdGluZyBMaW1pdGVkIiwiYWRkcmVzc19jaXR5IjoiU2VhZm9yZCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkdRSnZfeERrdll6X2Q2RW1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Lead Android Developer (Kotlin, MVVM, TDD)",
            "company_name": "Geo20",
            "location": "South Croydon, United Kingdom",
            "via": "GEO20",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=rP-TXf7QVXzCAVIQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQrCMBQAUFx7BKc_iUptSsFFp2KhYO2kdi1p80kiaX5IotQbeUx1eetLPoukvCAXUFrhSQuo8IWGHHpYNxSNtim0XdemcKuqDezgTAME5H5UQBZqImlweVQxunBgLASTyRB51GM20sTI4kAze9AQ_vRBcY_O8Ih9sc_nzFm5XdVIRQ7awpWeUcHJ01vQ771bHVFAo60UNH0BWWEWlasAAAA&shmds=v1_AUFQtOP6al91-dEalMKiFsE436qPiLe84YByWigokyLBL3AmMg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=rP-TXf7QVXzCAVIQAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Geo20 are proud to present a Lead Android position for one of Europe’s largest eCommerce companies and a product that has achieved over 5 million downloads and scores highly on Google Play Store.\n\nAlthough very well established, it is a start-up culture that has allowed them to continue to grow as a team, you will walk into an environment of flat hierarchies, empowerment, trust, and togetherness and welcoming. Attention to detail and the interaction between developer and end user is why they have achieved their success and with your help they are ready to go to the next level and exceed expectations. The Android team currently is four, and they are scaling up to six in the next few months and are fully committed to an agile mindset and cooperation to achieve best results using the latest technologies for Android. As the go to person for Android you will provide both technical and coaching leadership, take ownership of the Android product and drive the product forward.\n\nThey are committed to personal development and there is a personal budget in place for you to decide where you want to learn, budgets to go to conferences, unlimited specialist book budget, 30 days annual leave, home office and flexible working are available.",
            "apply_options": [
                {
                    "title": "GEO20",
                    "link": "https://www.geo20.com/jobs/009-lead-android-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEFuZHJvaWQgRGV2ZWxvcGVyIChLb3RsaW4sIE1WVk0sIFRERCkiLCJjb21wYW55X25hbWUiOiJHZW8yMCIsImFkZHJlc3NfY2l0eSI6IlNvdXRoIENyb3lkb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJyUC1UWGY3UVZYekNBVklRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Senior Android Developer",
            "company_name": "Admiral Careers",
            "location": "Cardiff, United Kingdom",
            "via": "Admiral Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=gU676IWNIwpLgRGHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXJsQrCQAyAYVz7CE6Zi_ZEcNFJFAQdxblce-k1ck2O5JA-i0-rXX4--KvvqnJPZBKFMwcVCnDFDybJqLCFu3Rg6LUfQRhuIjHh-jSWku3onFlqohVfqG96mZwwdjK7t3S2pLXRK-bkC7b7w25uMse6PoeJ1Ce4_B-qAfHCQMOwgRdTwQAP4hhk-gHT3Vn8nQAAAA&shmds=v1_AUFQtOMx3bHZ9nRR9qSWKcIzYT83CzrzAA1bqxmtJTyN9SM-bg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=gU676IWNIwpLgRGHAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785030fec498288be761ff0/images/f8d95129de5aa52d616009d7c533a20482186bbde7ba6e1a35fa9b4fbb08f00d.gif",
            "extensions": [
                "24 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "24 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We’re looking for a Senior Android Developer to join our team as we bring our existing app in house. Over the next 18 months, we’re transitioning towards an App-first approach and need strong Android Engineers to support this transition.\n\nAbout Veygo\n\nVeygo was founded 6 years ago – part of the pioneering incubation venture ‘Admiral Pioneer’ - created to seed and launch exciting scale ups to disrupt existing marketplaces.  \n\nVeygo has so far seen an impressive 50% YoY growth. We currently provide our customers with temporary and learner car insurance - products designed to make life easier for those wanting to share or borrow cars, insure their own car for a short amount of time, or for people learning to drive. \n\nWhat Makes Veygo Different?\n• We’re building flexible policies for learner drivers and people looking to share cars – whether owned or borrowed.  \n• Veygo provides comprehensive cover to those customers, meaning that the car owner’s existing insurance policy and no claims bonus is safe if the person borrowing the car has an accident. \n• All Veygo’s insurance is available by the hour, day, week or month and customers can get a quote in minutes.   \n• All backed by Admiral, voted Best UK Car Insurance Provider six years in a row by The Personal Finance Awards.  \n\nWhilst our mission today is to put people in control of their own journey our ambition is to create a youth lifestyle brand that take us beyond car insurance. Disruption is in our DNA and we’re always relentlessly looking for collaborative self-starters and innovators with the desire to challenge how we do things today; to push the boundaries and drive us through our onward growth journey. Veygo’s culture is vibrant, open, creative, and disruptive.\n\nWho You Are\n• Proven experience as an Android engineer, with a significant portion of that experience at fast-paced, consumer-focused companies.\n• Proven track record of successfully delivering and scaling Android applications with a large user base.\n• Strong proficiency in Android Kotlin and deep understanding of Android frameworks and APIs.\n• Strong experience with CI/CD & frequent release cadence.\n• Experience with engineering complex mobile app architectures, including data modelling, networking, caching, and synchronisation.\n• Excellent problem-solving and debugging skills, with a passion for writing clean, efficient, and maintainable code.\n• Strong communication skills, both verbal and written, with the ability to effectively convey complex technical concepts to both technical and non-technical stakeholders.\n• Proactive and self-driven, with the ability to take ownership of projects and drive them to completion.\n• Be comfortable operating in a scrappy environment, which will have you working deep in the code, but also reporting upwards simultaneously.\n\nWhat The Job Involves\n• Collaborate closely with product, design, and other cross-functional teams to define and drive the technical roadmap and architecture for the Veygo Android application.\n• Comfortably contribute to the development of complex features and architectural enhancements, ensuring scalability, performance, and maintainability of the Android app.\n• Champion the delivery high-quality code while operation as a high performing engineer.\n• Conduct thorough code reviews, ensuring adherence to best practices, code standards, and design principles.\n• Continuously work with backend, frontend and leadership teams to enhance the Veygo Android App Design.\n\nPlease note: this is a hybrid role based in our Cardiff office once-twice a week.\n\nSalary, Benefits and Work-Life Balance\n\nAt Admiral, we are proud to be a diverse business where we put our people and customers first. We have great benefits to ensure employees have a great work-life balance; it's one of the reasons we’re consistently voted one of the Sunday Times Best Big Companies to Work For in the UK.\n\nAll colleagues will receive 33 days holiday (including banks holidays) when they join us, and this will increase with length of service, up to a maximum of 38 days (including banks holidays). You also have the option to buy or sell up to five days of annual leave in addition to your allocation.\n\nYou can also view some of our other key benefits here\n\nOur Commitment to You\n\nAt Admiral, we are committed to being a diverse and inclusive workplace. Admiral is proud to be an equal opportunities employer and does not discriminate on the basis of race, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), national origin, gender, gender identity, sexual orientation, disability, age, or any other legally protected status.\n\nAll qualified applicants will receive equal consideration.\n\n#LI-IM1 #LI-Veygo",
            "apply_options": [
                {
                    "title": "Admiral Jobs",
                    "link": "https://www.admiraljobs.co.uk/job/senior-android-developer-in-cardiff-jid-2700?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/senior-developer/adria-solutions-job103890184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=20d82b69e8fe4eec&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/senior-android-developer-at-veygo-uk-4104378840?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/senior-android-developer-admiral-JV_IC3300986_KO0,24_KE25,32.htm?jl=1009573594339&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.co.uk/job/ATofSbYV5KiS12T-shinaZI-o-gRHIW2XJucEPtCSV5xeTdR9AVlCg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "reed.co.uk",
                    "link": "https://www.reed.co.uk/jobs/senior-developer/54114606?source=searchResults&filter=/jobs/jobs-in-risca&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/6ae3af2c0f05409c45653d6f7526a034?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJBZG1pcmFsIENhcmVlcnMiLCJhZGRyZXNzX2NpdHkiOiJDYXJkaWZmLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiZ1U2NzZJV05Jd3BMZ1JHSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRU5aWmtkVGRGOWpUM1ZtUldsaldtdFJYMjFwWlhSWlYwNWpNWGN0TldwTlVYWnpMVjlKWnpGQ1R6SlBlVFZTWTFka2FVMXhVV1pLTWtGMGVqZFJlVTlOU0RoNFVYa3dhMjVqVUdGQmN6TnVlRlZ6Vmt0SVluYzBaVlp6T0dNd2NrRnFaMGMxZVRCVk9IcFNjM0l5ZW5aT1IySnJPRnBLWjI4MVVIRm1hRmRmZVhCcFQzbG1SVE52VVVWMlYxTmlWbkY2YVZoRE0yY3dTbEZFWDJrd1dFeEpkMVJ3VVV4eWJWOWxWREpDYkRaeGRsRnJiVTV4WWtKdFNHaE9helJCVTJVM1VHaEpiR1pOYUd0eFNFbFhUelpzZWtnMmRGOUVja3hYYjFCRlIyRXhTVkJyY1V0SlUxaFdabFUyTjJsc2MwNHhUVXBoZVZsTk4yMUVNVzh0TlcxbE5VOVRheElYUlVGUFJsbzBZamRLWlVoWGNIUlJVSGMwZG04MFVXOGFJa0ZHV0hKRlkzSmtXRlJ5UTJaVGNIQnVUWEIxU0VOWE0wOXhhVWRJZG1SaWMzYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRU5aWmtkVGRGOWpUM1ZtUldsaldtdFJYMjFwWlhSWlYwNWpNWGN0TldwTlVYWnpMVjlKWnpGQ1R6SlBlVFZTWTFka2FVMXhVV1pLTWtGMGVqZFJlVTlOU0RoNFVYa3dhMjVqVUdGQmN6TnVlRlZ6Vmt0SVluYzBaVlp6T0dNd2NrRnFaMGMxZVRCVk9IcFNjM0l5ZW5aT1IySnJPRnBLWjI4MVVIRm1hRmRmZVhCcFQzbG1SVE52VVVWMlYxTmlWbkY2YVZoRE0yY3dTbEZFWDJrd1dFeEpkMVJ3VVV4eWJWOWxWREpDYkRaeGRsRnJiVTV4WWtKdFNHaE9helJCVTJVM1VHaEpiR1pOYUd0eFNFbFhUelpzZWtnMmRGOUVja3hYYjFCRlIyRXhTVkJyY1V0SlUxaFdabFUyTjJsc2MwNHhUVXBoZVZsTk4yMUVNVzh0TlcxbE5VOVRheElYUlVGUFJsbzBZamRLWlVoWGNIUlJVSGMwZG04MFVXOGFJa0ZHV0hKRlkzSmtXRlJ5UTJaVGNIQnVUWEIxU0VOWE0wOXhhVWRJZG1SaWMzYyIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}