{
    "search_metadata": {
        "id": "678502680232baf3ba9a2d28",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/c65bb32fc5d4b26c/678502680232baf3ba9a2d28.json",
        "created_at": "2025-01-13 12:09:12 UTC",
        "processed_at": "2025-01-13 12:09:12 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EuICCqICQUpHOUprUGgydngtWThuYXIwREJveUg2TVpKTW1Xbk16Ykx2dU5TWVYxa0luVEx0SlAweXVLQVNQWTFDemhzeWExWFZjVUpndFBnakFIVDRIRDByeEdNVDBXXzAwbm1MUFgwN1h4MHpfVnFIeGJ1NUJoOXFUTDN0UWIwQWFDSmc0U2RrYmV1emRzZUltWWxOb0VIWmdjZk1xUmlXYk9yMnh4WmRMeWFmUVJ4RzlqQ3AtckJvYUc4QWlaSnFjbl81WG9JZkpCV3dqSVZlRW8ydHV1OG5sNVZJYTU5eUttY1E3dDh2VC11LTJtR3FsYnBMTm0zVzI4WmpfSlBHTTc0cVlDSGNZd3F4SlVXNmt0UXc1dkxNOUs2c0dJV1ZJMlA0UXcSF1p3S0ZaOVdYRm91aHB0UVB3Y0NHMFFRGiJBRlhyRWNvY2FMd3p6T0pKUW5SVWZYWHhIY05nSlRaVW5R&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/c65bb32fc5d4b26c/678502680232baf3ba9a2d28.html",
        "prettify_html_file": "https://serpapi.com/searches/c65bb32fc5d4b26c/678502680232baf3ba9a2d28.prettify",
        "total_time_taken": 1.34
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVR2d5ZG5ndFdUaHVZWEl3UkVKdmVVZzJUVnBLVFcxWGJrMTZZa3gyZFU1VFdWWXhhMGx1VkV4MFNsQXdlWFZMUVZOUVdURkRlbWh6ZVdFeFdGWmpWVXBuZEZCbmFrRklWRFJJUkRCeWVFZE5WREJYWHpBd2JtMU1VRmd3TjFoNE1IcGZWbkZJZUdKMU5VSm9PWEZVVEROMFVXSXdRV0ZEU21jMFUyUnJZbVYxZW1SelpVbHRXV3hPYjBWSVdtZGpaazF4VW1sWFlrOXlNbmg0V21STWVXRm1VVko0UnpscVEzQXRja0p2WVVjNFFXbGFTbkZqYmw4MVdHOUpaa3BDVjNkcVNWWmxSVzh5ZEhWMU9HNXNOVlpKWVRVNWVVdHRZMUUzZERoMlZDMTFMVEp0UjNGc1luQk1UbTB6VnpJNFdtcGZTbEJIVFRjMGNWbERTR05aZDNGNFNsVlhObXQwVVhjMWRreE5PVXMyYzBkSlYxWkpNbEEwVVhjU0YxcDNTMFphT1ZkWVJtOTFhSEIwVVZCM1kwTkhNRkZSR2lKQlJsaHlSV052WTJGTWQzcDZUMHBLVVc1U1ZXWllXSGhJWTA1blNsUmFWVzVSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer at Affinity Victoria, BC",
            "company_name": "Affinity",
            "location": "Victoria, BC, Canada",
            "via": "Audio Mint",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Pz66tu8Rnw-aD6GNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1XNsQrCQAwAUFz7CU6ZpfZEcNGpVhD8ANeSXtM25bwclyD1d_xScRKXt77ivSrqOvZZuIcLPSlIogxoUA8DR7YX3NmbZMYSzg1s4SYdKGH2E0iEq8gYaH2azJIenVMN1aiGxr7y8nASqZPFzdLpl1YnzJQCGrX7w26pUhw3v4rj31ZCgxF7_ABpNaNdpQAAAA&shmds=v1_AUFQtOObHk6pQhXtA7uy1pm8C_KQvERu6zbrDPu7z246Udy4HA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Pz66tu8Rnw-aD6GNAAAAAA%3D%3D",
            "extensions": [
                "26 days ago",
                "CA$50 a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "salary": "CA$50 a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Developer job at Affinity. Victoria, BC. Job Description:\n\nOn behalf of our client, Affinity is looking for an Android Developer to support the upgrade of Android 10 internal applications to function on Android 11 OS devices.\n\nResponsibilities:\n\n• Work with the Application Support Team to upgrade three Android 10 internal applications to function on Android 11 OS devices\n\n• Work with Application Support Team to convert three Android internal applications from Java to Kotlin\n\n• Produce or enhance technical documentation (e.g. architecture designs, functional designs, release notes, deployment documentation)\n\n• Assist with application testing and provide rework / bug fixes as necessary\n\n• Ensure quality and completeness of the project delivery\n\n• Ensure adherence to operational standards, guidelines, and regulatory requirements\n\nQualifications:\n\n• Experience developing Android applications in Java or Kotlin\n\n• Experience upgrading Android applications from Android 10 to Android 11 or higher\n\n• Experience with Android APIs, including location services, camera, notifications, and storage management\n\n• Solid knowledge of Android UI/UX best practices\n\nSkills that would be an asset:\n\n• Experience with applications that accept payment transactions\n\n• Experience working in an application support or application maintenance environment\n\n• Knowledge of mobile security best practices\n\n• Experience with SAP UltraLite databases\n\nHourly Rate: $100-$105 Per Hour.\n\nAffinity Earn:\n\nKnow someone who’s great for this, or any of our open roles? Earn up to $4,000/year for each successful referral through Affinity Earn. You can also earn up to $50,000 for helping us find new clients. Learn about our referral program at or browse our jobs & follow us at\n\nAbout Affinity:\n\nAffinity Group is a technology and business consulting and services company. We believe in creating long term relationships between clients and consultants that foster a mutually beneficial partnership. Affinity is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All employment is decided on the basis of qualifications, merit and business need.\n\nFor more information on Affinity, please visit\n\nJob Number: 11233",
            "apply_options": [
                {
                    "title": "Audio Mint",
                    "link": "https://audiomint.net/library/job/android-developer-at-affinity-victoria-bc-NWk5RGZ2dHFXMmhZZmJMcmJxcHdONk5xTFE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBhdCBBZmZpbml0eSBWaWN0b3JpYSwgQkMiLCJjb21wYW55X25hbWUiOiJBZmZpbml0eSIsImFkZHJlc3NfY2l0eSI6IlZpY3RvcmlhLCBCQywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJQejY2dHU4Um53LWFENkdOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "p2 - senior android developers x 2.",
            "company_name": "Randstad",
            "location": "Toronto, ON, Canada",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=GdDdo3BOWKQfNYM4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCMBBAce0nuHiz1EQKLnV0EBwUxL1cm6NNiXchFyTf4tcalze9x2u-m6aPHRxAib0kQHZJvANHHwoSKSkU6EwVbjJWCdO0gDBcReZA2_OSc9TeWtVgZs2Y_WQmeVthGqXYVUb9Y9AFE8WAmYbudCwm8rzfPeutNg48w0uScJYWHvcWLsjo8AeqZ7NWnQAAAA&shmds=v1_AUFQtON_PUbjjx3Hp6tE9MHmCXS3Fe0ARz0L86OQqFF8ZKZsMw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=GdDdo3BOWKQfNYM4AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d4643ccfb739f82b585005c90e09bd05bd83209c3863972db8c.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Are you a Senior Android Developer looking for a new opportunity?\nAre you looking for a new contract opportunity?\n\nWe are pleased to offer you a new contract opportunity for you to consider: Senior Android Developer\n\n-Start: ASAP\n-Estimated length: 8 months\n-Location: Toronto\n-Hybrid role- 3 days a week\n\nAdvantages\nYou will have an opportunity to work with a leading employer in the local market.\n\nResponsibilities\n- Have a voice in the architectural definition and implementation of various key technology pieces\n- Translate business requirements into technical design specifications\n- Participate in the product definition phase, daily scrums, grooming sessions and story refining\n- Implement robust unit tests, including edge cases, usability and general reliability\n- Use git to create pull requests, review code and merge branches\n- Collaborate with the team and participate in knowledge sharing\n- The position requires including and implementing Agile Scrum development methodologies in every research, analysis, prototyping and interfaces development initiatives.\n\n- Openly expose problems and turn them into learning and team bonding experience\n\nQualifications\n- Minimum 4 years of experience with Android development (Kotlin, Android SDK, Java)\n- Deep understanding of Android SDK, performance, and optimization (ie. AsyncTasks, Adapters, Fragments, Activities, Threading, etc.)\n- Solid and demonstrable understanding of object-oriented design patterns and principles\n- Strong understanding of mobile user interface guidelines and best practices Comfortable with integrating RESTful web APIs and JSON Experience with planning and writing technical documentation\n- Superior problem solving and risk management skills Strong initiative, priority setting, and\n- Collaboration skills Experience with Jetpack Compose\n\nNice to have:\n- Experience with Android TV Experience with Kotlin Multi-Platform Experience with GraphQL\n- Experience with iOS native development SQL and relational database fundamentals\nUnderstanding of code obfuscation & encryption techniques Knowledge of Chromecast implementation and optimization\n\nMust have qualifications\n- Developer - Mobile 5-8 years\n\nSummary\nDo you have this experience? If you answer YES, then please apply IMMEDIATELY to so we can then discuss your experience and interest in this opportunity!\n\nRandstad Technologies Group\n\nCanada's largest provider of IT Staffing Solutions, offering hundreds of permanent and contract opportunities across all roles, levels and platforms. Our Web-based tools help you see and apply for jobs matched automatically to your skills and preferences. When you're ready to interview we meet with you in person to help you build the technology career path you've always wanted. Visit to get started!\n\nRandstad Canada is committed to fostering a workforce reflective of all peoples of Canada. As a result, we are committed to developing and implementing strategies to increase the equity, diversity and inclusion within the workplace by examining our internal policies, practices, and systems throughout the entire lifecycle of our workforce, including its recruitment, retention and advancement for all employees. In addition to our deep commitment to respecting human rights, we are dedicated to positive actions to affect change to ensure everyone has full participation in the workforce free from any barriers, systemic or otherwise, especially equity-seeking groups who are usually underrepresented in Canada's workforce, including those who identify as women or non-binary/gender non-conforming; Indigenous or Aboriginal Peoples; persons with disabilities (visible or invisible) and; members of visible minorities, racialized groups and the LGBTQ2+ community.\n\nRandstad Canada is committed to creating and maintaining an inclusive and accessible workplace for all its candidates and employees by supporting their accessibility and accommodation needs throughout the employment lifecycle. We ask that all job applications please identify any accommodation requirements by sending an email to View email address on randstad.com to ensure their ability to fully participate in the interview process. show more",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/-385082095473012445?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJwMiAtIHNlbmlvciBhbmRyb2lkIGRldmVsb3BlcnMgeCAyLiIsImNvbXBhbnlfbmFtZSI6IlJhbmRzdGFkIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04sIENhbmFkYSIsImh0aWRvY2lkIjoiR2REZG8zQk9XS1FmTllNNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Software Development Engineer (Android), On Road Transporter Experience",
            "company_name": "Amazon Development Centre Canada ULC",
            "location": "Toronto, ON, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=yvwWtJ-fwAt_9v2oAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_03OuwrCQBCFYWx9BKspVTQRwcZUEkUQUfDSKpNkTFaSmWV30OCj-jSuYGFzmh8OX_fd6V6OctMnOoIlPagW2xArrLg0TOSgv-DCiSkGI9gzHAQLODlkb8VpyKvWkjPEOcEYNpKBJ3R5BcKwFilr6iWVqvXzOPa-jkqvqCaPcmliYcqkje-S-e9cfRUQtkal63Q2aSPL5TBZNPgKX_-0NEzQpshYIJy3KRiGkzhhlYDcjX7pA9H5aQTdAAAA&shmds=v1_AUFQtONa6ZY0MCAautvLKW3JfUMlOY5OTt5xNAoERdrHPxA1zw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=yvwWtJ-fwAt_9v2oAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d46067aa3d22f5147af7454ab97ca001f312715a4413f72e852.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "• 3+ years of non-internship professional software development experience\n• Experience programming with at least one software programming language\n• 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n• 2+ years of Android development experience\n\nCome join the team that works on the latest delivery features for our Amazon customers and Delivery Associates.\n\nThe Transporter Learning and Compliance team works on enhancing the driver experience and provides enriched data and inferences about work performed by delivery providers during Last Mile Delivery Execution Phase.\n\nThe team you'd be joining provides transporters with knowledge, contextual help, and experience that enables gains in productivity (Service Time), quality (First Time Delivery Success), engagement (Attrition) and compliance to the local regulations.\n\nAre you interested in developing cutting-edge technology that will help Amazon deliver packages worldwide efficiently and quickly? The Amazon Flex mobile team focuses in providing smart and efficient mobile solutions that scales to delivering millions of packages every month. It is still Day1 in the Last Mile Technology space!\n\nAmazon Flex is the system that works with crowd-sourced and third-party delivery partners to complete all of Amazon’s deliveries. Our Amazon Flex application works in concert with our advanced logistics systems and technology. These technologies allow delivery partners to onboard, schedule delivery times in advance or on demand, and be guided through their deliveries with in-app mapping, navigation, and much more. Our ability to engage with, serve and provide a world-class experience to both customers and our delivery partners has become more critical as we continue to expand the number of delivery partners and target faster deliveries to our customers.\n\nKey job responsibilities\n• Being part of a customer obsessed company and working as part of this team, you’ll be responsible for the design, development, test, and deployment of a range of products that make it possible to deliver packages to customers in two hours or less all over the world.\n• You will have an opportunity to conceptualize, design, build, test and own software systems.\n• You will influence the technical direction of the team, work with many different technologies.\n\nIf you are a software engineer with a creative flare, problem-solving skills, exposure to various technologies such as Swift and Objective-C and have the desire to help drive Amazon's next generation of delivery, we want to talk with you.\n\nA day in the life\nAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\n1. Medical, Dental, and Vision Coverage\n2. Maternity and Parental Leave Options\n3. Paid Time Off (PTO)\n4. RRSP\n\nIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!\n• 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n• Bachelor's degree in computer science or equivalent\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status.\n\nOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=dfd280f3928e2be5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Amazon/Job/Software-Development-Engineer-(Android),-On-Road-Transporter-Experience/-in-Toronto,ON?jid=0f991b66ea5d90e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs.ca",
                    "link": "https://www.jobs.ca/offer/software-development-engineer-android-on-road-transporter-experience/7194c6dd-475e-4114-8f25-c19d58300bb2_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/software-development-engineer-android-on-road-transporter-experience-amazon-development-centre-canada-ulc-JV_IC2281069_KO0,68_KE69,105.htm?jl=1009500840514&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/I3hCIivYP_R-nphq_IsOG7JxT-O0xGkEkhSZGNYvcLXRQH1eMZvSQQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/software-development-engineer-android-on-road-transporter-experience-at-amazon-4059092662?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/amazon/software-development-engineer-android-on-road-transporter-experience/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobOffer.com",
                    "link": "https://joboffer.com/jobs/Software-Development-Engineer-Android-On-Road-Transporter-Experience-451b493c263b83dc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBEZXZlbG9wbWVudCBFbmdpbmVlciAoQW5kcm9pZCksIE9uIFJvYWQgVHJhbnNwb3J0ZXIgRXhwZXJpZW5jZSIsImNvbXBhbnlfbmFtZSI6IkFtYXpvbiBEZXZlbG9wbWVudCBDZW50cmUgQ2FuYWRhIFVMQyIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6Inl2d1d0Si1md0F0Xzl2Mm9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior Mobile Developer - Canada - (REMOTE)",
            "company_name": "eXp World Holdings",
            "location": "Ottawa, ON, Canada",
            "via": "Startup Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=nJkAARc63QpinWZRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3OsQrCMBCAYVz7CE43VqmNCC66qUURakEF3cqlPdJIzIUkaN_Jl7SCy883_slnlGwuZDV7KFlqQ7CjFxl25GEGW7TY4oD0XJTVtZgMPLKEQOibDtjCnlkZGq-7GF1YCRGCyVWIGHWTN_wUbElyLx4swy916NCTMxipXiznfe6smqZ0d3Bjb1o4sGm1VQG0hSpGfGMG1Sn7j3wB4e60qa4AAAA&shmds=v1_AUFQtOOSLiccj4oNAVGeULxuExN4IFdOyVuYFSShaJ8m9LQj5Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=nJkAARc63QpinWZRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d46aaba4f7714d231e1f27bb44cb4863eb1decd6ee6ad3e65d1.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "We are one of the first all-remote companies with 2,000+ team members utilizing our virtual office called eXp World. This role is work-from-anywhere in Canada.\nWho is eXp?\nDoing the audacious is part of eXp Realty’s DNA. We are a company that rewards creative minds who can offer bold solutions, where opinions matter, anything is possible and the outcome can be revolutionary. As a global full-service real estate brokerage utilizing a 3-D, fully immersive, cloud office environment, offering 24/7 access to collaborative tools & training, eXp has broken the traditional mold of real estate. We are doing big things.\nCome join us at eXp Realty – a 7x Glassdoor Best Places to Work organization!\nWhat you will do:\nAs a Senior Mobile Developer, you will be responsible for providing definition and implementation through hands-on management of a software development team leveraging their full SDLC experience and agile project management best practices defined by the company. You are responsible for the execution of software development projects to achieve the company’s strategic objectives.\nYour main responsibilities are to provide technical leadership, and provide guidance based on your experience creating successful mobile apps. You will need to be able to demonstrate ability to troubleshoot and analyze complex issues.\nYou're able to develop software solutions by studying information needs, conversing with users, and understanding systems flow, data usage, and work processes; investigating problem areas; following the software development lifecycle.\nIn this role you will focus on delivering products and solutions that directly impact internal and external user’s day-to-day productivity. You must be able to balance the desired system “elegance” against the needs for rapid delivery.\n• Proficient in mobile application design, prototyping, and development, with a strong emphasis on establishing and adhering to standard coding practices; experienced in managing directed assignments and effectively coordinating team efforts.\n• Skilled in mentoring junior team members and overseeing the entire product development lifecycle, from concept and design to development, implementation, and post-implementation evaluation.\n• Collaborating with product development, architecture, and SRE teams to build a comprehensive product roadmap.\n• Accountable for creating and documenting software development processes, reporting on development capacity and efficiency, and ensuring that the development squad's needs are fully met in areas including UI, UX, DevOps, and Product support\n• Responsible for assisting the team in removing blockers and aligning resources for effective problem triage, along with supporting various functions of the business, including dev ops, code maintenance, troubleshooting, and system documentation, particularly during new product launches and as the team gains proficiency in the eXp Enterprise system.\n• Additionally tasked with handling other accountabilities as assigned, ensuring a flexible and responsive approach to the evolving needs of the business.\n• Remain current with emerging technologies and trends in mobile development, particularly Flutter/Dart, while ensuring mobile applications comply with security standards and user data protection. Provide expert oversight and guidance on UX design to meet established UX goals and development practices.\n• Oversee the implementation and management of build pipelines for automated testing, building, and deployment processes, enhancing development workflow efficiency. Collaborate with external vendors and third-party services for solution integration, and plan and manage the internationalization and localization of mobile applications for global accessibility.\n• Proactively identify and manage risks in mobile development projects, devising strategies for mitigation, and stay updated on regulations and requirements of key platforms like the Apple AppStore and Google Play Store, ensuring compliance and relevancy of mobile applications.\n\nHow you will grab our attention:\n• Required: Bachelor's degree or equivalent experience, with a preference for a Master's degree, coupled with a minimum of 2 years in a leadership role within an engineering team and at least 5 years of experience in Software Engineering, including building mobile applications using web technologies.\n• Demonstrated expertise in iOS and Android development, with over 4 years of experience and deep knowledge of iOS frameworks and Android SDK, as well as proficiency in multiple programming languages and environments including Dart/Flutter, Swift, Kotlin, and JavaScript.\n• Exceptional mentorship, coaching, and communication skills, with a strong ability to work effectively with both business and technical teams, and a high degree of creativity and problem-solving ability.\n• Strong organizational and process management skills, with a specific focus on mobile UI guidelines and frameworks, and experience with AWS being an added advantage; ability to set and manage priorities effectively.\n• Proficiency in implementing automated testing platforms and unit tests, with a solid understanding of RESTful APIs, third-party SDKs, and a strong commitment to maintaining high standards in software engineering practices.\n\nIf you think you’d make a great match for this position but don’t meet all the requirements, we would still encourage you to apply!\nWhat eXp Canada provides:\n• Medical, Dental, Vision, Long-Term Disability\n• Life Insurance and AD&D\n• Subscription to Calm and Vitality Wellness Programs\n• Paid Vacation\n• Paid Holidays\n• Up to 4 Paid Personal Days\n• 5 Paid Sick Days\n• One time stock option\n• $20/pay cheque for the first two pays of the month for your mobile phone/internet\n• RRSP employer match will be available in the near future\n• Fully remote environment\n• Amazing company culture\n• And more..\n\nThe starting base pay for this position is $120,000 CAD per year in our lowest geographic cost of living market and is dependent upon many factors such as location, experience, skills, and training. Base pay is only one part of the total compensation package offered to employees in recognition of their hard work and is determined within a range to allow for growth and development within a role.\nEEO Statement:\neXp World Holdings is an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disability or any other characteristic protected by law.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-mobile-developer-canada-remote-exp-world-holdings-2-5819802?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ARemoteWork",
                    "link": "https://aremotework.com/senior-software-developer-ai-permanent-4331.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciAtIENhbmFkYSAtIChSRU1PVEUpIiwiY29tcGFueV9uYW1lIjoiZVhwIFdvcmxkIEhvbGRpbmdzIiwiYWRkcmVzc19jaXR5IjoiT3R0YXdhLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJuSmtBQVJjNjNRcGluV1pSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Senior Android Software Engineer",
            "company_name": "PressReader",
            "location": "Richmond, BC, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=weBCHL-bV9Ur4UPnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNQQrCMBBAUdz2CK4G3Ik2IoigKy0iuJL2AGWajEmknSmZgL2Ll7Vu_vL94rsojg1xlAQXdkmig0Ze-YOJ4MY-MlGCLTykAyVMNoAw3EV8T8tzyHnUkzGqfek1Y462tDIYYepkMm_p9J9Ww8yNPWZq94fdVI7s16tnItWa0M2DyFBHGwZht4FrtYEKGR3-AJC4_Q-eAAAA&shmds=v1_AUFQtOOmQFqyojgXQeSVEwe-ODPGs_gV8einzPjb1Vm-JJmcZw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=weBCHL-bV9Ur4UPnAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d4652a142ced02f46f5c9732056ad0222baef14f38046beefa7.gif",
            "extensions": [
                "26 days ago",
                "CA$110K–CA$120K a year",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "salary": "CA$110K–CA$120K a year",
                "schedule_type": "Full-time"
            },
            "description": "PressReader is a rapidly growing technology company that partners with the world’s leading publishers to deliver content to millions of users in over 160 countries. Our progressive approach to digital distribution has allowed publishers such as The Washington Post, The Guardian, Newsweek, Rolling Stone, The Globe and Mail, and Vogue to find new audiences through business partnerships, including airlines, hotels, cruise ships, libraries, and thousands of other companies worldwide.\n\nOur technology also powers Branded Editions (BE) - a white-label solution that enables publishers to deliver their digital content in interactive ways. BE allows them to build a customizable platform that supports a wide range of revenue opportunities.\n\nWe have a full-time opportunity for a Senior Android Software Engineer to join our Engineering Team.\n\nAs part of the Engineering team, you will work on an award-winning digital platform, and work across various stages of the software development cycle. You will use your proven experience in Android software development to heighten our current and future projects. You will help shape the culture and success of our Engineering department.\n\nThis is a great opportunity for a developer who has about 5+ years of experience working with Android applications as part of a professional team. Solid experience with Kotlin and Java is essential.\n\nIn this role, you will:\n• Design and develop key software components for PressReader applications, both baseline and branded editions.\n• Deliver code with top-tier quality while adhering to development best practices, employing test-driven development methodologies, and supporting delivery automation.\n• Engage in estimating project efforts and timelines for delivery.\n• Take charge in conducting peer design and code reviews.\n• Identify technical, schedule, and other potential project risks, providing pertinent feedback.\n• Actively collaborate with teammates, both mobile (iOS and Android) and backend, and maintain effective communication with project stakeholders to ensure smooth and predictable project progression.\n• Create and uphold high-caliber technical documentation outlining software designs and solutions.\n• Coach and/or mentor junior engineers on the team.\n\nYou may be a great fit if you have:\n• Minimum of 5 years' experience in developing Android applications.\n• Proficient in crafting reliable and scalable software systems.\n• Extensive knowledge of Kotlin, Java and Android SDK.\n• Various dev. tools like Jetpack, Compose, Dagger, Android Studio, Gradle, Git.\n• Design patterns and frameworks like RxJava, Coroutine, MVI, MVVM, Clean Architecture.\n• Testing tools: Junit, Mockito, Robolectric, Espresso.\n• Proficiency in refactoring complex code to enhance testability and maintainability.\n• Knowledge or experience in test-driven development and agile/iterative development methodologies.\n• Exceptional communication skills, both written and verbal, coupled with strong interpersonal abilities.\n• A team-player mindset with a willingness to broaden skills and actively contribute ideas and knowledge.\n\nBonus points if you:\n• Hold a Bachelor's Degree in Computer Science.\n\nWhy us for your next career adventure?\n\nPressReader offers a hybrid work environment to balance the flexibility of working from home and being together to collaborate, celebrate, and connect. This position is based in our Richmond, BC office and requires to be on-premises three days a week. When not in the office, employees have the opportunity to work remotely.\n\nPressReader is committed to providing a fair compensation package which include a 100% employer-paid health, dental, and vision benefit plan; 15 paid vacation days to start; health and wellness days and bereavement days; reimbursements for professional training and membership in professional associations; fitness subsidy and more, along with a chance to be working with amazing people. The pay range for this role is $110,000 to $120,000, depending on experience.\n\nWe thank everyone who is interested in our role. Only qualified candidates legally eligible to work in Canada will be directly contacted for this position.\n\nIf you don’t see yourself fully reflected in every job requirement listed for this job, we still encourage you to apply. We are committed to creating a more equitable, inclusive and diverse company and we welcome applicants of all genders, ages, ethnicities, cultures, abilities, sexual orientations, sexual identification, and life experiences. If you require accommodation in completing any pre-employment assessments or applications, interviewing, or otherwise participating in the recruitment process, please email people@pressreader.com.\n\nFinally, sometimes emergencies happen and you may need to reschedule an interview. We understand. Please let us know without worrying about losing the opportunity or your credibility.\n\nTo apply, please submit your resume, and a cover letter explaining why you are the right person for this role.\n\nThis is a great opportunity for the right candidate.\n\nWe can’t wait to meet you!",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=ed287094ac1b7447&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/PressReader/Job/Senior-Android-Software-Engineer/-in-Richmond,BC?jid=c0367d16efcc308f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/senior-android-software-engineer-pressreader-JV_IC2303209_KO0,32_KE33,44.htm?jl=1009569628969&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-android-software-engineer-pressreader-6077436?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/m1NueNUfy9LhsAKf-z8mGPDkj51cZc4rhUGPXa4YqBfyAvi9JjVO0g?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/5474492696252661088?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/senior-android-software-engineer-at-pressreader-4113237958?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Dice",
                    "link": "https://www.dice.com/job-detail/216ea3ca-f346-48e1-827f-0cae4dbd4f71?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlByZXNzUmVhZGVyIiwiYWRkcmVzc19jaXR5IjoiUmljaG1vbmQsIEJDLCBDYW5hZGEiLCJodGlkb2NpZCI6IndlQkNITC1iVjlVcjRVUG5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "iOS/Android Developer at BQ International Ltd Régina, SK",
            "company_name": "BQ International Ltd",
            "location": "Regina, SK, Canada",
            "via": "Audio Mint",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=g6DVFAPvCQdBaJ89AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_23NOwrCQBCAYWxzBKupQ8yKYKOVDxAfoMYDhEl22KysM8vuIrmSZ7D0YmphZ_N3P1_2HGQne7yoBesgVsOa7uTEUwBMsDzDlhMFxmSF0cEhaaheD2MZC7jsYQQ7aSAShrYDYdiIGEfDeZeSjzOlYnSliemzt2UrNyVMjfTqKk38po4dBvIOE9WT6bgvPZs8_6tahop-bgErZNT4BqhX3m2-AAAA&shmds=v1_AUFQtONECOdb3VvQ25f5ziG_1gKjEn0HUvOlTER2ST_wsaD7iQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=g6DVFAPvCQdBaJ89AAAAAA%3D%3D",
            "extensions": [
                "16 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "16 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "iOS/Android Developer job at BQ International Ltd. Régina, SK.\n\nTerm: January 4, 2021 to December 31, 2021 with possible extension\n\nKey Skills/Requirements:\n• Experience in mobile development of iOS or Android or both (more iOS strength is preferable).\n• Experience in mobile cross platform development, such as Xamarin, React Native.\n• Knowledge of RESTful APIs.\n• Experience in OOP using C#.\n• Experience in building relational dataset with SQL or Entity Framework.\n\nAssets:\n• Experience in Agile development.\n• Experience in team development using VCS with Git, SVN or Mercurial.\n• Knowledge of Azure cloud platform.\n• Experience working with Azure B2C and OAuth.\n• Knowledge of the iOS build and deployment process (working with provisioning profiles and certificates, tooling selection, app submission, XCode, TestFlight). MVVM pattern, Reactive extension.\n\nDescription of Duties:\n• Work within a small Development Team of 5 to publish updates to the iOS and Android apps which are commercially available to Canadian farmers. Updates include adding features, fixing bugs, responding to customer enquiries and reducing technical debt. The app is built on a relational local database and it's focus is data entry. It includes the ability to do a 2 way sync with a multi-tenant server database.",
            "apply_options": [
                {
                    "title": "Audio Mint",
                    "link": "https://audiomint.net/library/job/iosandroid-developer-at-bq-international-ltd-regina-sk-NGk5TGZ2RmpYMkpmZkxQdWI2MXlQNlJuSWc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Mobot, Inc.",
                    "link": "http://mobotinc.com/office/job/senior-server-administrator-at-bq-international-ltd-regina-sk-ZThrRXA5WmRyYlBGZmFwa1dnQkZHL0tGb1E9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Titanic | Trading LLC",
                    "link": "https://titanictradinguae.com/office/job/iosandroid-developer-at-bq-international-ltd-regina-sk-RTVPQkJtTlUxSllsd2s3MlVnRHdrSm1NTkE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jedmorrell.com",
                    "link": "http://jedmorrell.com/.joblib/job/sap-developer-at-bq-international-ltd-regina-sk-TTF1QUtaMnNTdGFmenVyaEVyOWE2WGs9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Wecleanhoods.com",
                    "link": "https://wecleanhoods.com/.career/job/iosandroid-developer-at-bq-international-ltd-regina-sk-RXVpQmV6aWppaXltVlUzUTBMUnlmUmllQVE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MvQW5kcm9pZCBEZXZlbG9wZXIgYXQgQlEgSW50ZXJuYXRpb25hbCBMdGQgUsOpZ2luYSwgU0siLCJjb21wYW55X25hbWUiOiJCUSBJbnRlcm5hdGlvbmFsIEx0ZCIsImFkZHJlc3NfY2l0eSI6IlJlZ2luYSwgU0ssIENhbmFkYSIsImh0aWRvY2lkIjoiZzZEVkZBUHZDUWRCYUo4OUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Senior Software Developer - Mobile Applications (Android)",
            "company_name": "Helcim",
            "location": "Calgary, AB, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=6H4qq4in9QM1JbOtAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNQQrCMBBFcdsjCMIsVWojghtdVQVFEIQeoCTpmEbSTMgErZfyjMbNh8fj8YvvpLg36C1FaOiR3jIinPCFjgJGWMGNlHUIdQjOapkseYZ57btItltkfyUFjDLqHsjDmcg4nO77lALvhGB2leGUO11pGgR5VDSKJyn-T8t9_gtOJmw32_VYBW-Wsws6bQewHo7SGRk_JdSHMoOXnfwBdjo9qbEAAAA&shmds=v1_AUFQtONnYbP_CJi6Y71EbuboTj7zE69vnHcngUdI7FJjtbYt8g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6H4qq4in9QM1JbOtAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d465ffde36cababa0d7c16e64d88b17d6d241352d8f3677965a.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "ABOUT HELCIM\n\nHelcim was founded with a mission at heart: to be the world’s most loved payment system. We believe that by offering small businesses in North America a decidedly human payment solution where it is easier to sign up and use while being transparent and affordable, we can empower them to grow and prosper. Simply put, helping small businesses thrive is at the very core of our business model, and we think that’s a great way to do business.\n\nFrom the very start, we knew that we wanted to be different from every payment processor out there. We want the merchants we serve to feel supported and see us as a trusted partner rather than simply just another “cost of doing business.” We are relentless in our pursuit to provide a radically transparent and honest payments solution that flat out saves business owners money, all while treating them like human beings.\n\nTHE POSITION\n\nHelcim is searching for a Senior Software Developer (Mobile Applications - Android) to join the mobile app development team and be responsible for developing the next generation of payments technology. We're looking for a talented and experienced individual with a passion for coding, enjoys learning about the latest technologies, strong problem-solving skills, and a user-focused approach to software development.\n\nAs a Senior Software Developer you will be responsible for building and deploying high quality software solutions while working in a fast moving product development lifecycle. You will continually be involved in mentorship and coaching activities ensuring you and your team are delivering at a high level.\n\nAs a member of our team, you will be working on numerous ongoing and new projects. Helcim is a fast-paced, high-demand company and the successful candidate will work well in that environment. The ideal candidate will embody our values and culture, and be a steward of The Way of the Helcim (see link below to our culture book).\n\nHere are the things you’ll own day to day:\n• Lead the design and development of hybrid mobile applications for Android and Desktop (Windows/Mac).\n• Architecting new and existing systems to be scalable, performant, fault tolerant, and secure with an ability to scale for moderate to high throughput using Golang and/or PHP.\n• Collaborate with product managers (mobile and cross domain), product designers, marketing and other developers to define app features and functionality.\n• Write clean, well-tested code that meets product requirements, ensuring minimal defects or issues escape into production.\n• Building systems through event driven architecture with Apache Kafka.\n• Troubleshoot and debug mobile applications to optimize performance.\n• Ensure the security and data protection of mobile applications.\n• Assist in recruiting and hiring talent to the organization.\n• Coach and mentor junior developers, providing guidance, support, and feedback to help them grow in their roles.\n• Conduct code reviews and provide constructive feedback to improve code quality and adherence to best practices.\n• Be a champion of test automation - lead & maintain the post deployment and release test automation pipelines.\n• Building reactive UIs with Vue.JS or an equivalent Javascript web framework such as Angular or React.\n• Discovering new insights through our BigQuery data warehouse.\n• Deploying and maintaining projects through Cloud Infrastructure such as AWS or Google Cloud Platform.\n\nA SUCCESSFUL CANDIDATE IS;\n• In search of a role where your work is highly impactful to your peers, and your efforts are visible in the products and services you contribute to.\n• Excited by the opportunity to join a growing & scaling company and the unique challenges that it poses.\n• Passionate for continuous learning, keeping up to date with tech industry trends, and researching and implementing excellent solutions to challenging problems.\n• An expert in coaching and mentoring junior developers to help the team grow.\n• Willing to try new things and believes that failure leads to inquiry and improvement of technical prowess and approach.\n• An expert using observability platforms, such as Elastic, Splunk, or Datadog.\n• Highly skilled in leading incident response and resolution.\n• Experienced and takes pride in writing mission-critical, highly available software.\n• Passionate about state management libraries such as Redux, NgRX, Effector, Mobx or other libraries that use similar patterns.\n• Invigorated by challenge, and go the extra mile to achieve your goals.\n\nKEY COMPETENCIES\n• 6+ years of professional software development experience.\n• 3-4 years of hybrid mobile app development experience (Android).\n• Bachelor’s degree in Computer Science, Software Engineering, or a related field.\n• Strong knowledge of mobile UI/UX design principles, patterns, and best practices.\n• Familiarity with RESTful APIs to connect mobile applications to back-end services.\n• Knowledge of cloud services such as AWS, Google Cloud, or Firebase.\n• Experience with MySQL or other SQL database systems at scale. Familiarity with cloud-native databases is a plus.\n• Experience with Docker and Kubernetes, or other containerization software(s).\n• Proficiency in one or more of programming languages such as Kotlin, Java, and/or React Native.\n• Experience with hardware related third party SDK integration.\n• Payment industry - software development experience.\n• Knowledge of mobile testing frameworks and tools.\n• Experience with CI/CD pipelines for mobile applications.\n\nNot checking every box? Please apply anyway! We know that candidates have different experiences that may make them a great fit for this position and for Helcim. We believe that diversity and having an inclusive culture is not only the right thing, but key to our long-term success. Diversity brings more experience, view-points, knowledge and insight about our future. We also want to provide an accessible interview process, so if there’s any accommodations that would make your experience more comfortable, please let us know.\n\nHELCIM CULTURE IS;\n\nBeing builders: We build things ourselves and we build them well. We use technology and our creativity to overcome challenges that would seem beyond the capability of a company our size. We improve what is already there, invent our way out of problems and we never stop dreaming of better.\n\nChoosing the harder path: We believe that the right decisions are usually the harder ones, so we embrace the challenge and endure when others quit. We choose what is difficult because it is more rewarding in the long-term, and makes us resilient, so that we not only survive but thrive.\n\nCreating trust: We earn trust by striving to be our best selves every day and by lifting those around us. We recognize that trust is hard to earn, easy to lose and is tested continuously over time, so we make trust our way of life.\n\nContributing to a company of many: We are stronger because of our collective passion, diversity, and fellowship. We believe only great teams can accomplish great things, and we ask the very best of each other. Together we create our own future.\n\nWORKING AT HELCIM\n\nJoining Helcim means joining a fast-growing company where we have found coming together makes us a strong company. We have a drive to achieve big things which creates amazing opportunities for everyone willing to work hard and contribute to that growth - opportunities for faster career growth, for more learning, more impact, and accelerated experience - all while surrounding yourself with incredible people working on interesting problems and delivering great results.\n\nHere are some of the reasons we attract such great people:\n\nThe Way of the Helcim: At Helcim, we build a team of engaged, caring and intelligent people. In return we provide an environment where you can be excited to come to work each day and tackle these challenges with an amazing team. Learn more about Helcim’s unique culture and environment in our culture book The Way of the Helcim.\n\nHealth and dental benefits: Through our Group Benefits, you’ll get access to dental benefits, extended healthcare benefits for drugs, vision, paramedical coverage (e.g. massage therapists, dieticians, mental health professionals), counseling, health service navigation, life insurance, critical illness and disability insurance, and more. All of these benefits come into effect on Day 1 of employment!\n\nDedicated Health Spending Account (“HSA”): An additional budget available for you to spend on health-related expenses (e.g. eyeglasses, therapy).\n\nMaternity and Parental Leave: To help launch our team members into this phase of family life we have some additional benefits in place including salary top for the birthing parents and a bonding break for non-birthing parents.\n\nStock Options: Stock options enable our team to purchase Helcim shares at a future date at a specified price. Every team member, not just people leaders and executives receive equity (aka ownership in the company).\n\nVacation Time: All team members get paid vacation time and a company break in December so they can recharge when they need it.\n\nFlexible work location: Work and life happens at different times and places. This is why our team enjoys the flexibility of hybrid work and flexibility around hours of work, so we can all do our best work. Our hybrid work schedule offers flexibility to work from home on Tuesdays and Thursdays. Furthermore, our core hours give team members flexibility to manage other parts of their lives.\n\nTraining: Helcim will cover 50% of the applicable training costs of up to $500 per year.\n\nLOGISTICS\n\nJob type: Full-time\n\nHiring manager: Rahul Parakkat\n\nLocation: Hybrid, In Office Monday's, Wednesday's + Friday's\n\nCandidates must be eligible to work in Canada and be located in Calgary for this position.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=8647565ada6b1c46&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Helcim/Job/Senior-Software-Developer-Mobile-Applications-(Android)/-in-Calgary,AB?jid=d850be3f8a7399fb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Dice",
                    "link": "https://www.dice.com/job-detail/f67ebf87-4d54-479e-a6e5-703159c9ca43?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Work In Tech Job Board - Communitech",
                    "link": "https://www1.communitech.ca/companies/helcim-inc/jobs/42311042-senior-software-developer-mobile-applications-android?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/-R8RY-_zLiKLnC6mKKuWZJz17AiermDUrZZXijdrfYBvwApZeaVXtw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Headline Job Board",
                    "link": "https://talent.headline.com/companies/helcim-inc/jobs/42311042-senior-software-developer-mobile-applications-android?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.ca",
                    "link": "https://www.monster.ca/job-openings/senior-software-developer-job-number-edm01l5-calgary-ab--5850d202-5022-4fcd-b2f9-a6a0b7b51eac?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs.com",
                    "link": "https://www.jobs.com/en-ca/jobs/senior-software-developer-job-number-edm01l5-calgary-ab--5850d202-5022-4fcd-b2f9-a6a0b7b51eac?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIC0gTW9iaWxlIEFwcGxpY2F0aW9ucyAoQW5kcm9pZCkiLCJjb21wYW55X25hbWUiOiJIZWxjaW0iLCJhZGRyZXNzX2NpdHkiOiJDYWxnYXJ5LCBBQiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiI2SDRxcTRpbjlRTTFKYk90QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "ANDROID FRAMEWORK ARCHITECT",
            "company_name": "Epsilon Solutions LTD",
            "location": "Ottawa, ON, Canada",
            "via": "ZipRecruiter",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Slvezew0UwIjCnDMAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMuw6CMBQA0LjyCU539kENiYtOBFDxAUklcSQXbKCm9jbcGvkav1VdzniCzySI4iKVZZ7CTsaX7FbKE8QyOeRVllSwhCM1wAqHtgeysCfqjJpue-8db4RgNmHHHr1uw5aegqxqaBQPavhPzT0Oyhn0qo7WqzF0tpvNM8fa_LIrmZfXZBnOVQraQuk9vnEBZbGABC3e8QvX-HUWoQAAAA&shmds=v1_AUFQtONyfGRnh_6YxIuFsstneluPcPWWuTrVUCCR-m-iGEX-Mw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Slvezew0UwIjCnDMAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502680232baf3ba9a2d28/images/304b94a7859f8d461ac08cf4418bc37feb04182b57aaa1735797f77566bae6be.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Android Framework Architect\nOTTAWA // HYBRID // FULLTIME\n\nJob Description\nAs infotainment IVI Lead/Architect, responsible to refactor the existing product and improve the performance of the software\nAnalyse and triage and fix the issues reported by validation team\nResponsible to interact with team spread across multiple geography and get faster on time solution to the problems reported.\nMandatory Skills\n\nGood understanding of Android architecture and Android HAL Layer, preferably Android-O or later\nUnderstanding of Automotive SoC architecture(application processor and Vehicle processor)\nExperience in Android code base - Application layer (Java), JNI, Native frameworks(C )\nGood understanding of Android programming environment using Binders, Shared memory, IPC mechanisms, etc.\nGood knowledge in Android Services/Framework layer and its debugging\nProgramming experience preferably in Kotlin, C and C++\nExpertise in Vehicle Interface & knowledge on Infotainment systems\nDebugging skills to troubleshoot problems in any layer of Android\nApplication development for Android Infotainment systems covering following areas - Navigation, Connectivity (WiFi, BT), Projection (Android Auto, Carplay)\nTools: GIT & Gerrit, JIRA, Android source build system, Android debugging tools",
            "apply_options": [
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Epsilon-Solutions-LTD/Job/ANDROID-FRAMEWORK-ARCHITECT/-in-Ottawa,ON?jid=63407fb2701998bf&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://fr.ca.sercanto.com/detail/a/android-framework-architect_ottawa_50467223?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBTkRST0lEIEZSQU1FV09SSyBBUkNISVRFQ1QiLCJjb21wYW55X25hbWUiOiJFcHNpbG9uIFNvbHV0aW9ucyBMVEQiLCJhZGRyZXNzX2NpdHkiOiJPdHRhd2EsIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6IlNsdmV6ZXcwVXdJakNuRE1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior React Native Mobile Developer (iOS & Android) @WAZO (Canadian residents only)",
            "company_name": "Wazo",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=qqx9q6_LlUqYfm55AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2OQUoDQRBFcZsjuPoLkSTEGRHc6MYQQRA0aBaBbEJ1TzFTsa0autqQeCPP4QU8kqObB-9t_h_9nIzeVqxiGa9MseCZiuwZTxYkMe55z8l6zhjLcoVzzLXJJs0Ed-v5ZonxgpQaIUVml4a1OEzTcYILPFqAM-XYDQkPZm3i09uulN5v6to9Va2XYS1W0d5rUw52qHcW_A9b7yhzn6jw9ur68lD12k7P1vRpEMXLx_dX4IiFlONsMB5khv8v9Aubj-Vt0wAAAA&shmds=v1_AUFQtONe1M5OXKtfh2uosaeKNEdskriyvB-dZeJO3_cMP-zm6Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=qqx9q6_LlUqYfm55AAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "About Wazo\n\nWazo is a software editor of an API-first Unified Communication Platform designed for telco operators, service providers, and integrators. The platform provides:\n• An all-in-one application suite to support IP telephony, collaboration and customer relationship needs\n• A strong solution that can be deployed on any infrastructure and managed through a cloud administration interface\n• A complete set of application programming interfaces (APIs) to build new communication services and integrate Wazo into the core of their information systems\n• A native open source platform which provides security and freedom to customers.\n\nWazo believes that Unified Communication users should have more control over their communication tools and that businesses should be able to integrate innovative communication features into their business workflows. Wazo’s ambition is to take a significant part of the UCaaS market that is expected to generate over USD 260 billion of revenues by 2028.\n\nSince launching its solution in Europe in 2018, Wazo has successfully gained a foothold in this very competitive market thanks to its unique positioning and innovative IT approach: Wazo has already attracted more than 100,000 users and more than 100 Telecommunication Companies, Value-Added Resellers and Managed Services Providers. Wazo is now accelerating its development with the launch of its solution in the US.\n\nRole\n\nAre you a talented senior developer looking for a new challenge? Come meet us, we're hiring!\n\nReporting to the VP Engineering, you'll work closely with our Mobile development team, and our product and customer success teams to develop the communication solutions and experiences of tomorrow.\n\nThe keywords of our technical stack are: React Native, React JS, WebRTC, REST API, iOS & Android.\n\nJob Description\n• Develop, implement, and enhance various features of our iOS & Android mobile applications with a focus on real time audio and video communication\n• Design intuitive interfaces for quick user adoption\n• Contribute to the development of open-source libraries (React Native CallKeep)\n• Write and automate reliable unit, functional and end to end tests\n• Participate in improving our agile development methodology\n• Contribute to the elaboration of the mobile roadmap in close collaboration with our Product Owners\n• Keep abreast of current technologies and recent developments in mobile and media technologies.\n\nQualifications\n• Bachelor’s degree in Computer Science, Engineering, or related field\n• Minimum 5 years of professional experience in React Native mobile development\n• Proficiency in React Native, Swift, Objective-C, and Java and developing cross platform mobile applications for iOS and Android OS\n• Expertise in voice, video, messaging, and conferencing technologies and webRTC\n• Experience with SIP, SFU architecture and telecommunication infrastructure\n• Familiarity with Linux and Asterisk\n• Familiarity with cloud platforms such as AWS, Google Cloud, or Azure\n• Ability to learn new technology quickly, as well as a strong interest in doing so\n• Ability to work in a multidisciplinary team\n• Enjoy collaborating on open-source projects\n• A habit of staying up-to-date with new practices and technologies\n• French or English proficiencies, both is a plus\n\nWhy Apply to Wazo?\n\n✅ Our mission is to provide the best open source communication platform to allow anyone to build any communication use cases anywhere\n\n✅ We invest in our employees through career development & opportunities, social events, and competitive benefits\n\n✅ You get to collaborate with and learn from smart and creative people around the globe\n\n✅ Team spirit is not a motto: it is a reality\n\nTo keep our employees happy and motivated, we are always assessing the benefits we offer to ensure we are competitive. Here are some we’d like to highlight:\n• Full time permanent position – Canada Based\n• Full benefits covered by the employer\n• Competitive Compensation\n• 4 Weeks of vacation + Comfort Days\n• Work remotely – with possibility to work in the Quebec City office.\n• VRSP (independent)\n• Fun culture with a big opportunity to make an impact on our growing global team\n\nWe welcome everyone to apply to our positions. Wazo is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=1e05582c64387573&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Wazo/Job/Senior-React-Native-Mobile-Developer-(iOS-&-Android)-@WAZO-(Canadian-residents-only)/-in-Qu%C3%A9bec,QC?jid=97a57c63d748a80d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/senior-react-native-mobile-developer-ios-android-wazo-canadian-residents-only-wazo-JV_KO0,77_KE78,82.htm?jl=1009291224100&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUmVhY3QgTmF0aXZlIE1vYmlsZSBEZXZlbG9wZXIgKGlPUyBcdTAwMjYgQW5kcm9pZCkgQFdBWk8gKENhbmFkaWFuIHJlc2lkZW50cyBvbmx5KSIsImNvbXBhbnlfbmFtZSI6Ildhem8iLCJhZGRyZXNzX2NpdHkiOiJRdcOpYmVjIENpdHksIFF1ZWJlYywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJxcXg5cTZfTGxVcVlmbTU1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMkZ6VHpCaVpXd3RSR2c1UnpoRWNFaDRiRFF5WlY5MUxXVkthalV6TmtoblN6bGhOSEl5VkRWaFZXcHVTR2RsYzJ0T2FFUXpYMmRITlRoMU9GcGFYM0ZYUzA4M05FSk1VMU5TTVcxbFVGOXZibUYxTlROVVNYWm9UVzFWVkRoalNHRmFOekY2UjBONU0zVTNOVVo2U25KSlIzazRMWFpuVW5BMWRWOXNjQzFPWkdSSFkySTBRa05ZYmxCVmRtNVhaRTAyTkdSSU5rZHJUVlV5UlhveVdIUk5Rak0zZVhaaVV6aGtZMkY1TjBoR1dYaFpSVGc0ZEhsYVR6Tk5Ra2hFYW1acVlVSlJSVmRSYUZSSFZIUmFNMGMwTTJkMVFtc3ROVUprYjFWdGJVTlNaVk16VUd3MmVGQnFlakE0WjJOYU0xZENUSEZsVEcxNmVrRkZWMHN0UTB4blVqQlVNUklYWVVGTFJscGZSMUJNYjJJNWExQkpVRFk0ZW05MVFUQWFJa0ZHV0hKRlkzRm1WVEZ5Tkc5bU5GZE1ZVEJoYVhreU1FZElkR1UzY1RGdVRsRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Canada&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMkZ6VHpCaVpXd3RSR2c1UnpoRWNFaDRiRFF5WlY5MUxXVkthalV6TmtoblN6bGhOSEl5VkRWaFZXcHVTR2RsYzJ0T2FFUXpYMmRITlRoMU9GcGFYM0ZYUzA4M05FSk1VMU5TTVcxbFVGOXZibUYxTlROVVNYWm9UVzFWVkRoalNHRmFOekY2UjBONU0zVTNOVVo2U25KSlIzazRMWFpuVW5BMWRWOXNjQzFPWkdSSFkySTBRa05ZYmxCVmRtNVhaRTAyTkdSSU5rZHJUVlV5UlhveVdIUk5Rak0zZVhaaVV6aGtZMkY1TjBoR1dYaFpSVGc0ZEhsYVR6Tk5Ra2hFYW1acVlVSlJSVmRSYUZSSFZIUmFNMGMwTTJkMVFtc3ROVUprYjFWdGJVTlNaVk16VUd3MmVGQnFlakE0WjJOYU0xZENUSEZsVEcxNmVrRkZWMHN0UTB4blVqQlVNUklYWVVGTFJscGZSMUJNYjJJNWExQkpVRFk0ZW05MVFUQWFJa0ZHV0hKRlkzRm1WVEZ5Tkc5bU5GZE1ZVEJoYVhreU1FZElkR1UzY1RGdVRsRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}