{
    "search_metadata": {
        "id": "678502c060c3a018713eccd4",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/57e4defef8a908c9/678502c060c3a018713eccd4.json",
        "created_at": "2025-01-13 12:10:40 UTC",
        "processed_at": "2025-01-13 12:10:40 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIJTGl0aHVhbmlh&udm=8&fc=EuECCqICQUpHOUprUGs2OFl2NTVrN2cwdXE1cDl2SXllc2VXS3BuSnR1dXZPS0E3OUFWZ0VTQzlwSWRMZmQxNzJhaWdicFpNZ2hrYTVlTjQ4aTNRZDJMMXNtVm1nV2N1aFByS0xQYmZkb0FwNGJwQ3lyNDJLQU03bVZMR25fZmRMVHcxTnIxeDluSGdOUHJpRUEzT0JqU2pnLWQ1S2lZVkhFVXQtQzNkSGg0TkRhRXhUZndxdUdVVUVOUGIzcml6U2U0SWNnUmVQUklfN2JqMHdlTDZIbHZoaTdtSThmZ09GZlJLWUZvOXRDMUtMYllHMTZlcWc5bWQydzF2M3pXcDhsMWNhMnQ1SWN0SG01eGFPdTdhZVJydDRvbDJINUFPR3h5RXM1elESFnZ3S0ZaXzZ5RnZ5Tndia1A4T19JU0EaIkFGWHJFY293cVVYR3MwR3BBdnc1Zy11Qk9xSHpyOWt3SWc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/57e4defef8a908c9/678502c060c3a018713eccd4.html",
        "prettify_html_file": "https://serpapi.com/searches/57e4defef8a908c9/678502c060c3a018713eccd4.prettify",
        "total_time_taken": 1.22
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Lithuania",
        "location_used": "Lithuania",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1RUNDcUlDUVVwSE9VcHJVR3MyT0ZsMk5UVnJOMmN3ZFhFMWNEbDJTWGxsYzJWWFMzQnVTblIxZFhaUFMwRTNPVUZXWjBWVFF6bHdTV1JNWm1ReE56SmhhV2RpY0ZwTloyaHJZVFZsVGpRNGFUTlJaREpNTVhOdFZtMW5WMk4xYUZCeVMweFFZbVprYjBGd05HSndRM2x5TkRKTFFVMDNiVlpNUjI1ZlptUk1WSGN4VG5JeGVEbHVTR2RPVUhKcFJVRXpUMEpxVTJwbkxXUTFTMmxaVmtoRlZYUXRRek5rU0dnMFRrUmhSWGhVWm5keGRVZFZWVVZPVUdJemNtbDZVMlUwU1dOblVtVlFVa2xmTjJKcU1IZGxURFpJYkhab2FUZHRTVGhtWjA5R1psSkxXVVp2T1hSRE1VdE1ZbGxITVRabGNXYzViV1F5ZHpGMk0zcFhjRGhzTVdOaE1uUTFTV04wU0cwMWVHRlBkVGRoWlZKeWREUnZiREpJTlVGUFIzaDVSWE0xZWxFU0ZuWjNTMFphWHpaNVJuWjVUbmRpYTFBNFQxOUpVMEVhSWtGR1dISkZZMjkzY1ZWWVIzTXdSM0JCZG5jMVp5MTFRazl4U0hweU9XdDNTV2MiLCJmY3YiOiIzIn0="
    },
    "jobs_results": [
        {
            "title": "Mobile Engineer - Android (Engage)",
            "company_name": "Transfergo",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Bxzjtrk6tsn3hL05AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zWIMQrCQBAAsc0TrLZUiYkIFppKRAQxndiGTVwvK-duuL1AfJj_MxY2w8wkn0myLbVmT3AUx0IUYAl7uQflO8zGh47m4zprDUYYmhZU4KTqPE2LNsbOdnlu5jNnESM3WaOvXIVqHfKn1vZDZS0G6jxGqtab1ZB14hbFNaDYg4JTYIEbe-He0r_AgeMbyl644Q79GClcOLY9CuMX5bSCzrgAAAA&shmds=v1_AUFQtOMcgmRKk2dOI_y-BlCPUoBEj54-t20nrUlDo0R3O_bBSg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Bxzjtrk6tsn3hL05AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c060c3a018713eccd4/images/0a429e47660cd997d3824795d12f4d2462356ee56c5efca8bc7846f3e8f2e75f.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "TransferGo is a growing fintech scale-up on a mission to make the world a fairer place for migrants. We strive to provide tailored, more affordable financial services that make people's hard-earned money go further. Now in our 12th year, with over 370 employees in offices across Europe, we’re crafting a brilliant, relevant product that makes a difference in people's lives and the well-being of their families.\n\nWe’ve come this far by building a talented, diverse workforce on a fair culture and our strong values. Having this strong team of employees, we can serve those who really need our product to make their lives better.\n\nThe Engage Team is pivotal in transforming the booking and pricing landscapes. We're dedicated to ensuring the best user experience for all our customers. To achieve this, we are seeking a talented Android Engineer to join our dynamic Engage Team.\n\nHere’s what you’ll be doing as Android Engineer:\n• Collaborate with developers and stakeholders to build smooth and scalable Android applications\n• Participate in team processes (Standups, refinements, sprint plannings, retros)\n• Identify areas for improvement to enhance the quality of our application\n• Stay updated with the latest industry trends and technologies to create engaging, trendy, and innovative user experiences\n• Support existing features and deliver new one\n\nYou’ll report to our Engineering Manager.\n\nHere’s what we’d love from our new Android Engineer:\n• Expertise in Kotlin\n• Experience with reactive programming (RxJava)\n• Proficiency in MVVM architectural pattern\n• Skilled in RESTful API integration\n• Familiarity with AndroidX libraries\n• Adept at networking and working with RESTful APIs\n• Hands-on experience with Git and JIRA\n• Fluent in English\n• Minimum 2 years of experience in object-oriented and protocol-oriented programming\n\nAnd if you can also do this stuff, even better:\n• Experience with code quality tools: lint, sonarqube, circle CI\n• Gradle knowledge\n• Have experience with Dependency Injection (Dagger)\n• Understanding the Clean Architecture and Modularization\n\nPlease take a look at our tech stack in detail on stackshare.io.\n\nWhat we believe\n\nAt TransferGo, we offer competitive rewards to all people. We know that recognition is about more than just money, and we’ve fostered a culture of kudos to shine a light on the great work throughout the business, and the people making it all happen. We hold regular in person events to connect with each other and help all our TransferNauts to grow with a generous training allowance. We believe that empowering people makes for a happier and more effective workforce. This means we enable anyone who wants to pursue initiatives that deliver real value for our migrant customers.\n\nWhat we offer:\n• Be part of building a meaningful product in a growing fintech scale-up\n• We hire owners\n• A competitive rewards package\n• Generous holiday allowance (based on tenure)\n• Competitive healthcare insurance / wellbeing package from day one (based on your location)\n• An annual development budget of €1,000 to spend on your growth\n• We truly embrace flexibility and take a hybrid approach to our working style. Most of our team members come into their local office 2 days a week\n• If you are near one of our offices, we are a pet-friendly company and we enjoy regular opportunities to connect in person (we truly value in person connection on a regular basis and celebrate in style)\n\nMonthly salary starting from 3600 € (gross) depending on the level of experience.\n\nAt TransferGo, we are committed to the equal treatment of all current and prospective employees. We will not tolerate discrimination on the basis of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, marriage, civil partnership or any other protected category. We are proud of our diverse and inclusive culture and we strongly encourage suitably qualified applicants from a wide range of backgrounds to apply and join TransferGo. We look forward to meeting you!",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/mobile-engineer-android-engage-at-transfergo-918?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Meritocracy",
                    "link": "https://meritocracy.is/de/transfergo/mobile-engineer-android-91990?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIgLSBBbmRyb2lkIChFbmdhZ2UpIiwiY29tcGFueV9uYW1lIjoiVHJhbnNmZXJnbyIsImFkZHJlc3NfY2l0eSI6IlZpbG5pdXMsIFZpbG5pdXMgQ2l0eSBNdW5pY2lwYWxpdHksIExpdGh1YW5pYSIsImh0aWRvY2lkIjoiQnh6anRyazZ0c24zaEwwNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Senior Android Software Engineer",
            "company_name": "Shift4lithuania",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=HWhkygFllkCjDYplAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zWMMQrCQBBFsc0RrKaWmIgogjaKiCBaBWzDZrPJjqwzy-4Ek5t5PGOR5vOK937ynSW7whBygBPVgbGGghv5qGDgQi2SMQGWcOMKolFBW2CCK3PrzPxgRXzc53mMLmujKEGdaX7nTKbiPn9xFf9TRjveeafElOvtqs88tYtjYbGRjUOxnSJUgARPdIRdTCeAM8oAj45Qo1ejOqRwn4If6QnLmLsAAAA&shmds=v1_AUFQtOOpdNwH54wSokghFDVj3lF5VnXSsj_CfOAWnMwQ1WSZYg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=HWhkygFllkCjDYplAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Overview\n\nShift4 (NYSE: FOUR) is boldly redefining commerce by simplifying complex payments ecosystems across the world. As the leader in commerce-enabling technology, Shift4 powers billions of transactions annually for hundreds of thousands of businesses in virtually every industry. For more information, visit www.shift4.com.\n\nAre you a great Android Developer & Want to be part of something really big?\n\nWe are looking for uber-passionate senior Android developers to join the software product team responsible for designing, developing and deploying Shift4’s new built-for-cloud restaurant platform that delivers on a complete solution for restaurant operators of all sizes that marries point-of-sale, guest engagement, online & mobile ordering, payments, analytics, table reservation, loyalty and much more. (We call this platform “SkyTab POS”.)\n\nThe main focal point of the platform consists of beautifully designed and highly functional Kotlin business apps deployed on both custom and consumer hardware. We have huge plans for this platform and need to expand the team with the best and brightest to ensure we continue to out-innovate competition and change the basis of competition.\n\nResponsibilities\n• Hardcore coding in Java/Kotlin of high-performant business solutions.\n• Be an active participant in a high velocity scaled Agile process.\n• Work alongside other Software Engineers on the team to elevate technology and consistently apply best practices as they relate to the project and general software engineering concepts.\n• Collaborate cross-functionally with Business Analysts, QA, and other team members to achieve elegant solutions which satisfy business needs, goals, and objectives.\n• Provide recommendations for continuous improvement of development processes, technical solutions, and SkyTab itself.\n• Test “your own” code via unit, integration and acceptance testing techniques to ensure delivery and quality goals are met.\n• Diagnose and resolve issues with deployed systems using a variety of techniques including direct engagement with support personnel and customers.\n• Become an acknowledged technical expert and specialist for some parts of the platform. As a team, we know that not everyone can know everything, but as a Lead Engineer, you are expected to develop and expertise in some parts of the platform on behalf of the team.\n• Proactive assessment and analysis of existing systems to maximize quality and customer satisfaction, and minimize maintenance costs and other operational issues.\n• Aspiration for leadership roles, including potential to be a team or tech lead, are highly appreciated and could foster your future growth as our product team evolves.\n\nRequirements\n• An expert in Java/Kotlin programming, the Android 8 & 10 SDK and with Google’s Android design principles.\n• 6+ years of hands-on experience developing innovative Android apps (Java, Kotlin) targeting both business users and consumers.\n• A strong plus: Hands-on experience using RabbitMQ for data synchronization and replication, and RESTful APIs for fetching and upserting of transactions to the cloud back end.\n• Strong knowledge of Android UI design and ability to work closely with UI designers.\n• Expertise with maintaining transactionality with asynchronous offline mode applications, threading and performance tuning (our apps must be responsive and fast!).\n• Strives to ensure that solutions are a great fit and use to the target end user persona.\n• Experience working in an agile software development lifecycle (SDLC) by designing, developing, and deploying working software through analysis of functionality as defined by a Product team.\n• Expertise and focus around restaurant point-of-service apps (POS, Kiosk, online ordering) is a big plus.\n• Comfortable and experienced in identifying and implementing non-functional requirements, writing code that is clean, of good quality\n• Proficient with testing work-in-progress deliverables to make sure they meet acceptance criteria and functional requirements as defined by a Product team as well as non-functional requirements defined by the development team.\n• Great interpersonal, verbal, and written skills including documentation of complex technical solutions (e.g., whiteboarding, code comments)\n• Driven and wants to be part of a highly productive team that delivers products on a continual basis.\n• As said above, expertise and focus around restaurant point-of-service apps (POS, Kiosk, online ordering) is a big plus.\n\nBenefits\n• A growing innovative company with a friendly atmosphere\n• Social Responsibility Initiatives\n• Creative, people-oriented, encouraging working environment\n• Personal budget for a year to raise professional competence\n• We also have our library, and anyone can order new books\n• Internal career development program “Bridge”\n• Cutting-edge technologies and tools\n• Office in the city center with parking for cars, bicycles, and scooters\n• The flexibility enables work-life balance\n• Private health insurance\n• Additional vacation days for each year spent with us\n• Solid salary and annual bonuses for the achieved results\n• NYSE: FOUR Restricted Stock Units award based on your seniority\n• Employee referral program.\n\nThe salary range for this position is 6500-8000 EUR / gross. The exact salary will be determined based on candidate’s experience.\n\n#LI-Hybrid\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-software-engineer-at-shift4lithuania-32?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlNoaWZ0NGxpdGh1YW5pYSIsImFkZHJlc3NfY2l0eSI6IlZpbG5pdXMsIFZpbG5pdXMgQ2l0eSBNdW5pY2lwYWxpdHksIExpdGh1YW5pYSIsImh0aWRvY2lkIjoiSFdoa3lnRmxsa0NqRFlwbEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Mobile Application Developer",
            "company_name": "MBito",
            "location": "Kaunas, Kaunas City Municipality, Lithuania",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=7y2POOteHLxf3bG1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y2LSwrCQBAFcesRXPVaYkb8bHTlBwQ1Zwidocm0jNNDuiPxRh7TCG5eURRv-plM15U0HAkOOUf2aCwJzvSiKJk6WMBVGlDCzgcYy0WkjTTbB7OsO-dUY9mqjTdfenk6SdTI4B7S6G9qDdhRjmhUr7bLocypnW-qI5sAJ7hhn1CLP-HE9oaqT-w5YxylgDtb6DExfgE-mDfRqwAAAA&shmds=v1_AUFQtONPmPX7sfdi8PbvZdQHQ__HuKd6gDEm6y7Ee0D6zR6Xyg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=7y2POOteHLxf3bG1AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c060c3a018713eccd4/images/0a429e47660cd997f32633474b45f25cd42777c90e7fc00eef1d9843fed0a1f6.gif",
            "extensions": [
                "21 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "MBito is an innovative company dedicated to making Mercedes vehicle diagnostics accessible and user-friendly for Mercedes owners worldwide. With over 10 years of experience in remote and local diagnostics, we empower thousands of customers to understand and control their car's health. Our MBito OBD2 Bluetooth Scanner and mobile app allow users to unlock, customize, and maintain their vehicles with ease.\n\nWe guarantee a start-up environment where you’ll have the full power to suggest and implement new features. You’ll work closely with engineers to integrate software with hardware, and you’ll be involved in tuning luxury cars to make them more premium. While we prefer working from our Kaunas office for better cooperation and hands-on hardware testing, hybrid remote work is also possible. The office provides snacks, a great vibe, and an environment where things get done.\n\nTasks\n• Develop and maintain high-quality mobile applications Android and iOS using React Native framework.\n• Collaborate with cross-functional engineering teams to define, design, and ship new features.\n• Ensure the performance, quality, and responsiveness of mobile applications.\n• Identify and correct bottlenecks, and fix bugs.\n• Help maintain code quality, organization, and automation.\n\nRequirements\n• Have experience working as a React Native Engineer.\n• Strong understanding of SQL and experience with database management (Hasura).\n• Hands-on experience with GraphQL.\n• Familiarity with virtualization technologies like Docker.\n• Basic knowledge of Linux for system management and deployment.\n• Knowledge of CI/CD pipelines and automated deployment strategies.\n• Solid problem-solving skills and attention to detail.\n\nBenefits\n• The opportunity to work with cutting-edge automotive technology and luxury cars, making them even better.\n• A start-up atmosphere with full autonomy to implement your ideas.\n• Flexible working hours and hybrid work options.\n• Snacks, good vibes, and an environment where you can truly make things happen.\n• Competitive salary and benefits.\n\nWe can’t wait to see how you’ll help us innovate!",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/mobile-application-developer-at-mbito-4108534464?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTUJpdG8iLCJhZGRyZXNzX2NpdHkiOiJLYXVuYXMsIEthdW5hcyBDaXR5IE11bmljaXBhbGl0eSwgTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiI3eTJQT090ZUhMeGYzYkcxQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Vilnius, Lithuania",
            "via": "Lever",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=EhkdcYfXnlpLTUQFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQoCMQwAUFzvEwQho4heRXHRUVEQN8H1SEu4VmJTLqncF_jd6vJ4zWfSzM9czWiAE72Jpfy2gqt4UMIhRJAMF5GeaXqIZkX3zqly26uhpdAGeTnJ5GV0T_H6p9OIAxVGo26zW49tyf1idg_ItD1CyvBInFPVJdySxYo54Rfw7EtsiQAAAA&shmds=v1_AUFQtONRNlLCMBeMS6f7rL_ZaXEIR1ne3dLDDIgSDS5cmV5_Xw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=EhkdcYfXnlpLTUQFAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who we are\n\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\n\nWhat we are looking for\n\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\n\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\n\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environment\n\n€25 - €35 an hour\n\nInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\n\nTalent acquisition team",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/scale3c/fe8ff793-1235-49cd-9a9e-0f0d2d848b85?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/flutter-developer/2714359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Layboard",
                    "link": "https://layboard.com/ua/vakansiya/320426/flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/flutter-developer-at-orion-innovation-3932153687?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=78662908099076806&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJWaWxuaXVzLCBMaXRodWFuaWEiLCJodGlkb2NpZCI6IkVoa2RjWWZYbmxwTFRVUUZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVEdsMGFIVmhibWxoIn0="
        },
        {
            "title": "Android Engineer",
            "company_name": "Ingenious",
            "location": "Anywhere",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=LVkrOMPJ3finVriPAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwA0P0-wMEpmyDYiuCik4OI4j8cbS-0kV5Smhzc5LeLb3jDd9jdeOpCE9w5EyN2OMBLIiiGngoIw0MkV9xei1nTi_eq1WW1YJRcktkLY5TVfyTqv1FL6NhqMBxP5-PqGuf95skZmWRRIIY3WVkCU_gB-dK5_YAAAAA&shmds=v1_AUFQtOO0ZuWmRUoUPcBzJdBTVfgU1OmiQIrPIZSTEKpTMq4TOw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=LVkrOMPJ3finVriPAAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At INGENIOUS.BUILD, we’ve cracked the code and built a world-class platform for companies of all sizes within the real estate and construction industries across the globe, enabling them to simply and effortlessly manage all aspects of their projects--from inception to completion, and both internally and in conjunction with the other project participants.\n\nThink about what you could do here… At INGENIOUS.BUILD, you’ll be participating in one of the most exciting and unparalleled journeys of your career--a journey to pioneer the first cloud application to manage the entire lifecycle of a real estate construction project. In short, you’ll be building what some have claimed is the holy grail of construction project management.\n\nIt’s big. Bold. Audacious, even. But that's how we roll...\n\nAnd if you’ve got what it takes, you’ll be directly involved in its development. The rest, as they say, will be history...\n\nAbout The Role:\n\nAs an Android Engineer at INGENIOUS.BUILD, you'll collaborate with a native scrum team to create innovative features and maintain native Android applications aligned with business requirements and our technical vision. Your role involves working within SCRUM, closely with a small team (and other dev teams), ensuring system consistency, and enhancing the user experience. We value a proactive approach and a strong eagerness to continually learn and grow in your development journey.\n\nCommunicative English reading/writing). Minimum level B2\n\nIn this position, you will:\n• Actively participate in the development of assigned projects\n• Addressing and resolving issues identified in production systems\n• Conducting code reviews for pull requests submitted by team members\n• Developing new functionalities as outlined in user stories or assigned tasks\n• Monitoring and documenting progress using JIRA to track changes made\n• Engaging in Scrum-based work management by participating in team meetings and discussions\n\nSkills and Experience needed:\n• Minimum 3 years of commercial experience as an Android Engineer\n• Experience working with Kotlin and Jetpack Compose\n• Experience building complex modular Android App Architecture\n• Experience working with Retrofit and Coroutines & Flow\n• Experience working with MVVM/ MVI design patterns\n• Experienced in integrating Android applications with back-end services using RESTful APIs\n\nPreferred experience with: Unit testing, Web sockets, and Figma\n\nWe're fired up to learn more about you to see how you can help us on our mission! We genuinely look forward to receiving your application to gain further detail on who you are and how you tick... and hopefully start the process of bringing you into the Ingenious family ;).",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-engineer-at-ingenious-317?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiSW5nZW5pb3VzIiwiYWRkcmVzc19jaXR5IjoiTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiJMVmtyT01QSjNmaW5WcmlQQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Android Team Lead",
            "company_name": "Ingenious",
            "location": "Lithuania",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=CiS0dAGgsAaesIAZAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAA0L0f4OB0owgmIrjo5FSUju7lkhxJJL0LuRS6-eviG97wHQ4PDk1ygDfhAhNhgBO8xIESNp9AGEaRWGh_T71XvVmrWkzUjj1742WxwuRksx9x-m_WhI1qwU7z5XreTOV43D05EmdZFTLDlHtakTP-AK5MUM2BAAAA&shmds=v1_AUFQtOPga3zDdwro4BYWASeTeeNeGPt6A7C3Iup9aCXef9N6Lg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=CiS0dAGgsAaesIAZAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At INGENIOUS.BUILD, we’ve cracked the code and built a world-class platform for companies of all sizes within the real estate and construction industries across the globe, enabling them to simply and effortlessly manage all aspects of their projects--from inception to completion, and both internally and in conjunction with the other project participants.\n\nThink about what you could do here… At INGENIOUS.BUILD, you’ll be participating in one of the most exciting and unparalleled journeys of your career--a journey to pioneer the first cloud application to manage the entire lifecycle of a real estate construction project. In short, you’ll be building what some have claimed is the holy grail of construction project management.\n\nIt’s big. Bold. Audacious, even. But that's how we roll...\n\nAnd if you’ve got what it takes, you’ll be directly involved in its development. The rest, as they say, will be history...\n\nAbout The Role:\n\nWe are seeking a talented Android Team Lead to join our remote team. If you have top-notch programming skills and a deep-rooted passion for developing applications or improving existing ones--plus you like to solve problems--we would like to meet you. As an Android Team Lead, you will work closely within a small team in SCRUM (but in conjunction with other dev teams) to ensure system consistency and to improve the user experience.\n\nWhat is vital, however, is that you have, and demonstrate, a burning desire to constantly learn new things and to be proactive in your development efforts.\n\nCommunicative English reading/writing). Minimum level B2\n\nIn this position, you will:\n• Actively participating in the development of our projects.\n• Managing a small team of Android engineers\n• Addressing and resolving issues identified in production systems.\n• Conducting code reviews for pull requests submitted by team members.\n• Developing new functionalities as outlined in user stories or assigned tasks.\n• Monitoring and documenting progress using JIRA to track changes made.\n• Engaging in Scrum-based work management by participating in team meetings and discussions\n\nSkills and Experience needed:\n• Minimum 5 years of commercial experience as an Android Engineer\n• 2+ years of management experience\n• Experience working with Kotlin and Jetpack Compose\n• Experience building complex modular Android App Architecture\n• Experience working with Retrofit and Coroutines & Flow\n• Experience working with MVVM/ MVI design patterns\n• Experienced in integrating Android applications with back-end services using RESTful APIs\n\nPreferred experience with: Unit testing, Web sockets, and Figma.\n\nWe're fired up to learn more about you to see how you can help us on our mission! We genuinely look forward to receiving your application to gain further detail on who you are and how you tick... and hopefully start the process of bringing you into the Ingenious family ;).",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-team-lead-at-ingenious-493?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFRlYW0gTGVhZCIsImNvbXBhbnlfbmFtZSI6IkluZ2VuaW91cyIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoiQ2lTMGRBR2dzQWFlc0lBWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Flutter Engineer",
            "company_name": "Orion Innovation",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=MdaHR_w2vs4fPMVpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXMsQoCMRAEUGzvE6y2E-S8iGCjlYiKotjZHrkQkpW4G5KN6Cf5l8bCZnhTzDSfUTPZhyJiE-zIIdmKGZx4gGx1Mh6Y4MDsgh2vvUjMK6VyDp3LogVNZ_ihmOzAL3XnIf-iz14nG4MW2y-W81cXyU0314T16kjEzzqsRIIbBsKS2z9gi_KGSyE0GHWopYUzii-aUH8BTbrgaKwAAAA&shmds=v1_AUFQtOPzHt74faMqwnmNLU6Key850hhszJ8P_fQMPJ-iQSOh0Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=MdaHR_w2vs4fPMVpAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c060c3a018713eccd4/images/0a429e47660cd997f0687c1486af8be5db35196afb646d1ed53384a9eda19303.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Are you passionate about mobile app development and proficient in Flutter? We are looking for a talented Flutter Mobile Developer to join our dynamic team in Vilnius, Lithuania. We want to hear from you if you thrive in a collaborative environment and have a knack for creating high-quality, efficient, and reliable code!\n\nResponsibilities:\n• Review project requirements and translate them into technical implementation for mobile applications using Flutter.\n• Develop and maintain clean, efficient, and reliable code using the Flutter framework.\n• Write unit and integration tests for your code to ensure its quality and reliability.\n• Collaborate with cross-functional teams to design and implement mobile applications.\n• Review software designs and code implementations by team members and provide constructive feedback.\n• Continuously optimize and improve code quality, adhering to best practices and principles such as OOP, SOLID, DRY, and Clean Architecture.\n• Demonstrate a deep understanding of mobile app development principles, including lifecycle management, permissions, data storage, and adherence to UX/UI guidelines.\n• Troubleshoot and resolve technical issues to ensure the functionality and performance of mobile apps.\n• Maintain a high level of proficiency in the use of Git for version control.\n• Effectively communicate and collaborate with management and other engineering teams on design and technology decisions.\n• Explore and implement advanced features, such as image, video, and audio content processing, as required by the project.\n• Collaborate on projects involving Location Services, Push Notifications, BLE, Firebase, In-App Purchase, Google Maps, and Mapbox.\n\nRequirements:\n• 2+ years of experience in Android or iOS mobile development.\n• Proven experience in Flutter mobile app development.\n• Strong proficiency in RESTful APIs, JSON, and database management.\n• Solid understanding of mobile app development principles, including lifecycle, permissions, data storage, and adherence to UX/UI guidelines.\n• Practical experience with OOP, SOLID, DRY, and Clean Architecture principles.\n• Proficiency in Git version control.\n• Strong communication skills in English, both written and verbal.\n• Nice to have: Experience in processing image, video, or audio content within mobile applications.\n• Nice to have: Experience working with Location Services, Push Notifications, BLE, Firebase, In-App Purchase, Google Maps, or Mapbox.\n\nWe Offer:\n• Employment with a stable and internationally recognized company.\n• Competitive salary and comprehensive benefits package.\n• The inclusive and diverse work environment that values your contributions.\n• Collaboration with a skilled and supportive team of professionals.\n• Flexible working hours to promote work-life balance.\n• Medical insurance coverage.\n• Ongoing training programs and excellent travel opportunities.\n• Various recognition and growth opportunities within the organization\n\nSalary ranges from 2000 to 4200 (Gross), commensurate with experience and qualifications, with room for growth based on performance.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/flutter-engineer-at-orion-innovation-4011313882?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiT3Jpb24gSW5ub3ZhdGlvbiIsImFkZHJlc3NfY2l0eSI6IlZpbG5pdXMsIFZpbG5pdXMgQ2l0eSBNdW5pY2lwYWxpdHksIExpdGh1YW5pYSIsImh0aWRvY2lkIjoiTWRhSFJfdzJ2czRmUE1WcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Flutter Developer",
            "company_name": "Andersen",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "Layboard",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=Abo_bmZd-QGZszpeAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXHsQrCQAyAYVz7CE4ZRWorgoM6iaIgurqW6xl6kTM5Lqno6_ik1sHl5_uLz6iYHGJvhhn2-MQoadAMTtKCoss-gDAcRbqI400wS7qua9VYdWrOyFdeHrUwtvKq79LqL40GlzFFZ9gslvNXlbibrrZ8w6zIQAxXiky9ln_AjuwNl57JU3JxmBLOZKF3TO4LUDRDPaUAAAA&shmds=v1_AUFQtONg5FpWNlKhHn3QDSxXASD0QiA19ifBl2dLyDGrdAnIkg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Abo_bmZd-QGZszpeAAAAAA%3D%3D",
            "extensions": [
                "5K a month",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "5K a month",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Andersen an international IT company invites a Flutter Developer to work on a large-scale project for one of our German customers The project is the creation of mobile applications for various areas of the customer39s business activities including the apps for its clients The company39s main fields of expertise are demand management tolling traffic and connected vehicles The customer is a provider of transportation solutions for sustainable mobility The company has brought projects to fruition in more than 50 countries around the globe With one-stop solutions the company covers the entire value chain of clients from the production of components design and implementation to the operation of systems Responsibilities - Developing a project from scratch - Using Material Design for the interface - Communicating with the API back-end - Participating in the engineering of reusable testable and efficient software solutions - Collaborating with other stakeholders regarding architecture design and technology choice Must-haves - Experience in mobile software development for 5+ years - Experience in developing Flutter applications for mobile devices for 2+ years - Portfolio with at least 2 apps for iOSAndroid developed using Flutter - Experience in uploading apps in App StoreGoogle Play - Experience with third-party libraries and APIs - Understanding of the Agile development lifecycle - Experience in writing unit tests - Experience with Git SVN or other version control tools - Experience in writing readable code creating documentation for existing code and refactoring - Experience in Material Design - Level of English Upper-Intermediate Nice-to-haves - Experience in automated testing Reasons why this job would be interesting to you - At Andersen you will enhance your CV by working on projects for such global brands as Samsung Johnson amp Johnson Ryanair Europcar and many others Our company never runs out of good projects so you wonrsquot stay on the sidelines - You will be able to learn something new every day If you want to change your domain or technology we will help you with this After all Andersen has a huge knowledge base and a strong resource management institution - Our employees work from anywhere in the world at the company39s offices or from home and even combine both formats in the way that suits them best Coworking with compensation is also possible - You will have a stable competitive USD-pegged salary and enjoy an extensive benefit package Also if you want to you will be able to increase your income by taking on additional activities - Your career will be in your hands We offer a clear assessment system and draw a roadmap to your goals Develop as a specialist or manager and your achievements will be appreciated at their true value We invite you to join our team httpspeopleandersenlabcom The vacancy assumes the possibility of remote work remoteon-site We will only consider applications with a resume E-mail cvmobile@andersenlabcom",
            "apply_options": [
                {
                    "title": "Layboard",
                    "link": "https://layboard.com/pl/vakansiya/320426/flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFuZGVyc2VuIiwiYWRkcmVzc19jaXR5IjoiVmlsbml1cywgVmlsbml1cyBDaXR5IE11bmljaXBhbGl0eSwgTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiJBYm9fYm1aZC1RR1pzenBlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVz7COJws2AjgouOakXRqe4lac_mJN6F5Ip9H1_Uuvzb_xXfWVHdqesCmhqZJMFdHAWEKgyqmKCWp35sQjhxT4yYMqzgKg4y2tR6EIazSB9wvveqMe-MyTmUfVar1JatvI0wOhnNS1z-p8l-8mKwis1mux7LyP1ycTk-4CApSpq-CSWGG6kfLJP9ARihYfmmAAAA&shmds=v1_AUFQtOO9FnqWXqZEKcWXKpYXq2v62zMyY7JJ9yLnawIHdDfWuA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c060c3a018713eccd4/images/0a429e47660cd997a51a928460d26a755c3a06c4ceae0f1c3679bc7779bc6875.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoiVDF4dnRsakpuY2Qxb3UwYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFw7OzndqEIbEVx0VFREoeAHlKRcm5M0F-6i1I_xX9Xlra_4TIrzHSOxwI0dBYS9sGpZB5s7lgEO-MLACQXmRxJ0VnEBJVzYgaKV1gNHODH3AWc7n3PSrTGqoeo120xt1fJgOKLj0TzY6Z9GvRVMvwKb9WY1Vin2y2ktPFL3BopwpeyfNpL9Ag30SaSgAAAA&shmds=v1_AUFQtOOT5DZAWfSHKXZhhuRlsoXyWpw14MC3__IQTr3s89Agxg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502c060c3a018713eccd4/images/0a429e47660cd99773f01b0e3cbff303ce3665555a6220b165a1e16e54e6b3e5.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoiRC00WlVycUZVbVc1Rm5VM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUakpWVVhGSmRYcHBUREpsY1RsdGRuQTBVblZPVTJkSldFZFVVM28wTkhCVFQyOTJSRzkyU2tsdlNGbGpaM1JPTlVsc1IwTTBZMTk2VjIxWFFqWkZUM2xpYW04dE5GaHBXbWs1WVRsVFlUTnJlbFZQVGxsTmIxbGtWVWN0VjBaYWFuSnFPV1JDU2s5M05sVm5ZMjEyVkVsSE1EaHRjaTFvVVdaUmFrcFpYMmswYzB0M1NrdFpWWE5KWm5BNVptcGpNblZXTm1aeU1VSkdRa2d4ZEVkSVowNXpVVk53UVc1U1VEQnlaRU5MUjJSM2EyOTZZalZHVG5kWU1XTm9RVUUzTUVzdFdWZEdVVVZXVVZKQk5FNXRjVTlUTmxWZmVtRm9TR1ptWnpKUGRXMVhWMmRvZEdSb1FVbEdOWEJqUW5wNVFtRTVUUzF5TVZwc05WbFRWa2RUYVU5S01rOUZXQklYZDBGTFJsbzVla05QU1V0eE5VNXZVREJRUkY4NFFUZ2FJa0ZHV0hKRlkzSTFOWE5CV1hZNFZFdE5VVzVuY0VSSGVVczNNa0pPV1hGTWVWRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Lithuania&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUakpWVVhGSmRYcHBUREpsY1RsdGRuQTBVblZPVTJkSldFZFVVM28wTkhCVFQyOTJSRzkyU2tsdlNGbGpaM1JPTlVsc1IwTTBZMTk2VjIxWFFqWkZUM2xpYW04dE5GaHBXbWs1WVRsVFlUTnJlbFZQVGxsTmIxbGtWVWN0VjBaYWFuSnFPV1JDU2s5M05sVm5ZMjEyVkVsSE1EaHRjaTFvVVdaUmFrcFpYMmswYzB0M1NrdFpWWE5KWm5BNVptcGpNblZXTm1aeU1VSkdRa2d4ZEVkSVowNXpVVk53UVc1U1VEQnlaRU5MUjJSM2EyOTZZalZHVG5kWU1XTm9RVUUzTUVzdFdWZEdVVVZXVVZKQk5FNXRjVTlUTmxWZmVtRm9TR1ptWnpKUGRXMVhWMmRvZEdSb1FVbEdOWEJqUW5wNVFtRTVUUzF5TVZwc05WbFRWa2RUYVU5S01rOUZXQklYZDBGTFJsbzVla05QU1V0eE5VNXZVREJRUkY4NFFUZ2FJa0ZHV0hKRlkzSTFOWE5CV1hZNFZFdE5VVzVuY0VSSGVVczNNa0pPV1hGTWVWRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}