{
    "search_metadata": {
        "id": "678502ff628b7239794b7331",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/ab4377a2926e4158/678502ff628b7239794b7331.json",
        "created_at": "2025-01-13 12:11:43 UTC",
        "processed_at": "2025-01-13 12:11:43 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIFU3BhaW4&udm=8&fc=EswCCowCQUpHOUprTXBsRlJtcXBnZEtwOEVZc2l5WkhQWFFRRXdsMEZQSVVrTTBFd1FROUtRcHFud1JOeDZMS3luMlJQT0JEdkNORG1KX21jZ2tBYXh0RlhEa0FUZnh5SDJYcE1yT2pRRlI0SW56SFQtcjlzRkhDWkNnUlNScmR2c1NWQUFoMEpUVWhVV2JIam1hVVhpTVV6Q1lmdF9xR0RRYmhlVTJqYkdCVGNFQnJkUFZBUVQ2VnV1LWRIUFg3QU1kdXdEOGZ2ajRtYjlLdTR2cXRYeERBby1yX3Qxa2VQelBxeHV1S3c2d2VtMUhwQXVGblVOdjlFVHlWTEVnS3R5TzB5bWFDR2JPUkJNUTlaQRIXX3dLRlo1ZndCSUxsNU5vUC03Nld1UXcaIkFGWHJFY29PeVduNVd4Y2x1N2EtMGJ5UHFnOWgza2ZpSGc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/ab4377a2926e4158/678502ff628b7239794b7331.html",
        "prettify_html_file": "https://serpapi.com/searches/ab4377a2926e4158/678502ff628b7239794b7331.prettify",
        "total_time_taken": 0.37
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Spain",
        "location_used": "Spain",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUWEJzUmxKdGNYQm5aRXR3T0VWWmMybDVXa2hRV0ZGUlJYZHNNRVpRU1ZWclRUQkZkMUZST1V0UmNIRnVkMUpPZURaTVMzbHVNbEpRVDBKRWRrTk9SRzFLWDIxaloydEJZWGgwUmxoRWEwRlVabmg1U0RKWWNFMXlUMnBSUmxJMFNXNTZTRlF0Y2pselJraERXa05uVWxOU2NtUjJjMU5XUVVGb01FcFVWV2hWVjJKSWFtMWhWVmhwVFZWNlExbG1kRjl4UjBSUlltaGxWVEpxWWtkQ1ZHTkZRbkprVUZaQlVWUTJWblYxTFdSSVVGZzNRVTFrZFhkRU9HWjJhalJ0WWpsTGRUUjJjWFJZZUVSQmJ5MXlYM1F4YTJWUWVsQnhlSFYxUzNjMmQyVnRNVWh3UVhWR2JsVk9kamxGVkhsV1RFVm5TM1I1VHpCNWJXRkRSMkpQVWtKTlVUbGFRUklYWDNkTFJsbzFabmRDU1V4c05VNXZVQzAzTmxkMVVYY2FJa0ZHV0hKRlkyOVBlVmR1TlZkNFkyeDFOMkV0TUdKNVVIRm5PV2d6YTJacFNHYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Android Developer Opportunity: Shaping the Future of Mobile Investing",
            "company_name": "Bitpanda",
            "location": "Barcelona, Spain",
            "via": "Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=tLC5Ei4yjdlFHxR2AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOMQrCQBAAsc0TxGJr0UQEG60MoiiIRVpBNsmaOzl3l7uN6NP8nbGZZmCY7DvKrltuo_gWdvSiIEoRLqoSrWdvnzVUDtVzB-YI9r31kUDucJbaB4IjvyjZX8_hJDUkwtg4EIaDSBdovHFmmtZFkVLIu2RovskbeRbCVMu7eEid_rglh5E0oNFtuVq8c-VuOim9KXKL4BnKoTz8Mc6gUvT8A3sqnzm8AAAA&shmds=v1_AUFQtONq879eM1e5RRITAvWw5dBPCgrPIE7lkMZ7wWsKJwuTfw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=tLC5Ei4yjdlFHxR2AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502ff628b7239794b7331/images/6ba27503c1a768815aeb3c8010c99264fc5c8756e8a42026754adb0f0f31bf90.gif",
            "extensions": [
                "13 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "13 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We're on a mission to revolutionize wealth creation at Bitpanda. Founded in 2014, our user-friendly platform empowers both first-time investors and seasoned experts to invest in cryptocurrencies, stocks, precious metals, and commodities with any sized budget, 24/7.\n\nOur global team operates across different cultures and time zones, bringing our products to more than 4 million customers, making us one of Europe's safest and most secure platforms for modern investing. Headquartered in Austria, we're operating across Europe.\nAbout the Role\n\nThis is an exciting opportunity to join our core mobile platform team as a Senior Android Developer at Bitpanda. You will work on the development of our native Android app infrastructure, shaping the architecture of our Android application by driving key initiatives to ensure its quality, scalability, and resilience.\nYour Key Responsibilities\n• Design and maintain the Android app architecture to ensure a robust foundation.\n• Conduct code reviews to uphold consistency and quality across the codebase.\n• Establish best practices, document guidelines, and mentor fellow Android developers.\n• Communicate effectively and work independently to support team goals.\n• Build and enhance modules and developer tools that empower the Android team to deliver high-quality code efficiently.\nRequirements\n\nTo succeed in this role, you'll need:\n• Excellent knowledge of Kotlin, Coroutines, Hilt, and Retrofit.\n• Proficient in architecture patterns such as MVVM.\n• Experience in managing and publishing Android applications on Google Play in a professional environment.\n• Solid knowledge of UI testing frameworks like Espresso and UI Automator.\n• Good understanding of CI/CD pipelines - experience with GitLab CI is a plus.\nWhat We Offer\n\nWe're proud of our flexible working model that includes 2 days (minimum) working from the local Hub, plus 60 Work From Anywhere days annually. Our competitive benefits programs and policies are shaped by our flexibility-first philosophy. Enjoy exclusive premiums when trading on Bitpanda, company-wide and team events, Bitpanda swag, and the opportunity to learn and grow as part of Bitpanda's incredible journey towards being Europe's future #1 investment platform. Estimated annual salary: €100,000+",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://es.trabajo.org/oferta-3065-e1de8e5b707bc13240818f1bc0ee7e8b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBPcHBvcnR1bml0eTogU2hhcGluZyB0aGUgRnV0dXJlIG9mIE1vYmlsZSBJbnZlc3RpbmciLCJjb21wYW55X25hbWUiOiJCaXRwYW5kYSIsImFkZHJlc3NfY2l0eSI6IkJhcmNlbG9uYSwgU3BhaW4iLCJodGlkb2NpZCI6InRMQzVFaTR5amRsRkh4UjJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lGVTNCaGFXNCJ9"
        },
        {
            "title": "Experienced Android Engineer",
            "company_name": "Backmarket",
            "location": "Spain",
            "via": "Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=QfsYPwEI41nyup3oAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFy7ujndLJiI4qKTQhFc_YBySY40Nr0LuQz5A39bfMMbvpvhPPZCNRF7CnDnUCUFGDkmJqpwgJc4UMLqZxCGp0jMtLvNrRW9WquaTdSGLXnjZbXC5KTbjzj9N-mMlUrGRtPpcuymcNxvH-iXFetCDRLDu2DiH0vohe2KAAAA&shmds=v1_AUFQtOOJw_00wtEmzR_YrOc91Yq4lAMSS4AKQDDEQZwJZ_q0fQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=QfsYPwEI41nyup3oAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678502ff628b7239794b7331/images/6ba27503c1a76881db74a3e139d989bea300da14f033ac370b3872f1baf80171.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Backmarket is hiring Experienced Android EngineerBack Market is the world’s leading refurbished electronics marketplace with a team of 650 people, powering operations in 21 countries (and counting).Named one of the World's Most Innovative Companies by Fast Company in 2019 and again in 2021, our mission is simple: empowering people to consume tech sustainably by offering folks a high quality, accessible, and more eco-friendly alternative to buying new electronics. Why? Refurbished tech helps lower our collective environmental impact. We have indeed contributed to avoid the production of more than 1,000,000 tons of CO2e worldwide since our launch in 2014.Be part of an exciting and growing international adventure that will change the way the world consumes tech.Mobile Engineering at Back MarketMobile engineers come from different cultures, backgrounds and working environments. They are spread across Europe (Spain, France, Germany). Each squad is composed of pairs of iOS & Android engineers, working on the native language to build the best experience for our users.You will also collaborate with other product squads & stakeholders, along with the Mobile Core squad that is providing the foundations & infrastructure for your developer experience on apps.The role & responsibilitiesWe are looking for an Experienced Android Engineer to join one squad of our main tribe, Customer Journey. We have the mission in 2024 and beyond, to provide the best features, services & user experience for our app users.The engineer will also contribute to the mobile engineering chapter, with talented iOS & Android engineers, showing exemplary professional collaboration with teammates and peers. Whether hooked on Kotlin, developing advanced and smooth UI & UX, or architecture scalable features, the engineer will share & remain open to new ideas.What you will do :Build & optimize Android code autonomously on any development task, delivering code on time and with a quality mindset.Proficiency in building native applications using Kotlin, with a strong foundation in architectural patterns (MVVM, MVP, etc.), coroutines, flows, and multi-modules architecture.Seeks understanding of how users interact with product/service to enhance the user experience, by collaborating with product design & product management on new features.Writes engineering review proposals and contributes to technical design, thinking through failure cases.High sense of collaboration by participating in code reviews, maintain high-standards code quality, including regular exchanges with the iOS team and the Mobile Core team.Contribute to the migration to Jetpack Compose for the new & existing features.Prevent regressions and write Unit & UITests, maintain automated E2E testing funnels.Ability to monitor & debug effectively by diving into the root cause of production issues, clarifying requirements where necessary: product KPIs (Amplitude), logs (Datadog), and crash reporting (Firebase Crashlytics).Participation in the tech community is appreciated: events, meetups, continuous learning through blog articles and industry conferences.Recruitment process :- Phone screen with Stéphane (1h)- Technical screening with two Android engineers (~30 minutes)- Team fit with your future manager + one person from our product/platform engineering team (~1h)- BM value interview with our leadership (~45m)WHY SHOULD YOU JOIN US ?- A meaningful job: you will help avoid thousands of tons of electronic waste and fight against planned obsolescence. It counts- A meaningful company: we became a mission-driven company in January 2022.- Be part of a worldwide growing company based in Europe, the USA and Asia to face great challenges: you will have the freedom to innovate and adopt new ideas- Work alongside passionate experts: who will share their knowledge and help you develop and grow in your career.- Grow your career: with a flexible career path and a dedicated Learning & Development team. Back Market will help you evolve with personalized internal trainings and external handpicked providers from day 1- Leadership Academy by Back Market: “be a coach not a dictator” is at the core of this program We train and enable all our leaders to support their team towards achieving goals.- An attractive salary, equity and a host of benefits including: Lunch voucher, health insurance, relocation package, paid time off for activism in your community, parental benefits, flexible hours, etc…- One Loving Tribe: you will have the opportunity to work in a fast-paced, open-minded and friendly environment.- Be part of one of our Employee Resource Groups created around shared identities, common backgrounds and/or special interests crafted to be a safe space and an expressive outlet.- Several internal events: The Monday Brief (weekly)/ The Somehands (monthly)/ The All Hands (annual).- We’re here to SABOTAGE: It’s our mantra. It keeps us focused on what we aspire to be: a little bit sneaky, always smart, kinda frugal and constantly conspiring to create maximum impact.Back Market is an Equal Opportunity Employer which means we pledge to not discriminate against employees based on race, color, religion, sex, national origin, age, disability or genetic information. If reasonable accommodations are needed for the interview process, please do not hesitate to discuss this with the Talent Acquisition Team.Back Market is helping to address one of the biggest challenges of our time: climate change. We take this so seriously that we were awarded status as a “Société à Mission”, or company with a social mission, by the French government. We know we can’t tackle a global problem without a globally representative team so we are committed to embedding diversity, equity and inclusion principles in every aspect of our organization.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://es.trabajo.org/oferta-3206-f0de5c6543ca4eb74bf96f8165373c24?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://es.linkedin.com/jobs/view/android-engineer-they-she-he-at-glovo-4121145756?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Kit Empleo",
                    "link": "https://www.kitempleo.es/empleo/130372813/vv399-android-engineer-madrid/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/en_internet/ti_tecnologia/3860703686/s/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Emprego.pt",
                    "link": "https://www.emprego.pt/jobs/show/31507285631261903105651103535?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBBbmRyb2lkIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQmFja21hcmtldCIsImFkZHJlc3NfY2l0eSI6IlNwYWluIiwiaHRpZG9jaWQiOiJRZnNZUHdFSTQxbnl1cDNvQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJRlUzQmhhVzQifQ=="
        }
    ]
}