{
    "search_metadata": {
        "id": "67850319a1600b13ef9a6453",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/41ac53d4b6421375/67850319a1600b13ef9a6453.json",
        "created_at": "2025-01-13 12:12:09 UTC",
        "processed_at": "2025-01-13 12:12:09 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=Android+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=EswCCowCQUpHOUprTTlRelNwUjBSeXZfZ2FoeGZxdGFGV1Q4OTQ4bHAtMnl2d3ZlMDZ2M09tWFhmU2JfeFZLZ3VBRWRXdWtXU1ZLM0luc19BMHQ1VF9YbGRpSU52VTVYWWxEQ0tUcGZnSy1JUDRLcmFJUmdPNGI0cTZTN2tBSzJRaFdFaDZPNXFSZGVob1E5TWpocUV5UnVmVllwcmpWeUdVNEZXNTJNaXZhN2hxWDNTSS1NWnRmTjc4NHV4YjJkWnJoTFYzT016cEF1TTRRVTh4Rk91REV4SE9ucDJsUGJza3ZEN3l0MF85eU9LSi1zNjZleHRIczVUNC1Ual9mZFFtbHZsalRNM2FFZl9fbWNIRxIXR0FPRlotZTRNY20ycHRRUDVlbXk4QTQaIkFGWHJFY3E4WnNybjBPeDRrSHUxdE94OGt6Ung2VmlNQUE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/41ac53d4b6421375/67850319a1600b13ef9a6453.html",
        "prettify_html_file": "https://serpapi.com/searches/41ac53d4b6421375/67850319a1600b13ef9a6453.prettify",
        "total_time_taken": 1.26
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVGxSZWxOd1VqQlNlWFpmWjJGb2VHWnhkR0ZHVjFRNE9UUTRiSEF0TW5sMmQzWmxNRFoyTTA5dFdGaG1VMkpmZUZaTFozVkJSV1JYZFd0WFUxWkxNMGx1YzE5Qk1IUTFWRjlZYkdScFNVNTJWVFZZV1d4RVEwdFVjR1puU3kxSlVEUkxjbUZKVW1kUE5HSTBjVFpUTjJ0QlN6SlJhRmRGYURaUE5YRlNaR1ZvYjFFNVRXcG9jVVY1VW5WbVZsbHdjbXBXZVVkVk5FWlhOVEpOYVhaaE4yaHhXRE5UU1MxTlduUm1UamM0TkhWNFlqSmtXbkpvVEZZelQwMTZjRUYxVFRSUlZUaDRSazkxUkVWNFNFOXVjREpzVUdKemEzWkVOM2wwTUY4NWVVOUxTaTF6TmpabGVIUkljelZVTkMxVWFsOW1aRkZ0Ykhac2FsUk5NMkZGWmw5ZmJXTklSeElYUjBGUFJsb3RaVFJOWTIweWNIUlJVRFZsYlhrNFFUUWFJa0ZHV0hKRlkzRTRXbk55YmpCUGVEUnJTSFV4ZEU5NE9HdDZVbmcyVm1sTlFVRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior Software Development Engineer - Mobile",
            "company_name": "Capital One - UK",
            "location": "London, United Kingdom",
            "via": "Capital One",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=yPh6j1AEzjXc-KA5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ6CMBCA4bjyCE43E6XGxEVHMSaicSDMpIWz1JS7pr0ob-UrCsuff_uy3yorayTHEWp-yVdHhBI_6DmMSAIXso4QI2zhwcZ5nOfGBhLq2A3ABFdm63F9GkRCOiqVki9sEi2uKzoeFRMantSbTVrSpmE2gteC7f6wm4pANs_POjjRHp60AE0FjuDO1DNtoCEn2EPlyPY8_gHH3QVTsgAAAA&shmds=v1_AUFQtONupRBImGPFzi9qG7SvwwiSaEDrdP9w4X-Gl2CTuSHXFQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=yPh6j1AEzjXc-KA5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb204d31c06372d2a94d5accaa807455e84bdca9d561daec8a7.gif",
            "extensions": [
                "26 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "schedule_type": "Full-time"
            },
            "description": "White Collar Factory (95009), United Kingdom, London, London\n\nSenior Software Development Engineer - Mobile\n\nWhat you’ll do\n• You’ll work as part of a self-organised Mobile engineering team to design and develop software features that are delightful and vital to the lives of credit card consumers across all walks of life\n• You'll work with the engineering manager (and the team) to evaluate technical risks and technology choices\n• Be a technical evangelist both within the team and outside, coaching and/or mentoring other more junior engineers as appropriate\n• Write well-factored, well-tested code both in the Android app and backend orchestration services\n• Work with senior engineers across other teams to ensure that our mobile offering stays compelling both for end-users and for the engineers working on it\n• Maintain a strong questioning (but diplomatic!) attitude about the way things are and a relentless focus on making it better by driving best current engineering practices across Capital One mobile communities of practice.\n• Your focus is on a major portion of existing or new team software (e.g., significant component, set of features, mid-size application or service)\n• You’ll work to achieve the goals and vision shared by Product Management and your more senior Tribe community\n• Innovate within your team, initiative area and contribute within your technical domain\n• Be a helpful, approachable and inquisitive problem-solver with excellent technical, supportive and communication skills and a demonstrable track record of continuous learning and improvement, to help us deliver frequent releases of high quality software in a complex regulated environment.\n\nWhat we’re looking for:\n• ​Strong programming skills with a good working knowledge of Kotlin or Java and modern Android toolsets like Android Studio, JUnit and Espresso\n• A capable, technical lead, who is willing to help grow and guiding more junior engineers towards appropriate target architectures\n• Diverse technical experience, perhaps with a history moving from backend engineering to Android\n• You’re excited by the cloud/AWS and the opportunities that it brings\n• You’re able to effectively communicate and work together across engineering to maximise inner-sourcing opportunities and reduce waste\n• You’ll have a proven ability to deliver high quality applications at scale\n• You’re an advocate for quality and can support the team leveraging approaches such as Pair Programming, TDD and BDD\n• An interest in learning new languages, tools, libraries and frameworks\n• An interest in static typing and reactive programming\n• Knowledge of at least one dynamically typed language\n\nWhat you’ll get to learn (any previous experience would be advantageous)\n• Working with the cloud/AWS and the opportunities that it brings\n• Solving real world problems and being comfortable working in a complex regulated environment\n\nWhere and how you'll work\n\nThis is a permanent position and will be based in our London office.\n\nWe’re big on collaboration and connection, so you’ll be based in our London office 3 days a week on Tuesdays, Wednesdays and Thursdays.\n\nWhat’s in it for you\n• You don’t have to tick every box (although the more the merrier!), if, however, you feel you do have the relevant skills and expertise then please get in touch as we would like to hear from you! The rewards (alongside a very generous financial package!) are that you’ll be contributing to the product roadmap for an organisation committed to transformation\n• A senior technical role in a team that genuinely values kindness and continuous improvement working within a company that cares for its associates and has interesting problems for you to help to solve around security, scale, availability and performance\n• We love continuous learning and that’s why we give you 10% of your time to work on cutting edge innovative projects that shape the way we will work in the future\n• We offer high performers strong and diverse career progression, investing heavily in developing great people through our Capital One University training programmes (and appropriate external providers)\n• Immediate access to our core benefits including pension scheme, bonus, generous holiday entitlement and private medical insurance – with flexible benefits available including season-ticket loans, cycle to work scheme and enhanced parental leave\n• Open-plan workspaces and facilities designed to inspire and support you. Our Nottingham head-office has a fully-serviced gym, subsidised restaurant, mindfulness and music rooms. In London, you can heighten your mood with a run on our rooftop running track or an espresso at the Workshop Coffee café\n\nWhat you should know about how we recruit\n\nWe pride ourselves on hiring the best people, not the same people. Building diverse and inclusive teams is the right thing to do and the smart thing to do. We want to work with top talent: whoever you are, whatever you look like, wherever you come from. We know it’s about what you do, not just what you say. That’s why we make our recruitment process fair and accessible. And we offer benefits that attract people at all ages and stages.\n\nWe also partner with organisations including the Women in Finance and Race At Work Charters, Stonewall and upReach to find people from every walk of life and help them thrive with us. We have a whole host of internal networks and support groups you could be involved in, to name a few:\n• REACH – Race Equality and Culture Heritage group focuses on representation, retention and engagement for associates from minority ethnic groups and allies\n• OutFront – to provide LGBTQ+ support for all associates\n• Mind Your Mind – signposting support and promoting positive mental wellbeing for all\n• Women in Tech – promoting an inclusive environment in tech\n• EmpowHER - network of female associates and allies focusing on developing future leaders, particularly for female talent in our industry\n\nCapital One is committed to diversity in the workplace.\n\nIf you require a reasonable adjustment, please contact ukrecruitment@capitalone.com All information will be kept confidential and will only be used for the purpose of applying a reasonable adjustment.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).\n\nWho We Are\n\nAt Capital One, we're building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding.\n\nGuided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.",
            "apply_options": [
                {
                    "title": "Capital One",
                    "link": "https://jobs.capitalone.co.uk/job/london/senior-software-development-engineer-mobile/1734/66499960336?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Careers At Apple",
                    "link": "https://jobs.apple.com/en-us/details/200557391/senior-software-engineer-apple-private-cloud?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/gocardless/jobs/6448559?t=52def6c01us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=3c37f45a3abf4b35&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/senior-software-engineer-apple-private-cloud/apple-job103956453?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/senior-software-development-engineer-velocity-black-uk-at-velocity-black-4114093632?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/senior-software-development-engineer-velocity-black-uk/3602178?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WIBF Jobs",
                    "link": "https://jobs.wibf.org.uk/job/24534/senior-software-development-engineer-velocity-black-uk/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcG1lbnQgRW5naW5lZXIgLSBNb2JpbGUiLCJjb21wYW55X25hbWUiOiJDYXBpdGFsIE9uZSAtIFVLIiwiYWRkcmVzc19jaXR5IjoiTG9uZG9uLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoieVBoNmoxQUV6alhjLUtBNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Senior Android Developer - Kotlin",
            "company_name": "Computer Futures",
            "location": "Churchdown, United Kingdom",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=iUnue_eN6tlnsGDwAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7CE43i7YiCKKTVBTsKM6lbY4kkt6F3FX7Rr6mcfn5t6_4LorDA8lzgjOZxN7ABd8YOGKCDTSswVOeO_cg2KXBARPcmG3A5cmpRjlWlUgorWinfigHHism7HmuXtzLP624LmEMnWK722_nMpJdlTWPcdLMXCedEgpkqHZTJgx_aA1P8ooGGk_W8PgDH9fJiqoAAAA&shmds=v1_AUFQtOM1TUJLLZnI91O-e_Tn9fghubfeNDiyvP--MlJlyig75A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=iUnue_eN6tlnsGDwAAAAAA%3D%3D",
            "extensions": [
                "10 days ago",
                "£80K–£90K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "salary": "£80K–£90K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Android Developer opportunity:\n\nOne of our key clients has an opportunity for a highly experienced Senior Android Developer. The right candidate will have a minimum of 7 years of Android mobile development experience, has excellent knowledge of Java and Kotlin programming languages, testing methodologies, experience with apps featuring maps functionalities.\n\nOur client is based in Gloucestershire and requires being in the office 1 day a week.\n\nJava\n\nKotlin\n\nEnd-to-end software development\n\n10% bonus\n\nChristmas bonus\n\nHealth and life insurance\n\n25 days holiday\n\nPension contributionAdditional Requirements:\n\nIf you meet these qualifications and have relevant work experience that makes you qualified enough to take up this role then please apply now! To find out more about Computer Futures please visit\n\nComputer Futures, a trading division of SThree Partnership LLP is acting as an Employment Business in relation to this vacancy | Registered office | 8 Bishopsgate, London, EC2N 4BQ, United Kingdom | Partnership Number | OC(phone number removed) England and Wales",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://uk.jooble.org/rjdp/6089157156788967184?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgLSBLb3RsaW4iLCJjb21wYW55X25hbWUiOiJDb21wdXRlciBGdXR1cmVzIiwiYWRkcmVzc19jaXR5IjoiQ2h1cmNoZG93biwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImlVbnVlX2VONnRsbnNHRHdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Software Engineer – Android",
            "company_name": "Russell Tobin",
            "location": "United Kingdom",
            "via": "StudySmarter - Talents",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=5xXZfAVtWp3QmGc-AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMPQrCQBBAYWxzBBunFsyKaKOVhQja-VOH3ey4WdnMhJ0RU3oHPaEnMcLjK1_xGRXLM9_0aTPCjkIkxAzf1xu25DNHDzM4sANBm-sGmGDPHBKON41qJ2tjRFIZRK3Guqy5NUzouDd3dvKnkmZYd8kqVovVvC87CtPJ6SGCKcGFXSQYulJU9HCMFDy3P48zrMiXAAAA&shmds=v1_AUFQtOOGABXhaHiFbO152DEO-yNwRp-aZbfJtDqi-OI4swAvUQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5xXZfAVtWp3QmGc-AAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: Senior Android Engineer (Contract)Experience: 6–10 YearsLocation: Remote (Flexibility to work in US hours required)About the TeamThe Growth Engineering team is dedicated to expanding company's presence in the US and international markets. By focusing on converting, onboarding, and retaining users through innovative features, the team plays a critical role in shaping company's future.Role OverviewAs a Senior Android Engineer on the Growth team, you will design and implement key features, systems, and applications that will enhance the user experience and drive growth. This contract role involves collaborating with Senior and Staff Engineers to deliver impactful features set to launch in 2025.If you’re passionate about building scalable, responsive, and high-performing Android applications and enjoy working in a fast-paced, cross-functional environment, we’d love to hear from you.Key ResponsibilitiesArchitect and Develop: Design architectures and build components that deliver smooth, responsive experiences for users worldwide.Cross-Functional Collaboration: Work closely with product, design, and engineering teams to create experiences that delight users.Full Development Cycle: Contribute to technical design, development, testing, experimentation, analysis, and launch of features.Mentorship and Leadership: Lead a team of skilled engineers, setting standards, improving workflows, and mentoring junior team members.Continuous Improvement: Stay curious and continuously enhance technical and non-technical skills.Required QualificationsExpertise in Android Development: 6+ years of experience with Java or Kotlin, with a strong focus on Android app development.Software Engineering Fundamentals: Solid understanding of software design principles and system architecture.Scalable App Development: Experience building data-intensive, fault-tolerant, and highly responsive mobile applications for constrained environments.Team Collaboration: A proven track record of shipping Android apps as part of a team.Communication: Excellent communication skills in English.Global Perspective: A passion for developing software that improves lives on a global scale.Technical SkillsMust-Have: Kotlin programming language.Nice-to-Have: Experience with Golang, GraphQL, and Python.Additional DetailsThis is a contract position requiring flexibility to work US hours.You’ll work closely with a highly motivated team of engineers to drive growth and deliver features that make a global impact.",
            "apply_options": [
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/russell-tobin/software-engineer-android-89024/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/88c00976978cfb41e1accb809a5a5dd1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Findjob24h.com",
                    "link": "https://findjob24h.com/android-software-engineer-job121625?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciDigJMgQW5kcm9pZCIsImNvbXBhbnlfbmFtZSI6IlJ1c3NlbGwgVG9iaW4iLCJhZGRyZXNzX2NpdHkiOiJVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiNXhYWmZBVnRXcDNRbUdjLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Senior Android Developer – Remote (must be UK based) – £55k",
            "company_name": "Ada Meher",
            "location": "United Kingdom",
            "via": "IT Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=mzwqI6a-KkrE5cLJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3OPwrCMBSAcVx7BF3eqIKtCF10KgiCxUUpjiVpHmk0zQt5UTp6B4_gEbyBR_Ek_lm-5bd8yXOQHA_oDAUonApkFKzxipY8Bnjf7rDHjiLCuLtwBIlQlSAFo5r89fXI8zPMYEsSGEVoWiAHGyJtcbhqY_S8zDJmm2qOIpombajLyKGkPjuR5F9qbkVAb0XEepHP-9Q7PR0VSsAO2--GcVA5E1FBaZxW1H0AtR8pzbYAAAA&shmds=v1_AUFQtOPkrAVDJy7j0nZHvlcG10VJ85EL3XME2pwu7fTA4SIfpw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mzwqI6a-KkrE5cLJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb2a51ccaab1eedc0d416a82db4cc5591e845fc40d1c78f1e94.gif",
            "extensions": [
                "£50K–£55K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "£50K–£55K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Android Developer – Remote (must be UK based) – £55k\n\nFully remote | Kotlin / Jetpack Compose | Personal Development & Progression Plan | Flexible Hours | Evolving Digital Agency\n\nAda Meher is currently working with a scaling digital agency as they look to recruit a Senior Android Developer to work on the development of a number of their exciting client projects. The successful applicant can expect to work on both greenfield development and BAU development project using Android and surrounding tech such as Kotlin & Jetpack Compose.\n\nThis role would suit someone who is self-driven and ambitious enough to work independently as well as take advantage of the resources and expertise made available to them internally to aide their personal development. This is a real focus for the client and every member of staff has their own personal development plan and with this role there will be a clearly defined pathway into a Technical Lead role.\n\nDue to this self-started culture the business works with flexibility at its core and it happy to allow the team to work remotely, though you'll need to be based in the UK. They also offer flexibility in hours and holiday days, to ensure that employees are able to make the job work around their other life commitments.\n\nTo Be Considered…\n• Prior experience in Android Mobile App Development\n• Experience working across multiple projects simultaneously in a fast paced environment\n• Strong communication skills\n• Experience with Kotlin, Jetpack Compose and PlayStore\n• Experience with Unit Testing / TDD\n\nAs mentioned, due to their commitment to continuous improvement, each employee in this business has a tailored personal development plan to help inspire their progression and growth with-in their role. As such, if you feel you tick most of the boxes required, with the exception of key a development area, please feel confident in making an application.\n\nWe’re expecting a strong response for this Senior Android Developer role, and looking to screen candidates immediately ready to shortlist candidates ASAP. As such, please send a CV to (url removed) or apply within ASAP to be considered.",
            "apply_options": [
                {
                    "title": "IT Jobs",
                    "link": "https://www.it-jobs.co.uk/job/222757472/Senior-Android-Developer-Remote-must-be-UK-based-55k?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://uk.jooble.org/jdp/-6544242111853485605?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Remote Jobs",
                    "link": "https://remote-jobs.com/job/9931451/ada-meher-android-developer-remote-must-be-uk-based-55k/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://www.sercanto.co.uk/detail/a/remote-data-entry-clerk-work-at-home_milton-keynes_75575168?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "IT Job Board",
                    "link": "https://www.itjobboard.co.uk/job/16021202/ada-meher-android-developer-remote-must-be-uk-based-55k/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/uk/job/full-time/others/senior-android-developer-remote-must-be-uk-based-55k-137227296?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://uk.jobrapido.com/jobpreview/4524961446081069056?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The BIG Jobsite",
                    "link": "https://www.thebigjobsite.com/details/702EE51081D1B2F204353C55FE38C18C/ada-meher---android-developer---remote--must-be-uk-based-----55k?source=attbus&utm_source=googlejobs&utm_medium=api2&key=D80527196478F11C7FF2D7A89B354978&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIg4oCTIFJlbW90ZSAobXVzdCBiZSBVSyBiYXNlZCkg4oCTIMKjNTVrIiwiY29tcGFueV9uYW1lIjoiQWRhIE1laGVyIiwiYWRkcmVzc19jaXR5IjoiVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Im16d3FJNmEtS2tyRTVjTEpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Developer Android",
            "company_name": "Wpsinplace",
            "location": "Leicester, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=KRKphXfsxSOQOICPAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7CU63KaKNCC46CYKgruJY0uRIT9K7kDukn-Enq8sbXvOZNcszvjFLwQonjlUowgau0oOir2EAYbiIpIzz42BW9OCcam6TmjcKbZDRCWMvk3tJr386HXzFkr1ht9tvp7ZwWi2eRYl_GRCI4Y4UUA3rGh5MhhFuxCnK-AXFWhOMkwAAAA&shmds=v1_AUFQtOM2HPJhU0XjnYGNbzZ2jwNOTjprbNLxqmK4_AI-gd0_fA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=KRKphXfsxSOQOICPAAAAAA%3D%3D",
            "extensions": [
                "6 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: Mobile App Developer\nDescription\n\nWe are seeking an experienced Mobile App Developer to join our team.\n• Able to communicate effectively with stakeholders and/or other team members due to strong English language skills.\n• Proven ability to work collaboratively in a fast-paced, large-scale environment within a technical team.\n• Expertise in Xamarin Native (Xamarin.iOS and/or Xamarin.Android) & Xamarin Forms/MAUI.\n• Detailed knowledge of the .NET framework technology stack using C#.\n• Experience in developing mobile apps for iOS and/or Android platforms.\n• Understanding of Object-Oriented design principles and implementation methods.\n• Familiarity with Design patterns and SOLID principles.\n• Working knowledge of MVVM / MVC application architectures.\n• Strong analytical and problem-solving skills.\n• Excellent decision-making, interpersonal, and leadership abilities.\n• Proficient in Source Control best practices using TFS or GIT.\n• Understanding of Unit Testing and Continuous Integration.\n• Prior experience publishing one or more applications in the Apple App Store / Google Play Store.\nRequirements\n\nSalary: £80,000 - 100,000 per annum\nKey Responsibilities\n\nThe successful candidate will be responsible for:\n• Designing, developing, and testing mobile apps for various platforms.\n• Collaborating with cross-functional teams to ensure seamless app delivery.\n• Maintaining and updating existing apps to meet changing business requirements.\n• Ensuring high-quality code and adhering to industry standards.\n• Providing technical guidance and support to junior developers.\nAbout Us\n\n{company} is a leading technology company that values innovation, collaboration, and excellence. We offer a dynamic work environment, competitive salaries, and opportunities for growth and development.",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/0bec9afd330d4c95a77938cf2081d947?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/leicester/uk/software_development/3718275259/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=639b900f6abf&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXZlbG9wZXIgQW5kcm9pZCIsImNvbXBhbnlfbmFtZSI6Ildwc2lucGxhY2UiLCJhZGRyZXNzX2NpdHkiOiJMZWljZXN0ZXIsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJLUktwaFhmc3hTT1FPSUNQQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Senior Android Engineer Mobile 🏆",
            "company_name": "Formula Recruitment",
            "location": "Birmingham, United Kingdom",
            "via": "DevITJobs.uk",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=lmZg-2X_Pzua3l4_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHMQrCMBQAUFx7BKc_izYquNRJQQXFRXEuSftJviT_lySFnsDVI3gBD-cR1OXBK96joroik0TYcBuFWtixJUaMcBZDHuHzej5gBkcxkFDHxoEwHESsx_Ha5dylSqmUfGlT1pmaspGghNHIoO5i0p86OR2x8zpjvVzNh7JjO1nsJYbea7hgE3vKATkDMWwpBmLrdJjCjSljC6ffWwlfA5MvSa8AAAA&shmds=v1_AUFQtOMGLwkVMsvtzjVMH2zKs3sfIAUH5JVYniT9iRh4rLqm-Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=lmZg-2X_Pzua3l4_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb23a16c6725084c7e9e81367aaf79c53fd11caef8e07f92dc7.gif",
            "extensions": [
                "19 hours ago",
                "£100K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "19 hours ago",
                "salary": "£100K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Android Engineer 💰 Salary: 100,000 - 100,000 GBP per year\n\nAt Formula Recruitment we are looking for a Mobile engineer!\n\n🛠️ Our tech stack:\nAndroid, Blockchain, Java, Kotlin, Mobile, MVC, MVVM, SQLite, Web3, microservices\n\n📝 Rquirements:\nAs a candidate for the Senior Android Engineer position, you bring at least 5 years of experience in mobile app development, particularly using Kotlin, Java, and the Android SDK. You have a strong background in developing client-server applications and possess a deep understanding of mobile application designs, including MVI, MVVM, MVP, and MVC. You take pride in writing and testing maintainable code and have prior experience with Realm or SQLite databases. A solid knowledge of crypto and blockchain best practices is essential, along with excellent problem-solving and communication skills.\n\n👩‍💻👨‍💻 Your responsibilities are:\nIn this role, you will join our team to leverage your expertise in Android engineering, driving the adoption of best practices and microservices architecture. You will be tasked with building reliable, scalable, and performant complex systems that align with our vision of disrupting the crypto ecosystem.\n\nView this job and over 500 other transparent jobs with salaries (💰💰💰) & tech stacks (🛠️) on DevITJobs.uk\n\nCategory: Mobile Developer / Engineer\nLocation address: Victoria Square, Birmingham, United Kingdom\n\nSalary: 100,000 - 100,000 GBP per year\n\nBenefits & perks that we offer:\n\nFormula Recruitment - More about us and the role:\nWe are a fully remote company and are excited to offer a permanent, full-time position with generous equity allocation, flexible working hours, and ample opportunities for growth. We value team-building and social events, creating a collaborative and innovative environment. This is a remarkable opportunity for a motivated Senior Android Engineer to join an innovative start-up in the fintech space, working alongside expert teams. Please note that due to the high volume of applications, we may not be able to provide feedback to all submissions.\n\nAre you looking for Mobile jobs in Birmingham?",
            "apply_options": [
                {
                    "title": "DevITJobs.uk",
                    "link": "https://devitjobs.uk/jobs/Formula-Recruitment-Senior-Android-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciBNb2JpbGUg8J+PhiIsImNvbXBhbnlfbmFtZSI6IkZvcm11bGEgUmVjcnVpdG1lbnQiLCJhZGRyZXNzX2NpdHkiOiJCaXJtaW5naGFtLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoibG1aZy0yWF9QenVhM2w0X0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Android Developer, Java and SQL Developer",
            "company_name": "The App Experts",
            "location": "London, United Kingdom",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=0JXyp1Wyt5_4pIIaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0XNsQrCMBCAYVz7CE63KtqI4KKLBUWoXUSdS9ocSSS9C7lQ-kw-pTq5_MO3_MV7VhwrMom9gROOGDhiWkGtRw2aDNxvzd9hDTV3IKhT74AJLsw24Pzgco6yV0oklFayzr4vex4UE3Y8qRd38ksrTieMQWdst7vNVEayy8XDIVQxwnn6LrKAJ2iYDNMKnuQzGrh6soaHDyNO_BatAAAA&shmds=v1_AUFQtOOdzJczkryZQkbWCUm3Z6E-nvvMIn0xUrZsWVHXPs6jPQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=0JXyp1Wyt5_4pIIaAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb268ec681c723a2c40f4f0363e156e7a67933d835ef6a72cab.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Us\nWe’re an exciting UK Software Company focused on developing a range of market leading products for mobile. We’re increasing the size of our engineering team and are looking for vibrant developers to join our dynamic environment.\nWhat we’re looking for\nAre you an Android Developer/Java Programmer/Mobile App Developer who has experience in mobile app development and has delivered apps released via the GooglePlay app store? We’re looking for smart, problem solving software engineers with strong Eclipse, Java and SQL Developer expertise to work on our cutting edge Android apps.\nThe role is for an Android developer who boasts 3+ years’ experience of kitkat development, ideally having published a number of Android apps. We are looking for someone who has experience in all aspects of kitkat development and execution, from design to production.\nThe App Experts want software engineers who can take responsibility for their own projects and have a flare for innovation, are flexible in their approach to adopting new technologies and can work effectively within an agile team environment.\nThis is a wonderful opportunity to get involved with this rapidly expanding software company developing next-generation software for iOS, Android, and other smart phone platforms.\n\nInterested and qualified candidates email your CV to recruitment@theappexperts.co.uk.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=3eaac841ec15c1c4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/android-developer-java-and-sql-developer-the-app-experts-uk-JV_IC2671300_KO0,40_KE41,59.htm?jl=1008796160163&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.co.uk/job/f6xpS4B1eBDX3g3I8dCQ0gf-iN_ciDdjyL4zMz83lLCeXkJqbHITOQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/7cfb9dd8b80c4717a1910c0c04e7c982?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciwgSmF2YSBhbmQgU1FMIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRoZSBBcHAgRXhwZXJ0cyIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IjBKWHlwMVd5dDVfNHBJSWFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior Android Developer - Kraken Field",
            "company_name": "Octopus Energy",
            "location": "England, United Kingdom",
            "via": "Theround",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=WWSzeroDvI-EuBbVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHvwrCMBCAcVz7CE63KtqI4KJQEPwDdnAQ55ImRxpN70IuSn0jH9O6fPy-4jspqhuS5wR7som9hQO-MXDEBEuok34iwcljsONeuAVBnUwHTHBmdgGnuy7nKFulRELpJOvsTWm4V0zY8qAe3Mo_jXQ6YQw6Y7PerIYykpvPriZzfAkcCZP7gKdRLmiyC7iTz2ih9uQs9z-zd3JCqwAAAA&shmds=v1_AUFQtOODqHIpxe-T2CrfyiOO4yBcwd-w3Ph-rpuLXAHtI2ohMg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=WWSzeroDvI-EuBbVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb2136d6604cb76ce13c5e303c0b11afd687c0d81fedd4ec279.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Kraken is the technology tentacle of the Octopus Energy Group.\n\nWe’re looking for a mobile developer to join Octopus’s rapidly expanding home retrofitting tech platform, Kraken Field.\n\nAbout Kraken Field\n\nWe’re making converting homes to green electrons as simple as possible, by building a giant integrated platform to enable engineers to retrofit homes with smart meters, solar panels, heat pumps, and EV chargers. We’re busy launching in new countries, working with ever more engineers and tech partners, building exciting new features at scale, and creating the integrated solution to retrofit homes across the world - all in the name of making it as easy and cheap as possible for customers to go green.Kraken Field is a multifunctional team made up of product, backend, design, mobile, web and more - all focused together on making Octopus the go-to name in green home installations. And we’re looking for smart individuals with an interest in the space who can help us make it happen.\n\nMobile development at Octopus\n\nAs well as being part of Kraken Field you’ll be part of a large team of mobile developers across Octopus with projects spanning Electric Vehicles, Energy usage flexibility, Energy accounts, Smart home devices, Acquisitions and Engineer solutions. All our apps are built with declarative UI frameworks (Jetpack Compose & SwiftUI), all our APIs are built in GraphQL, and we use a modern selection of libraries and software development techniques.We have projects in pure Android/Kotlin, others in pure iOS/Swift and we also use Kotlin Multiplatform in larger projects to share code between native codebases.\n\n—Don’t think you check off the requirements below? We love hiring passionate people with a drive to learn so drop us a speculative application—\n\nAbout you & what you’ll do\n• You’ll be someone who thrives on uncertainty and loves to make an impact.\n• You’ll be passionate about what you do and that shows through your enthusiasm and communication.\n• Your values will align with that of the company’s, you’ll care about sustainability and creating a better future for our planet.\n• You’ll enjoy contributing across the whole development process including design, product management and stay on top of upcoming technologies that could benefit the business.\n• The home retrofitting industry and Kraken Field as a product are rapidly expanding, and are a hugely important part of decarbonising the planet - you’ll have big responsibility from day one and really help influence how we scale the technology to make that happen.\nYou’ll..\n• Be able to discuss vision and features within a team and propose creative solutions\n• Be proficient with Kotlin and have experimented with other programming languages\n• Have a good knowledge of Jetpack Compose having used it in a professional environment\n• Be passionate about app architecture and can talk about the benefits and drawbacks of various patterns (MVC, MVVM, Redux)\n• Be passionate about great app design and user experience\n• Have used GraphQL or are interested in learning\n• Have knowledge of reactive libraries, offline storage, API integration, and testing\n• Be familiar with source control best practices and continuous integration\n• Be excited to explore cross platform code sharing solutions (whilst keeping the UI 100% native)\nNon requirements but a bonus if you do have experience in any of these areas!\n• Professional use of Kotlin Multiplatform\n• Exposure to Compose Multiplatform\n• Professional iOS development experience\n\nIf this sounds like you then we'd love to hear from you.\n\nStudies have shown that some groups of people, like women, are less likely to apply to a role unless they meet 100% of the job requirements. Whoever you are, if you like one of our jobs, we encourage you to apply as you might just be the candidate we hire. Across Octopus, we're looking for genuinely decent people who are honest and empathetic. Our people are our strongest asset and the unique skills and perspectives people bring to the team are the driving force of our success. As an equal opportunity employer, we do not discriminate on the basis of any protected attribute. Our commitment is to provide equal opportunities, an inclusive work environment, and fairness for everyone.",
            "apply_options": [
                {
                    "title": "Theround",
                    "link": "https://www.theround.com/octopus-energy-jobs/senior-android-developer--kraken-field/e4fb0963-4e30-4738-a147-61759cf61fb7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgLSBLcmFrZW4gRmllbGQiLCJjb21wYW55X25hbWUiOiJPY3RvcHVzIEVuZXJneSIsImFkZHJlc3NfY2l0eSI6IkVuZ2xhbmQsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJXV1N6ZXJvRHZJLUV1QmJWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Android Engineer - DriveScore",
            "company_name": "ClearScore",
            "location": "London, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=1MulZAHFdxqHYAPOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXMsQrCMBCAYVz7CE43OIk2IrroJCqCuolzSZMjOUnvSi5IX8W3teLyw7981WdSbQ7ss5CHMwdixAxLOGV648NJxnGu0oKizS6CMFxEQsLpPpbS684Y1VQHLbaQq510RhhbGcxLWv2l0Wgz9skWbNbb1VD3HOazYxq9v08Md2EvvIAnU0EPN-LgpfsC_tpXr5wAAAA&shmds=v1_AUFQtOPJ5Cw2s36RRn9o6X8FQEW-i_PYQTQRZwI1vYkGLKjFKA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=1MulZAHFdxqHYAPOAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850319a1600b13ef9a6453/images/56cf0f8532c70bb20115bab1a5c5cb4865a404482fdd5a4d4e42755d3041d5f6.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We're looking for a Android Engineer to join DriveScore, a fast-growing scale-up business within the ClearScore Group. DriveScore’s mission is to disrupt the car insurance market by making it more transparent, accessible, and user-centric than ever before. Leveraging cutting-edge telematics technology and data analytics, DriveScore provides users with personalised car insurance offers and insights, helping people make informed decisions about their car insurance needs.\n\nYou will be joining a team of talented engineers from around the world, working in an interdisciplinary squad on the DriveScore app. You will develop experiences that are as beautiful and visually complex as they are helpful and optimised.\n\nSkills we'd love you to have:\n• End-to-end delivery of fully-fledged commercial apps\n• Good knowledge of Kotlin and Android SDK\n• Experience with Kotlin Multiplatform\n• Good understanding of design patterns & Object Oriented Programming\n• Good knowledge of Android UI design principles, patterns, and best practices In-depth experience of working with RESTful APIs\n• Hands on experience with UI/Unit Testing\n• Good knowledge of version control using Git and Gitflow\n• Experience working in an Agile Scrum environment and collaborative tools (e.g. Jira)\n• Understanding of build processes and CI tooling (e.g. Bitrise, Fastlane, GitHub Actions)\n• Knowledge of other related tech stacks, such as web or backend\n• Experience with various Dependency Injection libraries (e.g. Koin, Dagger, Hilt)\n• Experience working with multi-module projects\n\nWe are always looking for ways to do things better and encourage new joiners to bring their ideas and ways of working to the table. Teach us some cool stuff and we'll teach you some, but most of all, you'll have fun doing it.\n\nFor more information on our tech stack check out our Tech Radar 2024, how we work is summarised in our Engineering Principles and we have many other Tech Blogs on Medium.\n\nWhy ClearScore?\n\nClearScore is the UK's #1 credit score and report app. We are also present in South Africa, Australia and Canada, with more than 20 million users globally and growing fast. Someone joins ClearScore every 20 seconds.\n\nWe have established relationships with over 50 of the main lenders in the U.K., and have been a trusted tool for customers to manage their credit and make better financial decisions.\n\nSince October 2016 we have helped 1.8 million users take out a new credit card or loan. We are user-centric at our core and we believe in leveraging technology to enable positive financial choices. We are design-led and data-driven and we embed these behaviours in everything we do.\n\nWhat is DriveScore?\n\nDriveScore is a new app that helps users to prove and improve their driving skills, enabling them to save money on car insurance and other products. ****Our beautiful, insightful, and private app puts users in control of the data collected as they drive, making driving a safer, cleaner, and fairer experience for all.\n\nBeing part of the ClearScore Group means we can market to ClearScore's existing 15 million users in the UK and provides funding to take our message out to the broader market. While we operate as a separate start-up team, we benefit from access to the best of ClearScore's market-leading capability, from technology to CRM.\n\nClearScore's culture is fundamental to the success it has achieved, and we're cultivating that same culture in DriveScore. We believe in hiring smart, driven, passionate and diverse people who are keen on having a real impact in our organisation. We trust you to manage your own time so we offer flexible work and no fixed desk hours. We don't micromanage and we believe in measuring outcomes rather than effort. We have an inclusive culture where all, regardless of seniority, are encouraged to contribute with their ideas, look after their wellbeing and actively seek opportunities for career growth.\n\nIf you feel like this could be the place for you, apply and our Talent team will be happy to share more.\n\nBenefits:\n• 25 paid holidays and a “duvet day” on your birthday\n• Hybrid Work Environment\n• Private health and dental cover - including mental health support through Bupa\n• GP office visits\n• Life assurance scheme\n• Up to 6% matched pension\n• Regular Lunch and Learns with guest speakers\n• Dog-friendly office\n• Daily breakfast and free snacks\n• Access to discounts via Cobens Extras\n• Free sports and social clubs\n• Continued investment into learning and development\n• Leadership-led training\n• In-house psychotherapist\n• Financial coach to help you plan and achieve your goals\n• No clock-watching culture\n• Generous maternity and paternity plans\n• Culture and inclusion representatives\n• Transparent pay structure and a career growth plan\n\nEqual Opportunities\n\nClearScore is committed to providing equal employment opportunities to all qualified individuals. As an equal opportunity employer, we are able to make reasonable adjustments to accommodate individuals with disabilities during the recruitment and selection process. If you require accommodation, please inform us in advance, and we will work with you to meet your needs.\n\nOur Hybrid Model\n\nWe embrace a dynamic hybrid work environment that balances flexibility with collaborative in-person experiences. Our approach is designed to foster innovation, team connection, and individual productivity.\n• Levels 1-5: Minimum 2 days per week in-office\n• Level 6 and above: Minimum 3 days per week in-office\n\nWe believe this structure offers the best of both worlds - the flexibility of remote work and the synergy of face-to-face collaboration. Our office days are carefully coordinated to maximise team interactions and learning/ mentorship opportunities.\n\nWhat This Means for You:\n• Flexibility to manage your work and life\n• Dedicated in-office days for team building and collaborative projects\n• Office facilities (with plants!) designed for productive interactions\n• Clear expectations and support for maintaining our hybrid schedule\n\nWe’re committed to creating an inclusive environment that accommodates diverse needs while maintaining our collaborative culture. Join us in shaping the future of work!\n\nNote: While we offer flexibility, commitment to our hybrid schedule is an important aspect of our team culture and performance expectations.\n\nInclusion Policy\n\nWe are always looking for talented individuals to join ClearScore. We are an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for our people. Please see our People Policy Notice at https://www.clearscore.com/people-notice.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/android-engineer-drivescore-at-clearscore-4102521319?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/android-engineer-drivescore/3699774?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In London",
                    "link": "https://builtinlondon.uk/job/android-engineer-drivescore/3699774?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/4987147695?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://uk.jooble.org/jdp/-7679907138459312631?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Brookson Jobsboard",
                    "link": "https://jobsboard.brookson.co.uk/job/8259913/android-developer-contract/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Remote",
                    "link": "https://remote.com/jobs/clearscore-technology-limited-c1gng2ov/android-engineer-drivescore-j1m1ch5d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WKRN Jobs",
                    "link": "https://jobs.wkrn.com/jobs/android-developer-edtech-london/1543352915-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIC0gRHJpdmVTY29yZSIsImNvbXBhbnlfbmFtZSI6IkNsZWFyU2NvcmUiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiIxTXVsWkFIRmR4cUhZQVBPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Android Developer (Hybrid)",
            "company_name": "AES",
            "location": "Cambridge, United Kingdom",
            "via": "Adzuna",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=Android+developer&htidocid=mUUAVkRwRWlv1dNYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU43qmijgkudioqioziXpDnSSHIXckHqb_jF0uWtr_rNql1LNrO3cMYPBk6YYXH7muztEjZwZwOCOvcDMMGV2QWcH4dSkjRKiYTaSdHF93XPUTGh4VG92chEJ4POmIIu2O0P27FO5FbQXp7gCU46TonDNbzIF7Tw8OQsxz8CvS7WlQAAAA&shmds=v1_AUFQtOMPp4klP1BsV1pSmCs8IqQbTUS5rw2vr8IFFglQRtTPJQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mUUAVkRwRWlv1dNYAAAAAA%3D%3D",
            "extensions": [
                "£75K–£85K a year",
                "Full-time"
            ],
            "detected_extensions": {
                "salary": "£75K–£85K a year",
                "schedule_type": "Full-time"
            },
            "description": "Position: Android Developer (Hybrid)\n\nLocation: Cambridgeshire\n\nSalary: £75,000 to £85,000 + Excellent Benefits / Prospects (including Relocation Assistance)\n\nIf there is something stopping you from achieving all you’re capable of, you’ll relish a role with a company that will positively encourage you to be pro-active – a real opportunity to release your true potential.\n\nThe Company: Our Client, an innovative dynamic passionate reliable collaborator for public safety users and commercial customers, my client excels in adapting to the evolving landscape of the Voice Communication Sector.\n\nOwing to ongoing expansion, they now need an Android Developer to assist with the development, configuration, and optimization of the Android platform, modifications to the Android framework/services, and the Android development toolchain. While experience in developing Android apps is beneficial, this role is not focused on Android app development.\n\nThe Person: Candidates suitable for consideration should be able to provide evidence of the following:\n• A HNC/D / Degree in Software Engineering (or similar) or be a Time Served Engineer with relevant experience\n• Good understanding of the Android architecture and ecosystem (including low level and security)\n• Understanding of the Android SDK and APIs (especially telecoms and networking)\n• Experience with most of the following: Binder / AIDL / Services (C++/Java) / Framework APIs / NDK, JNI & CTS\n\nThe successful candidate will enjoy a salary of between £75,000 to £85,000 (DOE) + Excellent Benefits / Prospects (including Relocation Assistance), an employment package that you would expect from a company that values its employees.\n\nDo you have the courage to take on this challenge?",
            "apply_options": [
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/4926354032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/e4d6943f1261e166fea55f7554a5cbb7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/aes/android-developer-hybrid-143965/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=11a099e5eba9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoSHlicmlkKSIsImNvbXBhbnlfbmFtZSI6IkFFUyIsImFkZHJlc3NfY2l0eSI6IkNhbWJyaWRnZSwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Im1VVUFWa1J3UldsdjFkTllBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUakJYV2tsVU4xQndVekZwTjJOU01EZEdOMDVRVEhseWR6aHlTREZuVEdoWE1HMDRZV1ZpV1U1dE0xOUhjWEJDTlMxSFpHaDBjM1JVUzFWR2FWSjZhV3cwZGtZemJXdGZialJ3YjFaU1NFbHRkMGM0WjNWVGJYaGZXVlZ0Y1hrNVIya3llRGhDT0hSWFpsQmZVRWRSZFhrNFZGbEJVWGMyYlc5bk0yaFRYMll6YUd4UmEwMW5MWEZXVVZoR01IUkNhVjlKVW5rM09URXROV2hHV2xsNFV5MDFTR0ZDWkhoR1pTMUJha05SYkdSSFoxZHBOVUZmVEMxM2FGOXBkRVk0Yms0d2F6SjBTblZmY25aTlFVcEllRkYxZUhwelZXVlVNRjlDTFVreWFrcEJSbEZTU0ZORlJtbFNlQzF5T1dONWNuaG1TRzh5VVdOblJUTlJNazFwUTI0NWRUWmtWVkJHTTFsQ2JtZE9WRTFwTVZKRVpqaENkVlZZTjNjU0YwZG5UMFphT1dWSFJHTjVMV3QyVVZCM2RYVlFhVkV3R2lKQlJsaHlSV055Y3pKWFFrVk9hbmgyVUdKd2REUXdjek5NVWxsdlVIWmZUVXAzIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUakJYV2tsVU4xQndVekZwTjJOU01EZEdOMDVRVEhseWR6aHlTREZuVEdoWE1HMDRZV1ZpV1U1dE0xOUhjWEJDTlMxSFpHaDBjM1JVUzFWR2FWSjZhV3cwZGtZemJXdGZialJ3YjFaU1NFbHRkMGM0WjNWVGJYaGZXVlZ0Y1hrNVIya3llRGhDT0hSWFpsQmZVRWRSZFhrNFZGbEJVWGMyYlc5bk0yaFRYMll6YUd4UmEwMW5MWEZXVVZoR01IUkNhVjlKVW5rM09URXROV2hHV2xsNFV5MDFTR0ZDWkhoR1pTMUJha05SYkdSSFoxZHBOVUZmVEMxM2FGOXBkRVk0Yms0d2F6SjBTblZmY25aTlFVcEllRkYxZUhwelZXVlVNRjlDTFVreWFrcEJSbEZTU0ZORlJtbFNlQzF5T1dONWNuaG1TRzh5VVdOblJUTlJNazFwUTI0NWRUWmtWVkJHTTFsQ2JtZE9WRTFwTVZKRVpqaENkVlZZTjNjU0YwZG5UMFphT1dWSFJHTjVMV3QyVVZCM2RYVlFhVkV3R2lKQlJsaHlSV055Y3pKWFFrVk9hbmgyVUdKd2REUXdjek5NVWxsdlVIWmZUVXAzIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}