{
    "search_metadata": {
        "id": "67850a0703883e94b049c12a",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/cd3bab9e5081e717/67850a0703883e94b049c12a.json",
        "created_at": "2025-01-13 12:41:43 UTC",
        "processed_at": "2025-01-13 12:41:43 UTC",
        "google_jobs_url": "https://www.google.ca/async/callback:550?q=Android+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EuICCqICQUpHOUprTkM0NDNkbldCVk14dGJZRWZlbldqNEl4N2RTc2xmbG5aaHZubUJ1aXRXSkhhbW50cHpfWmMzVW9nWHRsR1VSNmdfMXpya1VKZXNQUzNIWWd1azFiRldlUUFMMnh6UXpfYmFYaFc2MnNRQS1ZWFQ1MHdLMEIxMHR4ZzN1eTNqRGlPOVZHdE04VmQ2MkJ0NDFRbm9jVW1fMEhlNncwc203Q25zU25zQ2Q3V2JzZ0pTdmxjbi1iYm15YjBKVFRrdVVfVjg2aFJ5WmhBcExpYW9BZ2hDUEFHVEFiWWxHWEs3TzVJOG9aa3Q2RHlPaVRFU1FZNWNLZnVvY0pqX2piVnVaZzFGVmM3NzBNNXd0ck9vQWZxMU92cVFkNFFuQlESF0J3cUZaX1hoRXRDazVOb1BfcUx6NkFVGiJBRlhyRWNwMUJmZGlSSEFBMFBjRzgtVXJyVHVZR3JZemZR&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/cd3bab9e5081e717/67850a0703883e94b049c12a.html",
        "prettify_html_file": "https://serpapi.com/searches/cd3bab9e5081e717/67850a0703883e94b049c12a.prettify",
        "total_time_taken": 1.0
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.ca",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUa00wTkROa2JsZENWazE0ZEdKWlJXWmxibGRxTkVsNE4yUlRjMnhtYkc1YWFIWnViVUoxYVhSWFNraGhiVzUwY0hwZldtTXpWVzluV0hSc1IxVlNObWRmTVhweWExVktaWE5RVXpOSVdXZDFhekZpUmxkbFVVRk1Nbmg2VVhwZlltRllhRmMyTW5OUlFTMVpXRlExTUhkTE1FSXhNSFI0WnpOMWVUTnFSR2xQT1ZaSGRFMDRWbVEyTWtKME5ERlJibTlqVlcxZk1FaGxObmN3YzIwM1EyNXpVMjV6UTJRM1YySnpaMHBUZG14amJpMWlZbTE1WWpCS1ZGUnJkVlZmVmpnMmFGSjVXbWhCY0V4cFlXOUJaMmhEVUVGSFZFRmlXV3hIV0VzM1R6VkpPRzlhYTNRMlJIbFBhVlJGVTFGWk5XTkxablZ2WTBwcVgycGlWblZhWnpGR1ZtTTNOekJOTlhkMGNrOXZRV1p4TVU5MmNWRmtORkZ1UWxFU0YwSjNjVVphWDFob1JYUkRhelZPYjFCZmNVeDZOa0ZWR2lKQlJsaHlSV053TVVKbVpHbFNTRUZCTUZCalJ6Z3RWWEp5VkhWWlIzSlplbVpSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer",
            "company_name": "Orion Innovation",
            "location": "Mississauga, ON, Canada",
            "via": "SitePoint",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=JPnMKdGwK1CksXL5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMQQrCMBBFcdsjuJqlaG1EcGNXoiAK2iOUaTukkTgTMrH0IB7YCJ_H27xffBfF6sRDFDfAhSbyEijCFu7SgRLGfgRhuIpYT8t6TCno0RhVX1lNmFxf9fI2wtTJbF7S6R-tjhgpeEzU7g-7uQps15smunx1Y5Yph1kdw8Op5uHHYgnNs4QzMg74AxSQjeiXAAAA&shmds=v1_AUFQtOO7mvHfalfJRxssubdfHVPGrI6aBM5qn9ea_mv5rG5aoQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=JPnMKdGwK1CksXL5AAAAAA%3D%3D",
            "extensions": [
                "8 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "8 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: Mobile Android Developer 5 years with experience in Android TV Development Location: Mississauga, ON Type: Hybrid [3 days onsite] Type: Contract 8 Months Job Description : A client of ours is seeking a skilled Android Developer [5 years] passionate about crafting seamless and engaging user experiences? Join our dynamic team as a Senior Android Developer[5 years] , where you’ll spearhead the development of new features, maintain our suite of Android applications, and collaborate with external agencies to ensure adherence to our development guidelines. Partnering with talented engineers and designers, you’ll play a key role in creating exceptional experiences for our users. Responsibilities Take a leading role in defining the architecture and implementing key technological solutions. Translate business requirements into technical designs that align with company goals. Participate actively in product development phases, including daily scrums, grooming sessions, and story refinement. Develop and execute robust unit tests for edge cases, usability, and reliability. Use Git for pull requests, code reviews, and branch merges. Collaborate within the team to share knowledge and enhance development practices. Implement Agile Scrum methodologies in all development initiatives, including research, prototyping, and interface design. Address challenges openly and foster a culture of learning and team growth. Qualifications Must-Have Skills 5 years of experience in Android development (Kotlin, Android SDK, Java). Deep knowledge of Android SDK, performance, and optimization techniques (e.g., AsyncTasks, Adapters, Fragments, Activities, Threading). Proven understanding of object-oriented design patterns and principles. Strong grasp of mobile user interface guidelines and best practices. Hands-on experience with RESTful web APIs and JSON integration. Proficiency in planning and writing technical documentation. Excellent problem-solving and risk management skills. Experience with Jetpack Compose. Nice-to-Have Skills Familiarity with Android TV development . Exposure to Kotlin Multi-Platform . Knowledge of GraphQL integration . Experience with iOS native development. Strong understanding of SQL and relational databases . Awareness of code obfuscation and encryption techniques. Knowledge of Chromecast implementation and optimization.",
            "apply_options": [
                {
                    "title": "SitePoint",
                    "link": "https://www.sitepoint.com/jobs-for-developers/orion-innovation/android-developer-1330301/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ca.trabajo.org/job-947-ebee8ec4282ad4d52a2673097faffe90?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobtome",
                    "link": "https://ca.jobtome.com/job/android-developer/1f8deba1754119e43f60ad4e80c34e13?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/ca-on-mississauga-android-developer-ontario-orion-innovation-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobdash.ca",
                    "link": "https://jobdash.ca/job/android-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6Ik9yaW9uIElubm92YXRpb24iLCJhZGRyZXNzX2NpdHkiOiJNaXNzaXNzYXVnYSwgT04sIENhbmFkYSIsImh0aWRvY2lkIjoiSlBuTUtkR3dLMUNrc1hMNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Staff Android Developer",
            "company_name": "Arlo Technologies Canada Limited",
            "location": "Richmond, BC, Canada",
            "via": "Workday",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=IXbfOZSHNsbxTGeBAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3JsQrCMBAAUFz7CU43S01FEESnWkEQJ3Uv1-SaRNK7kATpH_mbIri85VWfRaUeBccRWjZJvIEzvSlIpARruMoAmTBpB8JwEbGBlkdXSsyHpsk5KJsLFq-VlqkRpkHm5iVD_tFnh4liwEL9dreZVWS72rcpCDxJO5Yg1lOGDhkNws1PvpABz3D32k3CpoZTV___C32NhXiqAAAA&shmds=v1_AUFQtOObyqC4orXYN9z4OvK8UbcfMVkV0mIcmpW3jiV6OqmXiA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=IXbfOZSHNsbxTGeBAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Arlo: At Arlo, we're passionate about creating innovative and reliable solutions that help people protect what matters most to them. Our team is dedicated to delivering products that exceed our customers' expectations, while always pushing the boundaries of what's possible in the world of protection technology. We believe that everyone deserves to feel safe and secure, whether they're at home or away, and we're committed to providing our customers with the peace of mind they need to live their lives without worry. Arlo’s deep expertise in AI- and CV-powered analytics, cloud services, user experience, product design, and innovative wireless and RF connectivity enables the delivery of a seamless, smart security experience for Arlo users that is easy to set up and interact with every day. Job Brief: We are seeking a highly skilled and experienced Staff Android Engineer to join our dynamic team. In this role, you will be responsible for leading the development and maintenance of our Android applications, ensuring the highest standards of code quality, performance, and scalability. You will collaborate closely with cross-functional teams, mentor junior engineers, and drive the adoption of best practices in Android App development and delivery. Job Description: As a Staff Android Engineer, you will take a leading role in the design, development, and deployment of our Android applications. You will work on a variety of projects, from architecture to deployment pipelines, and play a critical role in shaping the direction of our technology stack. This position requires hands-on coding, as well as strategic thinking to guide our team in delivering top-tier, scalable Android apps. In this role, you will be responsible for overseeing multiple projects, ensuring delivery of immediate goals, and leading the development and launch of product features. Additionally, you will mentor junior developers, participate in code reviews, and collaborate closely with product and engineering teams to drive innovation. Key Responsibilities: Lead Android Development: Architect, design, and implement Android applications, ensuring high performance, stability, and scalability. Code Quality and Best Practices: Conduct code reviews, enforce best practices, and ensure robust testing processes. Project Management: Coordinate projects, establish schedules, and ensure delivery of immediate goals and tasks. Features Focused: Lead the development and launch of product features. Help define product features, drive the system architecture, and spearhead best practices. Collaborate Across Teams: Work closely with product managers, designers, backend engineers, and QA teams to align on project goals and deliver seamless mobile experiences. Technology Evaluation: Evaluate the effectiveness of technologies, software, and tools to build state of the art solutions to meet business goals. Mentorship: Mentor and guide junior and mid-level engineers, fostering growth and ensuring knowledge sharing within the team. Stay Updated on Android Trends: Stay current with the latest developments in Android SDKs, libraries, and mobile development tools, introducing new ideas and technologies to the team. Qualifications: Experience: 7+ years of Android development experience, with deep knowledge of Kotlin, Java, and Android SDK. Architecture: Strong understanding of Android architectures (MVVM, Clean Architecture) and design patterns. Version Control: Proficiency with Git and managing complex branching strategies in large-scale projects. Agile Methodologies: Familiarity with Agile development processes and experience working in Agile teams. Communication Skills: Excellent communication skills, with an ability to clearly explain complex technical issues to non-technical stakeholders. Leadership: Proven experience in leading technical teams and mentoring junior engineers. Bonus Skills: Experience with analytics tools like Amplitude, LaunchDarkly, or Firebase Experience with reactive architecture RxAndroid, RxJava. Experience with Espresso Framework and UI Testing Experienced with Google Play Billing Ability to work well with tight schedules and rapid development cycles The pay range for this position reflects the minimum and maximum target for new hire salaries at commencement of employment and is expected to be between CAD$115,000-181,000/year. However, base pay offered may vary depending on multiple factors, including role, job-related knowledge, skills, relevant education and experience. The total compensation package for this position may also include other elements, including bonus, equity, and a full range of benefits. Details of all benefits will be provided if an employee receives an offer of employment. Studies have shown that candidates from certain underrepresented communities may be less likely to apply for jobs unless they believe they meet every single one of the qualifications as described in a job description. We are committed to building a diverse and inclusive company and we are most interested in finding the BEST candidate for the job, regardless of their background. That candidate may be one who comes from a less traditional background, and that’s okay. We would strongly encourage you to apply, even if you don't believe you meet every one of the qualifications described. We may work with candidates, as appropriate, to ensure they develop additional skills as necessary to fulfil the essential functions of the job. Arlo is proud to be an equal opportunity employer. We value diversity and inclusion and are committed to a diverse, inclusive, and harassment-free workplace. We prohibit discrimination and harassment based on Indigenous identity, race, colour, ancestry, place of origin, political belief, religion, marital status, family status, physical or mental disability, sex, sexual orientation, gender identity or expression, or age, or any other legally protected status in all hiring and employment. We provide reasonable accommodations to applicants and employees as required by law. Where required by applicable provincial law, the Company will consider for employment qualified applicants with criminal charges or convictions. We are a passionate and diverse group of thought leaders, creators, and developers across all disciplines dedicated to changing how people protect and connect with the people and things they love. Our talented employees, located throughout the United States, Canada, Asia, Australia, and Europe communicate, connect and work together to lead the industry in delivering a world-class end-to-end connected lifestyle solution. At every location, passionate and innovative employees work together to shape the future of connectivity. At Arlo, our employees are recognized as central to our business success, now and into the future.",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://arlo.wd12.myworkdayjobs.com/en-US/External_Careers/job/Staff-Android-Developer_JR100043?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://emplois.ca.indeed.com/viewjob?jk=08aec0a9d317afeb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/staff-android-developer-arlo-JV_IC2303209_KO0,23_KE24,28.htm?jl=1009531817283&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/staff-android-developer-at-arlo-technologies-inc-4050831576?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/JDF35EGRH-CRaJbf-hnjrRzNC8huNI4XvKHUgQBl_Wn4Fd_KAaZRrg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFybG8gVGVjaG5vbG9naWVzIENhbmFkYSBMaW1pdGVkIiwiYWRkcmVzc19jaXR5IjoiUmljaG1vbmQsIEJDLCBDYW5hZGEiLCJodGlkb2NpZCI6IklYYmZPWlNITnNieFRHZUJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior Android Developer",
            "company_name": "audiobooks.com",
            "location": "Burlington, ON, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=2NhK88Z1Z6peIAv2AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBAAUFz7CU43itRGBBedqoLgoIMfUC7NkUbjXcil0k_xc6XL2171W1TmSRwkQ8suS3BwoS9FSZRhAzexoIS5H0AYriI-0vI4lJL0YIxqbLwWLKFvevkYYbIymZdYnel0wEwpYqFut99OTWK_XuHogliRt84HAsNpzDGwL8I1PO41nJHR4R8DVaiomwAAAA&shmds=v1_AUFQtOMu-a_jazAdK-52I_7WIZWncwCv2sezUu1o93cLBnSYkQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2NhK88Z1Z6peIAv2AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993b11f8dc2b5afc37cc58b076554784bc1aacb7e3dbc800f6cd.gif",
            "extensions": [
                "10 days ago",
                "CA$110K–CA$140K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "salary": "CA$110K–CA$140K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "THE JOB\n\nWe are looking for a Senior Android Developer to join our talented mobile development team. As part of the development team, you will work alongside skilled developers to deliver a seamless experience for Android devices. As a key contributor, you will design, develop, and maintain high-quality code while mentoring junior team members. It will be important that you work well with other team members from a variety of departments towards common business objectives, and share their passion for the mobile experience, brand, digital product, and great books.\n\nABOUT YOU\n\nYou're a skilled Android developer looking for a company where you can have a real impact and work with a dedicated team. You're passionate about app development and the digital experience. You've got a proven track record of enriching apps and bringing ideas to life. You thrive in a dynamic environment, collaborating with multidisciplinary teams to create awesome user-centered experiences that compel and engage. If this is you, look no further.\n\nWHAT WE'RE LOOKING FOR\n\nThe ideal candidate will have 5+ years of experience in Android development and be passionate about researching, developing, testing, and implementing user-centric app experiences. We're looking for an experienced Android developer to make our apps shine. Our awesome mobile apps are a huge part of our brand and service, and we're looking for someone to help us keep our Android apps working flawlessly and build new features our users will love.\n\nMUST HAVES\n• 5+ years of hands-on, professional software development experience developing user-facing Android mobile native applications at scale, using Kotlin or Java\n• Experience with modern Android development frameworks such as Jetpack Compose and Room\n• Strong knowledge of Git flow strategies (e.g. feature branching, release management)\n• Knowledge of mobile network communication, API integration\n• Intuitive grasp of app design and usability best practices, emerging trends, and constraints\n• Display outstanding communication and organization skills, share technical insights with various teams, and foster a supportive and collaborative work environment\n• Encourage ongoing learning and adoption of the latest Android trends, leading the team by example\n• Familiarity with Google Play Console\n\nNICE TO HAVES\n• Experience with Android Auto and Wearables\n• Experience developing applications that support media playback\n• Hands-on experience setting up or managing CI/CD pipelines (e.g. GitHub Actions, fastlane, Jenkins)\n\nA TYPICAL DAY\n• Implement major design and functionality features\n• Develop and maintain expertise with new and emerging Android platforms\n• Participate in cross-functional meetings with a view to evolving UI, API, and usability standards\n• Analyze, understand, and solve functional problems for users\n• Mentor junior developers and provide guidance on best practices and coding standards.\n• Recommend technical developments and software to enhance/improve our app\n\nWORKING WITH US\n\nAt Audiobooks.com, you'll never feel tied to your desk. We employ a hybrid work policy, working 3 days of the week from home (Tuesdays & Thursdays in office). We've got two stories of really bright, open space in a great location that's just a 10-minute walk from Appleby GO Station, and we offer free parking. We provide our employees with healthy snacks, full benefits, and an unlimited paid vacation policy. Our close-knit group runs a ping-pong league, a book club, and frequent lunch outings for our resident foodies. Everyone who works here is friendly, talented and passionate, and enjoys getting their hands dirty building amazing products.\n\nEqual Opportunity Employer\n\nAudiobooks.com is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=57652f13e11b8ad0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/audiobooks.com/Job/Senior-Android-Developer/-in-Burlington,ON?jid=3db2cd7fad948e4d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/senior-android-developer-audiobooks-com-JV_IC2284969_KO0,24_KE25,39.htm?jl=1009585208994&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Career Beacon",
                    "link": "https://www.careerbeacon.com/fr/emplois-9/1751598/audiobooks-com/senior-android-developer/burlington-on?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/5wkmQZsYS154NoL3HmSekeRW-C2alFI1yL9HSVSt0QsCbohNw4ApAQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJhdWRpb2Jvb2tzLmNvbSIsImFkZHJlc3NfY2l0eSI6IkJ1cmxpbmd0b24sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6IjJOaEs4OFoxWjZwZUlBdjJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Android Developer - Core Experience",
            "company_name": "TextNow",
            "location": "Canada",
            "via": "Lever",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=q_tYp7sNbZvtd_OQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBCAYVy7uTrdLNiI4FInqSI4OLmXa3KkKfEu5ILmIXxo6_LD9zffVdOd2WUJDi70piiJMuygl0xwrQsCsaXl3GUEJcx2AmG4ifhIm9NUStLOGNXYei1Ygm2tvIwwjVLNLKP-M-iEmVLEQsPhuK9tYr9dP6mWh3wgMPTI6PAHsJhYio8AAAA&shmds=v1_AUFQtOPLBktIObhUAuNBiIGLbHSR_GcKYfGsZ_5wZY2sFLEOsg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=q_tYp7sNbZvtd_OQAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993bebb6de1d6fa07c5c5a258209e9ce7f6975c2ce24c4a9458e.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We believe communication belongs to everyone. We exist to democratize phone service.  TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do.   We're the largest provider of free phone service in the nation. And we're just getting started.\n\nJoin us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n\nTextNow is looking for an experienced Android Developer to play a key role in the development of our voice and messaging platform on Android. You will be responsible for building high-performance, scalable, and feature-rich mobile applications that integrate voice, video, and messaging capabilities. You will work alongside a talented team of developers, product managers, and UX/UI designers to create intuitive and user-centric experiences.\n\nWhat You’ll Do:\n• Design, develop, and maintain high-quality Android applications focused on voice and messaging features (voice calling, chat, real-time notifications, etc.).\n• Write clean, maintainable and testable Android applications in Java and Kotlin using the latest programming techniques and frameworks\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Work with real-time communication protocols, such as WebRTC, SIP, and related messaging and voice frameworks.\n• Optimize app performance to ensure smooth voice and messaging functionality, including audio quality, latency, and bandwidth usage.\n• Troubleshoot and debug issues related to performance, crashes, and other bugs, ensuring a smooth and stable user experience.\n• Own problems and solutions end-to-end, from ideation to deployment\n• Experimentation is a key part of your workflow; be data-driven and make the right decisions for our customers\n• Deploy your features to millions of users - your work will have an immediate impact.\n\nWho You Are:\n• A professional Android developer with 2+ years of experiencewith Android App development).\n• Experiencein Kotlin and Java, with a deep understanding of Android SDK, APIs, and frameworks.\n• Bonus points for experience with real-time communication protocols and technologies like WebRTC, SIP, or similar.\n• Experience with APIs and third-party libraries for real-time messaging and media streaming.\n• Knowledge of push notifications, background app tasks, and managing network connections for real-time updates.\n• Familiarity with modern Android development tools, Instruments, and the debugging process.\n• Understanding of user experience (UX) principles, with the ability to design elegant, simple solutions for complex problems.\n• Experience with automated testing frameworks (Unit, UI, Integration testing).\n\nMore about TextNow...\n\nOur Values:\n\n· Customer Obsessed (We strive to have a deep understanding of our customers)\n\n· Do Right By Our People (We treat each other with fairness, respect, and integrity)\n\n· Accept the Challenge (We adopt a \"Yes, We Can\" mindset to achieve ambitious goals)\n\n· Act Like an Owner (We treat this company like it's our own... because it is!)\n\n· Give a Damn! (We are deeply commited and passionate about our work and achieving results)\n\nBenefits, Culture, & More:\n\n· Strong work life blend\n\n· Flexible work arrangements (wfh, remote, or access to one of our office spaces)\n\n· Employee Stock Options\n\n· Unlimited vacation\n\n· Competitive pay and benefits\n\n· Parental leave\n\n· Benefits for both physical and mental well being (wellness credit and L&D credit)\n\n· We travel a few times a year for various team events, company wide off-sites, and more\n\nDiversity and Inclusion:\n\nAt TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great.\n\nTextNow Candidate Policy\n\nBy submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the TextNow Candidate Policy",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/textnow/099b107c-aeb0-49d9-8abc-394137ebe560?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=f46c0b491961aabb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/android-developer-core-experience/3713440?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/android-developer-upgrades-labs-textnow-5725098?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/android-developer-core-experience-at-textnow-4102637526?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/android-developer-core-experience-textnow-JV_KO0,33_KE34,41.htm?jl=1009569926818&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Org",
                    "link": "https://theorg.com/org/textnow/jobs/android-developer-core-ex-daf2f30c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Muse",
                    "link": "https://www.themuse.com/jobs/textnow/android-developer-core-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAtIENvcmUgRXhwZXJpZW5jZSIsImNvbXBhbnlfbmFtZSI6IlRleHROb3ciLCJhZGRyZXNzX2NpdHkiOiJDYW5hZGEiLCJodGlkb2NpZCI6InFfdFlwN3NOYlp2dGRfT1FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Technology Lead - Android Developer",
            "company_name": "Infosys",
            "location": "Canada (+2 others)",
            "via": "AnitaB.org Job Board",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=2ATJTXGGHyJTFC3eAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFy7uTrdLJiI4FInURDF0b1ckzNpiXchF6T9Bz9aXd7wms-iaR_kIkuSMMOd0MMGjuyLDB7O9KYkmcrvbtKDEhYXQRguIiHR6hBrzdpaq5pM0Ip1cMbJywpTL5Mdpdc_nUYslBNW6nb77WQyh_Xyyk_RWWFgOCGjxy9DzxUIjwAAAA&shmds=v1_AUFQtOOof8bRuEhT6568lBc-8EoC2y759U0WhOfg1ej5pRlLCA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2ATJTXGGHyJTFC3eAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993b048a74ae92598f85a9ac8a478755cbad17421e075ab16307.gif",
            "extensions": [
                "13 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "13 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Job details\n\nCountry\n\nCanada\n\nState / Region / Province\n\nOntario\n\nWork Location\n\nMississauga, Toronto\n\nDomain\n\nDelivery\n\nInterest Group\n\nInfosys Limited\n\nSkills\n\nTechnology|Mobile Development Platform|Android\n\nCompany\n\nITL Canada\n\nRequisition ID\n\n127676BR\n\nJob description\n\nInfosys is seeking a Android Developer. This position will interface with key stakeholders and apply technical proficiency across different stages of the Software Development Life Cycle including Requirements Elicitation, Application Architecture definition and Design; play an important role in creating the high level design artifacts; deliver high quality code deliverables for a module, lead validation for all types of testing and support activities related to implementation, transition and warranty. This is an opportunity to be part of a learning culture, where teamwork and collaboration are encouraged, excellence is rewarded, and diversity is respected and valued.\n\nRequired Qualifications :\n• Candidate must be located within commuting distance of Toronto/Mississauga, Ontario or be willing to relocate to the area. This position may require travel.\n• Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.\n• At least 4 years of Information Technology experience.\n• Candidates authorized to work for any employer in Canada without employer based visa sponsorship are welcome to apply. Infosys is unable to provide immigration sponsorship for this role at this time.\n\nPreferred Qualification :\n• At least 4 years of experience in Android Development\n• At least 4 Kotlin and Java programming languages\n• Exposure to hybrid mobile technology Flutter.\n• Good experience in project life cycle activities on development projects.\n• Experience with cloud platforms and backend technologies relevant to mobile development is a plus.\n• Ability to work in team in diverse/ multiple stakeholder environment\n• Experience in Telecom domain\n• Experience and desire to work in a Global delivery environment.\n• Expertise in Kotlin and Java programming languages.\n• In-depth understanding of modern design patterns like MVVM, Viper, and Dagger.\n• Strong experience with Android Studio development environment.\n• Proven ability to write unit and integration tests using relevant frameworks.\n• Experience integrating and utilizing third-party libraries and SDKs effectively.\n• Excellent problem-solving and debugging skills.\n• Strong communication and collaboration skills to effectively lead and work within a cross-functional team.\n• A passion for building user-centric and high-quality mobile applications.\n\nThe job entails sitting as well as working at a computer for extended periods of time. Should be able to communicate by telephone, email, or face to face. Extensive travel may be required as per client and project needs.\n\nEstimated annual compensation range for the candidate based in the below location will be:\nOntario: $ 89004 to $ 115491\n\nAbout Us\nInfosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem.",
            "apply_options": [
                {
                    "title": "AnitaB.org Job Board",
                    "link": "https://jobs.anitab.org/companies/infosys/jobs/44275474-technology-lead-android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobOffer.com",
                    "link": "https://joboffer.com/jobs/Technology-Lead-Android-Developer-1757bfdd48b0d806?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Canadajob24h.com",
                    "link": "https://canadajob24h.com/pt/technology-lead-android-developer-job262197?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJUZWNobm9sb2d5IExlYWQgLSBBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkluZm9zeXMiLCJhZGRyZXNzX2NpdHkiOiJDYW5hZGEiLCJodGlkb2NpZCI6IjJBVEpUWEdHSHlKVEZDM2VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Android Developer",
            "company_name": "Konrad Group",
            "location": "Hunter River, PE, Canada",
            "via": "Ladders",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=KhCOQn_urhy_VUtvAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU43FqmJCC46iUpFF_EHyrU52ki8C7m09Df8Y3V56ys-i6I8skviHZxpoiCREqzhJi0oYeoGEIZapA-0PAw5R91bqxpMrxmz70wnbytMrcz2Ja3-aXTARDFgpma728wmcr8q78IJHdRJxgie4Tpy_l1PP1Gq4HGp4ISMDr-gb0yolAAAAA&shmds=v1_AUFQtOOrCEyxEzlIQoHg9KkeM2vB35gjRqdb5pNk460yZ1tbMA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=KhCOQn_urhy_VUtvAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993b5d5d944d12c76e62931ee16f2e460b5220e9b08b8da66c5c.gif",
            "extensions": [
                "80,811–121,217 a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "80,811–121,217 a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who We Are\n\nKonrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners.\n\nAbout The Role\n\nAs an Android Developer you'll be tasked with working on Android application development. Working within the software development team, your duties will require you to assist in the development of consumer and enterprise applications. This role is ideal for developers who feel confident in their technical ability and want to be a part of the highly-skilled and constantly improving development team at Konrad.\n\nWhat You'll Do\n• Write maintainable, testable, and performant software in collaboration with our world class team.\n• Participate in code review and perform extensive testing to ensure we deliver high quality software.\n• Research new technology and tools and share those findings with the team.\n• Communicate clearly and effectively with all members of our team.\n\nQualifications\n• Experience developing Android applications\n• A strong command of important programming and computer science concepts.\n• Understanding of how mobile applications are built from end-to-end, including how they interact with server-side components.\n• Fundamental knowledge of core mobile principles (UI implementation, common development frameworks, REST APIs).\n• A working knowledge of modern Android development, Java and/or Kotlin, Android Jetpack, and design patterns such as MVVM, MVP\n• Great interpersonal skills - we work very closely together as a team and require a lot of communication.\n• A proactive personality, and a desire to deliver your best work.\n• A love for improving software development workflows and processes.\n\nNice To Have\n• Understanding of functional reactive programming and ReactiveX frameworks is a plus!\n• Experience with or an understanding of newer approaches to networking, like GraphQL.\n• Other mobile development experience, such as iOS development using Swift, or cross-platform development with React Native, Flutter, Ionic, Xamarin, or Cordova.\n\nPerks and Benefits\n• Comprehensive Health & Wellness Benefits Package\n• Socials, Outings & Retreats\n• Retirement Planning\n• Parental Leave Program\n• Annual tech & travel allowance\n• Culture of Learning & Development\n• Flexible Working Hours\n• Work from Home Flexibility\n• Service Recognition Programs\n\nBonus Points\n\nHave you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have!\n\nKonrad is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation.\n\nWhile we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.",
            "apply_options": [
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/android-developer-konradgroup-hunter-river-pe_76714742?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IktvbnJhZCBHcm91cCIsImFkZHJlc3NfY2l0eSI6Ikh1bnRlciBSaXZlciwgUEUsIENhbmFkYSIsImh0aWRvY2lkIjoiS2hDT1FuX3VyaHlfVlV0dkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Staff Android Developer",
            "company_name": "Faire",
            "location": "Kitchener, ON, Canada",
            "via": "Startup Jobs",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=jYuDRsuNDUvnkgjcAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CQ5ys9REBBedRFFQ0MEPKNf0mkRiLuQO6U_4z-IbXvOdNeapOI5wyEPlOMCJPpS4UIUVXLkHIawuAGe4MPtE831QLbKzViQZL4oanXH8tpyp58m-uJd_nQSsVBIqdZvtejIl--XijLESxAy3qC5QptrC497CETMO-AOTn8DYkAAAAA&shmds=v1_AUFQtONHRIPm71tZzJDB096NAP5GWcP0rQ-KwltmLvgEtEk03g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=jYuDRsuNDUvnkgjcAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993b093471b7e3cf3914e5e11520978a2bccc936cba04032d7a4.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "About Faire\n\nFaire is an online wholesale marketplace built on the belief that the future is local — independent retailers around the globe are doing more revenue than Walmart and Amazon combined, but individually, they are small compared to these massive entities. At Faire, we're using the power of tech, data, and machine learning to connect this thriving community of entrepreneurs across the globe. Picture your favorite boutique in town — we help them discover the best products from around the world to sell in their stores. With the right tools and insights, we believe that we can level the playing field so that small businesses everywhere can compete with these big box and e-commerce giants.\n\nBy supporting the growth of independent businesses, Faire is driving positive economic impact in local communities, globally. We’re looking for smart, resourceful and passionate people to join us as we power the shop local movement. If you believe in community, come join ours.\nAbout this role\n\nOur mobile apps are crucial to our vision: Empowering entrepreneurs to chase their dreams. We want to empower entrepreneurs to run their business from their pocket through a world class mobile app.\n\nWe care about stunning design, great UX, and good engineering practices -- we love to write software that is secure, tested, easy to maintain, responsive, and performant. We build minimum viable products, deploy to production weekly, A/B test customer-facing changes, listen to the data, and iterate.\n\nWe are looking for a Staff Engineer to help lead our mobile platform team, which powers our build system, core architecture, and the feature infrastructure that enables our product teams to iterate quickly with high quality.\n\nAs a Staff Android Engineer, you’ll collaborate with us to:\n\n• Lay the necessary foundations for infrastructure, developer velocity, team processes, design systems and other elements of the product development process with a long-term perspective.\n• Improve developer velocity and drive the future of our mobile tech stack\n• Help scale the entire mobile engineering team’s processes and systems.\n• Coach and mentor mobile engineers in a fast paced & hyper growth environment.\n• Raise the bar on the quality of our mobile apps through broad testability strategies.\n• Drive our technical strategy around unified architecture and exploration into Kotlin Multi-platform\n\nWe're excited about you because you have:\n\n• 6+ years of Android experience having worked on multiple apps shipped to the app store\n• Experience shipping and maintaining a mobile app over an extended period of time - working with mobile apps at scale or having helped apps scale to millions of users is a plus!\n• A passion for programming alongside strong problem solving and architecture abilities\n• A love for technology, and an insatiable curiosity for new tools to solve real problems\n• A bachelor's degree in Computer Science/Software Engineering or equivalent industry experience\n• Previous experience on a platform team and a passion for scaling systems for a growing organization and user base\n• A high bar for engineering excellence\n• Curiosity to drive engineering impact outside of the Android tech stack\n\nTechnologies we use and teach:\n\n• Kotlin, Jetpack Compose, Gradle\n• Kotlin Multi-platform\n• Diffable Data Sources, Combine\n• Protocol Buffers\n\nSalary Range\n\nCanada: the pay range for this role is $184,000-$230,000 per year.\n\nThis role will also be eligible for equity and benefits. Actual base pay will be determined based on permissible factors such as transferable skills, work experience, market demands, and primary work location. The base pay range provided is subject to change and may be modified in the future.\n\nThis role will be in-office on a hybrid schedule - Faire employees will be expected to go into the office 2 days per week on Tuesdays and Thursdays, effective the week of January 13, 2025. Additionally, in-office roles will have the flexibility to work remotely up to 4 weeks per year.\n\nApplications for this position will be accepted for a minimum of 30 days from the posting date.\n\nWhy you’ll love working at Faire\n\n• We are entrepreneurs: Faire is being built for entrepreneurs, by entrepreneurs. We believe entrepreneurship is a calling and our mission is to empower entrepreneurs to chase their dreams. Every member of our team is taking part in the founding process.\n• We are using technology and data to level the playing field: We are leveraging the power of product innovation and machine learning to connect brands and boutiques from all over the world, building a growing community of more than 350,000 small business owners.\n• We build products our customers love: Everything we do is ultimately in the service of helping our customers grow their business because our goal is to grow the pie - not steal a piece from it. Running a small business is hard work, but using Faire makes it easy.\n• We are curious and resourceful: Inquisitive by default, we explore every possibility, test every assumption, and develop creative solutions to the challenges at hand. We lead with curiosity and data in our decision making, and reason from a first principles mentality.\n\nFaire was founded in 2017 by a team of early product and engineering leads from Square. We’re backed by some of the top investors in retail and tech including: Y Combinator, Lightspeed Venture Partners, Forerunner Ventures, Khosla Ventures, Sequoia Capital, Founders Fund, and DST Global. We have headquarters in San Francisco and Kitchener-Waterloo, and a global employee presence across offices in Toronto, London, and New York. To learn more about Faire and our customers, you can read more on our blog.\n\nFaire provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression.\n\nFaire is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. To request reasonable accommodation, please fill out our Accommodation Request Form (https://bit.ly/faire-form)",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/staff-android-developer-faire-5503514?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/staff-android-developer-faire-kitchener-on_76313545?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkZhaXJlIiwiYWRkcmVzc19jaXR5IjoiS2l0Y2hlbmVyLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJqWXVEUnN1TkRVdm5rZ2pjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Sr. Android Developer (Contract)",
            "company_name": "Robots & Pencils",
            "location": "Toronto, ON, Canada",
            "via": "Taro",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=YCeauIJQxEmhAMN5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNvQrCMBAAYFz7CE43-UdNRRBBJ6kgOKiou1zSo43Eu5AL0rfxVdXlW7_iMyjWt2Rgx00S38Ce3hQkUoJJLZwTujyFORzFghIm14EwHETaQMNtl3PUTVWpBtNqxuydcfKqhMlKXz3F6p-HdpgoBsz0WK4WvYnczsZXsZIVRnAhdj4oeIa7pF8qJZxPJdTI2OAXxBKemqIAAAA&shmds=v1_AUFQtOPQ91chZp6hKsil49c0gG7iCTkiFpbYE9gTnt8IotCj7A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=YCeauIJQxEmhAMN5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a0703883e94b049c12a/images/9a64d8f72cf2993b0d140400964734f684ccb8dc5d8a0034d943497d4c790d8a.gif",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Sr. Android Developer (Contract) position at Robots & Pencils, focusing on innovative mobile solutions and software development.",
            "apply_options": [
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/robots-and-pencils/sr-android-developer-contract/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBEZXZlbG9wZXIgKENvbnRyYWN0KSIsImNvbXBhbnlfbmFtZSI6IlJvYm90cyBcdTAwMjYgUGVuY2lscyIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6IllDZWF1SUpReEVtaEFNTjVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Android Developer",
            "company_name": "Beionse",
            "location": "Brampton, ON, Canada",
            "via": "Beionse",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=uWtQJlkEzMaS8dH1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CS7eKFITEVzsZBUEB_2EckmPJpLehVyQfoKfLb7hNd9Vs73wWCSOcKMPJclUYA8PcaCExQcQhrvIlGjdhVqznq1VTWbSijV642W2wuRksW9x-m_QgIVywkrD8XRYTOZpt-kpCitBZOgLzrkKt_B6tnBFxhF_hWm6Q4sAAAA&shmds=v1_AUFQtOOLWkXkYTRm07X6rYDju91V4nQCNyVZA0QDBdp3f_THtg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=uWtQJlkEzMaS8dH1AAAAAA%3D%3D",
            "extensions": [
                "Full-time and Part-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time and Part-time"
            },
            "description": "We're looking for a committed Android developer to join our expanding business. As a member of a team of developers, you will work together to create and maintain Android apps.\n\nYou must be knowledgeable about the Android ecosystem and mobile app development as an Android developer, including familiarity with well-known app frameworks and best practices for software development. You'll be responsible for bug fixing, maintaining existing codebases, and working with a team to develop new apps while adhering to all coding standards and accepted best practices.\n\nResponsibilities:\n• App design and development for the Android ecosystem.\n• Writing code tests to ensure robustness and performance.\n• Adding new features and fixing known bugs in existing Android applications.\n• Good at using third-party software libraries and APIs.\n• Collaborating with designers to turn design templates into functional apps.\n\nSkills and Requirements:\n• A bachelor's degree in computer science, application performance, or a closely related field is required.\n• A firm grasp of standard programming tools and paradigms, including version control, framework usage, and common design patterns.\n• Minimum of 3 years of related experience\n• Knowledge of Android Studio and the Android SDK tools.\n• Experience developing mobile applications and using hardware such as accelerometers, cameras, and gyroscopes.\n• Ability to work well in a cross-functional team and with other people's written code, including fixing bugs and refactoring older code.\n• Proficient communication abilities.",
            "apply_options": [
                {
                    "title": "Beionse",
                    "link": "https://beionse.com/jobs/android-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "RemoteAmbition",
                    "link": "https://remoteambition.com/jobs/94fe50df-3295-4052-a17f-76d7f911b491?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkJlaW9uc2UiLCJhZGRyZXNzX2NpdHkiOiJCcmFtcHRvbiwgT04sIENhbmFkYSIsImh0aWRvY2lkIjoidVd0UUpsa0V6TWFTOGRIMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Android Developer, Key",
            "company_name": "Amazon",
            "location": "Vancouver, BC, Canada",
            "via": "Jooble",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=Android+developer&htidocid=f7zwcWGlcvUJFXvaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ6CMBCA4bjyCC7ebIAaExedEBMT3V3JUS5QU-6aXiXoO_jOyvKP3599V1lRcRfFdXChibwEijnc6Q0F3KQFJYx2AGG4ivSe1qchpaBHY1R92WvC5GxpZTTC1MpsntLqkkYHjBQ8Jmr2h91cBu63m2rEz99yDA9kK69puZ3rHGpk7PAH6H5fxpAAAAA&shmds=v1_AUFQtOOEDJULs6Euw_EP0cBv-LagJM4j5cXZ57Vu__kE4uHUFA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=f7zwcWGlcvUJFXvaAAAAAA%3D%3D",
            "extensions": [
                "3 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time"
            },
            "description": "How often have you had the opportunity to be a member of a team that is tasked with solving a huge everyday problem through innovative technology? Would you like to know more about how we are using the internet of things (IoT) to transform and disrupt an entire industry? If this sounds intriguing, then we’d like to talk to you about a role on the Amazon Key team tackling a set of problems requiring significant innovation. Amazon Key, our patented building access technology, supports Amazon Last Mile in the US, with international expansion plans.\n\nOur team is actively seeking a motivated and multi-talented engineer who is passionate about technological and business innovation. You will be part of an inter-disciplinary team of hardware, firmware, software (mobile, backend and frontend), and system engineers to develop and integrate cutting-edge technologies from IoT, wireless, and cloud computing into pragmatic solutions for Ring customers, package transportation, logistics, and delivery. Your software will guide the Amazon customers to access their access-control devices via mobile app. You will be building solutions for 3P partners that will guide them to install and configure the IoT enabled devices at property through iOS and Android applications owned by Amazon Key.\n\nDuties include research, design, implementation, documentation, and maintenance of new and existing systems and the creation of software services and tools to drive the software development process towards higher quality. You will be working on cutting edge technologies in the market today. The development will be from the concept stage to the launch stage and ensuring the highest level of quality for your deliverables.\n\nYou will be:\n• Working with product and UX team to solve the customer problem by proposing engineering solutions and trade-offs.\n• Working with engineering team members to investigate design approaches, prototype new technology and evaluate technical feasibility.\n• Working in an Agile/Scrum environment to deliver high quality software.\n• Engaging with the Android development community across Amazon to share learnings and grow.\nKey job responsibilities\n• Responsible for the design of Android mobile application, development and maintenance of systems.\n• Design new, secure, and reliable features that drive real-time data, video, and audio solutions.\n• Utilize modern Android development design patterns.\n• Propose innovative tools, frameworks, automations and processes that are used by the entire Android team for development.\n• Participate in hiring and developing the team.\nBASIC QUALIFICATIONS\n\n- 3+ years of non-internship professional software development experience\n- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\n- Experience programming with at least one software programming language.\nPREFERRED QUALIFICATIONS\n\n- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\n- Bachelor's degree in computer science or equivalent.\n\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, disability, age, or other legally protected status. If you would like to request an accommodation, please notify your Recruiter.\n\nPosted: January 8, 2025 (Updated about 4 hours ago)\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/-3746847101211234592?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee Canada Meet Opportunities",
                    "link": "https://ca.bebee.com/job/21a215c1b61a516d47a90a9f3802b983?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciwgS2V5IiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiYWRkcmVzc19jaXR5IjoiVmFuY291dmVyLCBCQywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJmN3p3Y1dHbGN2VUpGWHZhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUMVJhUmxWQ1pHOUNiVkowVGxaRWJXdEdYMTlVV0haNVNEVjNTazFZTXpjemJqSnJlbXRSV200NFpqZHZNR1ZpY3pOWFZtSTNja0o1VGs5ME9Vb3lNVEF3VXpCbFNFdDJRM3BmTld4d1pYVndSbmg1YVRsU2VXMXZNbmhrUmpsV1duQkRiMUZUZFRNdFh6ZHJNbkZMU1VnMllscDZhSFJvY3poYVRrOVVkbFpOVTBWTU9UUlRTa0phTTJ4d1R6WkZOakp0Wm5KcGIwRjVZVmt3ZGxsbFpFSTFSelpuVmxnek5tTXdNV3RTTmxaWmJqQkdSM0ZQVlhwRU4ydHhhazR6Y1ZOVWIwbEtZWEJSTFcxYVpXTmtVa3BhWlRCMVRuZFJTVU5sZGs1SWRESlBSVWt6V21sdlJHaDRabXcxVW1ZNVJWSmtRM1pCVjBoc2VWUmlWM0ZzU0V0TGJEZHpSRVYzYzBFMmVWQjRhV0ZXYTJWb1VtNU1iWGMyVFZFU0YwTkJjVVphTmw5VVNFc3piRFZPYjFBeGJ6TnZkVkZaR2lKQlJsaHlSV054Tm1WMU9VbzBRV2RRTTFwM09UWkpjMWRZVUhFdE5tTjZkbWhuIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.ca&location=Canada&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUMVJhUmxWQ1pHOUNiVkowVGxaRWJXdEdYMTlVV0haNVNEVjNTazFZTXpjemJqSnJlbXRSV200NFpqZHZNR1ZpY3pOWFZtSTNja0o1VGs5ME9Vb3lNVEF3VXpCbFNFdDJRM3BmTld4d1pYVndSbmg1YVRsU2VXMXZNbmhrUmpsV1duQkRiMUZUZFRNdFh6ZHJNbkZMU1VnMllscDZhSFJvY3poYVRrOVVkbFpOVTBWTU9UUlRTa0phTTJ4d1R6WkZOakp0Wm5KcGIwRjVZVmt3ZGxsbFpFSTFSelpuVmxnek5tTXdNV3RTTmxaWmJqQkdSM0ZQVlhwRU4ydHhhazR6Y1ZOVWIwbEtZWEJSTFcxYVpXTmtVa3BhWlRCMVRuZFJTVU5sZGs1SWRESlBSVWt6V21sdlJHaDRabXcxVW1ZNVJWSmtRM1pCVjBoc2VWUmlWM0ZzU0V0TGJEZHpSRVYzYzBFMmVWQjRhV0ZXYTJWb1VtNU1iWGMyVFZFU0YwTkJjVVphTmw5VVNFc3piRFZPYjFBeGJ6TnZkVkZaR2lKQlJsaHlSV054Tm1WMU9VbzBRV2RRTTFwM09UWkpjMWRZVUhFdE5tTjZkbWhuIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}