{
    "search_metadata": {
        "id": "67850a30d14cdeb6c0bbbc06",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/34777aaeb3bbc425/67850a30d14cdeb6c0bbbc06.json",
        "created_at": "2025-01-13 12:42:24 UTC",
        "processed_at": "2025-01-13 12:42:24 UTC",
        "google_jobs_url": "https://www.google.fi/async/callback:550?q=Android+developer&uule=w+CAIQICIHRmlubGFuZA&udm=8&fc=EuICCqICQUpHOUprT2RpSHZqNWtjUHBMU1Uwamxxcl9BVndyRmxsU1lmMnQ4WUFhejNzV1JCUDBtcFNkV1VGUVBkTVhKR3FGeUYtSWVjaGZBTjhmdjkzN3BSXzVSSndXUnpPa2tZVmlTZmE0V2lCdDFVQUV0ejdIb3NnNTVvVFRjZHJqRjdRSkRST3ZIQ2NZbkJGY0ZvcUpZREUzcGk1cWVvV3ozR2phc0dUNXZaNzdnVVEyeWNHaVhicVZVakg4eVJaaGQwV3gzdHE2OUQ4QW01R2o5Vy1XVEk5RkQ3eXhNZG5oYkI1cmJfS2VZS2pfSkp1X3R1RE1PSC1jZ1oweWFuOHl6TkdBVzR6MEVBWllKdGtSb19iXzFTSTBDMHBGVmdMd2RRTGcSF0x3cUZaOTcwQnZlRHdia1BzcXpTZ0FRGiJBRlhyRWNvRmlRdWkxdjFPSmFwT3NmRXpGSWtOa3BNc3hR&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/34777aaeb3bbc425/67850a30d14cdeb6c0bbbc06.html",
        "prettify_html_file": "https://serpapi.com/searches/34777aaeb3bbc425/67850a30d14cdeb6c0bbbc06.prettify",
        "total_time_taken": 0.74
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Finland",
        "location_used": "Finland",
        "google_domain": "google.fi",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUMlJwU0hacU5XdGpVSEJNVTFVd2FteHhjbDlCVm5keVJteHNVMWxtTW5RNFdVRmhlak56VjFKQ1VEQnRjRk5rVjFWR1VWQmtUVmhLUjNGR2VVWXRTV1ZqYUdaQlRqaG1kamt6TjNCU1h6VlNTbmRYVW5wUGEydFpWbWxUWm1FMFYybENkREZWUVVWMGVqZEliM05uTlRWdlZGUmpaSEpxUmpkUlNrUlNUM1pJUTJOWmJrSkdZMFp2Y1VwWlJFVXpjR2sxY1dWdlYzb3pSMnBoYzBkVU5YWmFOemRuVlZFeWVXTkhhVmhpY1ZaVmFrZzRlVkphYUdRd1YzZ3pkSEUyT1VRNFFXMDFSMm81VnkxWFZFazVSa1EzZVhoTlpHNW9Za0kxY21KZlMyVlpTMnBmU2twMVgzUjFSRTFQU0Mxaloxb3dlV0Z1T0hsNlRrZEJWelI2TUVWQldsbEtkR3RTYjE5aVh6RlRTVEJETUhCR1ZtZE1kMlJSVEdjU0YweDNjVVphT1Rjd1FuWmxSSGRpYTFCemNYcFRaMEZSR2lKQlJsaHlSV052Um1sUmRXa3hkakZQU21Gd1QzTm1SWHBHU1d0T2EzQk5jM2hSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Mobile Software Engineer (Android)",
            "company_name": "Dream Broker",
            "location": "Espoo, Finland",
            "via": "Työpaikat | Indeed",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=sJdG4BKN08WoGPWLAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7CA5yo4o2IjhUJ8UqCE4-QEmaM42mdyEXsI_i41qXf_z-4jspqjsbHxAe_MwfnRBqcp4QE8yPZBN7u4A13NiAoE5tB0xwZXYBp4cu5yh7pURC6STr7Nuy5V4xoeFBvdjIP410IxyDzthsd5uhjOSWs3NC3cMp8Xt8eYJaIvMKLp6CJvsDH8FTg5sAAAA&shmds=v1_AUFQtOMuLfyzrRN_AHU_yrutlTQghk82rg2mH7idznw_qfjwMA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=sJdG4BKN08WoGPWLAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d22cd2ba20d979536c80051c708d53de904f6b5aac46f4387.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Dream Broker, a fast-growing online video software company, is looking for a Mobile Software Engineer with Android experience to join the team of skilled professionals and shape the future of enterprise communication with video.\n\nDeveloping and engineering scalable, secure, and maintainable software is central to our team’s success, and as an experienced engineer you take pride and are motivated by this.\n\nKey responsibilities\n• Designing, implementing, and testing clear and elegant software systems\n• Developing and engineering robust solutions to our products and continuously grow as a professional\n• Developing and improving tools and processes to further advance team productivity and quality\n• Working with the latest technologies and following industry standards\n\nExpectations\n• Experience in native Android app development using Kotlin (Coroutines and Flows); familiarity with: MVVM architecture, LiveData, Retrofit, Room, Git\n• A drive to learn new technologies and ability to work in a collaborative, test-driven, and agile development, choosing the device on your preferences\n• An academic degree in Computer Science or relevant experience\n• At least one year of experience in mobile development\n• Collaborative way of working, readiness to own of entire concepts\n• Fluent professional communication skills in English\n\nKnowledge of Dependency Injection, CI/CD pipeline, Fastlane, Sentry.io and experience in cyber security is also valued.\n\nWe are ready to hire as soon as we find the right person matching the position and our company. Due to the high cyber security standards this is a full-time and on-site role based in Espoo or Turku, Finland.\n\nPlease apply by submitting your application letter and CV (in English) to tech-careers@dreambroker.fi with the title “Mobile Software Engineer (Android)” or by submitting the form below.",
            "apply_options": [
                {
                    "title": "Työpaikat | Indeed",
                    "link": "https://fi.indeed.com/viewjob?jk=7e7047af0cb5e465&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "HelloTalent Finland",
                    "link": "https://www.hellotalent.fi/jobs/100449879-mobile-software-engineer-android?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgU29mdHdhcmUgRW5naW5lZXIgKEFuZHJvaWQpIiwiY29tcGFueV9uYW1lIjoiRHJlYW0gQnJva2VyIiwiYWRkcmVzc19jaXR5IjoiRXNwb28sIEZpbmxhbmQiLCJodGlkb2NpZCI6InNKZEc0QktOMDhXb0dQV0xBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUm1sdWJHRnVaQSJ9"
        },
        {
            "title": "Mobile Developer (iOS/Android)",
            "company_name": "ALTEN Finland",
            "location": "Finland",
            "via": "LinkedIn",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=X2CalAVECi_A1jpaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXGOwoCMRAAUGz3BGI1pQomImzjVgt-QPwU2i_5DLuROBMyQfYUnlksbB6v-kyq-sI2RIQdvjFywgzzcLvrlnzm4BewghNbEDTZDcAER-Y-4qwZSkmy1Vokql6KKcEpxy_NhJZH_WQrPzoZTMYUTcFuU69HlahfTtvzY3-FQ6BoyEOgf79bVdI2kQAAAA&shmds=v1_AUFQtOPvBooIHMwqB7hNY6NuJtT9oR0ufHYNYEdQFTjAX79qmQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=X2CalAVECi_A1jpaAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4df69c52c39517c7bb4649f5c03ed686d07386229dca77af32.gif",
            "extensions": [
                "24 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "24 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Haluatko olla mukana rakentamassa tulevaisuuden digitaalista maailmaa?\n\nEtsimme intohimoista Mobile Developeria, joka innostuu huipputeknologioista ja kokee paloa innovaatioita kohtaan. Etsimme juuri sinua, kokenutta mobiilikehittäjää, jolla on halu luoda ratkaisuja sekä iOS- että Android-alustoilla, järjestelmäriippumattomasti tai natiivisti.\n\nMe ALTENilla olemme digitaalisen maailman edelläkävijöitä, jotka mullistavat yritysten toimintatapoja eri aloilla. Ketterä ja tulevaisuuteen suuntautunut tiimimme on sitoutunut ylittämään rajoja ja rakentamaan seuraavan tason ohjelmistoratkaisuja, jotka muovaavat tulevaisuutta. Mobiilikehittäjänä meillä sinulla on mahdollisuus työskennellä uraauurtavien projektien parissa alan parhaimpien rinnalla.\n\nRoolissa onnistumisen mahdollistaa:\n• Ohjelmointikielet (Kotlin, Swift, Dart, JavaScript/TypeScript, C#)\n• Mobiilisovelluskehysten tuntemus (Flutter, React Native, Xamarin)\n• Versionhallintataidot (Git, GitHub, GitLab, Bitbucket)\n• Jatkuvan integroinnin ja julkaisun toteutukset (Jenkins)\n• Mobiilitestaus- ja mobiilivarmennuskokemus (esim. Appium, JUnit, OAuth, Firebase Authentication)\n• Vähintään 5 vuoden aikaisempi kokemus mobiilikehittämisestä,\n• ja sujuva suomen sekä englannin kielen taito\n\nHuomioithan, että kaikkien teknologioiden ei tarvitse olla sinulle tuttuja roolissa onnistumiseksi.\n\nLisäksi eduksi katsomme:\n• Muun ohjelmistokehitystaidon ja -kokemuksen\n• Soveltuvan alemman tai ylemmän korkeakoulututkinnon\n\nTarjoamme sinulle:\n• Innovaatiivisen työympäristön ja haasteita: Pääset työskentelemään inspiroivassa ympäristössä, jossa luovuus ja tekninen osaaminen yhdistyvät. Meidän tavoitteemme on aina kehittää uusia ja innovatiivisia ratkaisuja asiakkaidemme tarpeisiin.\n• Ammatillisen kasvun ja kehityksen avaimet: Jatkuva oppiminen ja ammatillinen kehitys kasvattaa taitojasi ja asiantuntemustasi. Sinulla on myös mahdollisuus osallistua Tech Week -tapahtumiin ja suorittaa IT-alan sertifikaatteja.\n• Monipuolisen työn ja tiiviin tiimin: Pääset kannustavaan ja osallistavaan työympäristöön, jossa arvostetaan panostasi ja edistetään henkilökohtaista kasvua. Liity osaavien ja innostuneiden kehittäjien joukkoon, jotka jakavat intohimon ohjelmointiin. Meillä jokainen ääni kuuluu, ja yhteistyö on avain menestykseemme.\n• Haastavia projekteja: Pääset työskentelemään monipuolisten ja merkityksellisten projektien parissa. Kehität ohjelmistoja, jotka vaikuttavat suoraan ihmisten arkeen ja muuttavat alan standardit. Olet mukana rakentamassa tulevaisuutta!\n\nToivomme, että olet meidän tuleva Mobile Developer!\n\nJos koit värähtelyä screenin sillä puolen ja haluat liittyä tiimiimme, lähetäthän hakemuksen palkkatoiveineen oheisen linkin kautta viimeistään 19.1.2025.\n\nMiksi ALTEN?\n\nMeille ALTENilla on tärkeää tarjota työntekijöillemme työnteon vastapainoksi arkea parantavia etuuksia. Pakettiin kuuluu mahtavien työkavereiden sekä huumorintajuisen työyhteisön lisäksi muitakin etuja, kuten joustava etätyö/hybridimalli, lounas-, liikunta- ja kulttuuriedut sekä sporttisimmille tarjoamme myös mahdollisuuden työsuhdepyöräetuun.\n\nOsa kulttuuriamme on yhteinen ajanvietto myös työn ulkopuolella erinäisten tapahtumien parissa. Pohjoisen tai saariston seuduista innostuville tiedoksi, että lisäksi meillä on mahdollisuus hyödyntää ALTENin lomamökkejä, joita löytyy esimerkiksi Sallan ja Kustavin kauniista maisemista. Huolehdimme työntekijöidemme terveydestä tarjoamalla laajan työterveyshuoltopalvelun sekä kattavan vapaa-ajan tapaturmavakuutuksen.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://fi.linkedin.com/jobs/view/mobile-developer-ios-android-at-alten-finland-4107104988?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIChpT1MvQW5kcm9pZCkiLCJjb21wYW55X25hbWUiOiJBTFRFTiBGaW5sYW5kIiwiYWRkcmVzc19jaXR5IjoiRmlubGFuZCIsImh0aWRvY2lkIjoiWDJDYWxBVkVDaV9BMWpwYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSbWx1YkdGdVpBIn0="
        },
        {
            "title": "Senior Mobile Developer (Android/iOS)",
            "company_name": "Nitor",
            "location": "Helsinki, Finland",
            "via": "Työpaikat | Indeed",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=sT8vSCh0Mu0WFylOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCQAwAUFz7CU4ZVbQngou6CKIiqEM_oNy1oY3G5Lgc0j_xd9Xlra_4jIpdhUKa4KqBGOGAb2SNmGCylzYptY7u1RQWcNEAhj41PajASbVjHG_7nKNtnDPjsrPsMzVloy-ngkEH99Bgf2rrfcLIPmO9Wi-HMko3G98o_2YSOCMbyZPmcCRhL-0X7dDrd5oAAAA&shmds=v1_AUFQtOOjBh_qe4aSot0KW3ZDIAHMgdxhvssNeJUGPxhCfYbBlA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=sT8vSCh0Mu0WFylOAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d3799fc6a014d6a1a0317409c7b5f606fd4043ad01082745c.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Mobile Developerin roolista Nitorilla\n\nMobiilikehityksessä tärkeimmät kehitysalustamme ovat iOS ja Android. Kehitämme niin natiivi-sovelluksia Swiftillä, Objective-C:llä ja Kotlinilla kuin cross-platform ratkaisuja React Nativella. Pääset toteuttamaan itseäsi myös uusimmilla tekniikoilla kuten SwiftUI:lla ja Jetpack Composella.\n\nToimiva perusta on se, minkä päälle laadukas sovellus rakennetaan. Siksi pyrimme aina käyttämään parhaita mahdollisia ja moderneja arkkitehtuuriratkaisuja, kuten reactive programming, unidirectional dataflow, MVVM ja clean architecture. Kehitämme laajoja ja pitkäaikaisia sovelluksia, joten tässä roolissa saat vastuuta sovelluksen ylläpidosta ja laadun kehittämisestä pitkällä aikavälillä.\n\nMobiiliprojektiemme kesto on usein vuodesta useampaan vuoteen riippuen omista toiveistasi. Useimmissa projekteissa toimit osana asiakkaan kehitystiimiä, jossa on mukana myös useampi muu kokenut nitorilainen.\n\n✅ Mitä tarvitaan mobiilikehittäjänä menestymiseen Nitorilla?\n• Mobiiliprojektimme ovat tyypillisesti haastavia kokonaisuuksia, mikä edellyttää aikasi seuraamista ja ohjelmistokehityksen periaatteiden hyvää tuntemista. Ymmärrät esimerkiksi, miksi singleton on pahasta ja miksi dependency injection hyvästä. Asynkroninen ohjelmointi on sinulle tuttua.\n• Usean vuoden kokemusta ohjelmistokehityksestä erilaisten palvelujen/tuotteiden parissa, jotta pystyt toimimaan asiakasprojekteissasi lisäarvoa tuovana asiantuntijana. Asiakkaamme odottavat usein lähemmäs kymmentä vuotta relevanttia kokemusta.\n• Olet kirjoittanut yksikkötestejä ja kenties jonkun integraatiotestinkin. Kiinnostus pilviympäristöjä kohtaan, kuten AWS ja Firebase, katsotaan eduksi.\n• Tunnet alustariippumattomia ohjelmistokehyksiä, joilla voi toteuttaa sovelluksia eri päätelaitteille sekä ymmärrät ketterän laadunvarmistuksen käytäntöjen merkityksen mobiilikehityksessä.\n• Arvostamme intohimoista suhtautumista laadukkaan ohjelmakoodin tuottamiseen, testien kirjoittamiseen ja kykyä ottaa haltuun uusia varteenotettavia teknologioita.\n• Meille on tärkeää kyky tehdä töitä ketterästi tiimin yhteisten päämäärien saavuttamiseksi asiakaslähtöisessä ympäristössä. Tämän vuoksi arvostamme hyviä tiimityötaitoja sekä konsultatiivista ja asiakaslähtöistä ajattelutapaa. Sujuvaa suomen ja englannin kielen osaamista\n\nMiksi Nitorille?\nMielekkäiden projektien ja räätälöityjen ammatillisten kehittymismahdollisuuksien lisäksi tarjoamme sinulle henkilöstöetukokonaisuuden, joka todella tuntuu. Koko Nitor on rakennettu sen mukaan, että voimme tukea sinun urakehitystäsi sekä kestävää työtahtiasi ja hyvinvointiasi. Tässä esimerkkejä etupaketistamme:\n• Voit käyttää 10 % työajastasi omaan ammatilliseen kehittymiseesi yrityksen tukemana.\n• Haluaisitko osallistua johonkin alasi kiinnostavaan tapahtumaan? Voit käyttää vuodessa 5 työpäivää koulutus- tai konferenssimatkoihin missä päin maailmaa tahansa.\n• Työväline- ja kotitoimistohankintoihin sinulla on vapaasti käytettävissäsi 7100 € “Rautapankki”, joka täydentyy joka kuukausi.\n• Täydet lomat työsuhteesi alusta asti riippumatta siitä, mihin aikaan vuodesta aloitat.\n• Täydet kulttuuri- ja liikuntaedut, hierontaetu sekä työmatka- ja polkupyöräetu.\n• 500-2000 € bonus jokaisesta suorittamastasi sertifikaatista.\n• Todella laaja työterveyspaketti sekä terveysvakuutus, jotka kattavat mm. erikoissairaanhoidon palvelut, hammaslääkäripalvelut sekä mielenterveyden tuen\n• Yhteisöllisyyttä vaalimme muun muassa useilla vuosittaisilla yhteisillä matkoilla (olemme olleet mm. Pisassa, Berliinissä, Wienissä, Edinburghissa ja Dubrovnikissa sekä pohjoisen hiihtokeskuksissa), sesongin mukaisilla tapahtumilla ja viikoittaisilla yhteisillä kokoontumisilla ja aamiaisilla. Tervetuloa vaikkapa juoksuklubiin, viininmaistajaisiin, leffailtoihin, HIIT-treeneihin tai lautapelikerhoon!\n• Toimintatapamme perustuvat luottamukseen, avoimuuteen ja toistemme kunnioittamiseen; jokainen nitorilainen tuo oman lisänsä yrityksen toimintaan. Arvostamme ja vaalimme erilaisuutta sekä sen tuomaa lisäarvoa asiakkaillemme.\n\nTulevasta työnantajastasi\n\nNitor on vuonna 2007 perustettu digitaalinen insinööritoimisto, jossa työskentelee noin 300 tulevaisuuden liiketoiminnan rakentajaa. Jokainen nitorilainen on digitaalinen insinööri; pragmaattinen ja ratkaisukeskeinen tiimipelaaja, joka ei tyydy oletuksiin. Meille ominaista ovat todella korkea ammattitaito ja ylpeys niin omasta kuin kollegoidemmekin työstä. Työskentelemme yhdessä suurimpien suomalaisten yritysten kanssa ja autamme heitä onnistumaan paremman digitaalisen maailman rakentamisessa.\n\nKasvumme on vahvalla pohjalla: liikevaihtomme on kasvanut jokainen vuosi, vuonna 2023 kasvatimme liikevaihtoamme jo 17. peräkkäisenä vuotena yltäen 40 miljoonan euroon. Olemme jälleen vuonna 2023 saaneet Onwayn vertailussa IT-alan parhaan sijan asiakastyytyväisyydessä kahdettatoista vuotta putkeen, minkä lisäksi omat työntekijäkyselymme kertovat vuodesta toiseen todella korkeasta tyytyväisyydestä Nitoriin työnantajana. Tunnustuksena erinomaisesta työntekijäkokemuksestamme, meidät palkittiin vuoden 2023 vetovoimaisimpana työnantajabrändinä Suomessa. Poissaolollaan loistavat keskijohto, mikromanageeraus sekä itseään toistavat ja vaikutukseltaan marginaaliset asiakasprojektit. Nitorilla voit luottaa siihen, että saat keskittyä täysin omaan projektiisi meidän pitäessämme huolen kaikesta muusta.\n\nNitorilla avoin yrityskulttuuri ja läpinäkyvyys ovat oleellinen osa arkeamme. Yksi tärkeimmistä arvoistamme on yhteisöllisyys. Toimintatapamme perustuvat luottamukseen, avoimuuteen ja toistemme kunnioittamiseen. Jokainen Nitorilainen tuo oman mausteensa yrityksen toimintaan ja yhteisöön. Arvostamme ja vaalimme erilaisuutta sekä sen tuomaa lisäarvoa, täällä ei pakoteta ketään tiettyyn muottiin.\n\nKuulostaako lupaavalta? Lähetä meille LinkedIn-profiilisi tai CV:si ja jutellaan lisää siitä, mitä Nitor voisi sinulle mahdollistaa.\n\nNitorin rekrytointiprosessi\n\nRekrytointiprosessimme heijastelee arvojamme – kyseessä on selkeä ja avoin nelivaiheinen dialogi, jonka aikana pääset tapaamaan vähintään neljä nitorilaista. Tarjoamme sinulle kaiken mahdollisen tiedon, jota tarvitset tehdäksesi päätöksen seuraavasta työpaikastasi.\n\n1. Tutustuminen Nitoriin: Kartoitamme keskeisimmät uratoiveesi. People Partnerimme kertoo Nitorista, projekteistamme ja siitä, miltä työsi Nitorilla voisi näyttää.\n\n2. Tekninen haastattelu: Tapaat kaksi mobiilikehittäjäämme, joiden kanssa kartoitetaan teknisen osaamisesi vahvuudet ja laajuus. Saat myös ensikäden tietoa projekteistamme ja Nitorista työnantajana.\n\n3. Avoimet kysymykset: Tuplatsekkaamme, että olet saanut vastauksen kaikkiin mahdollisiin kysymyksiisi. Tarkennamme tulevaa rooliasi Nitorilla ja pohjustamme tulevaa työtarjoustasi.\n\n4. Tarjouksen esittely: Esittelemme tarjouksen joko toimistollamme tai online-tapaamisessa, jolloin voit kysellä heti lisätietoja tarjoukseen liittyen.\n\nKuulostaako lupaavalta? Haluatko olla mukana mahdollistamassa koodin ikitakuun, jonka asiakkaillemme annamme? Lähetä meille LinkedIn-profiilisi tai CV:si ja jutellaan lisää siitä, mitä Nitor voisi sinulle mahdollistaa.",
            "apply_options": [
                {
                    "title": "Työpaikat | Indeed",
                    "link": "https://fi.indeed.com/viewjob?jk=9d88dee755e71e9e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://fi.linkedin.com/jobs/view/senior-mobile-developer-android-ios-at-nitor-4059355570?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciAoQW5kcm9pZC9pT1MpIiwiY29tcGFueV9uYW1lIjoiTml0b3IiLCJhZGRyZXNzX2NpdHkiOiJIZWxzaW5raSwgRmlubGFuZCIsImh0aWRvY2lkIjoic1Q4dlNDaDBNdTBXRnlsT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSbWx1YkdGdVpBIn0="
        },
        {
            "title": "Computer Scientist (m/f/d) as App Developer for iOS / Android",
            "company_name": "RIWA GmbH",
            "location": "Finland",
            "via": "Jooble",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=eWCA7FFU-TRt1120AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKvQrCMBAAYFw7OzndqIKNCC46FcWqi6CCY8nPtY0kuZCL0lfyLdXlm77iMyruO_LxlTHBTVsM2XKGqRetMDOQDFWMsMc3Ooq_0lICe7mBgCqYRNbAAs6kgFEm3QMFqIk6h5Ntn3PkjRDMruw4y2x1qckLCqhoEE9S_KfhXiaMTmZsVuvlUMbQzcfX06OC2qsj2AAHG5wM5gtNwd8frAAAAA&shmds=v1_AUFQtOMrec0vchfiE7Zy0op_qMTM1aNMp-xeXC63QAzjDuDvwg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=eWCA7FFU-TRt1120AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d43bf03d8cfe4ae6ae55575bc22a1719b34f640a371a0603e.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Computer Scientist (m/f/d) as App Developer for iOS / Android\nRIWA - All geoinformation becomes a digital experience\n\nRIWA GmbH is a leading company in the field of geoinformation and municipal specialist processes with over 25 years of experience and market leader in Bavaria. Our team develops innovative solutions for the digital transformation of cities and municipalities, in particular through geographic information systems (GIS). We also create digital twins of municipalities for construction planning, energy management and sustainable urban development. We offer customized solutions and attach great importance to close cooperation.\n\nBecome part of our team in one of our branches in Augsburg, Memmingen or Kempten im AllgÃ¤u. After training, you can also work from home.\nThese are your tasks\n• Further development of our native RIWA GIS Android app\n• Implementation of our previous apps for Apple iOS with Kotlin & Compose Multiplatform\n• Quality assurance through code reviews, unit tests and automated test procedures\n• Technical conceptualization of functional requirements from product management\n• Advising product management on development issues\nYou know your way around this\n• Completed studies in computer science or equivalent training\n• Sound knowledge in the development of Android apps (Kotlin, Java, Android SDK). Basic knowledge of iOS development advantageous (Swift)\n• Ideally experience with Jetpack Compose, Kotlin Multiplatform and Compose Multiplatform\n• Expertise with automated tests, CI/CD processes and agile software development\n• Knowledge of designing appealing user interfaces is a plus\n• Independent working style, ability to work in a team and a high level of self-motivation\nWhat we offer you\n• A great team - #GernePerDu - and a varied job in the office and home office\n• Attractive salary, 13 monthly salaries, capital-forming benefits and a performance bonus\n• Family-friendly working time models with flexible working hours (flexitime)\n• Corporate benefits such as a job bike, drinks flat rate or employee discounts with over 1,500 providers\n• Intensive training in the field of activity and regular further training\n• An exciting environment with varied tasks\n• A secure, modern workplace close to the city center with future prospects\nHave we piqued your interest?\n\nPlease send us your complete application documents directly online via our applicant management system, stating your salary expectations and the earliest possible starting date.\nRIWA GmbH\n\nAn der NeumÃ¼hle 5, 87700 Memmingen\nEveryone is welcome at RIWA. Diversity and equal opportunities are an integral part of our company. We see the uniqueness of each individual, and therefore the diversity of our teams, as the driving force behind our daily work and innovations. - We look forward to meeting you.\n\n+\n\nOnline application",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://fi.jooble.org/jdp/-8917305004567298698?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJDb21wdXRlciBTY2llbnRpc3QgKG0vZi9kKSBhcyBBcHAgRGV2ZWxvcGVyIGZvciBpT1MgLyBBbmRyb2lkIiwiY29tcGFueV9uYW1lIjoiUklXQSBHbWJIIiwiYWRkcmVzc19jaXR5IjoiRmlubGFuZCIsImh0aWRvY2lkIjoiZVdDQTdGRlUtVFJ0MTEyMEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSbWx1YkdGdVpBIn0="
        },
        {
            "title": "Android Engineer - Automotive",
            "company_name": "Unikie",
            "location": "Helsinki, Finland",
            "via": "LinkedIn",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=cciSkF6PmzylJe6NAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHOw7CMAwAULH2CLB4RpAgBAtMHfiInblKWyt1m9pVbFCPwZGB5Umv-CyKQ8ltFmrhwpEYMcMWypfJKEZv_OUhNSiG3HQgDDeRmHB57swmPXmvmlxUC0aNa2T0wljL7Hup9U-lXcg4pWBY7Y-72U0c16sn00AIxHDHpMQDbeBKnAK3XwG0laiTAAAA&shmds=v1_AUFQtOOkliIzRRJQtJBZf6nByXz8wM_EOy-u7ozJE-kIDlUJLQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=cciSkF6PmzylJe6NAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d297c5582833cd65f07b40374ff8f164e593afb6773c43fc6.gif",
            "extensions": [
                "10 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "WE ARE LOOKING FOR Android Engineer\n\nWe are looking for Android Engineer to our team. You will start your journey either in a selected customer project or in Unikie's internal product development team, depending on your profile and available opportunities\n\nYour future colleagues are waiting for you to join our international team. Working with us is uncomplicated, there’s a good team spirit, low-hierarchy and nonexistent bureaucracy. Our way of working is flexible too, many of our team work remotely from home with visits to our office from time to time when needed. This role is equally challenging, and as such we offer a very good compensation.\n\nResponsibilities\n• Design and develop modular, scalable infotainment applications on Android Automotive OS.\n• Create design patterns and libraries to facilitate application development.\n• Collaborate with cross-functional teams, including product and UI/UX design, to define application features.\n• Identify and resolve application bottlenecks for performance optimization.\n• Conduct code reviews and practice continuous integration and development.\n• Write test code to ensure quality, robustness, and functional correctness, including edge cases.\n• Design and implement application updates and releases.\n• Investigate the Android Automotive OS codebase for better application performance and integration.\n• Develop sample and demo applications utilizing our technology.\n• Engage in continual learning through workshops, conferences, and talks.\n\nRequired Qualifications\n• Proven Android application developer with 5+ years of experience.\n• Proficiency in Kotlin, Java.\n• C++ is nice to have.\n• Ability to manage workload with minimal supervision.\n• Proficiency in using Android and Android Jetpack APIs, including general knowledge of Android NDK and JNI.\n• Knowledge of Android design principles, application interface guidelines, performance, and testing frameworks.\n• Familiarity with embedded Android framework services.\n• Experience with developing mapping, multimedia, and Bluetooth solutions is a plus.\n• Familiarity with push notifications, APIs, and cloud messaging.\n• Excellent coding and proofreading skills.\n• Familiarity with Agile Scrum practices.\n• Excellent interpersonal skills with the ability to collaboratively work with and influence cross-functional teams.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://fi.linkedin.com/jobs/view/android-engineer-automotive-at-unikie-4093558203?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "NEW JOBS - Findjob24h.com",
                    "link": "https://fi.findjob24h.com/de/telco-field-engineer-emea-job13824?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIC0gQXV0b21vdGl2ZSIsImNvbXBhbnlfbmFtZSI6IlVuaWtpZSIsImFkZHJlc3NfY2l0eSI6IkhlbHNpbmtpLCBGaW5sYW5kIiwiaHRpZG9jaWQiOiJjY2lTa0Y2UG16eWxKZTZOQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJtbHViR0Z1WkEifQ=="
        },
        {
            "title": "Sr. Android Engineer",
            "company_name": "ITExpert",
            "location": "Finland",
            "via": "Jooble",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=cjznrSI_b8BynPKDAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXELQ8CMQwAUH8Wh6qGsBESDCjEQcCCv-yj2UZGu7QTc_x1whNv-k7bpxi4UBQuEWZKhRAFdvBgD4pOQgYmuDGniutz7r3pyVrVapJ210swgT-WCT0P-2av_xbNTrBV13E5HPfDNEqb1f01j4bSoRBcC1VH8QfVvu0wgQAAAA&shmds=v1_AUFQtONHHP24nkh9tVz8Kyps6e0KiU_qyNbzYsNbQkXrQYOHmQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=cjznrSI_b8BynPKDAAAAAA%3D%3D",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Fingerprint empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong open-source focus. Our flagship open-source project is FingerprintJS (20K stars on GitHub).\n\nWe have raised $77M and are backed by Craft Ventures (previously invested in Tesla, Facebook, Airbnb ), Nexus Venture Partners (previously invested in Postman , Apollo.io, MinIO , Druva) and Uncorrelated Ventures (previously invested in Redis, Rollbar &Gradle ).\n\nWho We Are Looking For: We are looking for a Senior Android Engineer with a solid background in Information Security. The ideal candidate will have experience building Android applications or libraries from scratch and will be skilled in security frameworks, cryptography, and network protocols. The role requires strong expertise in Kotlin, and familiarity with Jetpack Compose is preferred.\n\nKey Responsibilities:\n• Design, develop, and optimize native Android applications and libraries, focusing on security, scalability, and performance.\n• Collaborate with cross-functional teams to implement security protocols and ensure that applications align with best security practices.\n• Build developer tools that enhance productivity and streamline the development process.\n• Contribute to the maintenance and advancement of security frameworks for mobile applications.\n• Provide mentorship to junior team members and contribute to their technical development.\n\nRequirements:\n• Education: Degree in Computer Science, Information Security, or equivalent experience.\n• Experience:\n• 5+ years as a Senior Android Engineer (prior experience in a Senior Android role is required).\n• Strong Information Security background, with practical experience in:\n• Network protocols and secure coding practices\n• Cryptography and security framework development\n• Proven experience in building Android applications from the ground up, with expertise in Kotlin and vanilla Android SDKs. Experience with Jetpack Compose is preferred.\n• Experience with Android NDK is a plus.\n• Contributions to Open Source projects on GitHub are a bonus.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nDue to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based. Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location .\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.\n\nIf you are applying as a resident of California, please read our CCPA notice here\n\nIf you are applying as a resident of the EU, please read our GDPR notice here",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://fi.jooble.org/jdp/-5879782668673579399?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IklURXhwZXJ0IiwiYWRkcmVzc19jaXR5IjoiRmlubGFuZCIsImh0aWRvY2lkIjoiY2p6bnJTSV9iOEJ5blBLREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSbWx1YkdGdVpBIn0="
        },
        {
            "title": "Senior Mobile Developer",
            "company_name": "ICT DIRECT",
            "location": "Oulu, Finland",
            "via": "Työpaikat | Indeed",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=R0LDATNF3B5x6mf6AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXFsQrCMBAAUFz7CbrcLJqI4KKjVakggrqXpD3ayHkXcqn0G_xqdXmv-EwKc0cOkuAiPhBCiW8kiZhgCWfxoOhS04MwnEQ6wumuzznq1lpVMp1ml0NjGnlZYfQy2qd4_VNr7xJGchnr9WY1msjdfFbtH1BWt8OvwHAdaFjAMTA5br-Q4f03jQAAAA&shmds=v1_AUFQtOPoOY_kCbE_9qZyDLKjfdYIskNmBVai2B59BFt_cmkUMQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=R0LDATNF3B5x6mf6AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4de6cbdbfa7a17c78b3d89901c9ceb686c0d0eb3939676f7ed.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We’re now looking for a\n\nSenior Mobile Developer\n\nFor our customer, 9Solutions. 9Solutions is the leading provider of real-time locating based safety, communications and smart care solutions from Oulu, Finland. Their mission is to create environments for safe and quality care by providing solutions that enable effective communication, make relevant information easily accessible and free up working hours for meaningful tasks. 9Solutions Oy is a Great Place to Work-certified workplace. Their offices are located in Oulu and in Helsingborg, Sweden. 9Solutions was also selected as one of Finland’s 40 most innovative companies leveraging AWS services. 9Solutions has an annual revenue of 10M EUR and the company employs over 40 people.\n\n9Solutions is now looking for an experienced and dynamic Senior Mobile Developer to join a team consisting of 5 people. The most important aspect of the job is to produce high-quality, user-friendly code on both iOS and Android with high focus especially on the front-end development.\n\nWhat does the role mostly consist of:\n• Designing and developing high-quality, user-friendly mobile applications for Android and iOS platforms\n• Collaborating with cross-functional teams to gather and refine project requirements\n• Implementing and maintaining clean and efficient code\n• Maintaining and improving the existing stack\n• Creating and optimizing front-end interfaces for an exceptional user experience\n• Staying up-to-date with the latest industry trends and best practices\n\nWhat are we looking for:\n• A curious individual who is interested in digging deeper into the best industry practices and development of personal expertise. We welcome applications from both seasoned professionals with extensive experience and those with a strong passion and relevant experience in the field.\n• Strong experience and expertise in Android development. iOS experience considered as advantage\n• Previous experience of working with front-end technologies (HTML, CSS, JavaScript)\n• Previous experience of working with Java\n• Experience with cross-platform mobile development frameworks (such as React, Native, Flutter)\n• Familiarity with mobile app design principles and UX/UI guidelines\n• Residency in Finland\n• Fluency in both written and spoken English\n\nWhat are seen as an advantages:\n• A strong portfolio of mobile app projects and/or previous experience of working with apps available in app stores\n• Knowledge of back-end development and APIs\n• Knowledge and expertise in AWS\n\nWhat are we offering:\n• An opportunity to contribute in meaningful work within healthcare sector and to make a difference in resolving one of the most significant societal challenges related to the aging population\n• A responsible role in a scale-up company\n• Excellent benefits such as extended healthcare, daily snacks at the office, insurance, sport, culture and wellbeing benefits, possibility for a bike benefit, childcare for a sick child etc.\n• A fixed salary of 5000-6500 EUR per month depending on your experience and expertise\n• Extremely flexible remote working possibilities (location in Oulu is preferred, but you can be anywhere in Finland as long as you are willing to visit the office in Oulu every now and then, at least once every two to three months)\n\nSounds good? We are looking forward to receiving your application! Apply latest as soon as possible because we will start going through the applications as they come. Please note that we only accept applications through our ATS. If you have any questions regarding the position, feel free to contact ICT DIRECT's consultant Ilpo Järvenpää; ilpo.jarvenpaa@ictdirect.io +358 50 548 5651",
            "apply_options": [
                {
                    "title": "Työpaikat | Indeed",
                    "link": "https://fi.indeed.com/viewjob?jk=3ec35becc1b8f858&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WhatJobs",
                    "link": "https://fi.whatjobs.com/ty%C3%B6t%C3%A4+varten-Senior-Mobile-Developer-sis%C3%A4%C3%A4n-oulu-oulun-l%C3%A4%C3%A4ni-coop51236?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IklDVCBESVJFQ1QiLCJhZGRyZXNzX2NpdHkiOiJPdWx1LCBGaW5sYW5kIiwiaHRpZG9jaWQiOiJSMExEQVRORjNCNXg2bWY2QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJtbHViR0Z1WkEifQ=="
        },
        {
            "title": "Senior or Lead Mobile Developer",
            "company_name": "Datadrivers Oy",
            "location": "Oulu, Finland",
            "via": "LinkedIn",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=mfLcUA-C5Ezt9EmKAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQrCQAwAQLz2CV7MWbQrgh70WhRE6cEHlGwb2pWYLJtt0Y_4XhWGKT6zYn8nCZrg50rYwU19YIKKJmKNlGANF_VghKkdQAXOqj3T_DjkHO3gnBmXvWXMoS1bfToV8vpyD_X2r7EBE0XGTM12t3mVUfrlosKMXQoTJYP6DUGgHnlcwSkIo3Rfl1QQqJkAAAA&shmds=v1_AUFQtOObIWKCU-cMEe5PZahTUoLkr_dEXtaf_X9ac5g56onWUA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mfLcUA-C5Ezt9EmKAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4dd04222e876ad9ebfbaf82e361eb06fb603aac4c9632964f4.gif",
            "extensions": [
                "18 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "18 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior or Lead Mobile Developer\n\nDatadrivers Oy is Finland's leading software developer in the logistics and driving education sector, and we are now looking for an experienced Mobile Developer to join our growing team in our Oulu or Tornio office. In this role, your main responsibilities will focus on web frontend development, with opportunities to work on both web and mobile projects. You will contribute to technically challenging projects aimed at improving traffic safety and the quality of vehicle training.\n\nDatadrivers is a software company founded in 1996, known for its customer-oriented development in driver training and logistics applications. As pioneers in the digitalization of the entire industry, we operate as part of CAP-Group, the largest driving education provider in the Nordics. With us, you will be part of a team that develops innovative digital services for the industry.\n\nWhat we are looking for:\n• At least 5 years of experience in mobile software development, with a strong focus on technologies like TypeScript, JavaScript, and React Native or React.js.\n• Experience in API integration, including working with RESTful API or GraphQL APIs, ensuring seamless communication between the frontend and the backend services.\n• Strong understanding of mobile-specific performance optimization and debugging tools.\n• Experience with Redux or alternative state management libraries to manage and maintain application state in a scalable and efficient way.\n• Experience with CSS frameworks (e.g., SASS, Tailwind), and a good understanding of responsive design and optimizing web performance.\n• Knowledge of publishing apps on App Store and Google Play, and understanding the related guidelines and processes.\n• Experience with Storybook for developing and testing UI components in isolation, ensuring a consistent and scalable design system.\n• Strong familiarity with logging, monitoring tools, and user behavior analysis to track system performance, understand user interactions, and ensure the smooth operation of frontend systems.\n• Good documentation skills to ensure that architecture, frontend components, and workflows are clearly communicated to the team and stakeholders.\n\nKey Responsibilities of the Role:\n• Develop and maintain mobile applications, focusing on delivering high-quality user experiences for driver education and road safety applications.\n• Work closely with backend developers, UX/UI designers, and product owners to ensure smooth integration between frontend services and backend systems.\n• Contribute to the architecture and design of the overall system, participating in technology selection and mobile strategy.\n• Work with Storybook to create and manage UI component libraries, ensuring components are reusable, tested and well-documented.\n• Optimize applications for performance, responsiveness, and usability on both iOS and Android platforms.\n• Keep up with the latest trends in mobile development, introducing new tools and techniques to improve the development process.\n\nWe expect from you:\n• Proven expertise in frontend development with a modern technology stack.\n• Good communication skills and the ability to work in a team.\n• Good problem-solving abilities and a passion for learning and improving your skills.\n• Proficiency in Finnish or English.\n\nWe offer you:\n• A permanent position in a dynamic and growing company.\n• The opportunity to work in an impactful industry where your contributions help improve traffic safety and vehicle training.\n• A collaborative and supportive work community where openness and teamwork are valued.\n• Opportunities to further develop your expertise and advance in your career.\n• Involvement in the architecture working group, where you can influence the technology choices and architecture of our ecosystem.\n• Competitive salary and comprehensive employee benefits.\n\nIf you are an experienced Mobile Developer with a passion for creating innovative digital solutions in a meaningful field, we would love to hear from you! Send your application and CV as soon as possible. Datadrivers Oy is committed to the professional development of its employees and offers the opportunity to work in a forward-thinking organization that invests in new technologies and innovative solutions.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://fi.linkedin.com/jobs/view/senior-or-lead-mobile-developer-at-datadrivers-oy-4109749443?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3Igb3IgTGVhZCBNb2JpbGUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiRGF0YWRyaXZlcnMgT3kiLCJhZGRyZXNzX2NpdHkiOiJPdWx1LCBGaW5sYW5kIiwiaHRpZG9jaWQiOiJtZkxjVUEtQzVFenQ5RW1LQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJtbHViR0Z1WkEifQ=="
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQ6CMBCA4bjyCEw3m0iNiYuOCkYTJtxJC2epqXdN74y8jm8qLv_2f8V3VTRtGMeIpkMKnKFlFyJCE9-qmKHjh35sRqjJB0LMAhu4sQNBm4cJmODC7COWx0k1ycEYkVh5UathqAZ-GSZ0PJsnO_mnl2nxUrSK_W6_natEfl1ez3c4cU6cl29BA0ETKFoaf0PyGv6kAAAA&shmds=v1_AUFQtOPs2YbwmHmibSGytYPSdN82syjkR3kwbSnnl80H71IMmA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d4e364ad3ff7b5371ed2f0c2cc14fad8323fb04f5fe24f7f0.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkZpbmxhbmQiLCJodGlkb2NpZCI6IlQxeHZ0bGpKbmNkMW91MGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUm1sdWJHRnVaQSJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.fi/search?ibp=htl;jobs&q=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFw7OjrdqEIbEVx0VKoIQsEPKEm9pidpLtwFqd_iz6rLW1_xmRWXO0ZigRs7CghHYdWyCTb3LCOc8IWBEwosaxJ0VnEFJVzZgaKVbgCOcGb2AReHIeeke2NUQ-U120xd1fFoOKLjyTzZ6Z9WByuYfgW2291mqlL063kjPFH_BopQUww2Pr7DvMSZngAAAA&shmds=v1_AUFQtOMaDDGJsIZuEdtOefE9NUo3F5Uvz6iFWC_1ID47uTb6gg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a30d14cdeb6c0bbbc06/images/d7f83b140e2d2c4d26fa3329b2aba611e1aeb838061f2ad2144e7192a097049b.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkZpbmxhbmQiLCJodGlkb2NpZCI6IkQtNFpVcnFGVW1XNUZuVTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUm1sdWJHRnVaQSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1RUNDcUlDUVVwSE9VcHJUMWRvYmxsRmVXbFdlR0Y2WWpScGJuSmhSMVY0ZGsxcmVHZFVPVWQ1ZUVoUFMwcGxTRmt4Ymt0eU9Ea3hOaTFUTWtWd1Z6UXlhVzVXU1VsbVNsTmFNM1pUVVhGVWJHVnJaRkV4VG5GSGVWWndWSEpKUmxvMFVuTlJUWFJTTFY5M2NHb3hTWGRVVkMxeFkxWkNhV1JNVmxaVlNscHpaMDVrUjFZNFExOVZNR05KT0RsUGMxUkRaMDh4ZHpCWU1tOVZia1E0VW1kdlVHdzVWWGxhTTB4Q1ZVRjFaMUZuUW1sc1RHSXRRbTR4WW5RMGVrNUVTM0ZEWkRCU2VqbHdlSFZpTWxOTVQwaEVZMkpLVlhCa0xVdHlaelpDTURFMk0xTjZWR3MxZGs5a05rNU9UazQyZGpkbldWQXRkVlZFU21jelptRkpURzlFY2xST1ZEZHNkR05GTTE5M1VqZG9VbmRRZDJoaVZteExiRFZZT1ZONFFVUjVWMVJvUm5jU0ZrMUJjVVphT0hKVVNUZzJTSGM0WTFCNFdXMVNXVkVhSWtGR1dISkZZM0pHZUhsSWFsTXljRzB3TkRsUFNtNWhNV2xtWmt4MVdXRTNhSGMiLCJmY3YiOiIzIn0=",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.fi&location=Finland&next_page_token=eyJmYyI6IkV1RUNDcUlDUVVwSE9VcHJUMWRvYmxsRmVXbFdlR0Y2WWpScGJuSmhSMVY0ZGsxcmVHZFVPVWQ1ZUVoUFMwcGxTRmt4Ymt0eU9Ea3hOaTFUTWtWd1Z6UXlhVzVXU1VsbVNsTmFNM1pUVVhGVWJHVnJaRkV4VG5GSGVWWndWSEpKUmxvMFVuTlJUWFJTTFY5M2NHb3hTWGRVVkMxeFkxWkNhV1JNVmxaVlNscHpaMDVrUjFZNFExOVZNR05KT0RsUGMxUkRaMDh4ZHpCWU1tOVZia1E0VW1kdlVHdzVWWGxhTTB4Q1ZVRjFaMUZuUW1sc1RHSXRRbTR4WW5RMGVrNUVTM0ZEWkRCU2VqbHdlSFZpTWxOTVQwaEVZMkpLVlhCa0xVdHlaelpDTURFMk0xTjZWR3MxZGs5a05rNU9UazQyZGpkbldWQXRkVlZFU21jelptRkpURzlFY2xST1ZEZHNkR05GTTE5M1VqZG9VbmRRZDJoaVZteExiRFZZT1ZONFFVUjVWMVJvUm5jU0ZrMUJjVVphT0hKVVNUZzJTSGM0WTFCNFdXMVNXVkVhSWtGR1dISkZZM0pHZUhsSWFsTXljRzB3TkRsUFNtNWhNV2xtWmt4MVdXRTNhSGMiLCJmY3YiOiIzIn0%3D&q=Android+developer"
    }
}