{
    "search_metadata": {
        "id": "67850a46a3dfaa5ebd82b151",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/c32fe44575a8a8bc/67850a46a3dfaa5ebd82b151.json",
        "created_at": "2025-01-13 12:42:46 UTC",
        "processed_at": "2025-01-13 12:42:46 UTC",
        "google_jobs_url": "https://www.google.de/async/callback:550?q=Android+developer&uule=w+CAIQICIHR2VybWFueQ&udm=8&fc=EswCCowCQUpHOUprUGNfQ0syd0MySlFWc2d2V1hXSGJGLUVJU2FDdmlaaWhaNWhiMXRzQWE2aUJIbVg4eHpTNkxma2RxMy0tdmhfdnZ2M2k4aGRMc3FFS1BTSGE5dTliaDBuT0todnl3VEtVOXZKdXFaMDlVcU5uZ2tkUUctcTFqakRBa0NJUFctTmk0aHRsUzB5VHJyV0JCeExySE9RY3kyd2p1S1VQS2F6YVJORWtEbU96ZkN6U01BZUFVR0V4al83UTNBWnV5N1czTk5Sb3FGMVlrbVBya1FvT29mQ2pNMzh2bk0zNVoyRjdfUHcwUlU2QkRwX181TlVwdXhIRG9RVmFiYklManVIQkw0OGRCZhIXUlFxRlo4TG1MNnlyNU5vUHZkZXQ0UXMaIkFGWHJFY3JUalRNR1ZLOEx5YzRjX2lrUDZtZklKcVA5Z0E&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/c32fe44575a8a8bc/67850a46a3dfaa5ebd82b151.html",
        "prettify_html_file": "https://serpapi.com/searches/c32fe44575a8a8bc/67850a46a3dfaa5ebd82b151.prettify",
        "total_time_taken": 0.9
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Germany",
        "location_used": "Germany",
        "google_domain": "google.de",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVR05mUTBzeWQwTXlTbEZXYzJkMlYxaFhTR0pHTFVWSlUyRkRkbWxhYVdoYU5XaGlNWFJ6UVdFMmFVSkliVmc0ZUhwVE5reG1hMlJ4TXkwdGRtaGZkbloyTTJrNGFHUk1jM0ZGUzFCVFNHRTVkVGxpYURCdVQwdG9kbmwzVkV0Vk9YWktkWEZhTURsVmNVNXVaMnRrVVVjdGNURnFha1JCYTBOSlVGY3RUbWswYUhSc1V6QjVWSEp5VjBKQ2VFeHlTRTlSWTNreWQycDFTMVZRUzJGNllWSk9SV3RFYlU5NlprTjZVMDFCWlVGVlIwVjRhbDgzVVROQlduVjVOMWN6VGs1U2IzRkdNVmxyYlZCeWExRnZUMjltUTJwTk16aDJiazB6TlZveVJqZGZVSGN3VWxVMlFrUndYMTgxVGxWd2RYaElSRzlSVm1GaVlrbE1hblZJUWt3ME9HUkNaaElYVWxGeFJsbzRURzFNTm5seU5VNXZVSFprWlhRMFVYTWFJa0ZHV0hKRlkzSlVhbFJOUjFaTE9FeDVZelJqWDJsclVEWnRaa2xLY1ZBNVowRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Junior Android Developer",
            "company_name": "Zero to One Search | Recruitment Agency",
            "location": "Anywhere",
            "via": "Learn4Good",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=6_MpNMMifDOF_NIpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXMsQrCMBAAUFz7CU43izYiuNSpIhS6CLq5lDQ92kh6Fy5XacEv8itFXN74ss8qM_VEngVK6oR9Bxd8YeCIAjuouYWEVtwATFAx9wHXp0E1psKYlELeJ7XqXe54NEzY8mye3KYfTRqsYAxWsTkc93Meqd8UDxQGZbgSwv1fv-GGTiavI5JC2SO5BTzBGSV42kKFMlpavmv-vwutAAAA&shmds=v1_AUFQtOOQwooQlGBwjWROVLxoW6t-AonSd4ewuPMtvuW3OkykPA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6_MpNMMifDOF_NIpAAAAAA%3D%3D",
            "extensions": [
                "€60K–€80K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "€60K–€80K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Our client is one of the leading online companies and Germany's largest comparison portal. Although they provide to their more than 15 million customers with a wide variety of products and services to compare against one another, they want to make their flight comparison tool the #1 option their customers have in order to book the perfect flight as easily and cheaply as possible through a transparent comparison of offers from hundreds of airlines.\n\nWe look forward to receiving your application as a Junior Android developer!\n\nAs an Android Developer you'll:\n• Be responsible for developing and co-designing innovative functions for the app in one of their growing products\n• Actively work with the product management team to design the app so that they offer their customers an outstanding user experience\n• Monitoring of app crashes and subsequent independent improvement of app stability\n• Implementation and co-design of their app architecture\n• Enrich your knowledge through various opportunities, such as company-wide Tech Talks and Tech Days , to continuously grow with them\nRequirements\n• First experience in Android app development using Kotlin in Android Studio\n• Completed IT studies (computer science, media informatics, business informatics, etc.) or training as an IT specialist (m/f/d)\n• Enthusiasm for innovative ideas in app development and very high quality standards\n• Good knowledge of object-oriented programming\n• Initiative and motivation to advance the product, the team and personal development\n• Fluent German skills and very good English skills\n• From your idea to a feature :\nWith them you are fully integrated into their team and the processes right from the start. With demanding, challenging and varied tasks with creative freedom, your everyday life with them will be as colorful as Berlin itself. They offer you plenty of room for your own initiative. Actively contribute your ideas, quickly take on responsibility and thus directly influence the success of the company!\n• Your start as a junior:\nThey offer you an environment in which you can learn from experienced software developers (m/f/d) and work with them on an equal footing. In addition, thanks to a broad training catalog, you benefit from numerous individual development and further training opportunities as well as an annual training budget that is freely available to you.\n• You can feel at home :\nTheir first-name culture creates a collegial and friendly environment. Extras such as drinks, fruit, cereal or lunches are a given! There are also vouchers for numerous products and a subsidized company pension scheme. For the perfect balance to work, they also offer free yoga and Cross Fit courses. You also have the option of partially working remotely from home (“home office”).\n• They are also a great team outside of work :\nTheir collaboration and team spirit make them special. They celebrate successes together at numerous events such as their monthly drinkouts and their summer and Christmas parties. Whether it's table football, table tennis or an after-work get-together: team spirit is very important for them!\n• You can easily find then:\nThey work on the Spittelmarkt in Berlin Mitte with excellent transport connections.\n\nFor example, you can come to the office with a BVG subscription subsidized by them or you can take part in their bike leasing program.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/online/software_entwicklung/3728963553/g/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJaZXJvIHRvIE9uZSBTZWFyY2ggfCBSZWNydWl0bWVudCBBZ2VuY3kiLCJhZGRyZXNzX2NpdHkiOiJCZXJsaW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6IjZfTXBOTU1pZkRPRl9OSXBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Android Developer (m/w/d)",
            "company_name": "BUERO LERSCH",
            "location": "Trier, Germany",
            "via": "XING",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=5GLobnxIiy__hWxVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFz7CA5yo4o2RXDRyZ9SEUGoOpc0PdpImgt3QetT-MriN3zJd5RkO98w2QaO-EJHARmmvXqrZgZLOFMNgppNB-ShIGodjrddjEE2Som4tJWoozWpoV6Rx5oG9aRa_lXSacbgdMRqtc6GNPh2Ptk_8vIKl7y8HU5gPdzZIi-gQO61__wAONyudZIAAAA&shmds=v1_AUFQtOOTCEFv6caiOgOOZXyJPGx1QF82QZH7pwloGDXzKza5jw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5GLobnxIiy__hWxVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f397b4ebbb0e20887bb1191a9443dfde2c3d42fc3831f7edd7.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "null\nÜber uns\n\nWir sind ein führender Anbieter von Versicherungen, der sich auf das Risikomanagement in der Landwirtschaft spezialisiert hat. Mit jahrzehntelanger Erfahrung in diesem Bereich setzen wir uns dafür ein, die Existenzgrundlage von Landwirten und landwirtschaftlichen Betrieben zu schützen, indem wir umfassende Versicherungslösungen anbieten, die auf ihre speziellen Bedürfnisse zugeschnitten sind.\n\nAufgaben\n• Konzeption, Entwicklung, Programmierung und Test von neuen mobilen Applikationen und Softwarelösungen\n• Analyse und Optimierung vorhandener Systeme, Anwendungen und Schnittstellen\n• Weiterentwicklung und Integration der Mobil-Lösungen mit den Backoffice-Systemen\n\nProfil\n• Du verfügst über ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation\n• Du bringst umfangreiche Erfahrung in der Entwicklung von Android-Apps mit (Kotlin / Java) mit\n• Du besitzt fundierte Kenntnisse in der Implementierung von mobilen Applikationen mit dem Android Studio sowie der Erstellung von Benutzeroberflächen mit Jetpack Compose\n• GIT ist kein Fremdwort für Dich und mit der Datenmodellierung ERM sowie UML hast Du bereits gearbeitet\n• Du besitzt Know-how über die Anbindung von Backend-Systemen (WebServices, XML, JSON, REST)\n• Du besitzt Verständnis für fachliche und technische Abläufe\n• Du kennst Confluence und Jira\n• Du bist kommunikativ, arbeitest gerne im Team und übernimmst gern Eigenverantwortung und Initiative\n• Du besitzt gute Deutsch- und Englischkenntnisse\n\nWir bieten\n• Flexible Arbeitszeitgestaltung mit Raum für Deine persönliche und berufliche Weiterentwicklung\n• Flache Hierarchien, kurze Wege, ein nettes Team und eine gute Einarbeitung\n• Sicherer Arbeitsplatz in einem modern ausgestatteten Arbeitsumfeld, das mobiles Arbeiten möglich macht\n• Leistungsgerechte Vergütung und zusätzliche Sonderleistungen, wie z.B. Betriebliche Altersvorsorge, Kinderbetreuungsgeld, Fahrradleasing für Job und Freizeit und noch vieles mehr\n\nKontakt\n\nThomas Lersch\n\nWe offer expertise in international IT recruiting & relocation services\n\n______________________________________________________________________\n\nBüro Lersch\n\nMobil: 0049-160-97375452 (Whatsapp/Telegram)\n\nWeb: www.buerolersch.de",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/trier-android-developer-127633595?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiQlVFUk8gTEVSU0NIIiwiYWRkcmVzc19jaXR5IjoiVHJpZXIsIEdlcm1hbnkiLCJodGlkb2NpZCI6IjVHTG9ibnhJaXlfX2hXeFZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Android Developer (m/w/d) - Raum Brandenburg",
            "company_name": "KA Resources",
            "location": "Brandenburg, Germany",
            "via": "KA Resources",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=ObBncAE1mnlFbn-1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_03NPQ7CMAxAYbH2CEweGABBg5BYYCogVYKtF6jSxEqLEjuKU35uxDGBjeUN3_KK96Q4VWQTDxbOeEfPERPMg3oou4A1NHoMcEyaLFI3JvelC3cgqJPpgQlqZudxeuhzjrJXSsSXTrLOgykNB8WEHT_VjTv5pZVeJ4xeZ2y3u82zjOSWs2sFDQqPyaDAQP_DFdSYgqbXB1AMO-KrAAAA&shmds=v1_AUFQtONfQ22ODbWzNhNDObHFZ5p9c_maOuuIIMpRei4Y0h6hCA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ObBncAE1mnlFbn-1AAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Nach ausführlicher Absprache suchen wir Sie für unseren Kunden mit großem Potenzial, einem marktführenden und international tätigen, sowie zukunftsorientierten IT-Dienstleister mit Leidenschaft und Weltklasse und bahnbrechenden, wegweisenden Technologien für eine zukunftsweisende Branche und einem familiären und kreativen Arbeitsumfeld, sowie extrem kurzen Entscheidungswegen. Das krisensichere Unternehmen verfolgt eine zukunftsorientierte Innovationsstrategie. Die Produkte stehen für Innovation, Pioniergeist, Qualität und Nachhaltigkeit. Die modernen Herausforderungen liegen für das Unternehmen sowohl in der Planung, Realisierung, als auch in der Operation, sowie mit großem Knowhow auch im Hinblick auf die Zukunft und mit internationaler Aufstellung, dennoch regionaler und persönlicher Präsenz. Das engagierte und verlässliches Unternehmen verfügt über Firmengeschichte, agiert dennoch jung, flexibel und agil mit Innovationskraft und Lust und Drive etwas zu bewegen und offen anderen Kulturen gegenüber mit Leidenschaft für die App-Entwicklung sowie für Themen wie Cloudification, IoT und Artificial Intelligence.\n\nDas Unternehmen ist zu Recht stolz auf ihre Qualität und Integrität. Die Nähe zum Kunden, Innovation, beste Leistung, Sicherheit, Nachhaltigkeit und das internationale Netzwerk sind Auszeichnungen, die die Kunden aufgrund der talentierten und hilfsbereiten Mitarbeiter bescheinigt. Das Unternehmen wächst organisch. Weltweit sind rund 7000 Mitarbeiter in mehreren Ländern an 40 nationalen und internationalen Standorten in verschiedenen Branchen mit Leidenschaft beschäftigt. In Deutschland gibt es mehrere Standorte und rund 6000 Mitarbeiter. Das Unternehmen genießt ein großes Vertrauen in der Branche. Es handelt sich um einen Marktführer mit viel Erfahrung und von hoher Qualität. Die einzigartige stabile Unternehmenstradition, das gelebte Vertrauen sind sehr wichtig. Das Unternehmensleitbild ist neben dem Kunden vor allen vom Erfolgsfaktor Mitarbeiter und großem Teamgeist beherrscht, für die von diesem innovativen Unternehmen Vertrauen, Loyalität, Transparenz, Fairness, Zuverlässigkeit, Achtung und Respekt entgegengebracht werden sowie eine offene und partnerschaftliche Kundenorientierung genauso wichtig ist. Neben einem offenen Wissenstransfer ist das Unternehmen an der persönlichen beruflichen Weiterentwicklung seiner Mitarbeiter sehr interessiert und bietet zahlreiche Angebote. Die Hierarchieebene ist auf Augenhöhe geführt.\n\nFür diesen Anspruch werden Sie als Android Developer (m/w/d) remote oder in einem der vielen Standorte in Deutschland eingesetzt. Arbeiten Sie eng verzahnt im Entwicklerteam und bringen Sie ihre Fähigkeiten und Kompetenz ein. Der Umgang untereinander erfolgt in der Regel in Duz-Kultur. Erleben Sie eine angenehme und familiäre Arbeitsatmosphäre mit einer generationenübergreifenden Teamarbeit.\n\nSteigen Sie ein in einem spannenden, familienfreundlichen & abwechslungsreichen Unternehmen, dass Service großschreibt, großen Wert auf die Zufriedenheit, nachhaltiges Arbeiten, Diversität und die Entwicklung der Mitarbeiter legt. Es wird Sie überraschen, dass Mitarbeiter sich weiterbilden dürfen und sollen, internationale Karrieremöglichkeiten haben, ein „Feel Good“ - Management genießen, in dem auch Frauen gerne arbeiten, sowie bei dem der extra Jahresbonus nicht fehlt, sowie das Unternehmen dem Alltag und der Arbeitswelt beiträgt. Das Unternehmen bietet Ihnen interessante Projekte und sehr gute Entwicklungsmöglichkeiten mit fördern und fordern. Gerne gesehen ist Eigeninitiative und sich einzubringen. Der Kundenkontakt ist sehr hoch und daher ist ein sehr gutes Beherrschen der deutschen Sprache ein MUST Have. Sie arbeiten in einer 40-Stunden-Woche bei flexibler Vertrauensarbeitszeit und 26-34 Tagen Urlaub.\n\nAndroid Developer (m/w/d)\n\nIn unbefristeter Festanstellung\n\nAb sofort oder nach Vereinbarung\n\nJahresgehalt bis 90.000 € und auf Verhandlungsbasis je nach Erfahrung und Qualifikation\n\nArbeitszeit: 40 Stunden Vertrauensarbeitszeit\n\nUrlaubstage: 30, können auf Wunsch reduziert oder erhöht werden\n\nUnternehmensstandort: verschiedene Standorte in Deutschland oder remote\n\nRef. 24768\n\nHighlights:\n• Spannende Ausrichtung in einem beständigen und wachsenden Unternehmen mit breit gefächerten Tätigkeiten.\n• Sicherer Arbeitsplatz und langfristig gesichert, mit Ausschluss von betriebsbedingten Kündigungen.\n• Spannende und abwechslungsreiche Aufgaben in einem bedeutsamen und modernen Umfeld.\n• Innovation und Weiterbildung: Vielfältige interne und externe Weiterbildungsmöglichkeiten.\n• Durch die flachen Hierarchien ein hoher Grad an Freiraum und die einmalige Gelegenheit, mit kreativen Ideen mitzuwirken, direkt Verantwortung zu übernehmen und die Aufgaben aktiv mit der eigenen Persönlichkeit selbst zu gestalten, sowie hoher Grad an kostenloser Weiterbildung.\n• Gute Entwicklungsmöglichkeiten und Individuelle Karrieremodelle.\n• Starker Teamzusammenhalt.\n• Vertrauensarbeitszeit - je nach Aufgabenfeld sind mobiles Arbeiten und flexible Arbeitszeitmodelle möglich.\n• Möglichkeit ein Team zu steuern und/oder junge Kollegen auszubilden.\n• „Social Goodies“ wie betriebliches prämiertes Altersvorsorgeprogramm, Bonuszahlungen (Aufgaben- und Positionsabhängig) und diverse Mitarbeiterprogramme und Vergünstigungen (Incentives, Veranstaltungen, Jobticket, Benefits).\n• Sinnstiftende und bedeutungsvolle Tätigkeit mit täglichem Wertbeitrag am IT-System, täglichem Beitrag zum stabilen Systembetrieb, Verantwortung an großen Finanzströmen.\n• Keine Überstunden .\n\nIhre Tätigkeiten:\n• Sie entwickeln einen Android-App Messenger.\n• Sie übernehmen im Team die Aufgaben des kompletten Softwareentwicklungszyklus.\n• Sie analysieren und generieren Geschäftsprozesse und Anforderungsspezifikationen.\n• Sie begeistern sich für die Arbeitsweise im Team und mit Stakeholdern.\n• Sie beherrschen die Entwicklung mit Hinblick auf CI/CD von Software-Modulen.\n\nIhre Voraussetzungen:\n• Sie haben ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation.\n• Sie bringen eine reiche, fachbezogene und prägende Berufserfahrung von mindestens 5 Jahren in der App-Entwicklung und Kotlin mit.\n• Sie haben sehr gute Kenntnisse mit Java und Android.\n• Sie sind vertraut im DevOps-Umfeld.\n• Sie entwickeln gerne zusammen mit dem Kunden neue Software.\n• Gute Deutsch- und fachliche Englischkenntnisse in Wort und Schrift.\n• Wünschenswert sind Kenntnisse mit Kotlin Coroutine, Dependency Injection, Confluence/Jira, GitLab sowie mit Architect Design Patters und MVVM.\n• Sie bringen Reisebereitschaft mit, max. 1- oder 2-mal alle 2 Wochen, wenn dies im Projekt gefordert wird.\n\nWas bietet Ihnen dieses Unternehmen:\n\nTrifft Ihren Geschmack: Eine reizvolle Aufgabe in einem großen innovativen Unternehmen und verschiedene spannende und interessante Herausforderungen in einem großartigen Team mit familiärer und familienfreundlicher Firmen-Kultur und Herausforderungen bei motivierender Arbeitsatmosphäre, mit Eigenverantwortung, flexiblen Arbeitszeiten, Kinderbetreuung, Work-Life Balance, Gesundheit & Sicherheit, Mitarbeiterevents, Kantine, Jobticket, Firmenfitness, Freiraum und Flexibilität, Parkplatz, Innovation & Expertise, mit Vertrauensarbeitszeit mit mobilem Arbeiten in einem familiären und kreativen Arbeitsumfeld, sowie unzähligen Möglichkeiten. Mitwirkung an AI-Projekten, sowie großartigen Firmenevents.\n\nBezahlt gut: attraktive fixe außertarifliche Vergütung, Weihnachts- und Urlaubsgeld, betriebliche prämierte Altersvorsorge vermögenswirksamen Leistungen, Rabattprogramm für Mitarbeiter, Sozialleistungen, 30 Urlaubstage und frei an Weihnachten und am Neujahrsabend, sicherer Arbeitsplatz mit flexiblen Arbeitszeiten, Job-Rad, Bonuszahlungen\n\nFördert Ihre Karriere: Persönliche individuelle Entwicklung und Förderung mit eigener Akademie, Mentoring, Management Development, und ein sehr breites Weiterbildungsangebot mit verschiedensten Möglichkeiten in der eigenen Firmenuniversität, sowie gewollte Karrieremöglichkeiten mit Kompetenzsteigerungen\n\nIst unkompliziert: Flache Hierarchien, flexible Arbeitszeiten, um Privat- und Berufsleben zu vereinen, sowie Home-Office und mobiles Arbeiten und alternierende Telearbeit\n\nHat Zukunft: Individuelle Möglichkeiten fachliche Verantwortung im IT-Umfeld zu übernehmen, Lust haben neue Themen zu gestalten in einem wirtschaftlich sicheren Umfeld, herausragende berufliche Perspektiven mit dem Weiterbildungsprogramm\n\nIst komfortabel: Gut Verkehrsanbindung und gelegene Büros & kostenlose Mitarbeiterparkplätze, in der Nähe S-Bahn Station und Bushaltestelle, Rabattprogrammen, Gesundheitsmanagement und Betriebssport.\n\nDas erwartet Sie bei Ihrem zukünftigen Arbeitgeber:\n\nKommen Sie bequem an, denn in der Nähe befindet sich eine Bahnstation und eine Bushaltestelle. Falls Sie lieber mit Ihrem PKW fahren, ist dies auch kein Problem, denn Sie können auch vor der Tür kostenlos parken. Meistens müssen Sie aber auch gar nicht weg und Sie arbeiten von Home-Office aus. Ihren täglichen Arbeitsalltag gestalten Sie mit Ihren sympathischen Kollegen bei einer familiären und lockeren Arbeitsatmosphäre. Dieses Unternehmen bietet Ihnen die Möglichkeit sich weiterzubilden und selbständig zu arbeiten und es werden gute und moderne Arbeitsmittel und Büroräume, Firmenlaptop und Handy geboten. Das Unternehmen glänzt durch kurze Entscheidungswege durch das Management. Die Position ist dem Head of Data Analytics unterstellt. Das Unternehmen ist ein nachhaltiges Unternehmen, dass sich auch vor individuellen Home-Office Regelungen nicht scheut. Reisetätigkeit ist nicht oder nur gering vorgesehen. Einen einmaligen seltenen projektabhängigen Einsatz bei einer der Tochtergesellschaften vor Ort erfolgt nur in Absprache. Die Entwicklung der Mitarbeiter wird individuell gestaltet.\n\nDas Jobangebot klingt interessant, entspricht jedoch nicht genau Ihren Vorstellungen? Dann rufen Sie mich an +49 (0)2371 35 33 722. Ich habe täglich neue Stellen für Sie im Programm. Des Weiteren pflege ich einen engen Kontakt zu den Entscheidern und sage Ihnen, worauf es ankommt. Ob beim Endkunden mit Reisetätigkeit oder bei verschiedenen Firmen mit ständig neuen Technologien. Sie sagen mir, wie Ihr Traumjob aussehen soll und wir finden gemeinsam die passende Stelle für Sie.\n\nSie haben Lust, Dinge zu gestalten und sich weiterzuentwickeln? Dann ist diese Stelle genau richtig und Sie dürfen mir Ihre vollständigen Bewerbungsunterlagen unter Angabe des nächstmöglichen Eintrittstermins, Gehaltsvorstellung und Ihren Wünschen zukommen lassen an n.zurybida@karesources.com\n\nSie möchten mehr Informationen oder über Ihre individuelle Zukunftsplanung sprechen? Dann senden Sie mir Ihren Lebenslauf + Anschreiben und vereinbaren einen Telefontermin mit mir!\n\nIhre Ansprechpartnerin\n\nNatascha Zurybida\n\nn.zurybida@karesources.com\n\nwww.karesources.com\n\n✆ +49 (0)2371 35 33 722",
            "apply_options": [
                {
                    "title": "KA Resources",
                    "link": "https://karesources.com/job/android-developer-m-w-d-berlin/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://de.jooble.org/jdp/3095326851162710783/Android-Developer-(m%2Fw%2Fd)-+-Raum-Brandenburg-Brandenburg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAobS93L2QpIC0gUmF1bSBCcmFuZGVuYnVyZyIsImNvbXBhbnlfbmFtZSI6IktBIFJlc291cmNlcyIsImFkZHJlc3NfY2l0eSI6IkJyYW5kZW5idXJnLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJPYkJuY0FFMW1ubEZibi0xQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Android Developer (m/w/d)",
            "company_name": "BUERO LERSCH",
            "location": "Darmstadt, Germany",
            "via": "XING",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=JJ7SiOWA-ncILr57AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU6Hk4o2RXCpk9pSEUGoOJekOdpKkgu5oPU7_GF1eeNLPpMk2zsdaNBQ4BMNeQwwt-Il9ALWcCYFjDK0PZCDiqgzON31MXrOhWA2acdRxqFNW7KCHCoaxYMU_2m4lwG9kRGbzTYbU--65exwL-srXMr6djzB4KCQwf4OHVdQYbDSvb9ltq1ElgAAAA&shmds=v1_AUFQtOOhs4QpwspPmO8u4ypacarRZw4KhBg0VtLINgkvhcCdRw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=JJ7SiOWA-ncILr57AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f3347a0de90899ac2639ce8cd68c2665e4f79536448ca138fc.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "null\nÜber uns\n\nWir sind ein führender Anbieter von Versicherungen, der sich auf das Risikomanagement in der Landwirtschaft spezialisiert hat. Mit jahrzehntelanger Erfahrung in diesem Bereich setzen wir uns dafür ein, die Existenzgrundlage von Landwirten und landwirtschaftlichen Betrieben zu schützen, indem wir umfassende Versicherungslösungen anbieten, die auf ihre speziellen Bedürfnisse zugeschnitten sind.\n\nAufgaben\n• Konzeption, Entwicklung, Programmierung und Test von neuen mobilen Applikationen und Softwarelösungen\n• Analyse und Optimierung vorhandener Systeme, Anwendungen und Schnittstellen\n• Weiterentwicklung und Integration der Mobil-Lösungen mit den Backoffice-Systemen\n\nProfil\n• Du verfügst über ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation\n• Du bringst umfangreiche Erfahrung in der Entwicklung von Android-Apps mit (Kotlin / Java) mit\n• Du besitzt fundierte Kenntnisse in der Implementierung von mobilen Applikationen mit dem Android Studio sowie der Erstellung von Benutzeroberflächen mit Jetpack Compose\n• GIT ist kein Fremdwort für Dich und mit der Datenmodellierung ERM sowie UML hast Du bereits gearbeitet\n• Du besitzt Know-how über die Anbindung von Backend-Systemen (WebServices, XML, JSON, REST)\n• Du besitzt Verständnis für fachliche und technische Abläufe\n• Du kennst Confluence und Jira\n• Du bist kommunikativ, arbeitest gerne im Team und übernimmst gern Eigenverantwortung und Initiative\n• Du besitzt gute Deutsch- und Englischkenntnisse\n\nWir bieten\n• Flexible Arbeitszeitgestaltung mit Raum für Deine persönliche und berufliche Weiterentwicklung\n• Flache Hierarchien, kurze Wege, ein nettes Team und eine gute Einarbeitung\n• Sicherer Arbeitsplatz in einem modern ausgestatteten Arbeitsumfeld, das mobiles Arbeiten möglich macht\n• Leistungsgerechte Vergütung und zusätzliche Sonderleistungen, wie z.B. Betriebliche Altersvorsorge, Kinderbetreuungsgeld, Fahrradleasing für Job und Freizeit und noch vieles mehr\n\nKontakt\n\nThomas Lersch\n\nWe offer expertise in international IT recruiting & relocation services\n\n______________________________________________________________________\n\nBüro Lersch\n\nMobil: 0049-160-97375452 (Whatsapp/Telegram)\n\nWeb: www.buerolersch.de",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/darmstadt-android-developer-127633113?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiQlVFUk8gTEVSU0NIIiwiYWRkcmVzc19jaXR5IjoiRGFybXN0YWR0LCBHZXJtYW55IiwiaHRpZG9jaWQiOiJKSjdTaU9XQS1uY0lMcjU3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Android SDK Engineer (Kotlin)",
            "company_name": "voize GmbH",
            "location": "Berlin, Germany",
            "via": "Stepstone",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=WdE6uV1eOsWWI4SfAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CYJwo4omInbRSVEidvQDStIeaSS9K7kg1c_wi9Xlra_4TIrdkdrEoYX7uYIL-UCICeYV5xhoAWu4sQNBm5oOmMAw-4jTQ5fzIHutRaLykm0OjWq410zoeNQPdvKnls4mHKLNWG_LzagG8svZk8MbwfTuCoHghOlXrcBg6i29vg5Dms6VAAAA&shmds=v1_AUFQtONkUfmtsgXM7YoEKZOcwAhDvVQcJP44XV6hs86zUbAaBA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=WdE6uV1eOsWWI4SfAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f35bdd21f1f9ced65172b4849fc86541dd7ad3fed5ab6cd058.gif",
            "extensions": [
                "2 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "2 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Einleitung\n\nBei voize revolutionieren wir die Pflege und setzen neue Maßstäbe in der Dokumentation durch künstliche Intelligenz (KI). Mit unserer innovativen Lösung können Pflegekräfte Dokumentationen direkt am Smartphone einsprechen, und unsere KI erstellt automatisch präzise und strukturierte Einträge. Das spart täglich bis zu 18 Minuten pro Pflegekraft und verbessert gleichzeitig die Dokumentationsqualität erheblich.\n\nUnsere Technologie findet auch Anwendung in anderen Branchen, z. B. beim TÜV. Wir sind ein junges, dynamisches Team, unterstützt von YCombinator und Redalpine, das cutting-edge Technologie mit sozialem Mehrwert verbindet. Mit voize kannst du die Zukunft der Arbeit aktiv gestalten – für Pflegekräfte, Fachleute und viele andere.\n\nFür die nächsten großen Schritte suchen wir dich als Android Engineer!\n\nUnser Team bei voize besteht aus 35 leidenschaftlichen Mitgliedern, die in den Bereichen Produkt-/Entwicklung, Data, Customer Success, Sales, Support, Marketing und HR arbeiten. Wir sind ein dynamisches und ambitioniertes Team, das eng zusammenarbeitet, um unsere Sprach-KI-Lösungen für die Pflegebranche stetig zu verbessern. Unsere Unternehmenskultur bietet viel Freiheit in der Arbeitsweise und eine große Begeisterung für moderne Technologien. Bei voize legen wir großen Wert auf datengetriebene Entscheidungen, um Prozesse zu optimieren und unseren Kunden den bestmöglichen Service zu bieten. Jeder im Team ist motiviert, kreativ zu denken und aktiv zur Weiterentwicklung unserer Produkte beizutragen.\n\nIhre Aufgaben\n\nAufgaben\n\nDeine Mission bei voize\n• Du übernimmst die zentrale Verantwortung für die Entwicklung und technische Umsetzung unserer Android-Apps (Kotlin & Jetpack Compose).\n• Du entwickelst Features, die den Alltag von Nutzer:innen spürbar erleichtern, und bringe sie von der Idee bis zur Umsetzung auf den Markt. Wir iterieren und shippen schnell.\n• Du gestaltest das voize SDK und ermögliche Partnern, unsere KI-Technologie nahtlos zu integrieren.\n• Du genießt es eng mit den Gründern und Kunden zusammen zu arbeiten, um Anforderungen direkt in kreative und effiziente Lösungen zu übersetzen.\n• Du begleitest den gesamten Entwicklungszyklus: von der Konzeptphase über Testing bis hin zum Nutzer-Feedback.\n\nQualifikation\n\nMust-Have:\n• 3+ Jahre Erfahrung in der Android-Entwicklung mit Kotlin und Jetpack Compose.\n• Erfahrung in der Entwicklung von SDKs oder Developer-Tools.\n• Fundierte Kenntnisse in Git, CI/CD-Prozessen und Testing-Frameworks.\n• Ein Auge für Design und die Fähigkeit, intuitive und nutzerfreundliche Oberflächen zu gestalten.\n• Ausgeprägte Kommunikationsfähigkeit, um mit Kunden, Partnern, und unserem Team auf Augenhöhe zu arbeiten.\n• Fließende Deutsch- und Englischkenntnisse auf C1-Niveau.\n\nNice-to-Have:\n• Kenntnisse in Kotlin Multiplatform und Compose Multiplatform.\n• Erfahrung mit iOS-Entwicklung, TypeScript, oder React.\n• Interesse an Backend-Entwicklung mit Kotlin oder DevOps-Themen wie Docker.\n\nBenefits\n• Unser Office sitzt in Berlin und wir bieten Remote Work an.\n• Wir bieten flexible Arbeitszeiten, denn du weißt am besten, wann du am liebsten arbeitest!\n• Wir haben eine offene Kultur und organisieren regelmäßige Work Weeks und Teamevents an, wo wir gemeinsam arbeiten und bonden\n• Kostenloses Deutschland Ticket und Urban Sports Club Mitgliedschaft\n• Wir sind ein schnell wachsendes Start-up mit vielfältigen Herausforderungen, was dir die optimale Grundlage für schnelles persönliches Wachstum bietet\n• Du kannst mit deiner Arbeit richtig was bewegen und hilfst Pflegekräfte zu entlasten\n• Werde Teilhaber*in von voize mit deinen eigenen virtuellen Anteilen\n\nNoch ein paar abschließende Informationen zum Team und Bewerbungsprozess:\n\nTeam\n\nHier findest du ein inspirierendes Umfeld, in dem du deine Fähigkeiten weiterentwickeln und gemeinsam mit uns die Pflegebranche revolutionieren kannst.\n\nBewerbungsprozess\n• Talent Call (Video Call): Kennenlernen und Austausch über die Rolle.\n• Fachliches Tech Interview (Video Call): Deine Skills und Projekte im Fokus.\n• Pair Programming Challenge (Onsite in Berlin): Lösen einer realen Herausforderung im Team.\n• Vertragsgespräch (Video Call)\n\nKontakt\n\nWir freuen uns auf deine Bewerbung und dich kennenzulernen!",
            "apply_options": [
                {
                    "title": "Stepstone",
                    "link": "https://www.stepstone.de/stellenangebote--Android-SDK-Engineer-Kotlin-Berlin-voize-GmbH--11821333-inline.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Arbeitnow",
                    "link": "https://www.arbeitnow.com/jobs/companies/voize-gmbh/android-sdk-engineer-kotlin-berlin-423905?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/android-sdk-engineer-kotlin-at-instaffo-4102307193?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://de.trabajo.org/stellenangebot-2902-820d81fcf10cc9ce2f156f411b289f4a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/berlin-android-sdk-engineer-kotlin-129703650?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba.de",
                    "link": "https://www.jobijoba.de/detailanzeige/9/9d89ae18eab17b8b1a33e7249a21c83c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNESyBFbmdpbmVlciAoS290bGluKSIsImNvbXBhbnlfbmFtZSI6InZvaXplIEdtYkgiLCJhZGRyZXNzX2NpdHkiOiJCZXJsaW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6IldkRTZ1VjFlT3NXV0k0U2ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Senior Android Engineer, Foundations Alliance (m/f/x)",
            "company_name": "4lu44n1n37w012k",
            "location": "Berlin, Germany",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=U6yodSrlvJiwE8aNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLMQ6CMBQA0LhyBKcfJzVIBTEmOmGiJMbNA5BSvqVa_idtiXgqr6gub3vRZxJdb0iGHRTUODYNnEgbQnQxnHmgRgbD5KGw1khSCPNO3MW4gBVcuAaP0qkWmKBk1hanhzaE3u-F8N4m2odfV4niTjBhzaN4cO3_VL6VDnsrA1bZdj0mPenlLLdDnlNKm91rnWZPMARHdNZQDCW6TtL7C-vlirWyAAAA&shmds=v1_AUFQtONwGkjjg_eOoFKT-8J4aG6slO87WLQFNhV2u5Oo4DtihA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=U6yodSrlvJiwE8aNAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "The role\n\nHelloFresh has expanded rapidly as a technology organization going from just over one hundred engineers to almost one thousand engineers in the last few years. As part of scaling as an engineering team, we’ve created the AppFoundations tribe to be responsible for unleashing mobile developers productivity across the company. The team has the following four major focus areas: architecture, automation and release (CI/CD), observability, and application performance. So if you like to make the life of your fellow engineers a bit easier and to have a big impact, this could be the role for you!\n\nAbove all, we are looking for people who will make HelloFresh better. We believe there are many different ways of developing skills and we love diverse experiences! So even if you don’t “tick all the boxes” but think you’d thrive in this role, we would really like to learn more about you.\n\nWhat you’ll do\n• Support the mobile engineers on feature teams across HelloFresh by improving our releases process, working on fundamental architectural challenges and core shared components\n• Build tooling to automate and improve developer experience and productivity.\n• Automate, improve, and maintain CI/CD pipelines and releases.\n• Bring observability for the mobile application, testing, and CI/CD performance.\n• Improve core mobile metrics such as app launch, build time, and compile time.\n• Take ownership of our engineering and process quality, our testing strategy and the monitoring of the code\n• Be part of true agile and solution oriented squads, collaborating cross functionally with Engineers, Designers, Product Owners\n\nWhat you’ll bring\n• You have relevant working experience working with mobile development, ideally on a mobile platform team\n• You have a strong experience and knowledge with Swift/Kotlin, as well as RESTful API’s\n• You have thorough knowledge of software development best practices, like Design Patterns, Clean Code, Agile Development, and Testing\n• You can support the team by monitoring, measuring and optimising various aspects of the application performance like app startup, build time and memory consumption\n\nInteracting with front-end developers, designers, product managers and our teams around the world is very much part of our day-to-day, so communication skills are vital. We are looking for strong problem-solvers who can apply their engineering skills to a wide range of platforms and environments, while also acting as an ambassador to coach team members and stakeholders.\n\nWhat we offer\n\nElevate your lifestyle! Join one of Europe's fastest-growing tech powerhouses in a dynamic phase of expansion.\n• Immerse yourself in a diverse global community of 90+ nationalities.\n• Enjoy a competitive compensation package that goes beyond the norm, with perks like a HelloFresh- subsidized Pension Scheme, Berlin relocation support, and a Hybrid working model.\n• Elevate your lifestyle with exclusive discounts on your weekly HelloFresh box and office meals.\n• Invest in your growth with a German language learning budget, and access to the HelloFresh Academy.\n• Plus, we've got your well-being covered with mental health support, transportation perks, and working-parent-friendly benefits. From our 24/7 gym access,wellbeing platforms like Headspace and Spill, to sabbatical leave options, HelloFresh is not just a workplace; it's a lifestyle of perks and possibilities!\n\n#Foundations",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-engineer-foundations-alliance-mfx-at-hello-fresh-862?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/de/job/senior-android-engineer-foundations-alliance-m-f-x--berlin--ea5d0a4b765525fe8fa608e357f9289a9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Play",
                    "link": "https://startupplay.com/job/senior_android_engineer_foundations_alliance_mfx_hellofresh_berlin_2886018?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciwgRm91bmRhdGlvbnMgQWxsaWFuY2UgKG0vZi94KSIsImNvbXBhbnlfbmFtZSI6IjRsdTQ0bjFuMzd3MDEyayIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoiVTZ5b2RTcmx2Sml3RThhTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Senior Android Developer, KMP - Point-of-Sale Tribe",
            "company_name": "SumUp",
            "location": "Cologne, Germany",
            "via": "LinkedIn",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=xtg8kouD0ITY2UD3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7BzrdLG0jgotOolCoCEJ1Lkl7ppH0Llyi1P_xQ9XlDS_7zLK6QXIssKde2PVwxBd6Dig5nM4XKODCjlLB96LRHuEqzuBvazYQUUs3ABNUzNbjYjekFOJWqRh9aWPSyXVlx6NiQsOTerCJf9o4aMHgdcJ2vVlNZSC7nDfP8RbAERzYsyXMoUIZNb2_wU0up6cAAAA&shmds=v1_AUFQtOMilSyb_wKozWcpyBn-sk7ZtshMRG7J1aezEdaCd0QKxQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=xtg8kouD0ITY2UD3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f394c03e01d5f8202abf1b5d7f7de3f8dc6293efa8520d8c48.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About The Team\n\nSumUp’s Point-of-Sale (POS) solution empowers cafes, shops, bars, hair salons, and other businesses to operate efficiently and grow. It offers a wide range of features, including product catalogs, inventory management, business analytics, compliance support, and loyalty tools.\n\nOur POS solution integrates seamlessly into the SumUp SuperApp, which supports both our proprietary register hardware and mobile devices like tablets and phones.\n\nAs a Senior Android Developer, you’ll collaborate with a dynamic, cross-functional team of Product Managers, Product Designers, Engineering Managers, and fellow engineers.\n\nYou’ll contribute to the Item Catalog value stream - a core component serving the needs of almost all teams at SumUp.\n\nAbout The Role\n\nWe’re evolving toward a Kotlin Multiplatform (KMP) strategy, enabling shared development across Android and iOS. In this role, you’ll learn, refine, and help implement this technology, shaping the future of our mobile apps.\n\nYou’re a developer who values user-centric design, precision, and seamless collaboration. You bring structure to communication and thrive in a cross-functional environment.\n\nThis role is on-site in Cologne, where face-to-face interactions spark innovation and teamwork.\n\nWhat You’ll Do\n• Build new features for the item catalog within the SumUp SuperApp\n• Help improve the architecture of the application\n• Enhance and maintain our unified android app, distributed across 60+ countries, ensuring high-quality, scalable solutions\n• Shape the product’s evolution by identifying opportunities for improvement and contributing to daily decision-making\n• Write thorough documentation and implement robust testing for features before shipping\n• Collaborate closely with Designer, Product Manager and Android engineers to deliver a unified UX experience across platforms\n• Coach and mentor other engineers\n\nYou’ll thrive in this role if:\n• You have 5+ years experience in mobile engineering with Android/Kotlin.\n• You have 2+ years of experience working with Jetpack Compose.\n• You have a solid understanding of software design patterns (e.g., MVVM, MVP) and expertise in building modular, scalable app architectures.\n• You have good knowledge of reactive programming (Flow, Coroutines and Concurrency).\n• You have a strong grasp of testing best practices: knowing what to test, why, and how to write resilient tests.\n• You strive for clean code, and you are flexible to balance pragmatism and perfection.\n• You have a keen interest in multi-platform development using Kotlin Multiplatform.\n\nWhy you should join SumUp\n• The opportunity to work on large scale fintech products used by millions of small businesses around the world\n• A dedicated annual Learning & Development budget for attending conferences and/or advancing your career through further education\n• Enrollment onto our virtual stock ownership program - you will own a stake in SumUp’s future success\n• A corporate pension scheme\n• 28 days’ paid leave\n• You’ll attend global offsites and/or hackathons.\n• You'd enjoy other great benefits such as Urban Sports Club subsidy, Kita placement assistance, subsidized office lunches and other location-tailored benefits, Babbel language platform subscription and more!\n\nAbout SumUp\n\nBe empowered to do more that matters.\n\nAt SumUp, we're on a mission to empower small businesses across the globe by providing simple and affordable tools that allow them to thrive. Today, over 4 million businesses in 36 markets rely on SumUp as their financial partner to manage payments, finance and customer relationships.\n\nOur commitment to small businesses is reflected in our diverse team of over 3,000 SumUppers from over 90 nationalities, united by global collaboration and an innovative mindset. Our core values lay the foundation for who we are and what we stand for, shaping our work culture and driving our success. We foster inclusivity and a continuous learning culture, providing a safe space for personal and professional growth. Our differences make us unique and strong as we strive to create an environment where everyone belongs and feels supported, no matter how they identify.\n\nSumUp is proud to be an Equal Employment Opportunity employer, actively seeking and embracing diversity in our workforce. We don't make hiring or employment decisions based on race, colour, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age or any other basis protected by applicable laws or prohibited by company policy. Our commitment extends beyond recruitment to creating a safe and respectful workplace where harassment of any form is strictly prohibited.\n\nExplore career opportunities with us and join a team driven by collaboration, innovation, and a shared vision of creating a world where everyone can build a thriving business. Discover more about our vibrant and inclusive work culture and how we work on our careers website, and follow our journey on LinkedIn and Instagram.\n\nSumUp is an Equal Employment Opportunity employer that proudly pursues and hires a diverse workforce. SumUp does not make hiring or employment decisions on the basis of race, color, religion or religious belief, ethnic or national origin, nationality, sex, gender, gender identity, sexual orientation, disability, age, or any other basis protected by applicable laws or prohibited by company policy. SumUp also strives for a healthy and safe workplace and strictly prohibits harassment of any kind.\n\nSumUp will not accept unsolicited resumes from any source other than directly from a candidate.\n\nJob Application Tip\n\nWe recognise that candidates feel they need to meet 100% of the job criteria in order to apply for a job. Please note that this is only a guide. If you don’t tick every box, it’s ok too because it means you have room to learn and develop your career at SumUp.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/senior-android-developer-kmp-point-of-sale-tribe-at-sumup-4021924221?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=74488666428187334&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Play",
                    "link": "https://startupplay.com/job/senior_android_developer_kmp__pointofsale_tribe_sumup_cologne_germany_5905642002?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIsIEtNUCAtIFBvaW50LW9mLVNhbGUgVHJpYmUiLCJjb21wYW55X25hbWUiOiJTdW1VcCIsImFkZHJlc3NfY2l0eSI6IkNvbG9nbmUsIEdlcm1hbnkiLCJodGlkb2NpZCI6Inh0Zzhrb3VEMElUWTJVRDNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Android Developer (m/w/d)",
            "company_name": "BUERO LERSCH",
            "location": "Wiesbaden, Germany",
            "via": "XING",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=zuXq4W3Et9L7V5-JAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXESwrCMBAAUNz2CK4GVyraFMGNrvyUighCRVyWfIY2kmZCJmg9hxcW3-Jl31FW7LyJZA0c8YWOAkaY9uItzAyWcCYFjDLqDshDRdQ6HG-7lAJvhGB2ectJJqtzTb0gj4oG8STF_xruZMTgZMJmtS6GPPh2Ptnfy_oKl7K-HU5gPTwsspIG_QIqjL30nx9ySGPvlgAAAA&shmds=v1_AUFQtOMhYQcSs075A3PeBy4ja1R3NsXv1EZaJiRoe0pc9-Ctzg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=zuXq4W3Et9L7V5-JAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f3ce1618c060d5e0876498c2ec1a92e90d60fef9aa976a70c5.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "null\nÜber uns\n\nWir sind ein führender Anbieter von Versicherungen, der sich auf das Risikomanagement in der Landwirtschaft spezialisiert hat. Mit jahrzehntelanger Erfahrung in diesem Bereich setzen wir uns dafür ein, die Existenzgrundlage von Landwirten und landwirtschaftlichen Betrieben zu schützen, indem wir umfassende Versicherungslösungen anbieten, die auf ihre speziellen Bedürfnisse zugeschnitten sind.\n\nAufgaben\n• Konzeption, Entwicklung, Programmierung und Test von neuen mobilen Applikationen und Softwarelösungen\n• Analyse und Optimierung vorhandener Systeme, Anwendungen und Schnittstellen\n• Weiterentwicklung und Integration der Mobil-Lösungen mit den Backoffice-Systemen\n\nProfil\n• Du verfügst über ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation\n• Du bringst umfangreiche Erfahrung in der Entwicklung von Android-Apps mit (Kotlin / Java) mit\n• Du besitzt fundierte Kenntnisse in der Implementierung von mobilen Applikationen mit dem Android Studio sowie der Erstellung von Benutzeroberflächen mit Jetpack Compose\n• GIT ist kein Fremdwort für Dich und mit der Datenmodellierung ERM sowie UML hast Du bereits gearbeitet\n• Du besitzt Know-how über die Anbindung von Backend-Systemen (WebServices, XML, JSON, REST)\n• Du besitzt Verständnis für fachliche und technische Abläufe\n• Du kennst Confluence und Jira\n• Du bist kommunikativ, arbeitest gerne im Team und übernimmst gern Eigenverantwortung und Initiative\n• Du besitzt gute Deutsch- und Englischkenntnisse\n\nWir bieten\n• Flexible Arbeitszeitgestaltung mit Raum für Deine persönliche und berufliche Weiterentwicklung\n• Flache Hierarchien, kurze Wege, ein nettes Team und eine gute Einarbeitung\n• Sicherer Arbeitsplatz in einem modern ausgestatteten Arbeitsumfeld, das mobiles Arbeiten möglich macht\n• Leistungsgerechte Vergütung und zusätzliche Sonderleistungen, wie z.B. Betriebliche Altersvorsorge, Kinderbetreuungsgeld, Fahrradleasing für Job und Freizeit und noch vieles mehr\n\nKontakt\n\nThomas Lersch\n\nWe offer expertise in international IT recruiting & relocation services\n\n______________________________________________________________________\n\nBüro Lersch\n\nMobil: 0049-160-97375452 (Whatsapp/Telegram)\n\nWeb: www.buerolersch.de",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/wiesbaden-android-developer-127629672?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiQlVFUk8gTEVSU0NIIiwiYWRkcmVzc19jaXR5IjoiV2llc2JhZGVuLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJ6dVhxNFczRXQ5TDdWNS1KQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Senior Android Engineer (W/M/D)",
            "company_name": "AVIV Group",
            "location": "Berlin, Germany",
            "via": "Startup Jobs",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=Uc8mfxZ75r5WVEDJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CYJwo4o2IuigU0UpCk5CHUvaHmkkvQt3Eep_-MHiG172nWT7B5JngYI6Yd_BhZwnRIH509zNeQFruHEDilbaHpigZHYBp8c-pagHY1RD7jTZ5Nu85cEwYcOjeXGj_2rtrWAMNmG93W3GPJJbzorqWkEp_I7gCU4owdMKSpTB0ucHGyR54pcAAAA&shmds=v1_AUFQtONndJ_skrAPpLZWuZ93lRCqVIh3R1RO-fwiGHKGbhEpaw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Uc8mfxZ75r5WVEDJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f3d60340f12b8e768c1e72a101eb2dae8f587bfae67907a962.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "As a Senior Android Engineer within the AVIV Group, you will benefit from great flexibility and true experts in native technologies within a team of more than 60 mobile developers (android, ios, back-end).\n\nAttached to the Mobile Experience Team, you will be in charge of:\n\n• Design and develop Android mobile applications for the Group's different brands\n• Continuously improve the quality and performance of applications\n• Ensure the monitoring and maintenance of the applications produced\n• Be a force for proposals to implement new innovative features (virtual/3D tour, voice recognition, geofencing, etc.)\n• Monitoring and creation of prototypes around new technological opportunities (connected watches, TV applications, Google Home, etc.)\n\nOur technical stack :\n\n• Android Studio 4.1 / Kotlin 1.6\n• Partial tooling based on the Atlassian suite (Jira, Confluence)\n• GitHub as source code controller\n• MVVM + Clean Archi application architecture\n• Responsive programming “coroutines Flow”\n• Jetpack tools (navigation component, compose, viewmodel, room datastore,...)\n• White label: Design System, Atomic Design & Backend Driven Design approach\n• Modular feature\n• Dagger for dependency injection\n• Nexus as package manager\n• CI/CD via Cloud\n• Unit testing with JUnit and source code analysis with Sonarqube\n• Automated UI Testing with Espresso\n• Crash management with Crashlytics\n• Management of application tracking with GTM\n• Firebase for Remote Config or A/B Testing\n\nThe skills we are looking for:\n\n• Significant experience in developing native applications on Android (Kotlin + Compose)\n• Solid foundations in the particularities and constraints of application development\n• You love automation and dream of your code coverage\n• Your autonomy combined with your desire to learn and share your knowledge make you the ideal candidate for this position.\n• You like working in a team, are organized and know how to stay light to join a friendly and fun team.\n• Your obsession: damaging the Crashfree!\n• Good knowledge of the use of REST services, the implementation of the MVVM pattern and mobile application architecture in general\n• Mastery of local data storage\n• Working in a high-load environment (several hundred thousand users each day)\n• Good ability to express yourself in English\n\nWhat we offer you :\n\n• We are one of the leading PropTech platforms in Europe. If you’ve ever rented or purchased a property then you may have used one of our classified portals. This is a great time to join us to help elevate our AVIV brand.\n• The opportunity to work hybrid within our operating footprint with international travel to our locations in France, Belgium and Germany.\n• The freedom to tell us which tools you need to be successful in your job so we can set you up to make it happen.\n\nAt Aviv, we are an equal opportunities employer and an organisation where everyone is welcomed to be their authentic selves. We strongly encourage individuals with visible and non visible disabilities, all educational backgrounds, people from minority backgrounds, those from the LGBTQIA+ community and parents and carers to apply. If you need reasonable adjustments at any point in the application or interview process, or wish to discuss part time or flexible working requirements, please let us know.\n\nIn your application, please feel free to note which pronouns you use (For example - she/her/hers, he/him/his, they/them/theirs, etc).\n\nOur ambition is to be the leading Employer in PropTech across Europe and this is a pivotal time to join us and unlock your perfect job!",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-android-engineer-w-m-d-aviv-group-6015931?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=66b7321b98d039d3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.de",
                    "link": "https://www.monster.de/stellenangebot/senior-android-engineer-f-m-x-berlin-berlin--210fd515-2d4b-44bb-8ffe-1447c41ad123?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "HackerX",
                    "link": "https://hackerx.org/job/mycraftnote-digital-gmbh-heinrich-heine-platz-10-10179-berlin-full-time-senior-android-engineer-m-f-x/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/senior-android-engineer-f-m-x-at-bonial-germany-4117955918?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://de.jooble.org/jdp/-8825477494899881503/Senior-Android-Engineer-(f%2Fm%2Fx)-Berlin?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/senior-android-engineer-f-m-x-bonial-international-JV_IC2622109_KO0,29_KE30,50.htm?jl=1009589482685&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/treatwell/senior-android-engineer-saas/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciAoVy9NL0QpIiwiY29tcGFueV9uYW1lIjoiQVZJViBHcm91cCIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoiVWM4bWZ4Wjc1cjVXVkVESkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Android Developer",
            "company_name": "Starfish GmbH & Co. KG",
            "location": "Ulm, Germany",
            "via": "Relevant Jobs",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=Android+developer&htidocid=Eca0fcP6pH2JwGzwAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQoCIRAAULruJ3Sa0xJRGkGXOkWBUcfovKg7qaGOOBLbV_TL0Tu87jvrFsc8VgojnPGNkQpWWMOVDDDqaj1QBkXkIs4PvrXCeymZo3DcdAtWWEqSMhqa5IsM_xvY64ol6obDdreZRMlu2d-brs_AHlQyF-jhRAJuCkKGR0wrUFiTzp8f_0La75IAAAA&shmds=v1_AUFQtOO2wDvVXvIuCYqQOajysas2CwkM4ArNCibwySDKdSTkqg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Eca0fcP6pH2JwGzwAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a46a3dfaa5ebd82b151/images/b785794fdc2252f35d56ab8b0584d10b66764bcfe8b1fa18853035ff114c440a.gif",
            "extensions": [
                "12 days ago",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "12 days ago",
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Starfish is on the lookout for a seasoned Android Developer joining our team as Freelancer (full-time, 3-6 months, 100 % remote, located in Europe) to develop Android applications according to mocks.\n\nYour star qualities & daily business:\n• You have several years of experience in native Android app development\n• You have worked with Jetpack Compose\n• At best you are also familiar with Android Automotive OS (AAOS)\n• Clean code and test coverage are as important to you as a good user experience\n• A strong understanding of app architectures and interest in continuously improving code quality are key to your performance\n• You have a structured working method, excellent problem-solving skills, attention to detail and write clear documentation\n• You're a team player with a proactive attitude, excellent communication skills, and proficiency in English\n\nWhy embark on a Starfish adventure?\n• Our Values: We champion personal responsibility, flexibility, and trust.\n• Our Team: We're global, diverse, and foster flat hierarchies.\n• Our Projects: They're inspiring, innovative, and growth-oriented.\n• 100% Remote: Work from wherever you're most productive and satisfied.\n\nInterested? We can't wait to hear from you. Send your CV to jobs@starfish.team.",
            "apply_options": [
                {
                    "title": "Relevant Jobs",
                    "link": "https://www.relevantjobs.com/jobs/d86064644-starfish-gmbh-amp-co-kg-android-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlN0YXJmaXNoIEdtYkggXHUwMDI2IENvLiBLRyIsImFkZHJlc3NfY2l0eSI6IlVsbSwgR2VybWFueSIsImh0aWRvY2lkIjoiRWNhMGZjUDZwSDJKd0d6d0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUV05QYXpkT2RsODFXR2h2ZGxOUlQzTm9ZMnBPTkdzMGVHbzNXRnBRWTB0alkwRjRhRms1YzJsa1RsWkpOVXN5UWtSSlZIbHlTSGs1WTJGRGNIRkxYMDVMWlhWRFdqSnZNSFI1Y0hwNFowZHZiV0ZsTjNKVE1pMWZjRTVwY0ZCTldXRklYM0ZKYVZabVIxZGhNbVpQVTFZdE9VeE9OMjFaYzE5NWVYQmhWSEV4VXkxVk5FTkpSbWRhTjNCRlVFNUdVRjlLYUhWS1UyNDJORWd3UlZKa2JXTlJhMTluWTJjdGVVRllSV2g2Vld4cFF6WmxaR2hDU25sNWJ6SjZkRmhNU0dWU2N6Wm1SVTkyUXpBdFIxVnBkM1JJVlhSMVlVdDRXRlF3V0hFM1UycEphbHB3UkhCUE9FVnJUMnhQTkZCc01GQmhVazFtVEhReGR6ZHpZeTFWYzBRdFNXcFZkVVowVVhoeVNYcEVSRm90UnpWeFZIQldSRTlwWmtFU0YxSm5jVVphTm1velQxa3RVM2RpYTFBeFRDMUZNRUZOR2lKQlJsaHlSV053TkRoTU1raExURXMyVDAxaVEzUmlhRFp3TUVKalJUUktaUzEzIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.de&location=Germany&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUV05QYXpkT2RsODFXR2h2ZGxOUlQzTm9ZMnBPTkdzMGVHbzNXRnBRWTB0alkwRjRhRms1YzJsa1RsWkpOVXN5UWtSSlZIbHlTSGs1WTJGRGNIRkxYMDVMWlhWRFdqSnZNSFI1Y0hwNFowZHZiV0ZsTjNKVE1pMWZjRTVwY0ZCTldXRklYM0ZKYVZabVIxZGhNbVpQVTFZdE9VeE9OMjFaYzE5NWVYQmhWSEV4VXkxVk5FTkpSbWRhTjNCRlVFNUdVRjlLYUhWS1UyNDJORWd3UlZKa2JXTlJhMTluWTJjdGVVRllSV2g2Vld4cFF6WmxaR2hDU25sNWJ6SjZkRmhNU0dWU2N6Wm1SVTkyUXpBdFIxVnBkM1JJVlhSMVlVdDRXRlF3V0hFM1UycEphbHB3UkhCUE9FVnJUMnhQTkZCc01GQmhVazFtVEhReGR6ZHpZeTFWYzBRdFNXcFZkVVowVVhoeVNYcEVSRm90UnpWeFZIQldSRTlwWmtFU0YxSm5jVVphTm1velQxa3RVM2RpYTFBeFRDMUZNRUZOR2lKQlJsaHlSV053TkRoTU1raExURXMyVDAxaVEzUmlhRFp3TUVKalJUUktaUzEzIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}