{
    "search_metadata": {
        "id": "67850a551d0609c0f138f5b4",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/dced80421af4ecd4/67850a551d0609c0f138f5b4.json",
        "created_at": "2025-01-13 12:43:01 UTC",
        "processed_at": "2025-01-13 12:43:01 UTC",
        "google_jobs_url": "https://www.google.ie/async/callback:550?q=Android+developer&uule=w+CAIQICIHSXJlbGFuZA&udm=8&fc=EuICCqICQUpHOUprTTFjeU1CcUVCUEkzU29JcVdEZDdGOEpvcV8tN1dpM0lvZmhsbFY0SE95aGxkTy1KajQtcG9IM2RVR21vckR0UmlQVUF4OERBTDBXc2ZJbm5objhyM0Q0Mk5TeGYzU3dVUzVUdzhVYlowZXdGWjZkTDJnMjcwVGFRUWJ1NC0teVdIRGpKVUVWS0M2ZnNKeFoxajNGLXlRdUxUQXdNMHFCenRTdmxVcUd2VWRYS1JXcWZBNS1XYjJtSDJpWVNRY1daano5T3VmaWlERUNfQjVZckJIeVR0NGltQjhPSnhrQklUUndEWmlmWmhIYUNadWdYZnRSdmY5Uk8zV1VJMk1EQXhiNDBJdGJyV1Bqek1MRms2dUd0UXNvWkxaTmcSF1ZBcUZaN3p3RnFHcjVOb1B6Nkd4NlFnGiJBRlhyRWNyZ1IyVURRNzQwZEJTYlZ1amhIMXdOSU8zajNB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/dced80421af4ecd4/67850a551d0609c0f138f5b4.html",
        "prettify_html_file": "https://serpapi.com/searches/dced80421af4ecd4/67850a551d0609c0f138f5b4.prettify",
        "total_time_taken": 1.07
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Ireland",
        "location_used": "Ireland",
        "google_domain": "google.ie",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUVEZqZVUxQ2NVVkNVRWt6VTI5SmNWZEVaRGRHT0VwdmNWOHROMWRwTTBsdlptaHNiRlkwU0U5NWFHeGtUeTFLYWpRdGNHOUlNMlJWUjIxdmNrUjBVbWxRVlVGNE9FUkJUREJYYzJaSmJtNW9iamh5TTBRME1rNVRlR1l6VTNkVlV6VlVkemhWWWxvd1pYZEdXalprVERKbk1qY3dWR0ZSVVdKMU5DMHRlVmRJUkdwS1ZVVldTME0yWm5OS2VGb3hhak5HTFhsUmRVeFVRWGROTUhGQ2VuUlRkbXhWY1VkMlZXUllTMUpYY1daQk5TMVhZakp0U0RKcFdWTlJZMWRhYW5vNVQzVm1hV2xFUlVOZlFqVlpja0pJZVZSME5HbHRRamhQU25oclFrbFVVbmRFV21sbVdtaElZVU5hZFdkWVpuUlNkbVk1VWs4elYxVkpNazFFUVhoaU5EQkpkR0p5VjFCcWVrMU1SbXMyZFVkMFVYTnZXa3hhVG1jU0YxWkJjVVphTjNwM1JuRkhjalZPYjFCNk5rZDRObEZuR2lKQlJsaHlSV055WjFJeVZVUlJOelF3WkVKVFlsWjFhbWhJTVhkT1NVOHphak5CIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Senior Android Engineer",
            "company_name": "Strava",
            "location": "Dublin, Ireland",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=YoUoq1tOm3pNq7SXAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwAUFzvD3TKLNqK4KKToIiu9wFH2gu9Sk1KUuU-wc8W3_C676JzPXEWhTOPKnmEK6fMRApbeEgAI9Q4gTDcRFKh1WlqrdrRe7PikjVsObooLy9MQWb_lGD_BptQqRZsNOwPu9lVTutl3xQ_CJnh8g4l8wbuSgV5_AHa2VtpiwAAAA&shmds=v1_AUFQtONDrRAgZIqEysYB0Lqk9Ml7UShnIR9Dw8K8AFcCty2cjA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=YoUoq1tOm3pNq7SXAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a551d0609c0f138f5b4/images/9509c5b39aff377895eb2eb0ad5b4177e2535a4b06df89a117b21798064ffea8.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About This Role\n\nStrava is the leading subscription platform at the center of connected fitness, with more than 100 million community members in over 190 countries. The platform offers a holistic view of your active lifestyle, no matter where you live, which sport you love and/or what device you use. Everyone belongs on Strava when they are pursuing an active life.\n\nOur engineering organization is growing and we are looking for motivated Android engineers. As an Android engineer at Strava, you will work closely with our cross-functional team to ensure our technology is addressing real athlete problems while being reliable and performant.\n\nYou’re excited about this opportunity because you will:\n• Work with a team of engineers, designers, product managers and analysts building compelling new experiences to attract and engage new users to Strava.\n• Help define the future of the Android app at Strava.\n• Directly impact the experience of tens of millions of athletes.\n• Work alongside a close community of peers in a hybrid work environment\n\nYou will be successful here by:\n• Excelling at user-centric product development.\n• Building beautiful, smooth, delightful mobile experiences.\n• Mentoring other engineers and providing technical leadership to the team through forums like tech talks.\n• Using your in-depth knowledge of all things Android to help drive technical conversations with peers from different backgrounds, across different teams.\n\nWe’re excited about you because you:\n• Have experience building Android applications in a production environment using Java and/or Kotlin (we use both).\n• Are familiar with Android Studio, Emulators and have developed against API’s in the past.\n• Stay up to date and experiment with the latest Android technologies.\n• Have a product-focused mindset. Our team works together to deliver projects that use technology to solve real business problems.\n• Enjoy working on mobile apps at all levels – from networking up to user interfaces and everything in between.\n• Have experience building maintainable and testable code bases, including API design and unit testing techniques.\n• Can collaborate with iOS, Android, and Server engineers in order to ship features.\n\nWe'd love to talk to you about the future of Strava’s core technologies and your role in developing them. For more on Strava’s engineering team check out the Engineering Blog. It covers a wide range of topics, from how we rebuilt our leaderboard systems to personal perspectives on what it’s like to be an engineer at Strava.\n\nAbout Strava\n\nStrava is Swedish for “strive,” which epitomizes who we are and what we do. We’re a passionate and committed team, unified by our mission to connect athletes to what motivates them and help them find their personal best. And with billions of activity uploads from all over the world, we have a humbling and audacious vision: to be the record of the world’s athletic activities and the technology that makes every effort count.\n\nStrava builds software that makes the best part of our athletes’ days even better. And just as we’re deeply committed to unlocking their potential, we’re dedicated to providing a world-class, inclusive workplace where our employees can grow and thrive, too. We’re backed by Sequoia Capital, Madrone Partners and Jackson Square Ventures, and we’re expanding in order to exceed the needs of our growing community of global athletes. Our culture reflects our community – we are continuously striving to hire and engage diverse teammates from all backgrounds, experiences and perspectives because we know we are a stronger team together.\n\nDespite challenges in the world around us, we are continuing to grow camaraderie and positivity within our culture and we are unified in our commitment to becoming an antiracist company. We are differentiated by our truly people-first approach, our compassionate leadership, and our belief that we can bring joy and inspiration to athletes’ lives — now more than ever. All to say, it’s a great time to join Strava!\n\nStrava is an equal opportunity employer. In keeping with the values of Strava, we make all employment decisions including hiring, evaluation, termination, promotional and training opportunities, without regard to race, religion, color, sex, age, national origin, ancestry, sexual orientation, physical handicap, mental disability, medical condition, disability, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight.\n\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.\n\nFor more information on compensation and benefits, please click here.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-android-engineer-at-strava-40?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ie.linkedin.com/jobs/view/senior-android-engineer-at-cpl-4114861959?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ie.jooble.org/jdp/-8531654159380848903?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlN0cmF2YSIsImFkZHJlc3NfY2l0eSI6IkR1YmxpbiwgSXJlbGFuZCIsImh0aWRvY2lkIjoiWW9Vb3ExdE9tM3BOcTdTWEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Mid Level Engineer (Android)",
            "company_name": "Ding",
            "location": "Dublin, Ireland",
            "via": "Indeed",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=VOQCOmEp9kndzUHLAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEOwoCMRAAUGz3AoLVlCqaiGKjlbAiip5hyWfIjsSZJRNl7-ClxVe85jtpdg-KcMcPZjhzIkYsMD9xLEJxAWu4iQdFV0IPwnARSRlnx77WQQ_WqmaTtLpKwQR5WWH0MtqneP3Xae8KDtlV7Lb7zWgGTstpS5yAGNq3z8QruBbMjuMPNSGkYI4AAAA&shmds=v1_AUFQtONxAt8fWH1LZtFCOtqtbVl6s-ym-Ow9_1VssO1Yh1FnPQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=VOQCOmEp9kndzUHLAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a551d0609c0f138f5b4/images/9509c5b39aff377840114222b4646163013d3d1b9c7f45262edd0d0a281197e8.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Mid Level Engineer (Android)\n\nAbout this role:\n\nAs Android Engineer you will report to Engineering Team Lead and be responsible for designing, developing, testing, and maintaining high-quality Android applications that provide an exceptional user experience. You will collaborate with cross-functional teams, including product managers, designers, and backend engineers, to deliver robust and scalable solutions.\n\nWhat we need you to do:\n• Design and develop advanced Android applications using Kotlin/Java, following best practices and coding standards.\n• Collaborate with cross-functional teams to define project requirements, specifications, and deliverables.\n• Participate in architectural and design discussions, providing valuable insights and recommendations.\n• Write clean, maintainable, and efficient code, ensuring proper documentation and adherence to coding standards.\n• Conduct thorough testing and debugging of applications, addressing any issues or bugs promptly.\n• Optimize application performance, ensuring smooth and efficient operation on various Android devices.\n• Stay up to date with the latest Android development trends, tools, and frameworks, and share knowledge with the team.\n• Continuously improve development processes and workflows to enhance productivity and quality.\n• Collaborate with backend engineers to design and integrate APIs and web services into Android applications.\n• Work closely with UX/UI designers to implement intuitive and visually appealing user interfaces.\n• Participate in code reviews, providing constructive feedback to peers and maintaining code quality standards.Troubleshoot and resolve software defects and production issues as they arise.\n\nWhat we are looking for:\n• Bachelor's or master’s degree in computer science, Software Engineering, or a related field.\n• Proven experience as an Android Engineer, with a strong portfolio of Android applications.\n• Proficiency in Kotlin and/or Java programming languages.\n• Solid understanding of Android SDK, Android Studio, and related development tools.\n• Experience with version control systems, such as Git.\n• Strong knowledge of object-oriented programming principles and design patterns.\n• Familiarity with RESTful APIs and integration of backend services into Android applications.\n• Understanding of mobile UI/UX design principles and best practices.\n• Experience with automated testing frameworks for Android applications (e.g., Espresso, Robolectric).\n• Knowledge of performance optimization techniques and tools.\n• Ability to work collaboratively in a fast-paced, agile environment.\n• Strong problem-solving and debugging skills.Excellent communication and interpersonal skills.\n\nDing is committed to creating equal employment opportunities in the workplace. We know that experience looks different for everyone – if you believe your proven experience would suit this role and is what we are looking for we encourage you to apply.\n\nLife at Ding:\n\nAt Ding, we are striving to grow and nurture a culture that is inclusive, global, and equitable but most of all fun! In addition, to your basic salary and bonus there are many benefits also available across Ding. Some are recent additions, some have been enhanced and others have been there all along!\n• YOLO days & Dingversary Leave: additional holidays the year of your 4th/7th/10th/13th Anniversary\n• Flexible & Hybrid Working: we recognise the need to use space and working practices in ways that best support you\n• Work Abroad Programme: the opportunity to work for 30 days from another country each year\n• Tax Free Remote Working Allowance: of up to €70 per month\n• Wellness Programme: with monthly events, both virtual and in-person\n• Ding Dollars: flexible benefit allowance allowing you to tailor your benefit choice\n• Referral Fees\n• Enhanced Family Policies\n\nOur aim is to build and run the safest, simplest, most effective and convenient top-up technology, in partnership with the best operators and platforms. Now more than ever we realise the importance of keeping in touch and here at Ding we believe a little goes a long way.\n\nDing’s recruitment privacy notice is available at https://www.ding.com/recruitment-privacy-notice",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ie.indeed.com/viewjob?jk=1d2c901b7ef7d511&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter Ireland",
                    "link": "https://www.ziprecruiter.ie/jobs/357710978-mid-level-engineer-android-at-ding?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWQgTGV2ZWwgRW5naW5lZXIgKEFuZHJvaWQpIiwiY29tcGFueV9uYW1lIjoiRGluZyIsImFkZHJlc3NfY2l0eSI6IkR1YmxpbiwgSXJlbGFuZCIsImh0aWRvY2lkIjoiVk9RQ09tRXA5a25kelVITEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Android Engineer, Payments",
            "company_name": "Toast",
            "location": "Dublin, Ireland",
            "via": "Startup Jobs",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=2rQVOMghMT_voe5DAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7BeJ0s9RGBRc7CYro5OBeLu2RRNK7kjuh_oJfLb7hVd9FtTvxUCQNcOGQmKjU8MDPSGwKG7iLByUsfQRhuIqETKs2mk16dE41N0ENLfVNL6MTJi-ze4nXf51GLDRlNOr2h-3cTBzWy6egGiSG89vnxDXcCmXk4QfyGGoKjQAAAA&shmds=v1_AUFQtONMgpjKfKFltb0_EjOsTKqKEQXfVhAzMbzuzeVPv3fiOw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2rQVOMghMT_voe5DAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a551d0609c0f138f5b4/images/9509c5b39aff3778be2870b23b7f140ae075d3902537d04f041158d1e3ed8c28.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Full Stack Android Engineer, Payments\n\nToast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.\n\nBready* to make a change?\n\nToast is looking for a Software Engineer II to join our POS Payments team in Dublin. This team is building a new way for us to handle payments on our POS application and supporting one of the most critical parts of Toast - allowing restaurants to take card payments from their guests. On this team, you’ll help create a seamless platform for integrating payment vendors in our POS, optimizing the system design to deliver increased engineering efficiency, and actively monitor the health of the entire system by creating and maintaining insightful data dashboards so we know our customers are getting the best experience.\n\nAbout this roll*: (Responsibilities)\n\n• Iterate frequently as part of a cross-functional Engineering, Product, and Design team, collaborating in a complex, fast-moving environment\n• Build new features, and maintain existing features in Toast’s point of sale Android application and the supporting server-side components\n• Shape the face of development at Toast by helping to balance building maintainable software for long-term success, with the need to deliver value to customers in an iterative fashion.\n• Ship code that creates delightful experiences for restaurants and their guests\n\nDo you have the right ingredients*? (Requirements)\n\n• Proficient in Java or Kotlin\n• Prior experience developing and maintaining Android applications\n• Empathy for users, both internal (other Toast teams) and external (our restaurants)\n• Passion for clean code\n• *This is a hybrid role requiring in-office presence two days per week**\n\nSpecial Sauce: (non-essential skills, nice to have)\n\n• Experience with Kotlin\n• Prior experience with distributed systems, microservices and capacity planning\n• Experience with EMV Payments or Kernel\n\nOur Spread* of Total Rewards\nWe strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.\n• Bread puns encouraged but not required\n\n#LI-Hybrid\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\n\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\n\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\n\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nBready* to make a change? Apply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/android-engineer-payments-toast-5854030?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-engineer-payments-at-whatnot-553?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ie.jooble.org/jdp/-8114012916253502773?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Useparallel.com",
                    "link": "https://www.useparallel.com/app/candidate/job/670c5fed1fa1e0c1447f015b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://ie.sercanto.com/detail/a/android-engineer-payments_dublin_37071169?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ie.trabajo.org/job-2078-097703f582571c333cdcd45801ed7b24?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/6403150902319906816?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyLCBQYXltZW50cyIsImNvbXBhbnlfbmFtZSI6IlRvYXN0IiwiYWRkcmVzc19jaXR5IjoiRHVibGluLCBJcmVsYW5kIiwiaHRpZG9jaWQiOiIyclFWT01naE1UX3ZvZTVEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNYSmxiR0Z1WkEifQ=="
        },
        {
            "title": "Mobile Android Engineer (f/m/x)",
            "company_name": "Yassir",
            "location": "County Dublin, Ireland",
            "via": "Levels.fyi",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=4oQHvXd46x0eC7m8AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43qmgjgg46iYoo-AFOJWnP9CS9C7kU4pf4u-IbXvWdVLuHOAoIR-6SUAcX9sSICWYvM5gyhxXcxYGiTW0PwnAV8QGnhz7nqHtjVEPtNdtMbd3KYITRSTFvcfqv0d4mjMFmbDbbdakj-wU8rSolIIaTjJw_cB5dIF7CLWGw3P0AOqBRhpoAAAA&shmds=v1_AUFQtONd6tgjYfgcAcu0QBh_SCXktSfqxSSUlCQOPnlmDNsvYw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=4oQHvXd46x0eC7m8AAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed (:$200M in funding) by VCs from Silicon Valley, Europe and other parts of the world.\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally.\n\nHelping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.\n\nAbout The Role\n\nIn this role, you will be part of our engineering team, working with a high quality code base and the latest tools, where you will promote your skills to be an expert in complex frontend development in Android (kotlin) native platforms. Your primary focus will be development of mobile applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to a highly dynamic environment, where root cause analysis and rapid collaborative problem solving, sophisticated design, and the creation of quality products are required.\n\nTASKS\n\n• Design and build mobile applications for Android\n• Ensure the performance, quality, and responsiveness of applications\n• Collaborate with a team to define, design, and ship new features\n• Identify and correct bottlenecks and fix bugs\n• Help maintain code quality, organization, and automatization\n• Participate in brainstorming sessions and contribute ideas to our technology, algorithms and products\n• Work with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n• Dive into difficult problems and successfully deliver results on schedule\n\nRequirements\n\n• Must have technical skills\n• A minimum of 2 years of experience\n• Language: Android, Kotlin\n• Familiarity with cloud message APIs and push notification\n• Web architecture: Rest and restful APIs, micro-services\n• Version control: GIT\n• Nice to have technical skills (Strongly advised)\n• Containers: Docker, kubernetes\n• Caching, Redis server\n• Scaling, Web load balancing\n• Experience in a rapidly growing company in the mobility, on-demand, or fintech space is a plus\n• BSc/MSc in Engineering, Computer Science or relevant field\n\nBenefits\n\n• Great compensation and bonuses including stock options\n• Ground floor opportunity with the team; shape the strategic direction of the company\n• Sharp, motivated co-workers in a fun office environment or in remote\n• Paid company holidays\n• Full social coverage\n\nWHY YOU SHOULD JOIN YASSIR\n\n• Join one of the fastest-growing tech companies in North Africa\n• Have a lasting impact on our company's culture\n• Make a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans\n• Work on some really hard technical challenges from identity infrastructure for Africans, digital payment networks to complex mapping and routing systems across the continent\n• We are the first Algerian startup to go through Y Combinator program and we’re backed by top investors including Unpopular Ventures, Rebel Fund and DainTree.VC\n\nAt Yassir, we believe in the power of diversity and the importance of an inclusive culture. So, if you're ready to bring your unique perspective and experiences to the table, then we're excited to listen.\n\nDon't just apply for a job, come and be a part of our journey. Let's create a better tomorrow together.\n\nWe look forward to receiving your application!\n\nBest of luck,\n\nYour Yassir TA Team",
            "apply_options": [
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=81775176491901638&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQW5kcm9pZCBFbmdpbmVlciAoZi9tL3gpIiwiY29tcGFueV9uYW1lIjoiWWFzc2lyIiwiYWRkcmVzc19jaXR5IjoiQ291bnR5IER1YmxpbiwgSXJlbGFuZCIsImh0aWRvY2lkIjoiNG9RSHZYZDQ2eDBlQzdtOEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Android Developer for Production-Ready App",
            "company_name": "Kaya",
            "location": "County Dublin, Ireland",
            "via": "Jobrapido.com",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=dOgd0LAOrBRICpJyAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CQ5ys9hGBBedggVRF_EHyiU520i8C0kq7d_4qeIbXvVdVFqzS-IdtPShIJESPCXBPYkbbfHC9YPQzaBjhBquYiATJjuAMJxF-kDL41BKzAelcg5NnwsWbxsrbyVMRib1EpP_dXnARDFgoW63305N5H69uuGM4BlOMnKZoR1N8LyBS6KA7H4tjCZPowAAAA&shmds=v1_AUFQtON7OSweeNo1U_lSc9x_YMALwwOvQtkueCf70chPkPzeiw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=dOgd0LAOrBRICpJyAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "I am seeking a seasoned Android developer to work on an Android project. The ideal candidate will have experience with Hilt, Clean Architecture, and Kotlin, and be able to produce production-ready code.\n\nKey Responsibilities:\n• Develop a fully functional Android application that meets my specifications.\n• Ensure the app is production-ready and can be seamlessly integrated with other systems.\n\nRequirements:\n• Strong knowledge and experience in Android development.\n• Proficiency in Kotlin.\n• Experience with Hilt and Clean Architecture.\n• Ability to work independently.\n• Proven track record of delivering high-quality production-ready code.\n\nThis project is perfect for someone who enjoys working on personal projects and is able and willing to work with cutting-edge technologies.\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/2455900722630230016?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciBmb3IgUHJvZHVjdGlvbi1SZWFkeSBBcHAiLCJjb21wYW55X25hbWUiOiJLYXlhIiwiYWRkcmVzc19jaXR5IjoiQ291bnR5IER1YmxpbiwgSXJlbGFuZCIsImh0aWRvY2lkIjoiZE9nZDBMQU9yQlJJQ3BKeUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Web and Mobile App Developer",
            "company_name": "FUSIO",
            "location": "Dublin, Ireland",
            "via": "Indeed",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=Xpfpqpq2tWgj4EvDAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOMQoCMRAAQGzvBWK1tWgiio1WwqGcIBYilkcSlySyZkM2yj3CR6vN1NN8Rs3qhhZMusOJbSSEXc7Q4huJMxaYw5EtCJriAnCCA7MnnGxDrVk2WouQ8lJNjU45fmpOaHnQD7byp5dgCmYyFfvlejGonPx0vL9eujPEBO3LUkwz6ArSr_AFur0XOY8AAAA&shmds=v1_AUFQtOP01Qhv6PCDMnSZpmC_Z_yi73OHSJ-e0xerHpforft-lA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Xpfpqpq2tWgj4EvDAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "10th May 2023\n\nFUSIO have a vacancy for a Web and Mobile App Developer. This role will involve working on a wide variety of web and mobile projects for clients ranging from small business and NGOs to enterprise size organisations. You will be reporting to our Senior Development manager. Professional experience is desired but is not essential if you can provide evidence of appropriate educational qualifications and projects you have worked on.\n\nSkills required / desired:\n\n– PHP development experience, particularly with WordPress, Laravel and CodeIgniter.\n– Android Native app development experience (Kotlin experience a plus).\n– Front end development experience, particularly with VueJS.\n– TDD experience a huge plus.\n\nIdeally we would like to see some of your code so please give us access to a Git repository or sample of code you’ve worked on.\n\nWe are located in Dublin city centre close to Luas, Dart, Irish Rail and Dublin Bikes services.\n\nPlease send CVs to jobs@fusio.net – we’re looking forward to hearing from you\n\nNo agency calls please.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ie.indeed.com/viewjob?jk=ba76fc0b017126dd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Bashlee Recruitment",
                    "link": "https://bashlee.com/jobs/mobile-app-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ie.trabajo.org/job-1450-6466bc95521ba003e7506dd409a15131?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruitment.ie",
                    "link": "https://www.recruitment.ie/jobs/96089022-web-and-mobile-app-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GetIrishJobs",
                    "link": "https://www.getirishjobs.com/jobs/view/graduate-mobile-app-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter Ireland",
                    "link": "https://www.ziprecruiter.ie/jobs/355403792-mobile-app-developer-at-qptech?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgYW5kIE1vYmlsZSBBcHAgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiRlVTSU8iLCJhZGRyZXNzX2NpdHkiOiJEdWJsaW4sIElyZWxhbmQiLCJodGlkb2NpZCI6IlhwZnBxcHEydFdnajRFdkRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "Staff Android Engineer - Financial Services",
            "company_name": "Yassir",
            "location": "Anywhere",
            "via": "LinkedIn",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=TugElA0thWBienUYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIOw7CMAwAULH2BjB5RtAgJBaYQHwEayemyk3d1CjYVRxQD8NhgeUNr_hMikOVsetgL21SbuEkgYUowRLOLCieMUJF6c2e7Jc3bcAIk-9BBS6qIdJs1-c82NY5s1gGy5jZl16fToUaHd1DG_tTW4-JhoiZ6vVmNZaDhPn0jmacgAWOryayLOCaKKK0X8ywWl-fAAAA&shmds=v1_AUFQtOM7o9OyW0OW0bqKsganTprDzcY50OlR_mxK7Y7jXkWDEg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=TugElA0thWBienUYAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a551d0609c0f138f5b4/images/9509c5b39aff3778da7cde2f0d6cee7bbe3c19e7f121dad0d692c8c051d2221a.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed (:$200M in funding) by VCs from Silicon Valley, Europe and other parts of the world.\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally.\n\nHelping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.\n\nAbout Your Role\n\nAs an Android Staff Engineer, you will drive the technical standards for the Android applications across our consumer domain, working with multiple squads inside the domain. You will lead Android engineers with tech roadmaps, architecture decisions, and feature development and release cycle. You will mentor junior developers. You will contribute to scaling up Android engineers in multiple squads and bringing great talents on board by conducting technical interviews.\n\nResponsibilities\n• Design, build and maintain features for the domain applications\n• Provide technical leadership and manage dependencies\n• Conduct design and code reviews\n• Help the domain team members with technical blockers supporting them and helping them grow\n• Continuously discover, evaluate, and implement new technologies to maximize efficiency\n• Participate in architecture and design discussions\n• Participate strongly in building the technical roadmap\n• Conduct technical interviews\n• Help Improving engineering standards, tooling, and processes\n\nRequirements\n• BSc/MSc in Engineering, Computer Science or relevant field\n• At least 8 years of Android mobile engineering experience. 3 years of which with Kotlin\n• Excellent communication skills\n• Enjoy solving problems and helping others meet their goals\n• Solid understanding of the full mobile development lifecycle\n• Substantial experience with Git in a team environment\n• Hands-on experience with mobile DevOps CI/CD tools\n• Experience working with different architectures\n• Experience writing testable code and unit tests\n• Have published many Android applications to the Store\n• Experience in a fast-growing startup in a the on-demand services space is a plus\n\nAt Yassir, we believe in the power of diversity and the importance of an inclusive culture. So, if you're ready to bring your unique perspective and experiences to the table, then we're excited to listen.\n\nDon't just apply for a job, come and be a part of our journey. Let's create a better tomorrow together.\n\nWe look forward to receiving your application!\n\nBest of luck,\n\nYour Yassir TA Team",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://ie.linkedin.com/jobs/view/staff-android-engineer-financial-services-at-yassir-3831176652?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBBbmRyb2lkIEVuZ2luZWVyIC0gRmluYW5jaWFsIFNlcnZpY2VzIiwiY29tcGFueV9uYW1lIjoiWWFzc2lyIiwiYWRkcmVzc19jaXR5IjoiRHVibGluLCBJcmVsYW5kIiwiaHRpZG9jaWQiOiJUdWdFbEEwdGhXQmllblVZQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNYSmxiR0Z1WkEifQ=="
        },
        {
            "title": "Senior Software Architect/ Developer for Android / React",
            "company_name": "Trinity College Dublin",
            "location": "Dublin, Ireland",
            "via": "Jooble",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=OuN7Uq5OvUY348EIAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yWNwQrCMBBE8dpP8LRXRRsRvOipWBC9CNZ7SdJtGonZkKxaP82_MyIMwzvMY4rPpDg36C1FaKjnl4wIVdSDZdQsoMYnOgoYoc-LyneRbAcCLig1wxJOpCChzAKQhwORcTjdDcwhbYVIyZUmsWSrS013QR4VjeJGKv2qTUO-C04ytuvNaiyDN_PZNVpv-Q17cg4NQv1QznrI-dMCjhGd9N0XssRgxLwAAAA&shmds=v1_AUFQtOMbfp_CTPhXmWPp3cc2Ao2giylLVas5Y-l1Gf-XCBq_vQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=OuN7Uq5OvUY348EIAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Trinity is Irelands leading university and is ranked 81st in the world (QS World University Rankings 2024).\n\nReady to make your application Please do read through the description at least once before clicking on Apply.\n\nFounded in 1592, the University is steeped in history with a reputation for excellence in education, research, and innovation, which has been inspiring generations of thinkers for over 400 years..\n\nPrecision ALS are seeking an experienced, skilled, and motivated Senior Software Developer to join our dynamic technical team within a larger green field project team focused on health research.\n\nAs a key/senior member of a small collaborative group, you will play a crucial role in developing and maintaining a multi-faceted, production-grade health research software system.\n\nThis system aims to contribute to the advancement of research in ALS and serve as a blueprint for future projects addressing various diseases.\n\nAnother responsibility of this role will include the management of fellow team members in developing product-specific software, fostering a positive and collaborative work environment.\n\nAdditionally, you will be instrumental in designing and implementing processes to optimise operations and boost overall productivity.\n\nPost Status: Specific Purpose.\n\nThe specific purpose of this employment is to develop and maintain a multi-faceted, production grade health research software system.\n\nIn addition, to manage a team in developing product-specific software and designing and implementing processes to optimise operations and boost overall productivity.\n\nEmployment is not offered on an indefinite duration basis as it is funded by an external agency and it is expected that work on this project will be completed in a finite period.\n\nHours of Post: 35 hours per week.\n\nSalary: Appointment will be made on the Administrative Officer 1 (1-6) (€68181- €107,959 per annum) and in accordance with the Department of Finance guidelines.\n\nHow to Apply: In order to assist the selection process, applicants should submit a Curriculum Vitae and a Cover Letter (1x A4 page) that specifically address the following points in their application.\n\nApplicants should clearly describe their experience with Kotlin,modern Android development, CI/CD in software development, and their proficiency in React or similar web frameworks, and how they obtained their knowledge in their application.\n\nThe applicant should give examples of involvement in Cloud migration and what the applicant learned from the process.\n\nClosing Date: 12 noon (Irish Standard Time) 10th January 2025.\n\nApplication will only be accepted by applying online through the Trinity Jobs Portal.\n\nApplications must be made by the date and time specified.\n\nAny applications which are still in progress at the closing time on the specified closing date will be cancelled automatically by the system.\n\nLate Applications will not be accepted.\n\nPlease click apply to view the job description for this position.\n\nInformal enquiries about this post should be made to E: At Trinity, we are committed to equality, diversity, and inclusion.\n\nTrinity welcomes applications from all individuals, including those applicants with disabilities, those who may have had non-traditional career paths, those who have taken time out for reasons including family or caring responsibilities.\n\nWe also welcome international applicants including those whom have been displaced due to war.\n\nTrinity College Dublin is Irelands premier University.\n\nWe are an EU Sustainable Gender Equality Champion and we hold an Athena Swan Silver award, recognising our ongoing work to advance gender equality both within Trinity and in the Higher Education sector.\n\nTrinity is committed to supporting work-life balance and to creating a family-friendly working environment.",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ie.jooble.org/jdp/1587880770950862307?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgQXJjaGl0ZWN0LyBEZXZlbG9wZXIgZm9yIEFuZHJvaWQgLyBSZWFjdCIsImNvbXBhbnlfbmFtZSI6IlRyaW5pdHkgQ29sbGVnZSBEdWJsaW4iLCJhZGRyZXNzX2NpdHkiOiJEdWJsaW4sIElyZWxhbmQiLCJodGlkb2NpZCI6Ik91TjdVcTVPdlVZMzQ4RUlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "Senior Android Developer [Only 24h Left]",
            "company_name": "Reperio Human Capital",
            "location": "Dublin, Ireland",
            "via": "Jobrapido.com",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=0Q-jXVHL2Sm9WnzgAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNvQrCMBAAYFz7CE43imgjRRcdRCz4gyDoKFIu7dlG0ruQpFLfyMdUl2_9ks8gWV-JjXjYcOXFVJDTi6w48nA7s31DNm_gRI94hykcRUMg9GUDwrATqS0NV02MLiyVCsGmdYgYTZmW0iph0tKrp-jwpwgNenIWIxXZYtanjuvx6EK_ygjsuxYZtuhMRAuGIe-0NTyBgyeLXH0Bf5QV2asAAAA&shmds=v1_AUFQtOO97Bp1QTN7j2k1IY6bAlgWI_PhotbZ7zhXKbK0ibXMXg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=0Q-jXVHL2Sm9WnzgAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Location: Dublin, Republic of Ireland\n\nResponsibilities\n\n- Design, build, and optimize Android apps.\n- Oversee deployment and versioning on the Google Play Store.\n- Set up CI/CD pipelines to streamline testing and deployment.\n\nRequired Experience:\n\n- 8+ years of industry experience with Android development using Android SDK and Android Studio.\n- Extensive industry experience with Kotlin and Jetpack Compose.\n- Experience deploying and managing applications on the Google Play Store.\n- CI/CD & DevOps: Skilled in CI/CD pipeline setup and Git for source control.\n- Familiarity with Cloud Technologies.\n\nApplicants must be eligible to work full-time in the Republic of Ireland without restriction.\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/8971644390183272448?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgW09ubHkgMjRoIExlZnRdIiwiY29tcGFueV9uYW1lIjoiUmVwZXJpbyBIdW1hbiBDYXBpdGFsIiwiYWRkcmVzc19jaXR5IjoiRHVibGluLCBJcmVsYW5kIiwiaHRpZG9jaWQiOiIwUS1qWFZITDJTbTlXbnpnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNYSmxiR0Z1WkEifQ=="
        },
        {
            "title": "Mobile Engineer, Android",
            "company_name": "Intercom",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.ie/search?ibp=htl;jobs&q=Android+developer&htidocid=WZoxmlGfQQww6rfoAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKvQoCMQwAYFxvdXPKLNqK4KKTg8gJPsPRn9Cr1KQkGW73xdXlm77hsxr8k2NtCDcqlRBlB1fKwjXDHh4cQTFImoEJ7syl4eYym3U9e6_aXFELVpNL_PZMGHnxL476Z9I5CPYWDKfj6bC4TmW7HslQfhsqwSjYAuUvUlFy_YYAAAA&shmds=v1_AUFQtOMB3cKl864xA0O6g-6-RIWGb0GrafHTXk_vkOsEcK5xfQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=WZoxmlGfQQww6rfoAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a551d0609c0f138f5b4/images/9509c5b39aff3778c180bf22956581402cb98af01ff8dea09004a33599d265b3.gif",
            "extensions": [
                "CA$25K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "CA$25K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Ireland\n\nIntercom was founded in 2011 to change the standard of customer service online. Our AI-first customer service platform is a totally new way to deliver customer service and is designed to transform the way businesses interact with their customers through AI. We all know that customer service on the internet sucks. It’s slow and impersonal. We help businesses provide instant and exceptional service to their customers and maximize their support agents’ productivity, efficiency, and performance—all through our single AI system. More than 25,000 businesses use Intercom to send millions of messages to millions of customers each month.Intercom has been a long-standing product leader and cultural icon in the technology and startup worlds for more than a decade. We set the pace for our industry and live by our values that allow us to push boundaries, build with speed and intensity, and deliver incredible value to our customers.Join us on our mission to redefine customer service and make internet business personal.\n\nWhat's the opportunity?\n\nIntercom’s Android Messenger SDK is integrated into thousands of Android apps and used by millions of users. We’re looking for an Android Engineer to help us shape and accelerate our mobile Messenger strategy. In this role, you’ll be part of the team consisting of mobile engineers, product manager, designer and full-stack web engineers that own problems end to end for all mobile offerings at Intercom.\n\nBuilding a visual Messenger SDK allows you to ship beautiful and quality UI/UX for millions of users while also giving you a unique opportunity to go deeper into the Android operating system than you would building an app.\n\nHow does mobile work in Intercom?\n\nWe value autonomy in our teams at Intercom. The Messenger team is staffed with Android, iOS and full-stack web engineers as well as a Designer and Product manager. We own problems end to end, which means you will work with all those people as we build new products. While we don’t expect you to write code outside of the Android codebase, it is important to be willing to learn, fully understand and take ownership of the system and customer experience end to end.\n\nOur Android Mobile SDK is built in Kotlin and Java. We are open to change, adopting the right tools for the job but we are pragmatic in how we use our time. We optimize for delivering the highest value for our customers.\n\nThe Messenger team collaborates with the other teams in Intercom as we bring a range of features to the mobile SDKs. As platform experts, we know what’s best on mobile and can help support and upskill other teams to adopt their features for mobile.\n\nWe value moving fast and shipping to learn at Intercom. We’ve got a great CI setup with extensive unit test coverage using JUnit and Robolectric and UI tests with Espresso and Firebase. Our strong test coverage allows us to safely move fast without breaking existing features.\n\nWhat will I be doing?\n• Collaborate on shaping our mobile strategy and roadmap across all Intercom offerings.\n• Owning problems end to end, working with design, product, backend engineers as well as other Android and iOS engineers to solve the biggest problems for our customers. We believe in autonomous teams and that the best mobile products are created from close collaboration across the stack, without barriers.\n• Help us make the right tradeoffs while being pragmatic and building for the long term.\n• Develop technical plans and contribute to our technical architecture as we grow.\n• We move fast at Intercom but building a mobile SDK demands a very high quality bar. You will help us build long-standing, well tested and reliable Android code.\nWhat skills do I need?\n\nWhat skills do I need?\n• 3+ years experience building mobile products on Android.\n• Knowledge of Kotlin or Java, Android APIs and design patterns.\n• You’ve published one or more apps in the Play Store.\n• Having experience building an Android SDK is a bonus.\n• Experience collaborating directly with product teams and designers, and the ability to deliver value to customers or users. Engineers at Intercom are pragmatists who work closely with others on cross-disciplinary teams.\n\nHow will I be supported?\n• You’ll report directly to an Engineering Manager who will start you off with a great onboarding plan.\n• You’ll embed immediately into our Messenger team and receive dedicated peer support from one of our engineers.\n• We invest heavily in our Engineers, supporting individual career development through training and coaching.\n\nBenefits\n\nWe are a well treated bunch, with awesome benefits! If there’s something important to you that’s not on this list, talk to us!\n• Competitive salary and equity in a fast-growing start-up\n• We serve lunch every weekday, plus a variety of snack foods and a fully stocked kitchen\n• Regular compensation reviews - we reward great work!\n• Pension scheme & match up to 4%\n• Peace of mind with life assurance, as well as comprehensive health and dental insurance for you and your dependents\n• Flexible paid time off policy\n• Paid maternity leave, as well as 6 weeks paternity leave for fathers, to let you spend valuable time with your loved ones\n• If you’re cycling, we’ve got you covered on the Cycle-to-Work Scheme. With secure bike storage too\n• MacBooks are our standard, but we also offer Windows for certain roles when needed.\n\nPolicies\n\nIntercom has a hybrid working policy. We believe that working in person helps us stay connected, collaborate easier and create a great culture while still providing flexibility to work from home. We expect employees to be in the office at least two days per week.\n\nWe have a radically open and accepting culture at Intercom. We avoid spending time on divisive subjects to foster a safe and cohesive work environment for everyone. As an organization, our policy is to not advocate on behalf of the company or our employees on any social or political topics out of our internal or external communications. We respect personal opinion and expression on these topics on personal social platforms on personal time, and do not challenge or confront anyone for their views on non-work related topics. Our goal is to focus on doing incredible work to achieve our goals and unite the company through our core values.\n\nIntercom values diversity and is committed to a policy of Equal Employment Opportunity. Intercom will not discriminate against an applicant or employee on the basis of race, color, religion, creed, national origin, ancestry, sex, gender, age, physical or mental disability, veteran or military status, genetic information, sexual orientation, gender identity, gender expression, marital status, or any other legally recognized protected basis under federal, state, or local law.\n\nIs this role not quite what you're looking for? Join our Talent Community to stay connected with us.\n\nThis offer from \"Intercom\" has been enriched by Jobgether.com and got a 78% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/67374a6db744d03dbbcdc44b-mobile-engineer-android?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/ie-dublin-region-mobile-engineer-android-intercom-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIsIEFuZHJvaWQiLCJjb21wYW55X25hbWUiOiJJbnRlcmNvbSIsImFkZHJlc3NfY2l0eSI6IklyZWxhbmQiLCJodGlkb2NpZCI6Ildab3htbEdmUVF3dzZyZm9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRTlIU2taSlRIaHZkMmhWZUUxV2FqRnpkaTEzYVVWb2JuSXRlRFl0TkhRMU9YUk5jbmRtYkVsdmRGcFdObkJpUkdKM1lUZzJabmxITkVGc1VGTTNlR1JDV0ROUmJVRkJTV0ZYYVZkaldsODJYMW8xVTI5SmMxbDFjbTlrWTBkWk4zWmFkWGxxU0VSeU5IWlJNRlZqVjA5TU5teFFiVVp2Y0daMmExSlBXVFppWVRWNFdrODNiMFJ1VjJNeFNUaFNlRFEzUzA1cmRsUjVVRWRNUWpsT2FsUmlNbFZ3VGxaaWJGRldXR2hGZDNOdFkyNVJZa3gyU1hOVFVXa3llVTlFY0ZocFF6QnBPVzlXYUVSdlZFWllibGhDYkRSNFFYcGtXV2xpYjNBeVh6UmlUMFE1VERNM2RETkVSVkZSVFdOZmNVMTBka2x5UjFkalZXeEZNQzF2UVdGTlYzUnNXSFYwVWsxRllsUTFXRXcyYUdoR1UzRkRSVVpsVTBFU0YxWlJjVVphTlhsT1RITnlPWEIwVVZCcVpUSXhjMUZ2R2lKQlJsaHlSV053UzJsb2RuSmljRFJHUVU5S2FYUkVZbGxNVUU5NmNVNWlTM0JuIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.ie&location=Ireland&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRTlIU2taSlRIaHZkMmhWZUUxV2FqRnpkaTEzYVVWb2JuSXRlRFl0TkhRMU9YUk5jbmRtYkVsdmRGcFdObkJpUkdKM1lUZzJabmxITkVGc1VGTTNlR1JDV0ROUmJVRkJTV0ZYYVZkaldsODJYMW8xVTI5SmMxbDFjbTlrWTBkWk4zWmFkWGxxU0VSeU5IWlJNRlZqVjA5TU5teFFiVVp2Y0daMmExSlBXVFppWVRWNFdrODNiMFJ1VjJNeFNUaFNlRFEzUzA1cmRsUjVVRWRNUWpsT2FsUmlNbFZ3VGxaaWJGRldXR2hGZDNOdFkyNVJZa3gyU1hOVFVXa3llVTlFY0ZocFF6QnBPVzlXYUVSdlZFWllibGhDYkRSNFFYcGtXV2xpYjNBeVh6UmlUMFE1VERNM2RETkVSVkZSVFdOZmNVMTBka2x5UjFkalZXeEZNQzF2UVdGTlYzUnNXSFYwVWsxRllsUTFXRXcyYUdoR1UzRkRSVVpsVTBFU0YxWlJjVVphTlhsT1RITnlPWEIwVVZCcVpUSXhjMUZ2R2lKQlJsaHlSV053UzJsb2RuSmljRFJHUVU5S2FYUkVZbGxNVUU5NmNVNWlTM0JuIiwiZmN2IjoiMyJ9&q=Android+developer"
    }
}