{
    "search_metadata": {
        "id": "67850a71d53e5933145ddbfe",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/1dc3d9a4a2e577b8/67850a71d53e5933145ddbfe.json",
        "created_at": "2025-01-13 12:43:29 UTC",
        "processed_at": "2025-01-13 12:43:29 UTC",
        "google_jobs_url": "https://www.google.com.mx/async/callback:550?q=Android+developer&uule=w+CAIQICIGTWV4aWNv&udm=8&fc=EuICCqICQUpHOUprUE1pdzlucDNwU0Vhd1lMdm0tNC1PZlpTNUxKZzdsOFVoa2RYOTVIaV92ZXo2T0t1Ql9rRVpTbDhZRUNVbWszZFp4V1A0WHpuLXV1SFZQZ0RZd0Nkdlkwb2xVczM3Q1lFWGlaWXI0RkpDSVVOblh6Y2NTempXV29FN19sSW44ZWdIdnRBZ2I4SWtpVm9JNzMtYU85ZGJYZ2QtWDFpRzhndWhIeEVxZlJ1dDFYTzNVMERPOVBncTlva0xvbURtbk1rdEpyZlFJVTdnYXRPNFVBb3dITGx6TURKY0RUVXZNRnNNaDdTeVA2XzhQNWZBWFlDMm00NGJ4ZnpaZ0V2WVlkaWJMOEYxSHZTMEFDd09jVXdaeTFWX2RiZnpwLVESF2NBcUZaNE9NSDZ6U2tQSVB2TEg1c0EwGiJBRlhyRWNwLS10blFURVJScjdFcVZGTmliN2VkWWp5bkFR&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/1dc3d9a4a2e577b8/67850a71d53e5933145ddbfe.html",
        "prettify_html_file": "https://serpapi.com/searches/1dc3d9a4a2e577b8/67850a71d53e5933145ddbfe.prettify",
        "total_time_taken": 1.2
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Mexico",
        "location_used": "Mexico",
        "google_domain": "google.com.mx",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRTFwZHpsdWNETndVMFZoZDFsTWRtMHROQzFQWmxwVE5VeEtaemRzT0ZWb2EyUllPVFZJYVY5MlpYbzJUMHQxUWw5clJWcFRiRGhaUlVOVmJXc3paRnA0VjFBMFdIcHVMWFYxU0ZaUVowUlpkME5rZGxrd2IyeFZjek0zUTFsRldHbGFXWEkwUmtwRFNWVk9ibGg2WTJOVGVtcFhWMjlGTjE5c1NXNDRaV2RJZG5SQloySTRTV3RwVm05Sk56TXRZVTg1WkdKWVoyUXRXREZwUnpobmRXaEllRVZ4WmxKMWRERllUek5WTUVSUE9WQm5jVGx2YTB4dmJVUnRiazFyZEVweVpsRkpWVGRuWVhSUE5GVkJiM2RJVEd4NlRVUktZMFJVVlhaTlJuTk5hRGRUZVZBMlh6aFFOV1pCV0ZsRE1tMDBOR0o0Wm5wYVowVjJXVmxrYVdKTU9FWXhTSFpUTUVGRGQwOWpWWGRhZVRGV1gyUmlabnB3TFZFU0YyTkJjVVphTkU5TlNEWjZVMnRRU1ZCMlRFZzFjMEV3R2lKQlJsaHlSV053TFMxMGJsRlVSVkpTY2pkRmNWWkdUbWxpTjJWa1dXcDVia0ZSIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer",
            "company_name": "IBM",
            "location": "Monterrey, Nuevo Leon, Mexico",
            "via": "Karkidi",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=Z0wriZv3QxYbNRTmAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQrCMBAFUNz2CK5m4UKkNiK40ZUiiGK9QknToY3E-SETSz2Edxbf4hXfWbE8SpfgOzrzyAGRE63phpaUbXIDQegC9IHnhyHnqHtjVEPVa7bZu8rhZSDcYjJPtPqv0cEmjsFmbra7zVRF6VeL66kmL1RDMqfEn5Iebx5Bd4aUVPPkHX7ewbMLkAAAAA&shmds=v1_AUFQtOP6X5UAn-E5McTWbOVGVappZHzMTZTSeRX_Mf8W-ZpmsA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Z0wriZv3QxYbNRTmAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a71d53e5933145ddbfe/images/87e2db23d2a6d319d1c186f995c55ad79806ececebcfb0262eb51ee9871b8775.gif",
            "extensions": [
                "MX$90K–MX$190K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "MX$90K–MX$190K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "In this role, you’ll work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver deep technical and industry expertise to a wide range of public and private sector clients around the world.​ Our delivery centers offer our clients locally based skills and technical expertise to drive innovation and adoption of new technology.\n\nA career in IBM Consulting embraces long-term relationships and close collaboration with clients across the globe.\n\nYou’ll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including IBM Software and Red Hat.\n\nCuriosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you’ll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.\n\nJoin us and you’ll be part of a team that encourages constant learning and provides the projects and training that will help develop your expertise. You’ll be challenged and supported in an environment that embraces individual differences and rewards your best work. You’ll find everything you need to start building the career you want at one of the most successful companies in history. But it’s up to you how you get there – you’ll be the one in charge, putting forward your ideas, taking on responsibilities and making choices about how to get the job done.\n\nYour Role and Responsibilities\n\nIn this role, you will work in one of our IBM Consulting Client Innovation Centers (Delivery Centers), where we deliver our deep technical and industry expertise to a variety of clients from different public and private sectors around the world. Our Delivery Centers offer our clients localized technical skills and expertise to promote innovation and the adoption of new technologies.\n\nA career at IBM Consulting is based on long-term relationships and close collaboration with clients around the world.\n\nYou’ll work with visionaries across multiple industries to advance hybrid cloud and artificial intelligence adoption for the world’s most innovative and valuable companies. Your ability to accelerate our impact and create meaningful change for your clients will be supported by our ecosystem of strategic partners and the IBM portfolio with its robust technology platforms, including Software and Red Hat.\n\nCuriosity and the constant search for knowledge serve as the basis for success at IBM Consulting. In your role, you will be encouraged to challenge norms, investigate ideas outside your responsibilities, and generate creative solutions that result in resonant impact for a broad network of clients. Our culture of evolution and empathy focuses on long-term career and development opportunities, in an environment that will leverage your skills and experience. As a software developer, you will be involved in several areas of the software development lifecycle, such as design. , code implementation, testing and technical support. You will create software that will guide your customers’ journey in the world of artificial intelligence and hybrid cloud.\n\nYour main responsibilities include:\n• Lead the design and construction of new mobile solutions using the latest technologies, always seeking to add commercial value and satisfy user requirements.\n• Strive for continuous improvements, constantly testing the solution under construction and working under an agile framework.\n• Discover and implement the latest technological trends to maximize and build unique creative solutions.\n\nRequired Technical and Professional Expertise\n\nAndroid Developer, Android Kotlin\n\nOOP experience\n\nKnowledge of JAVA\n\niOS Swift Experience, iOS Swift UI\n\nKnowledge of REST consumption\n\nKnowledge in Unit Testing\n\nGIT skills\n\nKnowledge of design/architectural patterns\n\nPreferred Technical and Professional Expertise\n\nAndroid Developer, Android Kotlin\n\niOS ,\n\nEnglish",
            "apply_options": [
                {
                    "title": "Karkidi",
                    "link": "https://www.karkidi.com/job-details/64389-android-developer-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://mx.bebee.com/job/6262ef914267bb61c333d6a67d672823?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Vacantes De Empleo, Trabajo",
                    "link": "https://mx.trabajo.org/oferta-2863-599f88936c22f8d8cc30e82a8b1701b6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto",
                    "link": "https://mx.sercanto.com/detail/a/android-developer_monterrey-city_1438265?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IklCTSIsImFkZHJlc3NfY2l0eSI6Ik1vbnRlcnJleSwgTnVldm8gTGVvbiwgTWV4aWNvIiwiaHRpZG9jaWQiOiJaMHdyaVp2M1F4WWJOUlRtQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Senior Android Developer (remote)",
            "company_name": "State of Mexico",
            "location": "State of Mexico, Mexico",
            "via": "Jooble",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=6_RNfnCY8PE2b4o4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_12KQQrCMBQFcdsjuPpLLdqIIIiuBEEQXPUAJUm_aSTNC_lBeh8vqoIrNzMwTPWaVfuWo0emU-wzfE9nfnJA4kyLzCMKL2lNVxgS1tkOhEgXwAWeH4dSkhyUEgmNk6KLt43FqBDZYFIPGPmik0FnTkEX7ra7zdSk6Oq6_fxMuNONJ29BPtJfWv38BhYjiFemAAAA&shmds=v1_AUFQtOPfAzZevM3Ho4qRsesebZwlVwDOs5hOr6lpvO4atFRyGw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=6_RNfnCY8PE2b4o4AAAAAA%3D%3D",
            "extensions": [
                "27 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Req ID:\n#\n\nNTT DATA strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.\n\nWe are currently seeking a Senior Android Developer (Remote) to join our team in Mexico City, México (MX-MEX), Mexico (MX).\n\nSenior Android Developer (Remote)\n\nHow You’ll Help Us:\n\nOur clients need digital solutions that will transform their business so they can succeed in today’s hypercompetitive marketplace. As a team member in our Emerging and Immersive Technologies group, you will make these digital solutions come to life. You will routinely deliver elite solutions to clients that will impact their products, customers, and services.\n\nHow We Will Help You:\n\nJoining our Emerging and Immersive Technologies group is not only a job, but a chance to grow your career. We will make sure to equip you with the skills you need to produce robust applications that you can be proud of. Whether it is providing you with training on a new programming language or helping you get certified in a new technology, we will help you grow your skills so you can continue to deliver increasingly valuable work.\n\nOnce You Are Here, You Will:\n\n-Work with Architect to gather the technical details and requirements.\n-Develop the module end to end using XML & Kotlin.\n-Write unit test cases and execute the test cases against the entire application functionalities.\n-Work with backend team for REST service creation.\n-Integrate with REST services in the application.\n-Integrate third-party authentication services.\n-Follow UI design, UI guidelines and coding guidelines to develop and deliver the applications.\n-Participate in the code review process and implement the code review comments.\n-Ensure app design is compatible with all the screen sizes.\n-Fix any app issues or bugs that arise.\n\nBasic Qualifications:\n\n-5+ Years’ experience in overall mobile App development.\n-3+ Years’ experience in Android development with Java/Kotlin.\n-3+ Years’ experience in building MVC, MVVM architecture, Rest API development/integrations, SVN/GIT/Bitbucket.\n-2+ years’ experience with Jetpack components such as ViewModel, LiveData, RoomDatabase, WorkManager\n-Bachelor’s Degree or equivalent combined 4 years education and work experience\n\nPreferred:\n\n-Experience developing iOS applications\n-2+ years' experience with Junit, Espresso and Mockito Frameworks\n-2+ years' experience with tools like Atlassian JIRA.\n-1+ years' experience with UI/UX design and implementation\n-1+ years’ experience in CI/CD\n\nIdeal Mindset:\n\n-Lifelong Learner. You are always seeking to improve your technical and nontechnical skills.\n-Team Player. You are someone who wants to see everyone on the team succeed and is willing to go the extra mile to help a teammate in need.\n-Listener. You listen to the needs of the customer and make those the priority throughout development.\n\n#LaunchJobs #LaunchEngineering\n\nAbout NTT DATA\n\nNTT DATA is a $30 billion trusted global innovator of business and technology services. We serve 75% of the Fortune Global 100 and are committed to helping clients innovate, optimize and transform for long term success. As a Global Top Employer, we have diverse experts in more than 50 countries and a robust partner ecosystem of established and start-up companies. Our services include business and technology consulting, data and artificial intelligence, industry solutions, as well as the development, implementation and management of applications, infrastructure and connectivity. We are one of the leading providers of digital and AI infrastructure in the world. NTT DATA is a part of NTT Group, which invests over $3.6 billion each year in R&D to help organizations and society move confidently and sustainably into the digital future. Visit us at us.nttdata\n\nNTT DATA endeavors to make us.nttdata accessible to any and all users. If you would like to Apply regarding the accessibility of our website or need assistance completing the application process, please Apply at us.nttdata/en/contact-us.\nThis contact information is for accommodation requests only and cannot be used to inquire about the status of applications. NTT DATA is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. For our EEO Policy Statement, please click here. If you'd like more information on your EEO rights under the law, please click here. For Pay Transparency information, please click here.",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://mx.jooble.org/jdp/1640464166449113400?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKHJlbW90ZSkiLCJjb21wYW55X25hbWUiOiJTdGF0ZSBvZiBNZXhpY28iLCJhZGRyZXNzX2NpdHkiOiJTdGF0ZSBvZiBNZXhpY28sIE1leGljbyIsImh0aWRvY2lkIjoiNl9STmZuQ1k4UEUyYjRvNEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdUV1Y0YVdOdiJ9"
        },
        {
            "title": "Android / iOS Developers",
            "company_name": "Presidency Solutions",
            "location": "Mexico City, Mexico",
            "via": "Smart Recruiters Jobs",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=eFIKHlxXk3FtKjIsAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3HSwrCQAwAUNz2CK6y9tMRwY2uioIgiEIPUKbT0EbGZJhEac_iZUVw8-AVn1nhKu6yUAcO6FbDCd8YJWFWWMNFWlD0OQwgDGeRPuL8MJgl3TunGstezRuFMsjTCWMro3tIqz8aHXzGFL1hs91txjJxv1jeMyp1yGGCWuLLSFiBGK44UhA4kk2rf757OIZangAAAA&shmds=v1_AUFQtONHWX-xuVbUH7jAOmO_UyEHUt5xzYE7Xa21gT90QBWxiQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=eFIKHlxXk3FtKjIsAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Company Description\n\nPresidency Inc. is a Software Development and IT Consulting company that provides practical and economical Software Solutions to its clients. We seek to present exceptional solutions and resources that today’s Technical as well as Financial decision makers appreciate.\n\nPresidency Inc. was incorporated by a group of Passionate Professionals who put together a team of talented developers and designers from around the globe. The motto is to maintain a high emphasis on quality, comprehensiveness, and usefulness goes into each solution provided to the client.\n\nPresidency Solutions is now providing development services to over 8 State Governments – helping them achieve deadlines for their healthcare insurance programs\n\nPresidency Solutions teams up with a multinational bank to provide data conversion and data warehousing services\n\nJob Description\n\nThis is an excellent opportunity for Mexicans Developers who are looking to join a well-established IT company and gain experience in a fast paced environment in USA.\n\nWe offer attractive salaries. We sponsor work visas for qualified candidates. (TN, H1B, Green Card)\n\nWe are currently looking for:\n• Android Developers\n• iOS Developers\n\nQualifications\n\n3 year of experience on mobile development.\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\n\nPlease Note: This job requires relocation to USA and Visa Sponsorship can be provided.",
            "apply_options": [
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/PresidencySolutions1/99785588-android-ios-developers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIC8gaU9TIERldmVsb3BlcnMiLCJjb21wYW55X25hbWUiOiJQcmVzaWRlbmN5IFNvbHV0aW9ucyIsImFkZHJlc3NfY2l0eSI6Ik1leGljbyBDaXR5LCBNZXhpY28iLCJodGlkb2NpZCI6ImVGSUtIbHhYazNGdEtqSXNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Android Mobile Mid Engineer (Hybrid)",
            "company_name": "Storicardmx",
            "location": "Mexico",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=XBxVsSW9rBID9Ij9AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGvQrCMBAAYFy7uzjdqIKNCC52chBF6OQDlPwc6ZU0V-4yxMfwjdXl42s-q6a75iBMAXp2lBD6X285UkYU2D7eTijs4ABPdqBoxY_AGe7MMeGmG0tZ9GKMamqjFlvIt55nwxkdVzOx0z-DjlZwSbbgcDofa7vkuF-_Cgt5K2GuQBl6rOT5CzDC1gGUAAAA&shmds=v1_AUFQtOOdVE9MM7JupahchvkBVGgQJEWFVQ8bT1jAzY0SVe7M1w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=XBxVsSW9rBID9Ij9AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Stori\n\nStori is a fast-growing, venture-backed financial technology company, on a mission to democratize credit access for 400 million underbanked LatAm consumers. Stori currently operates in Mexico and has a global team with offices in Arlington Virginia, Mexico City, and Asia. We have quickly made our mark as one of the top digital banks in Mexico with more than two million applicants for our credit card product since launching.\n\nStori is one of the top-funded startups in the region with US$250 million raised to date. We are backed by top global venture capital funds, such as GGV Capital, GIC, Lightspeed Venture Partners, General Catalyst, Goodwater Capital, Mexico’s Tresalia Capital, Vision Plus Capital, BAI Capital and Source Code Capital; who have successfully invested in startups such as Affirm, Airbnb, Alibaba, Stripe, and TikTok.\n\nStori has a standout founder team among fintechs, leveraging 100+ years of accumulated experience in consumer finance, banking and technology across Mastercard, Intel, Capital One, Morgan Stanley, GE Capital, and HSBC in the U.S., Mexico and Asia. The team has launched and managed many multi-million-customer credit card products globally, providing a wide breadth of experience and knowledge to our team.\n\nWe welcome diversity of background, experience and thinking. Storians are passionate about our mission and take pride in the products we build. Our culture thrives off of a flat structure and an inclusive environment where all of our employees can be their authentic selves, with boundless opportunities for professional growth.\n\nThe Role\n\nStori mobile app developers write the technology that enables Stori to serve customers across Mexico. By offering financial services in the Stori app, our customers can start their financial journey with Stori without ever having to visit a bank branch. Mobile app developers create software, capabilities and tools to enable Stori to provide a good customer experience while scaling rapidly.\n\nYou will\n• Work closely with software engineers and other mobile application developers to build and enhance Stori’s Android app\n• Research and recommend new ideas or improvements to the application\n• Collaborate with product leads and UX/UI team members to evolve product requirements and function definition\n• Improve and maintain our mobile apps CI and CD infrastructure and pipelines.\n• Spot technical obstacles early, and work closely with the team to find clever solutions\n• Influence and contribute to group discussions and absorb feedback from the product team\n\nRequirements\n• Have a good product awareness and coding style, love programming, and pursue high-quality code.\n• Ability to work with incomplete requirements and to balance multiple priorities\n• Well-designed code structure, continuous optimization and refactoring.\n• Solid computer foundation, familiar with common data structures, algorithms and design patterns, familiar with common protocols such as TCP, HTTP, and WebSocket.\n• Experience in the development of large-scale apps (more than 10 million users) is preferred.\n• Extensive development experience including practice with popular open source libraries\n• Familiar with mobile hybrid development using open-source frameworks such as Ionic or React Native\n\nAndroid Specific Requirements\n• Production-level proficiency in Java or Kotlin languages\n• Hands-on skill with Android application development tools, including Android Studio, Android SDK and Android Development Tools\n• 3+ years of experience developing Android applications\n• Familiar with Android performance analysis and optimization for customer-facing mobile applications\n\nWhat we offer\n• Make a positive impact on the lives of our customers via financial inclusion\n• Professional development opportunities\n• International exposure & work experience\n• Company swag\n• Legally required benefits",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-mobile-mid-engineer-hybrid-at-storicardmx-312?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIE1vYmlsZSBNaWQgRW5naW5lZXIgKEh5YnJpZCkiLCJjb21wYW55X25hbWUiOiJTdG9yaWNhcmRteCIsImFkZHJlc3NfY2l0eSI6Ik1leGljbyIsImh0aWRvY2lkIjoiWEJ4VnNTVzlyQklEOUlqOUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdUV1Y0YVdOdiJ9"
        },
        {
            "title": "Highly Skilled Android Developer Wanted for Clinical Collaboration Platform",
            "company_name": "Tigerconnect",
            "location": "Guadalajara, Jalisco, Mexico",
            "via": "BeBee",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=OkSVdjYG2klwMJIQAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBDGcVx9BKebpbYiuOgkCkpBEBQc5ZKe6ek1V5Io9Sl9JePyLT--__g7GpsDu1Y-cH6yCDWw8U1QbmBHbxLtKcAVfcpw1wBbYc8WBbYqgkYDJlYPJ8GUuYMZ1GogEgbbQoa9qhOarNuU-riqqhildDHlly2tdpV6MjpUDzXxP7fYYqA-1-i2WM6HsvduWlzYUbDqPdkEnKMvbFDwgQELqFE4Wi3gSANb_QEAeNid0gAAAA&shmds=v1_AUFQtOMarmqEq9EFlsoqP7sMXCRpRsERyixuoLhryBPeFGhY5A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=OkSVdjYG2klwMJIQAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a71d53e5933145ddbfe/images/87e2db23d2a6d3195b7afa8502d4659e62210a23a67996115d6e7ac4532383ae.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "TigerConnect is transforming the healthcare industry with its cutting-edge clinical collaboration platform. As a leading provider of clinical communication and collaboration solutions, we're seeking an experienced Android Engineer to join our team.\n\nWe're looking for someone who can help us build the next generation of our platform using the latest Android frameworks and patterns. If you have a passion for developing innovative software solutions that make a real impact, we want to hear from you!\n\nAbout the Role:\n\nAs an Android Engineer, you'll be working on a range of exciting projects that involve building and maintaining our mobile applications. You'll have the opportunity to work with our talented team of engineers to design and develop new features, as well as troubleshoot and resolve technical issues.\n\nOur ideal candidate will have 3+ years of professional experience in native Android development, with a strong understanding of Kotlin and other relevant technologies. You'll also have excellent problem-solving skills, a keen eye for detail, and the ability to work collaboratively as part of a fast-paced team.\n\nWe offer a competitive salary, medical benefits, and a 401K matching plan. Our office space is located in California, complete with a loaded fridge, rock climbing wall, food trucks, yoga, happy hours, and more! We're proud to be recognized as a top Cyber Security Company to Know, one of the 5 Sizzling Silicon Beach Startups to Watch, and Built In LA's Best Places to Work.\n\nWhat We Offer:\n• A highly competitive salary: $120,000 - $160,000 per year\n• Medical benefits and 401K matching plan\n• Prime office space in California, complete with amenities like a rock climbing wall, food trucks, and happy hours\n• A fun environment that embraces a 'work hard-play hard' culture",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://mx.bebee.com/job/9ea7ea92c8733bb0351c28492b3d808b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Vacantes De Empleo, Trabajo",
                    "link": "https://mx.trabajo.org/oferta-3081-0116e8ff5efd014b21e368bce25384bb?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJIaWdobHkgU2tpbGxlZCBBbmRyb2lkIERldmVsb3BlciBXYW50ZWQgZm9yIENsaW5pY2FsIENvbGxhYm9yYXRpb24gUGxhdGZvcm0iLCJjb21wYW55X25hbWUiOiJUaWdlcmNvbm5lY3QiLCJhZGRyZXNzX2NpdHkiOiJHdWFkYWxhamFyYSwgSmFsaXNjbywgTWV4aWNvIiwiaHRpZG9jaWQiOiJPa1NWZGpZRzJrbHdNSklRQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Software Engineering Manager, Android Developer Experience",
            "company_name": "Google",
            "location": "Mexico City, Mexico",
            "via": "Indeed",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=UygPYSgf6yMgkPEDAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y2NQQrCMBAA8donCMKepTYieNGTaBGEHsQHlDRd05W4G5Kg8VV-0YpeBuYyU7wnxfki1_TUAaFmS4wYiC00mrXFUMKO-yDUwwEf6MRjgDqPJGSDsICTdBBRBzOAMBxFrMPpdkjJx41SMbrKxqQTmcrIXQljJ1ndpItftHEYv97phO1qvcyVZzuf_SJADA1mMgJ7Sq_yLx-NIiIAsgAAAA&shmds=v1_AUFQtOOiYuOtg5D6gqN7CfhzWJ32jOooGptvavBu1VJ76J3zbw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=UygPYSgf6yMgkPEDAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a71d53e5933145ddbfe/images/87e2db23d2a6d3199593e20948a3e5199c7297315fb7a33515b05425b57ae47f.gif",
            "extensions": [
                "10 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Please submit your resume in English - we can only consider applications submitted in this language.\nOnly applications of candidates with Mexican citizenship will be evaluated for this role in compliance with the provisions of Article 7 of the Federal Labor Law.\n\nMinimum qualifications:\n• Bachelor's degree or equivalent practical experience.\n• 8 years of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n• 3 years of experience in a technical leadership role; overseeing strategic projects, with 2 years of experience in a people management, supervision/team leadership role.\n• 3 years of experience building and developing large-scale infrastructure or distributed systems.\n• Experience in Machine Learning or Artificial Intelligence.\n\nPreferred qualifications:\n• Master’s degree or PhD in Engineering, Computer Science, or a related technical field.\n• 3 years of experience working in a complex, matrixed organization.\n• Experience architecting and developing software or infrastructure for scalable, high performance, distributed systems.\n• Experience working with developer-focused products and tools.\n\nAbout the job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We are looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your extensive technical expertise you take initiative to independently design and implement new systems, designing, implementing, and testing multiple features with little or no direction from tech lead or manager. You collaborate with key stakeholders to determine future direction of work.\nWithin Google, we have about 4,000 Android app developers across the company. With a shift to a hybrid working environment for Google Android app developers, we need to re-architect and create new app developers tools that make working on Android seamless no matter if an Google app developer is in the office or working remotely. This role is both managerial and technical.\nThe Core team builds the technical foundation behind Google’s flagship products. We are owners and advocates for the underlying design elements, developer platforms, product components, and infrastructure at Google. These are the essential building blocks for excellent, safe, and coherent experiences for our users and drive the pace of innovation for every developer. We look across Google’s products to build central solutions, break down technical barriers and strengthen existing systems. As the Core team, we have a mandate and a unique opportunity to impact important technical decisions across the company.\nResponsibilities\n• Set and communicate team priorities that support the organization's goals. Align strategy, processes, and decision-making across teams.\n• Set clear expectations with individuals based on their level and role and aligned to the broader organization's goals. Meet regularly with individuals to discuss performance and development and provide feedback and coaching.\n• Develop the mid-term technical vision and roadmap within the scope of your (often multiple) team(s). Evolve the roadmap to meet anticipated future requirements and infrastructure needs.\n• Design, guide and vet systems designs within the scope of the broader area, and write product or system development code to solve ambiguous problems.\n• Review code developed by other engineers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See alsoGoogle's EEO Policy andEEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing ourAccommodations for Applicants form.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://mx.indeed.com/viewjob?jk=0e1ce18199f2cad3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com.mx/job-listing/software-engineering-manager-android-developer-experience-google-JV_IC5017436_KO0,57_KE58,64.htm?jl=1009585527462&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BYP Network",
                    "link": "https://careers.byp-network.com/jobs/356851870-software-engineering-manager-android-developer-experience-at-google?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "PowerToFly",
                    "link": "https://powertofly.com/jobs/detail/2085586?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://mx.linkedin.com/jobs/view/software-engineering-manager-android-developer-experience-at-google-4115838079?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AnitaB.org Job Board",
                    "link": "https://jobs.anitab.org/companies/google-24698/jobs/44269592-software-engineering-manager-android-developer-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/software-engineering-manager-android-developer-experience-google-JV_IC5017436_KO0,57_KE58,64.htm?jl=1009585527462&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.mx/job/qRGOIj6Se3jSCpgYl5USyZa1biDuK1RejLXGQRue3sNPpAkFcpXMRg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBNYW5hZ2VyLCBBbmRyb2lkIERldmVsb3BlciBFeHBlcmllbmNlIiwiY29tcGFueV9uYW1lIjoiR29vZ2xlIiwiYWRkcmVzc19jaXR5IjoiTWV4aWNvIENpdHksIE1leGljbyIsImh0aWRvY2lkIjoiVXlnUFlTZ2Y2eU1na1BFREFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdUV1Y0YVdOdiJ9"
        },
        {
            "title": "Lead Engineer - Android Platform Automation",
            "company_name": "Kunai",
            "location": "Mexico",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=aExBIhzLZXZrEHipAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMywrCMBBFcduNe1ezFmxEcKOrFkTwAf5ByWNMI-1MyKSQ7_CLjZsLh3O4zXfV9A_UDi7kAyEm2EFHLnFw8Jp0fnOaoVsyzzoHpmpvbEBQJztC5Suzn3BzHnOOclJKZGq95Brb1vKsmNBwUR828p9BRp0w1mMcDsd9aSP57fq-kA4QCJ5YguUfdYin1JUAAAA&shmds=v1_AUFQtONyJV2Y9JGGX4nWOdpSIHloLE-Djq38tD3djtrpwynCSg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=aExBIhzLZXZrEHipAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Kunai is a fast-growing digital consultancy focused on banking, payments, and fintech powered by a global network that attracts the best and brightest people from all backgrounds and cultures, driven by innovation and experimentation, spread across almost every single continent. Over the past decade, we've shipped over 150 products for clients that include Visa, American Express, Capital One, WEX, Wells Fargo, Ernst & Young, and TOMS Shoes. Our founders built a previous agency (Monsoon) that was acquired by Capital One in 2015.\n\nKunai is currently engaged in the development of Android and iOS native applications for one of the largest Fintech environments in the world. Our mobile applications are used by over 30 million customers and are developed by hundreds of engineers on disparate teams across many independent lines of business. We are seeking Software Engineers with a background in automating the build, deployment and testing processes for Android platforms.\n\nJoin us as we build a Center of Excellence (CoE) aimed at consolidating and coordinating build, testing and deployment efforts across multiple business units. The CoE is currently developing a centralized platform to ingest and analyze testing and reliability data. This platform will empower application teams by providing actionable insights to enhance the effectiveness of existing tests, thereby improving the prevention, mitigation, and rollback of production incidents. Additionally, we will identify opportunities to optimize test suites and streamline deployment pipelines.\n\nSkills:\n• 5 years of experience in the development, deployment or automated testing of mobile applications\n• Experience managing engineering teams to include mentorship, architecture and design, requirements gathering and distribution\n• Knowledge of one or more of the following languages: Kotlin, Java, Python, JavaScript\n• Experience with Android SDK, Android Studio\n• Experience with Android automation deployment tools like Bazel, Gradle, Fastlane, etc.\n• Experience with automated testing frameworks such as Espresso, Appium, Calabash, etc.\n• Knowledge of data analytics and visualization tools like Spark or Superset\n• Proven track record in supporting large-scale deployment pipelines and automated testing initiatives.\n• Ability to collaborate effectively with cross-functional teams and stakeholders to achieve project objectives.\n• Strong problem-solving skills and proactive approach to identifying and implementing improvements in testing and deployment processes.\n\nAt Kunai, we have built deep relationships with our clients. Our bar is high, and our mission is to always exceed our client’s expectations. If you are fanatical about customer success and driven to work on and solve tough technical challenges, we would love to chat with you!",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/lead-engineer-android-platform-automation-at-kunai-924?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEVuZ2luZWVyIC0gQW5kcm9pZCBQbGF0Zm9ybSBBdXRvbWF0aW9uIiwiY29tcGFueV9uYW1lIjoiS3VuYWkiLCJhZGRyZXNzX2NpdHkiOiJNZXhpY28iLCJodGlkb2NpZCI6ImFFeEJJaHpMWlhackVIaXBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Android Developer",
            "company_name": "Lasec Technology Systems S.A.P.I. de C.V.",
            "location": "Zacatecas, Mexico",
            "via": "Indeed",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=A7b5ADIu5T-RxqpfAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBAAUFz7CU43iuhFBBcFoSiIoiBUHFwkTY8mkuZCLkj7Rf6murztFZ9RMSlDk9g1sKc3eY6UYA4nrkFIJ2OBAxyYW0_jjc05ylopEY-tZJ2dQcOd4kA19-rFtfx5itWJoteZnsvVoscY2un2rIUM3MjYwJ7bAapBMnUCFZZ4xSNCQ7DDO4IL8NDmt42WGVyod4a_WXhA2KoAAAA&shmds=v1_AUFQtON-UOuu4lXt4NaNcKZNpNsLxsJDjJaplJ2CYgncjSagDw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=A7b5ADIu5T-RxqpfAAAAAA%3D%3D",
            "extensions": [
                "MX$20K–MX$30K a month",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "MX$20K–MX$30K a month",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Lasec Technology Systems, S.A.P.I. De C.V. UNETE a nuestro gran equipo de trabajo y forma parte de la mina digital.\n\nPuesto: Desarrollador Android\n\nResponsabilidades:\n\nDesarrollo e innovación de aplicaciones, resolución de problemas técnicos, soporte al cliente, documentación efectiva, documentación técnica, monitoreo y seguimiento, etc.\n\nConocimientos requeridos:\n• Material Design\n• Patrones de diseño\n• ciclo de vida del fragments y activities\n• Manejo de datos en tiempo real\n\nHabilidades\n• Android Studio\n• Kotlin\n• Java\n• Consumo de API Rest (Retrofit)\n• Interaccion de base de datos (ROOM)\n• Uso de git\n• Uso de hardware del dispositivo\n\nRol:\n• Lunes a viernes de 8:00am a 5:36pm.\n• Lugar de trabajo Zacatecas Zac.\n• Empleo 100% presencial.\n\nSICUMPLES CON EL PERFIL NO DUDES EN POSTULARTE AL PUESTO.\n\nTipo de puesto: Tiempo completo\n\nSueldo: $20,000.00 - $30,000.00 al mes\n\nBeneficios:\n• Caja de ahorro\n• Seguro de vida\n\nPago complementario:\n• Bono de asistencia\n• Bono de puntualidad\n\nTipo de jornada:\n• Turno de 8 horas\n\nLugar de trabajo: Empleo presencial\n\nFecha de inicio prevista: 04/11/2024",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://mx.indeed.com/viewjob?jk=c2a822d5be7742b1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com.mx/job-listing/android-developer-lasec-technology-systems-s-a-p-i-de-c-v-JV_IC3497111_KO0,17_KE18,57.htm?jl=1009495454670&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://mx.jooble.org/jdp/8074376518198408147?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.mx/job/gDcYopgWK4syGoO4W5YvdlGn0hDsXELyr2WAgAHsc2SBcCTO3O8cGw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/android-developer-lasec-technology-systems-s-a-p-i-de-c-v-JV_IC3497111_KO0,17_KE18,57.htm?jl=1009495454670&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6Ikxhc2VjIFRlY2hub2xvZ3kgU3lzdGVtcyBTLkEuUC5JLiBkZSBDLlYuIiwiYWRkcmVzc19jaXR5IjoiWmFjYXRlY2FzLCBNZXhpY28iLCJodGlkb2NpZCI6IkE3YjVBREl1NVQtUnhxcGZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        },
        {
            "title": "Android Developer - REMOTE WORK",
            "company_name": "BairesDev",
            "location": "Santiago de Querétaro, Querétaro, Mexico",
            "via": "SimplyHired",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=2_SvqDKbPAi9WAM3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1WNMQrCMBRAce0RnP4s2oiggk6KRVBKsQqO5Tf9pJGYH5IovZKLl_Bi1tHl8d70kvcgWWxs41k3sKMnGXbkYQJllheXDK5FeezrwDUEQi9bYAt7ZmVouG5jdGElRAgmVSFi1DKVfBdsqeZO3LgOP1ShRU_OYKRqNp92qbNqtNyi9hT6JWgLZ7RRo2JoCE4P8p9XRM_jP8-p05K_qfrFerEAAAA&shmds=v1_AUFQtOM-6XMi2FY_eEf6NFofJGQlMGX90iIQGESYRf4GWPVKBQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=2_SvqDKbPAi9WAM3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a71d53e5933145ddbfe/images/87e2db23d2a6d319fda0a785b9248ffb12dc92bdaa7126c07c10e7ab3e79fe5a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.\n\nOur diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.\n\nWhen you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.\n\nAndroid Developer at BairesDev\n\nWe are looking for Android Developers to work from home and join our Development team and participate in different projects made up of multicultural teams distributed throughout the world. We are looking for proactive people, team players passionate about programming in this language and oriented to provide the best experience to the end user. This is an excellent opportunity for those professionals looking to develop in one of the fastest growing companies in the industry!\n\nThese developers will face numerous technical challenges, so they must use current technologies, get involved in the mobile world, web applications, devices, etc.\n\nWhat You’ll Do:\n• Able to work independently with minimal supervision, as well as collaborate with a diverse team.\n• Accountable for resolution of the most technically challenging issues facing the organization.\n• Write code with increasing quality and maintainability.\n• Guide the architecture of large features which impact all parts of the company, identifying issues and raising concerns/blockers for mitigation.\n• Research and introduce new technology to improve the applications and/or the development pipeline.\n\nHere’s what we are looking for:\n• 6+ years of experience in development.\n• 5+ years of experience in Android development.\n• Solid knowledge of design and architecture patterns.\n• Solid knowledge and management of programming fundamentals including algorithms and data structures.\n• Advanced English level.\n\nHow we make your work (and your life) easier:\n• 100% remote work (from anywhere).\n• Excellent compensation in USD or your local currency if preferred\n• Hardware and software setup for you to work from home.\n• Flexible hours: create your own schedule.\n• Paid parental leaves, vacations, and national holidays.\n• Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.\n• Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.\n\nJoin a global team where your unique talents can truly thrive!",
            "apply_options": [
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.mx/job/ZrjRKkH0F4T7vSD9JNAhk1cOGQMQtEdHMdm08E29PrbiLb_rCB8CVA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Www.jobaliza.com",
                    "link": "https://www.jobaliza.com/mx/jobad/23643909f0f50a27/9307679650/8282504725/android-developer-remote-work-queretaro-qro.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAtIFJFTU9URSBXT1JLIiwiY29tcGFueV9uYW1lIjoiQmFpcmVzRGV2IiwiYWRkcmVzc19jaXR5IjoiU2FudGlhZ28gZGUgUXVlcsOpdGFybywgUXVlcsOpdGFybywgTWV4aWNvIiwiaHRpZG9jaWQiOiIyX1N2cURLYlBBaTlXQU0zQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1RXVjRhV052In0="
        },
        {
            "title": "Android Engineer (Hybrid)",
            "company_name": "Homebase",
            "location": "Mexico",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.com.mx/search?ibp=htl;jobs&q=Android+developer&htidocid=QxoxjSsPvADHlThYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFw7OjrdqIJJEVx0chCL4DOU_BxJSnoXchni7IuL3_AN380w3slXTh4eFBIhVthPH1uTP8AJXmxB0FQXgQmezCHj7hZbK3LVWiSrIM205JTjVTOh5a4XtvJvlmgqlmwazufL2FWhcNxOvKI1gpAI3tiT4x8PkloLhgAAAA&shmds=v1_AUFQtONO0F_oNogCcrRfYkob_UsDs81nsOxbcKZVoupV_R7nFQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=QxoxjSsPvADHlThYAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850a71d53e5933145ddbfe/images/87e2db23d2a6d3197337ec861688b77b22c66bfd8960df7fd8a5029082c39a21.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Hi, Future Homie!\n\nAs a Homie, you'll be part of an unstoppable team that puts customers first, embraces each day with excitement, and strives for excellence in everything you do. We’re revolutionizing the way small businesses manage their teams and grow their business. What this means for you is a shared passion for innovation and making a difference for the people we serve. So what do you say, will you join us on our mission to empower small businesses?\n\nAs a Homie, you are a bar raiser, which means you come with\n• 4+ years of Mobile Software Engineering experience\n• Expert in Kotlin, Kotlin coroutines, and various common Android frameworks\n• Nice to have: Experience with Java and Jet pack components MVI & compose\n• Advanced understanding of object-oriented software design and design patterns, and how they apply to the frameworks listed above\n• Advanced understanding of performant code\n• Knowledge of Android UI design principles, patterns, and best practices\n• Experience with RESTful APIs and third-party libraries\n• Testing framework experience - unit, feature, and integration\n• Knowledge of Jira, Git, Github, CircleCI, and development using pull requests.\n• Strong systematic and problem-solving skills\n• Ability to work from the office weekly on Tuesdays and Wednesdays\n\nAs a Homie, you will make an impact by\n\nDesigning, building, and implementing incredible software solutions that enhance the value of the Homebase software platform to impact the lives of our customers. You will be a part of a passionate and dynamic community eager to take innovation to the next level. The ideal candidate is comfortable with ambiguity and failure, thrives in a fast-paced environment, and possesses a genuine passion for creating impactful solutions. If you are a risk-taking, scrappy, and unconstrained thinker who takes pride in ownership, we want you on our team.\n• You’ll drive product engineering end-to-end for the mobile to deliver value to our customers\n• You will contribute to the evolution of our current engineering strategy and development process\n• Rapidly prototype and iterate on ideas to validate assumptions and hypotheses\n• Take ownership of initiatives, measure key metrics, and examine results to inform choices with your partners\n• Embrace a mindset of continuous improvement, incorporating learnings from both successes and failures into future initiatives\n• Champion a culture of innovation, collaboration, and a bias for action within the team\n\nWhat to Expect During the Interview Process:\n• Meet the Talent Acquisition team, Mehreen M.\n• Meet with the Hiring Manager\n• Participate in two Technical Interviews (Live Coding/Systems Architecture)\n• Meet with the Director of Engineering, Ronnie C\n• Professional Reference Checks\n• Background Check + Offer Stage\n• Welcome to the team 💜🎉\n\nDiversity, Equity, and Inclusion at Homebase\n\nAt Homebase, we take pride in fostering a welcoming space where every Homie of every gender, age, orientation, culture and walk of life can be their full selves. Diverse perspectives empower us to build the best-in-class platform for small businesses and hourly shift workers. We recognize that experience comes in many forms, so if you think you’re close to what we’re looking for (even if you don’t meet 100% of the qualifications), we encourage you to apply!\n\nAbout Us\n\nWelcome to the exciting world of Homebase in Monterrey, Mexico! We are looking for passionate individuals like you to join our unstoppable team of developers. Can you imagine being one of the first members of this adventure?\n\nOur mission is to make small business teams unstoppable.\n\nHomebase is the everything app for hourly teams, with employee scheduling, time clocks, payroll, team communication, HR, and more. More than 100,000 small (but mighty) businesses rely on Homebase to make work radically easy and give their teams superpowers. As the leader in small business team management, Homebase tracked 1+ billion hours for 2.5+ million workers last year. Homebase is based in San Francisco, Houston, Denver, and Toronto. We are backed by leading venture investors L Catterton Growth, Emerson Collective, Notable Capital, Bain Capital Ventures, Khosla Ventures, Baseline Ventures, Cowboy Ventures, Bedrock Capital, and PLUS Capital.\n\nIf you're ready to join an exciting adventure and make an impact in the world of technology, now is the perfect time to become part of our team in Monterrey! Apply today and be a part of the future we are building together at Homebase!\n• *Interview Recording Notice\n\nBy participating in interviews with Homebase, you consent to the use of Metaview, a recording and transcription tool, during the interview process. Please be aware that all interviews may be recorded and transcribed for the purpose of evaluating candidates and ensuring the quality of our recruitment process. If you do not consent to being recorded, please inform the Talent Team at the beginning of the call, and appropriate arrangements will be made to accommodate your preference. Your privacy is important to us, and the recorded interviews will only be used for internal evaluation and assessment of candidates.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-engineer-hybrid-at-homebase-801?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIChIeWJyaWQpIiwiY29tcGFueV9uYW1lIjoiSG9tZWJhc2UiLCJhZGRyZXNzX2NpdHkiOiJNZXhpY28iLCJodGlkb2NpZCI6IlF4b3hqU3NQdkFESGxUaFlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVFdWNGFXTnYifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUM0ZYYkdSMmJuTnNRV0pWVlZBMU9YSm5WVEozVW1zeFEydEtjbXQwTFV4MlIwazFRbkp2V1dSNk56RmZTbXRFUmpWMVRHZEtVMlkwZUVwbVluUlBaVGsyTkRCMWRsa3pjbmx6V1hNNU4yVkZkM1F0YjNaUFNIaEdaaTAwV0hoNWJIaHNkQzAzUVdkM1pteE5SRFpMYjE5bE5YVjBkbU5XWVhneE9GSlBNSFpxVkdSTVoyMUNhRkpZYjB4RmFuZzBURzVNVVZaM1pqWkhSekp1TTJKeVpEbDZPRE5HWjJReFVreGlZMnMzWjFWUGVVUTJSMnBtYkZCSGNVSmFVRVY2VmpVMVpTMVRhWFEyTWpjeGJYaHBjalZIYjNwTVdYVmtUVEpXZWxSdlpUWXlZekUxV1hNeVVtMVViME5OY3pWbk9VZDJXakp1TTJ4cFZIRnNTbEJGZDFNMk1ucEpWaElYWTFGeFJsbzFaVXBOY25sSmQySnJVRGhrWWxOM1VWVWFJa0ZHV0hKRlkyOXFiMVZuU3pGV1dUVjBPVXB1ZEhkclEyMTNkRXd4WWsxaFZVRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com.mx&location=Mexico&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUM0ZYYkdSMmJuTnNRV0pWVlZBMU9YSm5WVEozVW1zeFEydEtjbXQwTFV4MlIwazFRbkp2V1dSNk56RmZTbXRFUmpWMVRHZEtVMlkwZUVwbVluUlBaVGsyTkRCMWRsa3pjbmx6V1hNNU4yVkZkM1F0YjNaUFNIaEdaaTAwV0hoNWJIaHNkQzAzUVdkM1pteE5SRFpMYjE5bE5YVjBkbU5XWVhneE9GSlBNSFpxVkdSTVoyMUNhRkpZYjB4RmFuZzBURzVNVVZaM1pqWkhSekp1TTJKeVpEbDZPRE5HWjJReFVreGlZMnMzWjFWUGVVUTJSMnBtYkZCSGNVSmFVRVY2VmpVMVpTMVRhWFEyTWpjeGJYaHBjalZIYjNwTVdYVmtUVEpXZWxSdlpUWXlZekUxV1hNeVVtMVViME5OY3pWbk9VZDJXakp1TTJ4cFZIRnNTbEJGZDFNMk1ucEpWaElYWTFGeFJsbzFaVXBOY25sSmQySnJVRGhrWWxOM1VWVWFJa0ZHV0hKRlkyOXFiMVZuU3pGV1dUVjBPVXB1ZEhkclEyMTNkRXd4WWsxaFZVRSIsImZjdiI6IjMifQ%3D%3D&q=Android+developer"
    }
}