{
    "search_metadata": {
        "id": "67850abe1c208be68ff7ca54",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/5916dfbdb049b286/67850abe1c208be68ff7ca54.json",
        "created_at": "2025-01-13 12:44:46 UTC",
        "processed_at": "2025-01-13 12:44:46 UTC",
        "google_jobs_url": "https://www.google.se/async/callback:550?q=Android+developer&uule=w+CAIQICIGU3dlZGVu&udm=8&fc=EuICCqICQUpHOUprUFBEeW1PYkdnWlZhLWhvV0FFV0JaYi1FQXBaWFVVNEhudkdqSmxuMlRMUERmNGJwSDFGX0ZvZGZUQXExZTRxcGhGTXVIczJqZ1dsOXB4cE1ZZFhEOXQ1QWFoSWlJWkdhem9IOU9Uak9ZWkNIUV92cGhTX1JwU3JJNGNLcS1TdTloRUFkaWFMVXlkaVF2UE0za21LdGM0bDM3cjVGenpxVWJJYUVGMW1Rc24tdVVIMTNGT3B6bUxuemJqYlFsZkNmcXFFT3JfT3pWSEZWaTFBcVBrZE96WDR2aDF5TjlDR01wZ0VjZm1fQzQwYVdETG9pbDJFbWRlOXp1QzNqcEhpbjg5RVBzX2pFTU50M3NSdUtGSF9fc21JSmpaZlESF3ZRcUZaNnFyS2JTYndia1A5TWlYaVF3GiJBRlhyRWNyYXRFbFFEXzVpYzBYamJRQ0xoZGtUNERZN0FB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/5916dfbdb049b286/67850abe1c208be68ff7ca54.html",
        "prettify_html_file": "https://serpapi.com/searches/5916dfbdb049b286/67850abe1c208be68ff7ca54.prettify",
        "total_time_taken": 2.24
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "Sweden",
        "location_used": "Sweden",
        "google_domain": "google.se",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRkJFZVcxUFlrZG5XbFpoTFdodlYwRkZWMEphWWkxRlFYQmFXRlZWTkVodWRrZHFTbXh1TWxSTVVFUm1OR0p3U0RGR1gwWnZaR1pVUVhFeFpUUnhjR2hHVFhWSWN6SnFaMWRzT1hCNGNFMVpaRmhFT1hRMVFXRm9TV2xKV2tkaGVtOUlPVTlVYWs5WldrTklVVjkyY0doVFgxSndVM0pKTkdOTGNTMVRkVGxvUlVGa2FXRk1WWGxrYVZGMlVFMHphMjFMZEdNMGJETTNjalZHZW5weFZXSkpZVVZHTVcxUmMyNHRkVlZJTVROR1QzQjZiVXh1ZW1KcVlsRnNaa05tY1hGRlQzSmZUM3BXU0VaV2FURkJjVkJyWkU5NldEUjJhREY1VGpsRFIwMXdaMFZqWm0xZlF6UXdZVmRFVEc5cGJESkZiV1JsT1hwMVF6TnFjRWhwYmpnNVJWQnpYMnBGVFU1ME0zTlNkVXRHU0Y5ZmMyMUpTbXBhWmxFU0YzWlJjVVphTm5GeVMySlRZbmRpYTFBNVRXbFlhVkYzR2lKQlJsaHlSV055WVhSRmJGRkVYelZwWXpCWWFtSlJRMHhvWkd0VU5FUlpOMEZCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Software Engineer (Android)",
            "company_name": "SIX Payment Services",
            "location": "Sweden",
            "via": "Expertini | Sweden Jobs Expertini",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=p2kreTw_rV_HlUDrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CQ5yowo2UnDRyUFEJyGLW0nTM42kdyV32PoZ_rG6vPEVn1lRWX7o6DLCiUIkxAzLI7WZY7uCDVy5AUGXfQdMcGYOCeeHTnWQvTEiqQyiTqMvPfeGCRuezJMb-VNL94uH5BTraredyoHCemEvd7i5d4-kYDG_okeBSGBHbJG-sRQ9IZQAAAA&shmds=v1_AUFQtONZ_AUgxM4wP8TqQdVBzKRLLdmsZ3W3cCbvr1qmISiQ3w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=p2kreTw_rV_HlUDrAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850abe1c208be68ff7ca54/images/d284d0e8d1e7bd857354815a51f2b88e33984166fe5014f9fb5b4e6a5d1e4153.gif",
            "extensions": [
                "4 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "4 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Software Engineer (Android)\n\nDate posted 03/14/ Location Gothenburg | Sweden Company Worldline\n\nSoftware Engineer (Android)\n\nWorldline växer och behöver stärka utvecklingsavdelningen i Halmstad med ytterligare Android-utvecklare som kan bidra med både kompetens, erfarenhet och en härlig personlighet. Vi söker dig som har ett genuint teknikintresse och som tycker om att arbeta tillsammans med andra utvecklare i sann laganda.\n\nI våra moderna och rymliga lokaler i Halmstad arbetar ett 60-tal härliga Worldliners i blandad ålder inom flera olika arbetsområden. Produktutvecklingsteamet utgörs av ca 20 personer och det är här vi tar fram Worldlines produkter riktade till små- och medelstora butikshandlare främst i Norden, från kortterminaler och betalsystem, till kundinriktade och interna webbsystem, verktyg och API-er. Våra betaltjänster används av tiotusentals butikshandlare som tillsammans genomför miljontals transaktioner varje dag, året runt.\n\nNu siktar vi ännu högre och planerar att ta våra produkter och tjänster ut till små- och medelstora handlare i hela Europa. Worldline har redan idag en mycket väl etablerad verksamhet runt om i Europa för en mängd olika kundsegment, framför allt storkunder och banker, så våra produkter som vi ansvarar för kompletterar Worldlines portfölj väldigt väl.\n\nVi erbjuder en flexibel hybridmodell där man har goda möjligheter att arbeta både på plats och på distans. Vi tror dock på samhörighet och teamkänsla, därför erbjuds inte denna tjänst helt på distans.\n\nArbetsbeskrivning\n\nDu kommer vara en del av ett erfaret utvecklingsteam som fokuserar på att utveckla våra kortterminaler. En ny generation Android-baserade kortterminaler håller på att utvecklas och dessa kommer över tid ersätta äldre generationer. Här har du en fantastisk möjlighet att vara med från tidigt stadie i ett spännande arbete där ny teknik skapar nya möjligheter för oss och våra kunder.\n\nVi arbetar agilt och produktdrivet med flera autonoma team, där vi strävar efter bred kompetens så att alla kan bidra med det som behövs. Vi tror att kommunikation och samarbete inom teamet såväl som med andra team är nyckeln till framgång. Vi njuter av en öppen, hjälpsam och positiv atmosfär.\n\nTeamet arbetar i en bred teknikstack, där Android och Kotlin ändå står i fokus, och vi strävar alltid efter att lära oss nya saker och utmana oss själva för att alltid kunna leverera bättre och modernare produkter och tjänster till våra kunder.\n\nAlla team har fullständigt tekniskt ägarskap för flera system där man gemensamt och i sann DevOps-anda ansvarar för alla delar så som kravställning, arkitektur, teknikval, utveckling, test, CI/CD och lansering.Tillsammans med våra produktägare formar ni våra produkter för dagens och framtidens behov.\n\nEgenskaper\n• Du har en god känsla för användarvänlighet och kvalitet\n• Du brinner för att lära dig nya saker och håller dig uppdaterad inom moderna utvecklingsramverk och metodologier\n• Du är lyhörd, vill lära och delar gärna med dig av din kompetens med andra\n• Du är en sann lagspelare med en positiv, ödmjuk inställning\n\nKvalifikationer\n• Några års arbetslivserfarenhet inom Android och Kotlin-utveckling\n• Erfarenhet inom testautomation\n• Erfarenhet inom CI / CD\n• Du behärskar svenska och engelska i både tal och skrift\n\nMeriterande\n• Kompetens, erfarenhet och känsla för UI design\n• Kompetens inom några av dessa teknologier vi arbetar med dagligenC# .NET, C/C++, SQLite, MariaDB, Elasticsearch, Grafana, Docker, Swagger, GitLab, TeamCity, Octopus Deploy\n\nSkicka in din jobbansökan och CV så snart som möjligt då vi granskar ansökningar löpande. Vi ser fram emot att höra mer om dig och dina passioner och färdigheter!",
            "apply_options": [
                {
                    "title": "Expertini | Sweden Jobs Expertini",
                    "link": "https://se.expertini.com/jobs/job/software-engineer-android--sweden-six-payment-services-7707ca0ce4/amp/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoQW5kcm9pZCkiLCJjb21wYW55X25hbWUiOiJTSVggUGF5bWVudCBTZXJ2aWNlcyIsImFkZHJlc3NfY2l0eSI6IlN3ZWRlbiIsImh0aWRvY2lkIjoicDJrcmVUd19yVl9IbFVEckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdVM2RsWkdWdSJ9"
        },
        {
            "title": "Mobile Engineer",
            "company_name": "Wolt",
            "location": "Stockholm, Sweden",
            "via": "Job Board Search",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=hAMeCUw2-ne0ZRkHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQoCMQwAUFzvD3TK5CB6FcFFZxEEpxscj7aGtppLShPwRj9dfMPrvotufZdQCOHCqTBigx3cJICibzGDMFxFEuHqnM2qnpxTpT6peSuxjzI5YQwyu5cE_Tdq9g0recPxcNzPfeW0WT6EDArDYBLfWWjawvDBJ_IPBwnw1oMAAAA&shmds=v1_AUFQtOPjejr7EosTb4M3vp27oCD_QVm4KGLGsCwOu47QozPB3g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=hAMeCUw2-ne0ZRkHAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850abe1c208be68ff7ca54/images/d284d0e8d1e7bd85510917cc38fba543bf521c8e5b450ba18b3c6220eaadd110.gif",
            "extensions": [
                "5 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Company Description\n\nWolt is a technology company that makes it incredibly easy to discover and get the best restaurants, grocery stores and other local shops delivered to your home or office. Since launching 8 years ago, Wolt has expanded from a restaurant food delivery platform in the Nordics to a leading player in the delivery of everything across EMEA. Wolt works together with tens of thousands of restaurant and retail partners, as well as with over a hundred thousand courier partners across 23 countries and 250+ cities.\n\nIn November 2021, we announced that we’re joining forces with the US-based company DoorDash. The transaction closed in May 2022, and since then we have been one team with DoorDash. Our CEO, Miki Kuusi leads all of DoorDash’s international business in the 26 countries outside of the US.\n\nWolt not only offers great apps to customers and partners, but is also developing a broad range of technologies and solutions. Our apps (iOS and Android) have the industry’s highest reviews, largely because of our customer-centric approach to how we build our products and operations. For example, our customer service team responds in a matter of minutes, in the customer’s own language.\n\nSo, why work at Wolt?\n\nAt Wolt, we’re about getting things done.\n\nYou’ll probably enjoy it here if you like taking ownership, developing yourself and being around friendly, humble and ambitious people.\n\nWe work hard to make cities into better places, and it’s pretty cool seeing us grow every week. If you’re passionate about building things that just… work, Wolt might be for you.\n\nOur Commitment to Diversity, Equity & Inclusion\n\nWe want to have all sorts of people in our team – people like you and me, and people different from you and me. To be able to work with diverse teammates – when it comes to gender, age, ethnicity, life background, sexual orientation, political views, religion, or any other personal trait – we consciously aim to offer equal opportunity for everyone to work with us. This is because we believe diverse teams make the most thought-through decisions and build things in the most inclusive way.\n\nJoin us today to build Wolt together.\nJob Description\n\nBe part of an ambitious new initiative that will redefine how our merchants operate across both physical and virtual worlds. As an early contributor, you’ll play a pivotal role in designing and building a modern Android app that leverages existing technology assets while also creating new, innovative features. You’ll have the opportunity to work with cutting-edge tools and frameworks, balancing the need for new development with the practicalities of integrating with established systems.\n\nYou’ll enjoy a high level of autonomy, influencing architecture, technology choices, and product direction. This is more than just coding—it's about solving complex challenges and crafting a seamless experience for merchants, redefining their daily operations. You’ll need to be comfortable working with what’s already in place, as well as identifying where you can introduce new, forward-looking solutions.\n\nYour role will require an ability to handle ambiguity and rapid changes while maintaining a focus on quality and high performance. This is a unique opportunity to work on a new product that will significantly impact how merchants operate.\n\nKey Responsibilities:\n• Architect and build key components of a modern Android application, leveraging both existing technology assets and new tools.\n• Influence architecture decisions, technology stack selection, and product direction.\n• Collaborate closely with product, design and backend teams to shape features and user experiences.\n• Implement high-quality, scalable code while maintaining performance and security standards.\n• Rapidly iterate and adapt to evolving requirements and ambiguous contexts.\n• Continuously refine the app’s user experience to support and enhance merchants’ daily operations.\n• Drive innovation and help establish best practices for the team.\n• Mentor and coach junior engineers, fostering a collaborative and inclusive environment.\n\n📍This role can be based in one of our tech hubs in Helsinki, Stockholm or Tallinn.\nQualifications\n• Android development experience, with a solid grasp of Kotlin and the Android SDK.\n• Hands-on experience with Jetpack Compose and modern Android app architectures (e.g., MVVM, MVI).\n• Experience with UI/UX principles, including building polished, accessible interfaces aligned with Design guidelines.\n• A demonstrated track record of working in a fast-paced environment with changing requirements.\n• Ability to work independently, make decisions with a high degree of autonomy, and handle ambiguity effectively.\n• Effective collaboration and communication skills to work seamlessly with team members and stakeholders.\n\nNice-to-Haves:\n• Interest or foundational experience in Golang or Kotlin backend development.\n• Exposure to Flutter framework to bring fresh perspectives to the mobile development process.\n• Willingness and ability to travel to the US for in-person team collaboration.\n• Previous experience in start-up environments or working on early-stage products, demonstrating adaptability and entrepreneurial mindset.\n\nAdditional Information",
            "apply_options": [
                {
                    "title": "Job Board Search",
                    "link": "https://jobboardsearch.com/redirect?utm_source=schema&utm_medium=bot&utm_id=jobboarsearch&utm_term=echojobs.io&rurl=aHR0cHM6Ly9lY2hvam9icy5pby9qb2Ivd29sdC1tb2JpbGUtZW5naW5lZXItbWVyY2hhbnQtZW5naW5lZXJpbmctdWhzOWE%3D&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJXb2x0IiwiYWRkcmVzc19jaXR5IjoiU3RvY2tob2xtLCBTd2VkZW4iLCJodGlkb2NpZCI6ImhBTWVDVXcyLW5lMFpSa0hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVTNkbFpHVnUifQ=="
        },
        {
            "title": "Mobilutvecklare",
            "company_name": "Techster Solutions AB",
            "location": "Lund, Sweden",
            "via": "Jobbland",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=DF2ok8RcJJC1F4UAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQ7CMAxAUbH2CExeYEDQICQWOsGChGAqe5WkVhMIdlS70ENwaMryx_eL76xY3tjFNOgb_TPZHmEDF3YgaHsfgAnOzF3CeRVUsxyMEUllJ2o1-tLzyzCh49E82Mk_jYRJyckqNrv9diwzdavFHX0QxR5qnl6RSeB4gkhwHahdQ_3BFukH3ZC5Do8AAAA&shmds=v1_AUFQtOP_kMNYqykWwQWTMfOye43gz7GZmZ9EkyBx9Dlxz80zXA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=DF2ok8RcJJC1F4UAAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Techster Solutions befinner i dagsläget sig i en spännande tillväxtfas och söker nu fler kollegor, inledningsvis dig med minst 3+ års erfarenhet och som kan stärka teamet.\n\nDu kan förvänta dig en omväxlande miljö, dagarna kan se väldigt olika ut - men en sak är säkert, här får du använda dina kompetenser och sätter själv gränsen för hur mycket du vill utvecklas. Som ett kunskapsbolag är det viktigt för oss att våra specialister delar med sig av sin kompetens och får kollegorna att växa.\n\nRollbeskrivning:\n\nYou will join a team of highly skilled developers with an established network within the company software community. We cooperate closely with for example UX/Design, the Product Owner and tech leads. The position is based in Lund.\n\nWho are you?You are a very skilled software developer and you have worked with AOSP, the Android framework, SystemUI and Java/Kotlin app development. Quality thinking and taking ownership are parts of your characteristics and you naturally write testable and maintainable code. You are a true collaborator who feel comfortable handling complexity. You are used to working in cross functional teams where collaboration with for example interaction and graphic designers is a part of the day-to-day work.\n\nWhat you need to bring with you?• M.Sc in Software Engineering or corresponding relevant experience• Java/Kotlin app development• Experience in working within AOSP and Android Framework• Experience in Android stack and related development and build tools (Gradle and Soong build system)• Writing automated unit and integration tests as a natural part of design and implementation• Comfortable working in a Linux environment• Experience in working with Git/Gerrit/Jenkins tools• Good communication skills, including in English (written and spoken)• Swedish Driver's license (B-level) is required to be able to do testing in cars\n\nIt is meritorious if you have experience of:• AIDL and Android HAL• C++ development• Experience from Android SystemUI\n\nAnsökan Tror du att du är Techster Solutions nästa stjärna? Tveka då inte att skicka in din ansökan redan nu. Urval sker löpande och tillträde sker enligt överenskommelse.\n\nArbetsplats och kulturVi är ett entreprenördrivet IT företag, med både produktkunskap och försäljning (Techster AB) och konsultativa tjänster (Techster Solutions AB). Det innebär att vi är mycket öppna för nya tekniska lösningar, kunskapsutbyte och ständigt lärande. Att ha roligt och samtidigt behålla den familjära andan utan hierarkier är lika viktigt.\n\nVi vill skapa det konsultbolag som du alltid velat jobba för, men kanske inte hittat ännu. Redan idag har vi en blandning av seniora och yngre medarbetare, såväl som män och kvinnor. Det vill vi fortsätta att bygga på. Så välkommen med din ansökan!",
            "apply_options": [
                {
                    "title": "Jobbland",
                    "link": "https://jobbland.se/jobb/senior-android-developer-sasrb-18708498?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbHV0dmVja2xhcmUiLCJjb21wYW55X25hbWUiOiJUZWNoc3RlciBTb2x1dGlvbnMgQUIiLCJhZGRyZXNzX2NpdHkiOiJMdW5kLCBTd2VkZW4iLCJodGlkb2NpZCI6IkRGMm9rOFJjSkpDMUY0VUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVTNkbFpHVnUifQ=="
        },
        {
            "title": "Android Software Engineer with Backend Expertise",
            "company_name": "Readly",
            "location": "Kronoberg, Sweden",
            "via": "Jobrapido.com",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=mcC_7YDmLx0JNy1_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNOwoCMRAAUGz3CNpMLboRwUYrhWVBO_cAks-YRONMyAR2PY8XVZvXvuYza_ojucLRwcD3OuqC0JGPhFhgjDXASdsnkoNuylhqFIQ1nNmAoC42ABP0zD7h_BBqzbJXSiS1Xqqu0baWX4oJDU_qwUb-3CT8lpx0xdt2t5naTH65uKJ26Q2R4FKY2GDxKxhGdEhfvoeiNqYAAAA&shmds=v1_AUFQtOPIlCikO-MqPwALbz63WmwqEedC_MiBfMRQya4TGWug1A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mcC_7YDmLx0JNy1_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850abe1c208be68ff7ca54/images/d284d0e8d1e7bd85b3a3656c3889973effceebf3aa310948d2bb89b0e8410840.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This is Readly\nReadly offers unlimited access to thousands of national and international magazines and newspapers, all in one app. We’ve partnered with 1,200+ world-famous publishers, providing readers with 7,500+ titles and over 290,000 back issues.\n\nWe’re a value-driven ecosystem committed to unlocking a world of editorial content. Our goal is to boost journalistic content consumption through an innovative digital product while minimizing our climate impact. With a dedicated team of 100+ professionals in Sweden, Germany, and the UK, we’re making magazines and trusted journalism more accessible than ever.\n\nAndroid Software Engineer with Backend Expertise\n\nWe are seeking Android engineers to join our mission of delivering world-class magazine apps on Android, iOS, and Web.\n\nAs part of a lean, flat tech organization, you'll contribute to both product features and the evolution of our Android tech stack. Working in autonomous, cross-functional teams, you'll be involved in the entire product development process, from idea to deployment.\n\nWe value curiosity, collaboration, and a passion for development. In addition to Android expertise, backend knowledge—preferably in Node.js—is essential to support full-stack features and smooth front-end/back-end integration. Join us in a skilled and dedicated team at a market-leading company.\n\nWhat you will do\n• Collaborate in a small autonomous team of developers, designers, and a product manager in our mission to continue to provide a best-in-world Android magazine application to the market.\n• Collaborate with other Android developers to jointly shape the direction of our Android tech stack and development processes.\n• Leverage your backend knowledge, preferably in Node.js, to work on full-stack features and enhance the overall functionality of our applications.\n• Collaborate with developers across other stacks to shape the direction of our complete tech stack portfolio.\n• Manage releases in various app stores.\n• Assure code quality through code reviews.\n• Learn a ton of new things and share your knowledge with colleagues.\n• Have fun and take a lot of pride in what you and all of Readly are doing.\n\nWhat we are looking for\n• Ideally, you have 5+ years of professional experience in software development, including 3+ years of Android app development.\n• You have a strong understanding of modern Android development, mobile architecture patterns, and experience with modern Android development tools.\n• You know how to write readable, maintainable, and performant code and care about quality in your work.\n• You possess backend development experience, preferably with Node.js, to support the integration and functionality of our applications.\n• You’re excellent in problem solving and debugging code.\n• Experience working in Agile/Scrum/Kanban-oriented team environments.\n\nWho you are\n• You are passionate about building great products that people love.\n• You have a “can-do mentality,” but you are not afraid to ask questions and seek assistance from colleagues.\n• You value teamwork and collaborative problem-solving, demonstrating good communication skills, empathy, and a team-first mindset.\n• Culture fit – You embody our culture of bravery, humility, and transparency and are passionate about helping us achieve our goals. You understand the importance of curiosity, empower others, and build on a foundation of trust by sharing information openly and proactively.\n\nApplication\n\nDo you feel this is a perfect match? Please apply by clicking the link below!\n\nReadly has been listed on the Allbright list three years in a row for having a gender-balanced management team. Additionally, we are very proud to have a 50/50 gender split among our employees and managers. Maintaining this balance is important to us.\n\nAs many other digital companies acknowledge, tackling the gender gap in the product and tech industry is challenging. We actively encourage women to apply for this position.\n\nReady to make an impact? Apply to join Readly and be part of a team where your work truly matters.\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jobrapido.com",
                    "link": "https://se.jobrapido.com/jobpreview/3542824539996028928?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIEVuZ2luZWVyIHdpdGggQmFja2VuZCBFeHBlcnRpc2UiLCJjb21wYW55X25hbWUiOiJSZWFkbHkiLCJhZGRyZXNzX2NpdHkiOiJLcm9ub2JlcmcsIFN3ZWRlbiIsImh0aWRvY2lkIjoibWNDXzdZRG1MeDBKTnkxX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdVM2RsWkdWdSJ9"
        },
        {
            "title": "Senior Android Platform Developer",
            "company_name": "Swediumglobal",
            "location": "Sweden",
            "via": "Jooble",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=DYgj9zCpssWyfqbSAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMQQrCMBBGYdz2AoKrWQs2IgiiK0EQXAk9QEnaMY2k84dM1B7DI2s3b_EtXvVdVIeGJSDTWfqM0NM92vJAHunCb45InGlDNzhStrkbCEJXwEdenYZSkh6NUY2112JL6OoOo4Gww2SecDqn1cFmTv8vt7v9dqqT-PWy-XAfXqOPcDZSEJqB5QeVBPXskwAAAA&shmds=v1_AUFQtOOApmrNcbDxcs2eUEBTLxyEk1o8I1kkz9rej4Iuk2WVfg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=DYgj9zCpssWyfqbSAAAAAA%3D%3D",
            "extensions": [
                "15 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "15 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Swedium Global is the growing System Engineering and Solution Company, offering services like Semiconductor Engineering R&D Services, Embedded Systems Development, Custom Application Software Development, Web and Cloud Application Development, Testing Services, Consultancy, and Outsourcing services to our clients across the globe for an onsite and offshore business model. Swedium Global has a presence in Sweden, Finland, Poland, Czech Republic, and India.\n\nLocation: Sweden\n\nJob Description: Senior Android Platform Developer\nRoles and Responsibilities\n\nResponsibilities\n• Collaborate with colleagues to contribute to the entire product development lifecycle\n• Drive the development of assigned work packages\n• Safeguard maintainability and code quality\n• Support the team with design reviews and code reviews\n• Facilitate knowledge sharing and team collaboration\n\nWe are looking for individuals passionate about HW solutions, Android development, and working in tight collaboration with customer projects. Key qualifications include:\n• Java, Kotlin, C, C++, Python\n• Jenkins\n• Knowledge of Qualcomm CPUs is a bonus\n• Ability to work in a hybrid environment with up to 1 day remote\nJob Overview\n• Vacancy: 1\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://se.jooble.org/jdp/-1751522667199806133?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBQbGF0Zm9ybSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJTd2VkaXVtZ2xvYmFsIiwiYWRkcmVzc19jaXR5IjoiU3dlZGVuIiwiaHRpZG9jaWQiOiJEWWdqOXpDcHNzV3lmcWJTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1UzZGxaR1Z1In0="
        },
        {
            "title": "Android Software Engineer",
            "company_name": "ECARX",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=BEC4BTIEFJtURTddAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CbrcLNoUwUWnIkVwtItbSdozicS7kjtpP8KP1i5vfMV3VVQ1DZnjAC0_dbIZoSEfCTHDHm7sQNDmPgATXJl9wvU5qI5yMkYklV7UauzLnt-GCR3P5sVOFjoJ_25MVrE7HKu5HMlvN82lvj8gLpsGJPfJfgfthAPSD6Vg062PAAAA&shmds=v1_AUFQtOP4zizMdbDHORNXdmRYsjBsnimn0IgegbQ9RSrfAQ8TXw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=BEC4BTIEFJtURTddAAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "About ECARX\n\nECARX (Nasdaq: ECX) is a global mobility-tech company that partners with leading Original Equipment Manufacturers (OEMs) to reshape the automotive industry as it transitions toward an all-electric future. With innovative technology such as central computers, System-on-a-Chip (SoCs), and software solutions, ECARX is driving the next generation of in-car user experiences. Since its founding in 2017, ECARX has grown to nearly 2,000 employees, and its products have been integrated into over 5 million vehicles worldwide.\n\nAbout the Role\n\nWe are seeking an Android Software Engineer to join our team developing a cutting-edge digital cockpit product, from silicon to pixels, for world-leading vehicle manufacturers. You will work on Android Automotive Operating System (AAOS) and the Android Open Source Project (AOSP) to create applications and frameworks that enhance the in-car user experience. As part of a young and dynamic company, you will have the opportunity to shape both our products and company culture, working in an environment that values initiative, collaboration, and creativity.\n\nWhat You Will Do\n• Develop native platform software for AOSP using the Soong/Make build system, with a focus on high-quality code and user experience.\n• Work on Android app development using Kotlin and Java to build innovative automotive solutions.\n• Collaborate with global teams to define and develop new features, troubleshoot issues, and optimize performance.\n• Contribute to improving the Android software development processes and toolchains.\n• Participate in code reviews, ensuring that all code is efficient, maintainable, and testable.\n• Apply your knowledge of core Android components such as Activities, Services, Content Providers, Broadcast Receivers, and Intents to develop robust applications.\n\nWhat You Need\n• A BSc in Computer Science or equivalent experience in software development.\n• 5+ years of industry experience, preferably with a background in the automotive or infotainment industry.\n• Expertise in Android app development using Kotlin and Java, with proficiency in Android Studio.\n• Hands-on experience in native platform development for AOSP using the Soong/Make build system.\n• Deep understanding of the Android SDK and its core components.\n• Knowledge of Android runtime resource overlays (RRO), privileged apps, and permissions is a plus.\n• Experience with automotive communication protocols and QNX is an advantage.\n• Strong problem-solving skills and the ability to work independently and in a fast-paced environment.\n\nWhy Choose ECARX?\n\nYou will work with talented colleagues in an international and open environment, developing the next generation of in-car experiences. Located in the state-of-the-art Uni3 campus in Lindholmen, you’ll enjoy scenic views of the harbor and exciting new technology projects. We offer a hybrid remote workday, promoting a healthy work-life balance, competitive salaries, and a strong commitment to diversity, which makes ECARX an awesome place to work!\n\nWhat We Offer\n• A collaborative and creative work environment, focused on personal and professional growth.\n• Opportunities to work on cutting-edge technology and shape the future of in-car experiences.\n• A competitive salary and a hybrid remote work arrangement.\n• A modern office with great amenities and an on-site restaurant featuring Asian fusion flavors.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://se.indeed.com/viewjob?jk=7f993b13fc9dff8c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRUNBUlgiLCJhZGRyZXNzX2NpdHkiOiJHb3RoZW5idXJnLCBTd2VkZW4iLCJodGlkb2NpZCI6IkJFQzRCVElFRkp0VVJUZGRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVTNkbFpHVnUifQ=="
        },
        {
            "title": "Software Engineer, Google Meet Interoperability/Rooms Media, Android",
            "company_name": "Google",
            "location": "Stockholm, Sweden",
            "via": "Taro",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=zpnPI5u2jcvn1yj-AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y2OMQrCQBAAsc0TtNlaYk4EG60sRBRsTGkhl7s1Ob3shtuFxJf5PSOkmWZgmOw7y-4lP7W3CeFIdSDElMOJuY4IV0SFMykm7jDZKsSgH3NjbmV0PtgcDuQTBw8ruHAFgja5BpimwnzfqHayM0YkFrWo1eAKx61hwooH8-JK_nhIMx500So-Ntv1UHRULxfTRiAold274djmUPbokX4fspP4ugAAAA&shmds=v1_AUFQtONku6LfYXqwHp4I_Rw8EDmVJS1Yvyg8tNTnIzpzI6MaiQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=zpnPI5u2jcvn1yj-AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Mid-level Software Engineer position at Google, focusing on Android development for Google Meet Interoperability and Rooms Media systems in Stockholm.",
            "apply_options": [
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/google/software-engineer-google-meet-interoperabilityrooms-media-android-030ca8c8/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgR29vZ2xlIE1lZXQgSW50ZXJvcGVyYWJpbGl0eS9Sb29tcyBNZWRpYSwgQW5kcm9pZCIsImNvbXBhbnlfbmFtZSI6Ikdvb2dsZSIsImFkZHJlc3NfY2l0eSI6IlN0b2NraG9sbSwgU3dlZGVuIiwiaHRpZG9jaWQiOiJ6cG5QSTV1Mmpjdm4xeWotQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1UzZGxaR1Z1In0="
        },
        {
            "title": "Android Developer / CTS Expert",
            "company_name": "Luxoft",
            "location": "Sweden",
            "via": "Jooble",
            "share_link": "https://www.google.se/search?ibp=htl;jobs&q=Android+developer&htidocid=suEGYqOype_oUVUXAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQrCMBAAUFw7OTvdLJiI0EUnqSKIW91Lkp5NJOZC7tR8gd-tLo_XfGZNu09joTDCAV8YKWMBDd21h2P9XWAFZ7LAaIrzQAlORFPExc6LZN5qzRzVxGIkOOXooSmhparvZPnPwN4UzNEIDpt2XVVO03J-eVa6CYQE_RtHTF-CZ3w_iQAAAA&shmds=v1_AUFQtOMlSBAqpyfZAzCXuoFmB6WnGXJ0hs7eaFAtnrgLWXkoYQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=suEGYqOype_oUVUXAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850abe1c208be68ff7ca54/images/d284d0e8d1e7bd8590ad56e8a331b29609f5188eb2ab358bb004536575d15be7.gif",
            "extensions": [
                "5 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Project description\n\nOur new Android Automotive IVI project is looking for an Expert Automotive HAL Developer for an agile project development team. It is an ongoing development project for one of our OEM customers, featuring state of the art and innovative functionalities and technologies.\n\nOur team: Global team of professionals in the automotive industry with experience in innovative development.\n\nResponsibilities\n• Work inside an intercultural team of many layers and competencies around software engineering, architecture, and development.\n• Primarily responsible for analysing results of Google's CTS tests.\n• Identify any issues that impact the successful execution of CTS.\n\nSKILLS\n\nMust have\n• Deep expertise in Google CTS tests.\n• Strong Android skills - 5+ years experience.\n• Strong C++ skills - 5+ years experience.\n• Strong Java skills - 5+ years experience.\n• Experience working with Git.\n\nNice to have\n• Docker\n• AUTOSAR (AUTomotive Open System ARchitecture)\n• Linux\n• Gerrit\n• GitHub\n• AOSP\n• Atlassian Confluence\n• Atlassian Jira\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://se.jooble.org/jdp/-3772465007171043237?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://se.indeed.com/viewjob?jk=94e8ee8a60ef1fc9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobbsafari",
                    "link": "https://jobbsafari.se/jobb/android-developer-cts-expert-scsom-18776651?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://se.linkedin.com/jobs/view/senior-android-developer-cts-expert-at-luxoft-4119715579?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAvIENUUyBFeHBlcnQiLCJjb21wYW55X25hbWUiOiJMdXhvZnQiLCJhZGRyZXNzX2NpdHkiOiJTd2VkZW4iLCJodGlkb2NpZCI6InN1RUdZcU95cGVfb1VWVVhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHVTNkbFpHVnUifQ=="
        }
    ]
}