{
    "search_metadata": {
        "id": "67850ad69c4c1734c296b41e",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/be332f354a0b5816/67850ad69c4c1734c296b41e.json",
        "created_at": "2025-01-13 12:45:10 UTC",
        "processed_at": "2025-01-13 12:45:10 UTC",
        "google_jobs_url": "https://www.google.co.uk/async/callback:550?q=Android+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=ErcCCvcBQUpHOUprT0hsQ2tyNkNBVkhsVTM5UFh2UWc3RlF6TXVYNzVhdmY0LWRka0FKTm1aMWpSdHJiWkdFM2JUWkJGY0ZxWEd0WlpVUzNlaDZzV0lXQjc1NW1fdmxnbjB5RG1lbjBTZ3g5R2tLcng2M0l4M3phYmFYRzlDV2UzWTRXUXkxaTV3azBqUmhRWmtDQ1VfYU9fWWZFYjViTk0yN0V6SUFSdTBNcXVRTTdDNlNHblVvaTJDSjUzclNJZVJhT1VLNWI0R1Z4a2xFMmJwNGVfSWg0b250SngxVkxiRWRtdmI3Uy0zZDdKOXAyVkt4NmU1OFBORHJwZxIXMVFxRlo0NmhIY0dZd2JrUDdkcmg2QUUaIkFGWHJFY3BJd0VxT21WdUozWEZYdGQzd1U1OE5YQUtCUHc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/be332f354a0b5816/67850ad69c4c1734c296b41e.html",
        "prettify_html_file": "https://serpapi.com/searches/be332f354a0b5816/67850ad69c4c1734c296b41e.prettify",
        "total_time_taken": 1.32
    },
    "search_parameters": {
        "q": "Android developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.co.uk",
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJUMGhzUTJ0eU5rTkJWa2hzVlRNNVVGaDJVV2MzUmxGNlRYVllOelZoZG1ZMExXUmthMEZLVG0xYU1XcFNkSEppV2tkRk0ySlVXa0pHWTBaeFdFZDBXbHBWVXpObGFEWnpWMGxYUWpjMU5XMWZkbXhuYmpCNVJHMWxiakJUWjNnNVIydExjbmcyTTBsNE0zcGhZbUZZUnpsRFYyVXpXVFJYVVhreGFUVjNhekJxVW1oUldtdERRMVZmWVU5ZldXWkZZalZpVGsweU4wVjZTVUZTZFRCTmNYVlJUVGRETmxOSGJsVnZhVEpEU2pVemNsTkpaVkpoVDFWTE5XSTBSMVo0YTJ4Rk1tSndOR1ZmU1dnMGIyNTBTbmd4Vmt4aVJXUnRkbUkzVXkwelpEZEtPWEF5Vmt0NE5tVTFPRkJPUkhKd1p4SVhNVkZ4UmxvME5taElZMGRaZDJKclVEZGtjbWcyUVVVYUlrRkdXSEpGWTNCSmQwVnhUMjFXZFVveldFWllkR1F6ZDFVMU9FNVlRVXRDVUhjIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Android Developer (Hybrid)",
            "company_name": "AES",
            "location": "Cambridge, United Kingdom",
            "via": "Adzuna",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=mUUAVkRwRWlv1dNYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU43qmijgkudioqioziXpDnSSHIXckHqb_jF0uWtr_rNql1LNrO3cMYPBk6YYXH7muztEjZwZwOCOvcDMMGV2QWcH4dSkjRKiYTaSdHF93XPUTGh4VG92chEJ4POmIIu2O0P27FO5FbQXp7gCU46TonDNbzIF7Tw8OQsxz8CvS7WlQAAAA&shmds=v1_AUFQtOMPp4klP1BsV1pSmCs8IqQbTUS5rw2vr8IFFglQRtTPJQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=mUUAVkRwRWlv1dNYAAAAAA%3D%3D",
            "extensions": [
                "£75K–£85K a year",
                "Full-time"
            ],
            "detected_extensions": {
                "salary": "£75K–£85K a year",
                "schedule_type": "Full-time"
            },
            "description": "Position: Android Developer (Hybrid)\n\nLocation: Cambridgeshire\n\nSalary: £75,000 to £85,000 + Excellent Benefits / Prospects (including Relocation Assistance)\n\nIf there is something stopping you from achieving all you’re capable of, you’ll relish a role with a company that will positively encourage you to be pro-active – a real opportunity to release your true potential.\n\nThe Company: Our Client, an innovative dynamic passionate reliable collaborator for public safety users and commercial customers, my client excels in adapting to the evolving landscape of the Voice Communication Sector.\n\nOwing to ongoing expansion, they now need an Android Developer to assist with the development, configuration, and optimization of the Android platform, modifications to the Android framework/services, and the Android development toolchain. While experience in developing Android apps is beneficial, this role is not focused on Android app development.\n\nThe Person: Candidates suitable for consideration should be able to provide evidence of the following:\n• A HNC/D / Degree in Software Engineering (or similar) or be a Time Served Engineer with relevant experience\n• Good understanding of the Android architecture and ecosystem (including low level and security)\n• Understanding of the Android SDK and APIs (especially telecoms and networking)\n• Experience with most of the following: Binder / AIDL / Services (C++/Java) / Framework APIs / NDK, JNI & CTS\n\nThe successful candidate will enjoy a salary of between £75,000 to £85,000 (DOE) + Excellent Benefits / Prospects (including Relocation Assistance), an employment package that you would expect from a company that values its employees.\n\nDo you have the courage to take on this challenge?",
            "apply_options": [
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/4926354032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/e4d6943f1261e166fea55f7554a5cbb7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/aes/android-developer-hybrid-143965/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=11a099e5eba9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAoSHlicmlkKSIsImNvbXBhbnlfbmFtZSI6IkFFUyIsImFkZHJlc3NfY2l0eSI6IkNhbWJyaWRnZSwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Im1VVUFWa1J3UldsdjFkTllBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior Software Engineer (Android)",
            "company_name": "Myunidaysltd",
            "location": "United Kingdom",
            "via": "AndroidDev.careers",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=bWrpPvRg3dqOqRWAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCQAwAUFz7CQ6SUQV7Ijiok4MIilNxLtdevEbapFwitn_i56rLG1_2mWS7ApkkQSEPe_uEcOJIjJhgfuSQhMICVnCRChR9qhsQhrNIbHF6aMx63Tun2uZRzRvVeS2dE8ZKBveUSv-U2vzivvWG5Wa7HvKe43J2G19MwY_aWgBiuDMZBrgSxyDdFzp3mSmbAAAA&shmds=v1_AUFQtOO_X7Y2a2CiBV_mpPioHO2P6IVwDtA3p4DUX51bNM5ZEA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=bWrpPvRg3dqOqRWAAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "*this role is open to remote working within the UK. Successful candidates will be required to travel to their closest UNiDAYS campus (London or Nottingham) on occasion.\n\nThe role in a nutshell\n\nA Senior Software Engineer in UNiDAYS is a hands-on software development role focused on building innovative solutions to delight our members and drive product success in a fast-paced company.\n\nIt’s more than just lines of code; we are looking for a commercially-minded Senior Software Engineer who can bridge the gap between user needs and business goals. You will have the ability to build resilient, cost-effective solutions and navigate evolving market demands.\n\nYou will be working closely alongside the rest of our product and engineering teams while defining, refining, building, and measuring the impact of the solutions you implement. These may be across our portfolio of marketplace products, identity products, or elsewhere as the business grows.\n\nIn order to be successful in this role, you will need to translate user needs into market-winning solutions, all while navigating technical challenges and ensuring commercial viability.\n\nYou will need an inquisitive mind as we continue to work with bleeding-edge technologies and split our core business logic out into Kotlin Multiplatform libraries (Note that prior experience with KMP is not required; on-the-job training/learning is fully supported).\n\nDay to day responsibilities\n• Working in a cross-functional product team to build end-to-end solutions. This will involve taking part in the standard agile ceremonies, as well as collaborating with other team members in addition to designing/writing/debugging/testing/shipping/supporting the code you develop\n• Deliver impactful features with a pragmatic approach\n• Use your technical knowledge and experience to solve problems in the most appropriate way - balancing risks, constraints, user needs, and business needs\n• Championing user-centric solutions with a keen eye on market fit and profitability\n• Representing Android concerns within the team\n• Be an active contributor and promoter of the wider Android and Mobile team\n• You will work closely with your teammates to ensure the direction and standards set out for the team are delivered\n• Monitoring platform/feature performance & crashes, flagging issues, and writing tickets to address\n• Contribute to the design and architecture of software systems, ensuring that they are scalable, efficient, and maintainable\n• Collaborating with external stakeholders and peers\n• Support and challenge software engineers through pairing, knowledge sharing, documentation, and mentoring\n• From time to time - support our interview process by attending interviews, task assessments, and candidate feedback\n\nWhat we need from you\n\nIn order to be your best self in this role, you will be/have:\n• Passionate about member experience and creating meaningful experiences for our users\n• Passionate about the Android and mobile problem space\n• Experience working in a cross-functional team and representing Android and mobile concerns\n• Ability to adapt and persevere through complex problem\n• Leadership skills\n• Able to motivate and mentor others\n• Strong problem-solving skills and attention to detail\n• Excellent communication and collaboration skills\n• Understanding of software development concepts\n• Proficient in Kotlin and to a lesser extent, Java\n• Proficient with Kotlin coroutines and flows\n• Experience with unit testing\n• Knowledge of REST APIs, 3rd Party SDK integration\n• Strong understanding of agile methodologies such as scrum, kanban etc.\n• Use of GIT and related tools\n\nNice to Have\n• Jetpack Compose\n• Kotlin Multiplatform\n• Firebase Remote Config / Crashlytics\n• Continuous Integration\n• Reactive Programming patterns\n• UI Automation testing\n• Proficient with Kotlin coroutines and flows\n\nWe’re aware that everybody is different and comes with differing experiences. If you don’t have all of the skills/experience in our list but are keen to learn and offer something different, please reach out as we are still keen to talk to you.\n\nPerks\n\nWe've accomplished a lot since we started in 2011, but in many ways, this is just the beginning. This is the chance for you to get in on ground zero. An opportunity to make a difference within the business with global reach. We are the world’s largest Student Affinity Network, with over 22 million verified members in 115 markets including the US, UK, Germany, India, Canada and Australia. We work with 800 of the world’s biggest brands globally, taking their products and services into the hearts and minds of tomorrow’s professionals, delivering engagement, building affinity and sales. You’ll also be working for a Great Place to Work CertifiedTM company who have been recognised on the UK’s Best WorkplacesTM for Wellbeing and UK's Best Workplaces for Women 2022 list. To find out more about our workplace initiatives, see our UK exclusive case study with Great Place to Work and be sure to visit our profile for more information.\n\nWe offer a fast paced, fun & social working environment where you can truly make an impact. We believe that work should enhance and complement your life which is why we leave it up to you to decide where you work. You can choose to work from your assigned campus (either Nottingham or London) or from home, whatever works best for your individual needs. Your manager may request you attend team meet ups at your campus but other than that it is up to you! We work hard at UNiDAYS, but we also believe in fair compensation for hard work. That's why we're pleased to offer all employees full access to our comprehensive benefits package.\n\nOur perks include:\n• 25 days holiday per year increasing with length of service, plus flexible bank holidays\n• Competitive salaries\n• 4pm finishes every Friday\n• Company bonus scheme\n• Company pension scheme\n• Private health insurance (Vitality)\n• Income protection policy\n• Life assurance policy\n• Employee Assistance Program\n• Enhanced parental leave pay\n• Core hours with flexibility around how/when you manage your time\n• Regular team building activities\n• The latest tech and hardware will be supplied from day one\n• Good Vibes Program: we know we’ve all had to adapt to new ways of working and UNiDAYS has always taken pride in the community we’ve created in the office but we’re just as committed to creating an innovative approach to fostering connections and improving engagement outside of the office! We want to boost your remote working experience so think virtual parties, pottery classes, wellness classes and guest speakers just to name a few!\n• Support for home working for all new team members. We will help assess your home set up and you can expense £150 towards any additional furniture you may need to be safe and comfortable when working from home\n\nAbout our Product & Engineering team\n\nThe driving force behind this fantastic tech business are the talented Product and Engineering team, who work collaboratively to ensure that UNiDAYS stays one step ahead of the competition, with the ultimate goal of giving students the power to make every experience more valuable and rewarding.\n\nThe Product and Engineering teams at UNiDAYS are comprised of a bunch of passionate people who work in a fun, fast paced and social environment. Everyone is equal and encouraged to work with each other, whilst having the autonomy to solve problems in the best way they see fit.\n\nThe UNiDAYS tech team are passionate about the local Tech Community, hosting and sponsoring local meet ups and hack events. Career development is an important facet of the UNiDAYS tech experience.\n\nListen to the episode on The Diverse Podcast here: https://podcasts.apple.com/gb/podcast/47-how-to-build-your-dream-career-in-tech/id1515585546?i=1000587931714\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, colour, national origin, gender, sexual orientation, age, marital status, veteran status or disability status.",
            "apply_options": [
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/senior-software-engineer-android-at-myunidaysltd-242?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/gb/job/senior-software-engineer-android--united-kingdom--e253e78dabf3061e15d0dfd8171dcdaa9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The BIG Jobsite",
                    "link": "https://www.thebigjobsite.com/details/69B04730274E1839B78E3DF0BCAE0489/senior-software-engineer--android?source=attbus&utm_source=googlejobs&utm_medium=api2&key=4C8E2B6E7749F421C6822B0CDF5C189D&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgKEFuZHJvaWQpIiwiY29tcGFueV9uYW1lIjoiTXl1bmlkYXlzbHRkIiwiYWRkcmVzc19jaXR5IjoiVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImJXcnBQdlJnM2RxT3FSV0FBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior Android Engineer",
            "company_name": "Gymshark",
            "location": "Solihull, United Kingdom",
            "via": "Startup Jobs",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=ca-9onJjcEUXHmf8AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7CU43OIkmIrjo5CAFHYtzSZsjOU3uSi5C_Q5_WLq84TW_VWM6ZJICV_ZFyMONAzFigT3cZQBFV8YIwtCKhITrS6x10rO1qskEra7SaEbJVhgHme1LBl3oNbqCU3IV--PpMJuJw3bTfvPybyCGThLFT0o7eDJV9PAgDl7yH3dlyVCWAAAA&shmds=v1_AUFQtOOhFFtwFA3kj81UZI7ymodTwPLhFxteW46Frlf5InppKQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ca-9onJjcEUXHmf8AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3d7d4158f4692a7b3d1ae194a5259918806654adcb8a5324a4.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "OVERVIEW:\n\nAre you ready to influence mobile innovation?\n\nWe're seeking a Senior Android Engineer with a passion for cutting-edge Android development to shape the future of our Training App. If you're experienced in leveraging device features as well as an expert in producing clean architecture using Kotlin, we want you!\n\nThis role offers a unique opportunity to mentor Junior Developers, guide cross-functional teams, and build offline-first apps that sync seamlessly across devices, ensuring data integrity even in low-bandwidth environments. With a strong background in API integration, cloud services (Firebase, AWS), and mobile security best practices, you’ll influence technical direction, explore new technologies, and push the boundaries of fitness and health apps.\n\nJoin us and lead the way in creating state-of-the-art mobile experiences!\n\nWHAT YOU'LL BE DOING:\n\n• Playing a major part in people leadership\n• Influence application development\n• Be part of technical ideation\n• Utilising your knowledge and experience in kotlin to produce an excellent, cutting edge codebase\n• Taking responsibility of data management for off line applications\n• Implementing coding best practice amongst the team\n• Playing a key part in driving the development of applications\n\nWHAT YOU'LL NEED:\n\nEssential Criteria:\n\n• Hands of delivery of mobile solutions according to the sprint backlog\n• Ensure solutions delivered add value to users\n• Coordinate and instrumenting overarching design in accordance to the architectural vision\n• Perform a suitable degree of testing\n• Raising technical constraints and solutions to Product Owner and working on feasible solution and next steps\n• Defining engineering KPIs with the Lead Engineer to ensure consistent design and delivery\n• Extensive knowledge and experience with Kotlin and Jetpack compose\n\nThis is a hybrid role and would require the successful candidate to attend at least 3 days a week in GSIQ, Solihull, UK.\n\nCLOSING DATE: 2nd October 2024\n\nBELONGING AT GYMSHARK.\n\nOur mission is to be a place where everyone belongs. We’re an equal opportunities employer, and for us that means we always strive to be as inclusive as possible in all aspects of employment, right from your application. We’re committed to finding reasonable adjustments* for candidates with specific needs or have a disability during our recruitment process, and all applicants will be considered fairly and equally. We do not tolerate discrimination of any kind. *If you’d like to request a reasonable adjustment please email talent@gymshark.com.\n\nABOUT US.\n\nWe’re here to unite the conditioning community. We believe that putting the sweat in today, prepares us for tomorrow. So, we give people the tools they need to reach further, go faster, be stronger. We celebrate those who show up – for themselves – to be their physical or mental best, whatever that means for them. It’s what we want for our community, and our team. A team that’s growing rapidly around the world. A collective of talented individuals working together to invent Gymshark’s future. Our plans are ambitious, and we’re looking for people who want to join us for the ride – our growth will be your growth.\n\nTHE PERKS.\n\n🙌 Competitive ‘Win Together, Lose Together’ Bonus\n🩺 Choice of Private Medical Insurance or Healthcare Cash Plan, paid for by us!\n🏖 25 days holidays + your birthday and all the Bank Holidays which can be substituted and taken whenever you want.\n💻 A truly Flexible Working Culture\n👥 A collaborative, creative and inspiring working environment\n💰 Employer pension contributions up to 7%\n🤩 Life Assurance at four times your basic salary\n🦈 50% Gymshark Discount\n🎁 Gymshark Gift Card for each year of service\n🛍️ Discounts, Cashback and Savings programme\n🥇 Financial, Physical and Mental Wellbeing Support\n📚 Great Training and Learning Resources\n🖥 Choice of hardware and access to the best software\n🤒 Paid time off when you’re physically and mentally unwell\n🧸 Very Generous Family Leave package – we support you extending your family\n🍎 Refuel - Healthy fresh food at GSHQ\n🏋️‍♂️ Lifting Club (LC) Gym Membership\n👉 Free monthly massages\n💈 Beauty and Barber facilities\n🚘 Free on-site parking\n\n#LI-MA",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-android-engineer-gymshark-5879741?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6Ikd5bXNoYXJrIiwiYWRkcmVzc19jaXR5IjoiU29saWh1bGwsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJjYS05b25KamNFVVhIbWY4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Remote Senior Android Developer",
            "company_name": "Tomorrow GmbH",
            "location": "United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=EvRIu0kFEvPvGJieAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBQGUFz7CC7eWbARQQedBKGimz9zSZpLGknuF5KgfRKfVzzDab6zZnfjiMp0Z_HIdBSb4S2d-M0BiTOt6AJDhXUeRoJQB7jA88NYayp7pUoJrStVVz-0A6KCsMGkXjDlX19GnTkFXbnfbNdTm8QtFw9E5IwPddGcyQs9xVe2dPXiLOIPu4K70pkAAAA&shmds=v1_AUFQtOMNfjGUKQ0tExrh6NHxX96OmtNz5yZb_Wq5dN6WoY76Og&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=EvRIu0kFEvPvGJieAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3da2fefb69ab6fd6ff210e1fcce26247265fbe3c2027500f50.gif",
            "extensions": [
                "6 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "The Role\n\nWe are committed to establishing sustainable finance as a cornerstone of society. This ambitious goal requires dedication and expertise, particularly in the development of our Mobile Banking App.\nKey Responsibilities\n• Contribute to the ongoing enhancement and development of our Mobile Banking App using modern Android technologies and features.\n• Collaborate with cross-functional teams, including Mobile and Backend Developers, Designers, and Product Owners, in an agile environment with regular release cycles.\nRequirements\n• A minimum of several years of experience in building Android apps using Kotlin and other modern technologies.\n• Strong understanding of testing processes to ensure high-quality app development from user interface to maintainable architecture and source code.\n• Familiarity with KMP, Jetpack Compose, and other latest Android platform features is a plus.\n• Excellent English language skills.\n• Passion for creating a better future through sustainable finance.\nWhat We Offer\n\nA dynamic work environment with over 100 like-minded colleagues, promoting innovation and progress towards our shared goals. Our culture emphasizes values, active new work philosophy, and clear objectives.\nSalary\n\nAn annual gross salary range of 67,000-85,000 EUR, plus a one-time bonus of 5,000 EUR in virtual shares.\nRemote Work Options\n\nWe offer flexible working hours and remote work opportunities, allowing employees to balance their personal life and work requirements. However, we also believe in the benefits of in-person collaboration and expect our Senior Android Engineer to spend at least 3 days per quarter working on-site in our office in Hamburg.",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/7e4c658b5f21a2920dc81809fe9a39d9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJSZW1vdGUgU2VuaW9yIEFuZHJvaWQgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVG9tb3Jyb3cgR21iSCIsImFkZHJlc3NfY2l0eSI6IlVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJFdlJJdTBrRkV2UHZHSmllQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Android Engineer - DriveScore",
            "company_name": "ClearScore",
            "location": "London, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=1MulZAHFdxqHYAPOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXMsQrCMBCAYVz7CE43OIk2IrroJCqCuolzSZMjOUnvSi5IX8W3teLyw7981WdSbQ7ss5CHMwdixAxLOGV648NJxnGu0oKizS6CMFxEQsLpPpbS684Y1VQHLbaQq510RhhbGcxLWv2l0Wgz9skWbNbb1VD3HOazYxq9v08Md2EvvIAnU0EPN-LgpfsC_tpXr5wAAAA&shmds=v1_AUFQtOPJ5Cw2s36RRn9o6X8FQEW-i_PYQTQRZwI1vYkGLKjFKA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=1MulZAHFdxqHYAPOAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3d3ab8f0900f690df7512d9301fa3808c0047437970de2ea1b.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We're looking for a Android Engineer to join DriveScore, a fast-growing scale-up business within the ClearScore Group. DriveScore’s mission is to disrupt the car insurance market by making it more transparent, accessible, and user-centric than ever before. Leveraging cutting-edge telematics technology and data analytics, DriveScore provides users with personalised car insurance offers and insights, helping people make informed decisions about their car insurance needs.\n\nYou will be joining a team of talented engineers from around the world, working in an interdisciplinary squad on the DriveScore app. You will develop experiences that are as beautiful and visually complex as they are helpful and optimised.\n\nSkills we'd love you to have:\n• End-to-end delivery of fully-fledged commercial apps\n• Good knowledge of Kotlin and Android SDK\n• Experience with Kotlin Multiplatform\n• Good understanding of design patterns & Object Oriented Programming\n• Good knowledge of Android UI design principles, patterns, and best practices In-depth experience of working with RESTful APIs\n• Hands on experience with UI/Unit Testing\n• Good knowledge of version control using Git and Gitflow\n• Experience working in an Agile Scrum environment and collaborative tools (e.g. Jira)\n• Understanding of build processes and CI tooling (e.g. Bitrise, Fastlane, GitHub Actions)\n• Knowledge of other related tech stacks, such as web or backend\n• Experience with various Dependency Injection libraries (e.g. Koin, Dagger, Hilt)\n• Experience working with multi-module projects\n\nWe are always looking for ways to do things better and encourage new joiners to bring their ideas and ways of working to the table. Teach us some cool stuff and we'll teach you some, but most of all, you'll have fun doing it.\n\nFor more information on our tech stack check out our Tech Radar 2024, how we work is summarised in our Engineering Principles and we have many other Tech Blogs on Medium.\n\nWhy ClearScore?\n\nClearScore is the UK's #1 credit score and report app. We are also present in South Africa, Australia and Canada, with more than 20 million users globally and growing fast. Someone joins ClearScore every 20 seconds.\n\nWe have established relationships with over 50 of the main lenders in the U.K., and have been a trusted tool for customers to manage their credit and make better financial decisions.\n\nSince October 2016 we have helped 1.8 million users take out a new credit card or loan. We are user-centric at our core and we believe in leveraging technology to enable positive financial choices. We are design-led and data-driven and we embed these behaviours in everything we do.\n\nWhat is DriveScore?\n\nDriveScore is a new app that helps users to prove and improve their driving skills, enabling them to save money on car insurance and other products. ****Our beautiful, insightful, and private app puts users in control of the data collected as they drive, making driving a safer, cleaner, and fairer experience for all.\n\nBeing part of the ClearScore Group means we can market to ClearScore's existing 15 million users in the UK and provides funding to take our message out to the broader market. While we operate as a separate start-up team, we benefit from access to the best of ClearScore's market-leading capability, from technology to CRM.\n\nClearScore's culture is fundamental to the success it has achieved, and we're cultivating that same culture in DriveScore. We believe in hiring smart, driven, passionate and diverse people who are keen on having a real impact in our organisation. We trust you to manage your own time so we offer flexible work and no fixed desk hours. We don't micromanage and we believe in measuring outcomes rather than effort. We have an inclusive culture where all, regardless of seniority, are encouraged to contribute with their ideas, look after their wellbeing and actively seek opportunities for career growth.\n\nIf you feel like this could be the place for you, apply and our Talent team will be happy to share more.\n\nBenefits:\n• 25 paid holidays and a “duvet day” on your birthday\n• Hybrid Work Environment\n• Private health and dental cover - including mental health support through Bupa\n• GP office visits\n• Life assurance scheme\n• Up to 6% matched pension\n• Regular Lunch and Learns with guest speakers\n• Dog-friendly office\n• Daily breakfast and free snacks\n• Access to discounts via Cobens Extras\n• Free sports and social clubs\n• Continued investment into learning and development\n• Leadership-led training\n• In-house psychotherapist\n• Financial coach to help you plan and achieve your goals\n• No clock-watching culture\n• Generous maternity and paternity plans\n• Culture and inclusion representatives\n• Transparent pay structure and a career growth plan\n\nEqual Opportunities\n\nClearScore is committed to providing equal employment opportunities to all qualified individuals. As an equal opportunity employer, we are able to make reasonable adjustments to accommodate individuals with disabilities during the recruitment and selection process. If you require accommodation, please inform us in advance, and we will work with you to meet your needs.\n\nOur Hybrid Model\n\nWe embrace a dynamic hybrid work environment that balances flexibility with collaborative in-person experiences. Our approach is designed to foster innovation, team connection, and individual productivity.\n• Levels 1-5: Minimum 2 days per week in-office\n• Level 6 and above: Minimum 3 days per week in-office\n\nWe believe this structure offers the best of both worlds - the flexibility of remote work and the synergy of face-to-face collaboration. Our office days are carefully coordinated to maximise team interactions and learning/ mentorship opportunities.\n\nWhat This Means for You:\n• Flexibility to manage your work and life\n• Dedicated in-office days for team building and collaborative projects\n• Office facilities (with plants!) designed for productive interactions\n• Clear expectations and support for maintaining our hybrid schedule\n\nWe’re committed to creating an inclusive environment that accommodates diverse needs while maintaining our collaborative culture. Join us in shaping the future of work!\n\nNote: While we offer flexibility, commitment to our hybrid schedule is an important aspect of our team culture and performance expectations.\n\nInclusion Policy\n\nWe are always looking for talented individuals to join ClearScore. We are an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for our people. Please see our People Policy Notice at https://www.clearscore.com/people-notice.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/android-engineer-drivescore-at-clearscore-4102521319?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/android-engineer-drivescore/3699774?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In London",
                    "link": "https://builtinlondon.uk/job/android-engineer-drivescore/3699774?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/4987147695?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://uk.jooble.org/jdp/-7679907138459312631?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Brookson Jobsboard",
                    "link": "https://jobsboard.brookson.co.uk/job/8259913/android-developer-contract/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Remote",
                    "link": "https://remote.com/jobs/clearscore-technology-limited-c1gng2ov/android-engineer-drivescore-j1m1ch5d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WKRN Jobs",
                    "link": "https://jobs.wkrn.com/jobs/android-developer-edtech-london/1543352915-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyIC0gRHJpdmVTY29yZSIsImNvbXBhbnlfbmFtZSI6IkNsZWFyU2NvcmUiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiIxTXVsWkFIRmR4cUhZQVBPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Android Engineer, New Interfaces at Nothing",
            "company_name": "Nothing",
            "location": "London, United Kingdom",
            "via": "Peerlist",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=-qboOF38QnIa9YLRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXMvwrCMBCAcVz7CE7nKrURwUUnBRH_0M25pMk1ibR3JXdgH8gHVQeXb_gNX_GeFccD-czJw4lCIsRcQo0vuJBi7qxDAatQs8ZEAVZw5RYEbXYRmODMHHqc76PqKDtjRPoqiFpNrnI8GCZseTJPbuWXRqLNOPZWsdls11M1Ulgu_vNEcGfyTCU8KCl6uH3Z8_AB5RSwdqcAAAA&shmds=v1_AUFQtOO5XXL2Rf871IOAfhq6k6bJLd4NztShBmjZTEkz-BNVKQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=-qboOF38QnIa9YLRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3dc13d5e3629f46c6aec47ce6e655cff74ff019056cc1c318a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Nothing is hiring with Peerlist for a Full-time Android Engineer, New Interfaces. Required skills: Android SDK,TensorFlow,Pytorch,Caffe,Java,Kotlin,C/C++",
            "apply_options": [
                {
                    "title": "Peerlist",
                    "link": "https://peerlist.io/company/nothing/careers/android-engineer-new-interfaces/jobha9nro7qggjanoikodgpmldqgga?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIEVuZ2luZWVyLCBOZXcgSW50ZXJmYWNlcyBhdCBOb3RoaW5nIiwiY29tcGFueV9uYW1lIjoiTm90aGluZyIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Ii1xYm9PRjM4UW5JYTlZTFJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior Android Platform Developer",
            "company_name": "Polytec Personnel Ltd",
            "location": "United Kingdom",
            "via": "StudySmarter - Talents",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=ELHteNp7qs7mzYWiAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU63CYKNCILoVBAEdSiIc0mTM42kdyF3SP0bP1Vd3viqz6za3ZAiF2jIF44e2mT1wWWEI74wccYCKzhzD4K2uAGY4MQcEs4Pg2qWvTEiqQ6iVqOrHY-GCXuezJN7-dPJYAvm34vdZrue6kxhuWg5vRUdtFiEiTDBVT1EgjtFRQ-XSMHz-AUb0TaEowAAAA&shmds=v1_AUFQtOP8D4welBJd5N4vZZ1Vqz-CtJWH5P_ktH8j6Ax5K4IvqA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=ELHteNp7qs7mzYWiAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Location: Cambridge (CB25) Duration: Permanent Hours: 9am until 5:30pm (Monday to Friday) Salary: £70000 - £85000 Job Reference: 35490 Polytec are looking for a Senior Android Platform Software Engineer for our client based just north of Cambridge. You will focus on the development, configuration and tuning of the Android platform, Android framework/service alterations and the Android development toolchain. Responsibilities: * Android platform development, kernel configuration * Trialling and integrating open-source development tools * Monitoring relevant Android community mailing lists * Prototyping of demonstration systems to generate early feedback * Production of architectural, design and test specifications * Integration testing, investigation and resolution of issues * Project planning and technical reviews Requirements: * Degree in a relevant field * Significant contribution to the platform development of a commercially released product using Android * Good understanding of Android architecture and ecosystem * Understanding of the Android SDK and APIs (especially telecoms and networking) * Experience optimising Android performance * Experience with Binder, AIDL, Services (C++/Java), Framework APIs, NDK, JNI and CTS * Excellent knowledge of the C++ programming language in real-time multi-processor, multi-threaded, event-driven software * Experience of developing for mobile platforms Please contact us as soon as possible for more details or apply below",
            "apply_options": [
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.co.uk/companies/polytec-personnel-ltd/senior-android-platform-developer-111303/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://uk.jobrapido.com/jobpreview/425077972756594688?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBQbGF0Zm9ybSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJQb2x5dGVjIFBlcnNvbm5lbCBMdGQiLCJhZGRyZXNzX2NpdHkiOiJVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiRUxIdGVOcDdxczdtellXaUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Senior Android Developer – Remote",
            "company_name": "Ada Meher",
            "location": "Reigate, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=Mzr1xDEKT_MLxnCcAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQrCMBSAYVx7BKc3OIk2IrjUqSAIioviXNLmkTxJ3gtJkI7ewQN4N09iXf7lH77qM6uaGzJJgpZNEjJwwCd6iZjg-3rDFYMUhDWcpIeMOg0OhOEoYj3O966UmBulcva1zUUXGupBghLGXkb1kD7_02WnE0avC3bb3WasI9vlojUaLugmiXiCyE57BXemggbOxNZI-AFiU7GaogAAAA&shmds=v1_AUFQtOM7GMB_5f0ymb3mE0SKLP4DUVVgTsRp0iZeN7lbdFg8RA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=Mzr1xDEKT_MLxnCcAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3d56ddebf5e606a2a2dc07ef2cc061047dc2973dc0eec4ae6a.gif",
            "extensions": [
                "3 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: Senior Android Developer\n\nWe are seeking an experienced and ambitious Senior Android Developer to join our team. This is a fantastic opportunity to work on exciting client projects, develop your skills, and progress your career.\n\nThe successful candidate will have prior experience in Android Mobile App Development, with a strong understanding of Kotlin, Jetpack Compose, and PlayStore. You will be able to work independently, take advantage of our resources and expertise, and contribute to the development of multiple projects simultaneously.\n\nWe offer a flexible and remote working environment, with a clear pathway for career progression. Our team has a strong focus on personal development, with a tailored plan to help you grow and succeed in your role.\n\nKey Responsibilities:\n• Develop high-quality Android applications using Kotlin and Jetpack Compose\n• Work across multiple projects simultaneously, ensuring timely delivery and excellent results\n• Collaborate with the team to identify and resolve technical issues\n• Contribute to the development of new features and technologies\n\nRequirements:\n• 5+ years of experience in Android Mobile App Development\n• Strong understanding of Kotlin, Jetpack Compose, and PlayStore\n• Experience working across multiple projects simultaneously\n• Excellent communication and problem-solving skills\n\nWhat We Offer:\n• A competitive salary of £55,000 per annum\n• A flexible and remote working environment\n• A clear pathway for career progression\n• Ongoing training and professional development",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/7e5966af7d1f03c8f3bc44a798d69f06?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIg4oCTIFJlbW90ZSIsImNvbXBhbnlfbmFtZSI6IkFkYSBNZWhlciIsImFkZHJlc3NfY2l0eSI6IlJlaWdhdGUsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJNenIxeERFS1RfTUx4bkNjQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "INTL- Senior Android Developer (Colombia)",
            "company_name": "Insight Global",
            "location": "Westbury, United Kingdom",
            "via": "Insight Global",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=5gEWsbBJ0qE4RV8OAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43arGNCC66KAqlKi4qjiVpjjSS3pVcFP0mf1J8w8u-o2xTn6-nAi5IniNsyUb2Fvb4wsADRpjsOHBvvJ5CAQc2IKhj2wETVMwu4HjdpTTISimRUDpJOvm2bLlXTGj4rR5s5F8jnY44BJ2wWSzn73Igl-c1iXddgiqw0QE8wR0lmWf8zOBGPqGFoydnuf8B3DaUPK4AAAA&shmds=v1_AUFQtOPFHL8OYJ-xeAj_hIvHCpWNQ0uEyD2ekscL0mIgi1O5CQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=5gEWsbBJ0qE4RV8OAAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "An employer is looking for a Senior Android Developer to sit remotely. You will primarily be responsible for development efforts related to the clients POS applications. You will be collaborating with internal product teams to implement new feature sets and help standardize the POS experience across all the clients brands. You will solve problems with new and emerging technologies to impact the end product. You will provide senior level development efforts in the Android space and assist the team with strategy and architectural discussions.\n\nWe are a company committed to creating diverse and inclusive environments where people can bring their full, authentic selves to work every day. We are an equal opportunity/affirmative action employer that believes everyone matters. Qualified candidates will receive consideration for employment regardless of their race, color, ethnicity, religion, sex (including pregnancy), sexual orientation, gender identity and expression, marital status, national origin, ancestry, genetic factors, age, disability, protected veteran status, military or uniformed service member status, or any other status or characteristic protected by applicable laws, regulations, and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please send a request to HR@insightglobal.com.\n\nTo learn more about how we collect, keep, and process your private information, please review Insight Global's Workforce Privacy Policy: https://insightglobal.com/workforce-privacy-policy/ .",
            "apply_options": [
                {
                    "title": "Insight Global",
                    "link": "https://jobs.insightglobal.com/find_a_job/texas/job-365795/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJTlRMLSBTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKENvbG9tYmlhKSIsImNvbXBhbnlfbmFtZSI6Ikluc2lnaHQgR2xvYmFsIiwiYWRkcmVzc19jaXR5IjoiV2VzdGJ1cnksIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiI1Z0VXc2JCSjBxRTRSVjhPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Senior Android Developer",
            "company_name": "ARM (Advanced Resource Managers)",
            "location": "Slough, United Kingdom",
            "via": "Engineer Job Board",
            "share_link": "https://www.google.co.uk/search?ibp=htl;jobs&q=Android+developer&htidocid=gj8aCMfIrKJdDJSJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAAUFz7CU43qmgjgkudCoKgdKk4lzQ5kkh6V3Jp6Tf5lerypld8VoV6IgVOUJNNHCxcccbIIyY4wJ17ENTJeGCCG7OLuL74nEeplBKJpZOsczCl4UExYc-LenMvfzrxOuEYdcbudD4u5UhuV9VtA5vazpoMWmhReEoGodGkHSbZQiB4Rp6c38OLQv6lRyBnefgCGx-Jta0AAAA&shmds=v1_AUFQtOPstTcWhz0M_uZvZ549R-iNBrilXuAkZ62luyHX2eW_xw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=Android+developer&htidocid=gj8aCMfIrKJdDJSJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850ad69c4c1734c296b41e/images/88f40b4fb2967a3d7dc6f4f2f7539d732cb25a2f50d4ee58c69a5d7115288e32.gif",
            "extensions": [
                "28 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Slough, Berkshire\n\nARM (Advanced Resource Managers)\n\nSenior Android Developer\n6 months initially\nSlough/Remote – 1 day a week on-site\n£585p/d – INSIDE IR35\n\nAs an Android Developer, you will be responsible for designing, coding, and implementing customized solutions for my clients Android mobile app.\n\nMain skills required – Kotlin and JetPack compose expertise\n\nDisclaimer:\n\nThis vacancy is being advertised by either Advanced Resource Managers Limited, Advanced Resource Managers IT Limited or Advanced Resource Managers Engineering Limited (“ARM”). ARM is a specialist talent acquisition and management consultancy. We provide technical contingency recruitment and a portfolio of more complex resource solutions. Our specialist recruitment divisions cover the entire technical arena, including some of the most economically and strategically important industries in the UK and the world today. We will never send your CV without your permission. Where the role is marked as Outside IR35 in the advertisement this is subject to receipt of a final Status Determination Statement from the end Client and may be subject to change.",
            "apply_options": [
                {
                    "title": "Engineer Job Board",
                    "link": "https://www.engineerjobboard.co.uk/job/senior-android-developer-43/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJBUk0gKEFkdmFuY2VkIFJlc291cmNlIE1hbmFnZXJzKSIsImFkZHJlc3NfY2l0eSI6IlNsb3VnaCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImdqOGFDTWZJcktKZERKU0pBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1RUNDcUlDUVVwSE9VcHJUVkJ3Tms1UlVVOTROMkpSVkV4dlVIcFNUbmRJWDFob1FqUjFTVlpQUVZWbFpreGhRbVZvTjBweVlsaGphRGc1ZW1WeVRFbEliMGwwVkU5TWRXbDJWRFkzUmpaWlprOU5ZMUY1WVU0M1dURlVObkZOTW5wTWFWZzVSVTlaWWtaR05VUm9ZV1IwTlZaUVZqVTRhSHBJWjBOWFdYcGlTakZhTWs5WWRVNUpXWE5EVkU1NGExSlZkVlpNT0c1VFpqUjNjVFJ1TFRGdlNEUXhPWHB4YnpRNGFrMXFURXREV0RaUVluaHBOMUpLZVVoQ01WTmxTV0ozV1ZOQlJrOUljVzR3VXpWS1dHZHlOblpaUzBWVlQwd3lSVWxOYVUxMlJ6WnVTVEJ0WjIxTGJtaFVYMnhsVkdSSlVuQk1Nbll3VVdnNGJFZDJVbWRwYlZkWU1IWmpZbEEzYnpOdVpqRmFXVEoyU1ZkTloySTNWRGN4VEdGVlpYZElhV0YwYTBFU0ZqRjNjVVphWDFseWRYRlVhekpuWDI5cllqZENRV2NhSWtGR1dISkZZM0ZDVHpBNGNXWjZSVzVvTVRZdE4ySnFaamRRUzFwb2FERllXbmMiLCJmY3YiOiIzIn0=",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.co.uk&location=United+Kingdom&next_page_token=eyJmYyI6IkV1RUNDcUlDUVVwSE9VcHJUVkJ3Tms1UlVVOTROMkpSVkV4dlVIcFNUbmRJWDFob1FqUjFTVlpQUVZWbFpreGhRbVZvTjBweVlsaGphRGc1ZW1WeVRFbEliMGwwVkU5TWRXbDJWRFkzUmpaWlprOU5ZMUY1WVU0M1dURlVObkZOTW5wTWFWZzVSVTlaWWtaR05VUm9ZV1IwTlZaUVZqVTRhSHBJWjBOWFdYcGlTakZhTWs5WWRVNUpXWE5EVkU1NGExSlZkVlpNT0c1VFpqUjNjVFJ1TFRGdlNEUXhPWHB4YnpRNGFrMXFURXREV0RaUVluaHBOMUpLZVVoQ01WTmxTV0ozV1ZOQlJrOUljVzR3VXpWS1dHZHlOblpaUzBWVlQwd3lSVWxOYVUxMlJ6WnVTVEJ0WjIxTGJtaFVYMnhsVkdSSlVuQk1Nbll3VVdnNGJFZDJVbWRwYlZkWU1IWmpZbEEzYnpOdVpqRmFXVEoyU1ZkTloySTNWRGN4VEdGVlpYZElhV0YwYTBFU0ZqRjNjVVphWDFseWRYRlVhekpuWDI5cllqZENRV2NhSWtGR1dISkZZM0ZDVHpBNGNXWjZSVzVvTVRZdE4ySnFaamRRUzFwb2FERllXbmMiLCJmY3YiOiIzIn0%3D&q=Android+developer"
    }
}