{
    "search_metadata": {
        "id": "67850523a873dc5c3a6a141e",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/43ec5f681d548038/67850523a873dc5c3a6a141e.json",
        "created_at": "2025-01-13 12:20:51 UTC",
        "processed_at": "2025-01-13 12:20:51 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHQmVsZ2l1bQ&udm=8&fc=EswCCowCQUpHOUprT1BuWmVQOWxfNGxHME1RQVJaZUlHc2F1Y0pKX2JfOExFY1k1Ri1CeDZMSHFuSFNtcDBtam9fNnJiN1g5RHEza1BzVEVtY2JENC0yWGh3WVNtQWRKWGNaS2dNWjRhMy03Wno3ckp5dmtvSmVXX3FlbHRidjlKaWZrc3Fab1dmLTVEdjF2OFpJVzdKbWxPWFRaUW9Ydm1TcjBncjVZWDlIeWVtd2VRRXN5RWhySnYzY0swcW92THJnSW1qQ3ktVmcwcEdFSlFyUDU4Z3ZERGRuZmRXM1dpRGhoTUdXUEpUY1g0X1Z5T2M5SHlmcmJ0cWlVTmVoc1VVSDlteWtyQkZJUUQ4b29jWRIXSWdXRlo1aXNPYVdqNU5vUHVwN3dnQUkaIkFGWHJFY3JPZ2V3OWJhX2xTSXhoYzFyVGN2STBpMmZUWkE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/43ec5f681d548038/67850523a873dc5c3a6a141e.html",
        "prettify_html_file": "https://serpapi.com/searches/43ec5f681d548038/67850523a873dc5c3a6a141e.prettify",
        "total_time_taken": 1.28
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Belgium",
        "location_used": "Belgium",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMUJ1V21WUU9XeGZOR3hITUUxUlFWSmFaVWxIYzJGMVkwcEtYMkpmT0V4RlkxazFSaTFDZURaTVNIRnVTRk50Y0RCdGFtOWZObkppTjFnNVJIRXphMUJ6VkVWdFkySkVOQzB5V0doM1dWTnRRV1JLV0dOYVMyZE5XalJoTXkwM1dubzNja3A1ZG10dlNtVlhYM0ZsYkhSaWRqbEthV1pyYzNGYWIxZG1MVFZFZGpGMk9GcEpWemRLYld4UFdGUmFVVzlZZG0xVGNqQm5jalZaV0RsSWVXVnRkMlZSUlhONVJXaHlTbll6WTBzd2NXOTJUSEpuU1cxcVEza3RWbWN3Y0VkRlNsRnlVRFU0WjNaRVJHUnVabVJYTTFkcFJHaG9UVWRYVUVwVVkxZzBYMVo1VDJNNVNIbG1jbUowY1dsVlRtVm9jMVZWU0RsdGVXdHlRa1pKVVVRNGIyOWpXUklYU1dkWFJsbzFhWE5QWVZkcU5VNXZVSFZ3TjNkblFVa2FJa0ZHV0hKRlkzSlBaMlYzT1dKaFgyeFRTWGhvWXpGeVZHTjJTVEJwTW1aVVdrRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Developer (Freelance)",
            "company_name": "Appamist",
            "location": "Antwerp, Belgium",
            "via": "SimplyHired",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Tk_hkJrZpmpJqPcuAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQrCMAwAULz6CeIhRxVdRRBBTxNR8OJhHzC6ErpKl4Qm6j7EDxbf4U2_k-mhQUpcID0auOAbMwsWWFwLYvYUcAkbuHMHir6EHpjgxhwzzk69mejROdVcRTVvKVSBB8eEHY_uyZ3-a7X3BSV7w3a3346VUFzNaxE_JDVIBDXZB4us4Yw5ptfwA51-N8yXAAAA&shmds=v1_AUFQtOPDUpkOjE7DxabT95ZqMcrer2BgtJiQqz-K7rL6Z0YIPw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Tk_hkJrZpmpJqPcuAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb821471459945d8d7b1165e5764763d6c931b9924e54837fb82e822a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "What will you be doing?\n\nAs an iOS Developer you’ll be working closely with your colleagues in the mobile app team, the UX-experts, designers, project managers and in a lot of cases your fellow engineers from the web app team. You’ll develop and maintain custom iOS apps made for our customers and also integrate them with the back-end systems and web apps. You will develop the architecture for the app, choose the right 3rd party SDK’s and components and of course deliver the hardcore development. Above all you will be coaching your team-members to get them to a higher level and you take the responsibility to make sure development is done right on your current project(s).\n\nWhat do we expect from you?\n• You at least have 4 years experience in iOS development with Objective-C or Swift\n• XCode, UIKit and Cocoa Touch have no secrets for you\n• Implementation of 3rd party SDK’s are no problem\n• Storyboards and Auto Layout are familiar to yourself\n• You implement design patterns as delegation, observer and singleton\n• You have experience in the coaching of team-members\n• You have great communication skills and come up with constructive ideas\n• You value your team over your personal ambition\n• You put your team’s best interest before your own\n• You love technology and are up to date with the latest trends\n• You are the ambassador for Appamist when working for our clients\n• You speak Dutch and have a good understanding of English\n\nWe’ll make sure you feel at home and we’ll offer you the right support to take that next step in your career.\n\nInterested? Send your CV and motivation at jobs@appamist.com.",
            "apply_options": [
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.be/job/3KbQSFZv575YJgZH3Mz8xY7enLykFXhkRkhCnK_8_EVK0LNxwdgBlw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAoRnJlZWxhbmNlKSIsImNvbXBhbnlfbmFtZSI6IkFwcGFtaXN0IiwiYWRkcmVzc19jaXR5IjoiQW50d2VycCwgQmVsZ2l1bSIsImh0aWRvY2lkIjoiVGtfaGtKclpwbXBKcVBjdUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRbVZzWjJsMWJRIn0="
        },
        {
            "title": "Mobile Application Developer - React Native",
            "company_name": "Token Metrics",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=zqoQYOszigQyAH4eAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWKsQrCMBBAce0XiNPNgo0ILjpZBEGog7iXJBxp9JoLubP4L_6scXnweK_5LpquZxcJ4ZQzRW81coIzzkicscAG7mi9wq2GGate2YGgLX6EOl6YA-HqOKpmORgjQm0QrbNvPU-GEzr-mCc7-WOQ0RbMZBWH3X77aXMK6-WDX5igRy3RC8QEHVKI7-kHHlTS8J4AAAA&shmds=v1_AUFQtONsGyMZ5T2Bciot4cNnajGNH5vVKHtjvokjo3KlZAxHNA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=zqoQYOszigQyAH4eAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb8214714c97a268f82c17fb2e3957c94c6cef55640d8f0d1d06de44b.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Belgium\n\nWe are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms. You will be responsible for architecting and building these applications, as well as coordinating with the teams responsible for other layers of the product infrastructure. Building a product is a highly collaborative effort, and as such, a strong team player with a commitment to perfection is required.\n\nResponsibilities\n• Build pixel-perfect, buttery smooth UIs across both mobile platforms.\n• Leverage native APIs for deep integrations with both platforms.\n• Diagnose and fix bugs and performance bottlenecks for performance that feels native.\n• Reach out to the open source community to encourage and help implement mission-critical software fixes—React Native moves fast and often breaks things.\n• Maintain code and write automated tests to ensure the product is of the highest quality.\n• Transition existing React web apps to React Native.\nSkills\n• Working Knowledge In React Native\n• Firm grasp of the JavaScript, TypeScript language, and its nuances, including ES6+ syntax\n• Knowledge of object-oriented programming\n• Ability to write well-documented, clean Javascript code\n• Rock solid at working with third-party dependencies and debugging dependency conflicts\n• Familiarity with native build tools, like XCode, Gradle, Android Studio, IntelliJ\n• Understanding of REST APIs, the document request model, and offline storage\n\nThis offer from \"Token Metrics\" has been enriched by Jobgether.com and got a 78% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/67582e3ddabd453a08b70cef-mobile-application-developer---react-native?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIC0gUmVhY3QgTmF0aXZlIiwiY29tcGFueV9uYW1lIjoiVG9rZW4gTWV0cmljcyIsImFkZHJlc3NfY2l0eSI6IkJlbGdpdW0iLCJodGlkb2NpZCI6Inpxb1FZT3N6aWdReUFINGVBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUW1Wc1oybDFiUSJ9"
        },
        {
            "title": "Developer Support Engineer",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Built In Toronto",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNPQoCMRBAYWy3t7GaWjBRwUY7fxAs9QBLEoZsJDsTMhPZG3ht1-YVX_O676LbXfGDmQtWeLVSuCrcKCbCGTbwYA-CroYBmODOHDOuToNqkaO1ItlEUacpmMCjZULPk32zl396GVzFkp1ivz9sJ1MorpfP-UcNL04hEZwxx9TGH_e36tGKAAAA&shmds=v1_AUFQtOOJFXzSU_NhxUVi6IBZX0U-2FMs-RtS7JtlrUf8rsRtvA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb8214714b01af9550bd21e5d29ca4b0ee4350cfb42a9c7fffb4afb7c.gif",
            "extensions": [
                "18 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "18 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like ChatGPT, VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nIf you’re looking to jumpstart your career in tech and have a direct impact on apps used by billions of end-users, the Developer Support Engineer (DSE) role at RevenueCat is a fantastic opportunity. This is one of the few entry-level positions we offer, and it has proven to be an incredible stepping stone—our current Support Lead, a Product Manager, and a Technical Account Manager each started out as DSEs.\n\nIn this role, you’ll help developers integrate the RevenueCat SDK into their apps, troubleshoot tricky edge cases, and unlock new possibilities in subscription monetization. You’ll provide hands-on support for some of the biggest apps in the world—imagine helping the teams behind ChatGPT, VSCO, PhotoRoom, Notion, and others get the best out of RevenueCat. You’ll be empowered to own the support experience, build out internal tools, and identify improvements that shape how developers everywhere use RevenueCat.\n\nIn 2024, our DSEs spoke at conferences in Berlin, Logroño, New York, London, and Tokyo. This is optional, but if you're interested, you can meet RevenueCat customers face to face, have fun working our booth, and share your knowledge with developers worldwide.\n\nWhat you’ll be responsible for\n• Supporting developers daily. You’ll debug issues, untangle complex code paths, and guide developers through onboarding so they can ship subscription features confidently.\n• Collaborating cross-functionally. You’ll partner closely with Engineering and Product to influence the developer experience—everything from our documentation to new features.\n• Building tooling and processes. You’ll craft or improve the internal apps and dashboards that make troubleshooting faster and easier, both for you and your teammates.\n• Driving user success. From investigating stack traces to clarifying best practices, you’ll ensure developers can move from “blocked” to “shipped” without missing a beat.\n\nWithin your first month, you’ll:\n• Deep-dive into the frustrations and roadblocks developers face, helping them get unblocked so they can launch their apps.\n• Familiarize yourself with our support tools and processes.\n• Propose and implement quick wins in our documentation and support articles to reduce common developer pitfalls.\n• Work alongside our engineering team to resolve complex issues and learn the ins and outs of subscription infrastructure.\n\nWithin your first 3 months, you’ll:\n• Spot opportunities for product improvements that will reduce developer friction.\n• Build out test apps and reproducible environments to tackle issues head-on.\n• Own onboarding and solution engineering for new developers using RevenueCat, providing a seamless start-to-finish experience.\n\nWithin your first 6 months, you’ll:\n• Identify recurring blockers and implement targeted improvements—both in our products and in your own support workflows.\n• Craft (and refine) internal dashboards and tooling that accelerate the DSE team’s efficiency.\n• Make meaningful, self-directed contributions to how we scale support for an ever-growing developer community.\n\nAfter 12 months, you’ll have:\n• Gained super-hero level intuition for diagnosing the root causes of even the trickiest tickets.\n• Led the charge on hiring, mentoring, and growing our support engineering team.\n• Found new ways to delight developers, turning frustrating subscription problems into smooth, joyful experiences.\n\nAbout you\n• You’re eager to learn and grow; this is one of the few entry-level positions at RevenueCat and has historically launched multiple careers within our company.\n• You have 2-3 years of experience in an engineering or technical role, or have built and shipped a mobile app that integrates RevenueCat.\n• You’re comfortable with either iOS (Swift / Objective-C) or Android (Java / Kotlin) and have a grasp of app development and release processes.\n• You can debug code with minimal info, diagnosing issues from cryptic logs or stack traces.\n• You thrive in an environment that requires creative problem-solving and a “get it done” mentality.\n• You have strong written and verbal communication skills, and you’re empathetic towards the developer journey.\n\nWhat you’ll need to be successful\n• Technical curiosity and a willingness to learn new tools and frameworks.\n• Resourcefulness in figuring out solutions when the path isn’t obvious.\n• Clear communication skills to translate complex issues into helpful, actionable steps.\n• Outcome-oriented mindset, ensuring your support leads to measurable developer success—fewer tickets, better documentation, and happier customers.\n• Collaboration and comfort with a fully remote, asynchronous setup using tools like Slack, Zoom, Linear, and Notion.\n\nWhat we offer:\n• $112,000 USD Salary regardless of your location\n• Competitive equity in a fast-growing, Series B startup backed by top tier investors including Y Combinator\n• 10 year window to exercise vested equity options\n• Fully remote work environment that promotes autonomy and flexibility\n• Suggested 4 to 5 weeks time off to recharge and focus on mental, physical, and emotional health\n• $2,000 USD to build your personal workspace\n• $1,000 USD annual stipend for your continuous learning and growth\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.",
            "apply_options": [
                {
                    "title": "Built In Toronto",
                    "link": "https://builtintoronto.com/job/developer-support-engineer/3641684?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXZlbG9wZXIgU3VwcG9ydCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlJldmVudWVDYXQiLCJhZGRyZXNzX2NpdHkiOiJCZWxnaXVtIiwiaHRpZG9jaWQiOiJoNjRHdmhGZU83eXJ0S2FWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFtVnNaMmwxYlEifQ=="
        },
        {
            "title": "Flutter Mobile Developer",
            "company_name": "Raketech",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVy7ujndLJiI4KKbFAXBxRcoSTiS6DUXclfp7otbl3_4hr_7rjp7pUkVGzzYZ0Lo8YPEdYEd3NmDoGshARe4MUfCzTmpVjlZK0ImijrNwQQeLRf0PNsXe_lnkOQaVnKKw-G4n00tcbt-ujcqLsNc4IIU8zT-AMGMB1SGAAAA&shmds=v1_AUFQtOMux9LEURj3LjcLow28oCRiAMONo640WqZ9JnovlTkVNw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb82147143f8a23243aa18eacc11d0a691e7717ffdf830c7f7a3b97f4.gif",
            "extensions": [
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Portugal\n\nThe role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or Malta.\n\nWe are looking for an enthusiastic Flutter Mobile Developer to help maintain and develop our sports mobile applications.\n• As a Flutter Mobile Developer you are expected to …\n• Write clean, well-documented, and maintainable code for Flutter application\n• Develop and maintain technical documentation for the applications\n• Identify the causes of the most complex issues and implement practical and efficient technical solutions\n• Implement both backend and front-end features\n• Coordinate with UX/UI designers, developers, and test engineers in an Agile environment\n• Abide by industry and company software development standards\n• Conduct code reviews and give feedback to other developers\n• Understand the big picture and offer insightful advice about technologies and projects\n• Be proactive in identifying and communicating potential risks and issues to the team and stakeholders\n• Participate in sprint planning, estimation, and retrospective meetings\n• Keep up-to-date with the latest mobile app development trends and technologies\n• Work in close partnership with cross-functional teams and management\n• Ensure code quality by writing tests, using SonarQube, etc.\n• Success in this role means...\n• Collaborating towards a team effort to improve the overall user experience of our applications.\n• Developing DRY, clean, maintainable and scalable code that can be comprehended and worked on solely through documentation created.\n• Increasing the performance, scalability and security of our mobile applications.\n• You have acquired proficient communication skills in the English language through team collaboration.\n\nThis offer from \"Raketech\" has been enriched by Jobgether.com and got a 86% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66e4d25a5ae7155b1774745b-flutter-mobile-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIE1vYmlsZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJSYWtldGVjaCIsImFkZHJlc3NfY2l0eSI6IkJlbGdpdW0iLCJodGlkb2NpZCI6InNGeWFMN3l1R1RkU2RJNE5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUW1Wc1oybDFiUSJ9"
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMvwrCMBCAcVz7CJ1uFmxEcNHNPxWFTnUvSXsmkTQXclfs6_im1uXbvl_xXRV144choGoxesrQkPEBoQ6TCGZo6SUfnRGu0fqImBk28CADjDr3DijCjcgGLI9OJPFBKeZQWRYtvq96GhVFNDSrNxn-p2O3eClowW63385VinZd3i9POFNOlJdvQX2EEwbrp_EHzOCvDqQAAAA&shmds=v1_AUFQtONEvWEBFzZ_4pEGB3FWgE3B2VUjFtm1kJy-5K5a2lwcoA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb82147148c30af0dee330c4b5a0c51f2a95d067f942e998e36f30664.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkJlbGdpdW0iLCJodGlkb2NpZCI6IlQxeHZ0bGpKbmNkMW91MGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUW1Wc1oybDFiUSJ9"
        },
        {
            "title": "Senior Developer Advocate",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNvwrCMBCAcVy7uzjdLJgUwUUn_4DgqA9QknikkfQu5K6lT-BzW5dv_H3Nd9W0L6TEFW44YeaCFc7viYNThB082IOgq6EHJrgzx4ybU69a5GitSDZR1GkKJvBgmdDzbD_s5Z9Oelex5IXq9od2NoXidv1cPjTi1SkkggvmmMbhB-ApP5eJAAAA&shmds=v1_AUFQtOMbrvHYBFIGbk9powP-XBppSldysLQM7KpVbN-hhOlJGw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb8214714ee32ab36a9ec1091ae657a6952e328ac4da7d7200d300f3c.gif",
            "extensions": [
                "212K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "212K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: United States, EMEA\n\nAbout us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nRevenueCat helps apps of all shapes and sizes make more money across mobile, the web, and other platforms like Roku and Amazon. As a result, many different types of users log in to – and use – RevenueCat on a day-to-day basis. Product managers, support reps, lifecycle marketers, user acquisition specialists, data analysts, executives: The list goes on.\n\nNone of those users would make it onto RevenueCat unless a developer implements it first. And for smaller apps, developers are these users: They do the marketing, provide support, interpret the performance data, make pricing and packaging decisions, and more.\n\nWe’re looking for a Senior Developer Advocate to help ensure these developers are successful when using RevenueCat. You’d join forces with our current Advocate, and guy you might have seen walking around Seoul in the rain, Charlie Chapman. We’re specifically looking for someone with strong skills in producing written educational content targeted at developers that is technical but engaging. Your work will educate existing RevenueCat users, attract new search traffic, and position RevenueCat as the go-to resource when implementing in-app purchases across platforms.\n\nWhat you’ll be responsible for\n\nYour primary responsibility will be creating high-quality, developer-focused content focused on monetization and in-app purchases. This includes both scenarios where developers use RevenueCat to solve for these use cases, as well as alternative implementations.\n\nExamples of the type of content we’d expect you to produce include blogpost with titles like:\n• \"Migrating a native subscription app to Flutter: A step by step plan\"\n• \"Implementing your first subscription with RevenueCat: Disable ads for paid users\"\n• \"How to detect and highlight the platform of purchase for cross-device subscribers\"\n• \"Adding a multi-tier subscription to your Expo app\"\n\nIn addition to writing, you’ll:\n• Speak at conferences, webinars, and other events to share insights and represent RevenueCat\n• Record videos and collaborate on webinars to help developers implement and succeed with RevenueCat\n• Work cross-functionally to develop resources that support developers using RevenueCat\n\nWithin the first month, you’ll:\n• Learn RevenueCat inside and out\n• Familiarize yourself with our developer community and how to engage them\n• Have produced your first pieces of RevenueCat content\n\nWithin the first 3 months, you’ll:\n• Collaborate with Charlie on a joint content strategy playing to both your strengths\n• Independently research and develop content to fill current gaps in our documentation and other educational efforts\n• Repurpose existing content into new formats (e.g., blog posts into videos) to expand our reach\n\nWithin the first 6 months, you’ll:\n• Represent RevenueCat at industry conferences and webinars, delivering talks and engaging with developers\n• Support product launches with technical content (written or video)\n\nAfter 12 months, you’ll have:\n• Become a fixture across the developer community, having become synonymous with RevenueCat and in-app monetization for Android, Flutter, and/or React Native\n• Found new and novel ways to help us engage developers (think Shipaton, App Store Rejection socks, and similar initiatives)\n\nAbout you\n\nYou’re passionate about teaching and helping developers thrive. You’re deeply experienced in app development, particularly subscription apps, whether as part of a team or through indie projects (preferably both).\n\nWhat you’ll need to be successful\n• 5+ years of experience in app development or developer-focused roles, ideally in a subscription app environment, with a deep understanding of at least one major mobile development platform (Android, Flutter, React Native preferred; iOS a strong alternative) and the ability to learn and write about others\n• Strong independent project management skills, with the ability to manage multiple content initiatives, events, and deadlines across time zones without constant oversight\n• Excellent technical communication skills, capable of translating complex technical concepts into accessible and engaging written, video, and spoken formats for developers\n• A passion for teaching and empowering developers, with the ability to create content that educates and inspires action, including blog posts, tutorials, and videos\n• Proven ability to learn and explain new technologies, with expertise in Android development, Flutter, or React Native preferred (experience with iOS development is a plus if paired with a demonstrated ability to adapt to and write about other platforms)\n• Proven experience in producing content for a developer audience, preferably in a professional capacity as a developer advocate, but we’d consider exceptional candidates that have written, recorded video, and have spoken at conferences targeted at developers as a hobby or side-project\n• Resourcefulness and adaptability, with a problem-solving mindset to navigate the challenges of engaging a global developer community\n• Outcome-driven approach, ensuring your efforts lead to measurable impacts, such as increased content engagement, developer onboarding, and community growth\n• Comfort with a fully remote, asynchronous work environment, and tools like Notion, Zoom, Slack, and Linear. You’ll need to thrive in an environment that balances collaboration with ample time for focused, deep work\n\nWe’re looking for someone who embodies our team’s core values of agency and intellectual curiosity: taking initiative, solving problems, and continually learning to better serve our diverse developer audience. Regular travel may occasionally be required for conferences, events, or team gatherings.\n\nWhat we offer:\n• $212,000 USD salary, regardless of location\n• Competitive equity in a fast-growing, Series C startup backed by top-tier investors, including Y Combinator\n• 10-year window to exercise vested equity options\n• Fully remote and flexible work environment\n• 4-5 weeks of suggested time off annually for mental, physical, and emotional recharge\n• $2,000 USD for workspace setup and $1,000 USD annual stipend for continuous learning\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.\n\nThis offer from \"RevenueCat\" has been enriched by Jobgether.com and got a 90% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/674cc14db10568bbc7b1e688-senior-developer-advocate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGV2ZWxvcGVyIEFkdm9jYXRlIiwiY29tcGFueV9uYW1lIjoiUmV2ZW51ZUNhdCIsImFkZHJlc3NfY2l0eSI6IkJlbGdpdW0iLCJodGlkb2NpZCI6Ing5VE1pUHBRbFowQ2xtbV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUW1Wc1oybDFiUSJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFw7OjrdqEIbEVx0U1ERhIIfUJJyTU_SXLiLUr_Fn1WXt77iMykud4zEAjd2FBAOwqplHWzuWAY44gsDJxSYn0jQWcUFlHBlB4pW2h44wpnZB5zt-pyTbo1RDZXXbDO1VcuD4YiOR_Ngp38a7a1g-hXYrDersUrRL6e18EjdGyjCHoOn5_AFTK5xaZ4AAAA&shmds=v1_AUFQtOPHks8olyI9KXEgfzURcgmMmIvELwUZq4tT47sUCEw0Gw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb82147146ba780f8f7c617bb73ee577849350f590030872d724aaae2.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkJlbGdpdW0iLCJodGlkb2NpZCI6IkQtNFpVcnFGVW1XNUZuVTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUW1Wc1oybDFiUSJ9"
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQrCMBAA0L2jo9ONIpiI4qKbioWufkBJwpFErrmQu0rBn1eXx-s-3eZBsyo2uOMbietvOxjYg6BrIQEX6Jkj4fqSVKucrRUhE0Wd5mACT5YLel7si738GSW5hpWc4ng47RdTS9yunsERHm-QC1yRYp6nL8Fbddl9AAAA&shmds=v1_AUFQtONyl3e_yu-K6-GHC1y2XA5jdTG8ylHOZR-MNlbvEEIC-Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850523a873dc5c3a6a141e/images/7f3bfb7eb8214714eeb918c5e5ceb5e93ce7ddc0244d86fb66823c0116a7b67b.gif",
            "extensions": [
                "21 days ago",
                "€192K a year",
                "Work from home",
                "Internship",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "salary": "€192K a year",
                "work_from_home": true,
                "schedule_type": "Internship",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: European Union\n\nWho we are\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\nWhat we are looking for\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environmentInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\nTalent acquisition team\n\nThis offer from \"Scale3C\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/677c07d256373d87f2b9cbc6-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJCZWxnaXVtIiwiaHRpZG9jaWQiOiJsU0xRZGVndzZaUThGWWRSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFtVnNaMmwxYlEifQ=="
        }
    ]
}