{
    "search_metadata": {
        "id": "6785052829f2645234f0f8de",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/5d69e101dfd18a52/6785052829f2645234f0f8de.json",
        "created_at": "2025-01-13 12:20:56 UTC",
        "processed_at": "2025-01-13 12:20:56 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIIQnVsZ2FyaWE&udm=8&fc=EswCCowCQUpHOUprUDBQa0RTcHRSUF9Ebm8wQnRONDJiNnBLMnNndnlPNEZaUXZFQ3dMX082Z0taa2R0aTB4eUR3cmEyRmljNlpPbkZGVXYtV3ZoWWxHaHQweXNZbU80bDRfM2hBY2JXOUx3SVZCUEt2U3lJaEFpQThQYk5zc1psMXBJbHBGZTFDeTV3NmNsS1N6NnFMWXE1RUdTQThuUDJpaDQ3blBtRS1IR1pzNDNEYlU2WjkzS2lnOEpVRzd0YVJDVkZ0MUhkS0lMemJ5Q0RnY1g0elZiQl9GYlRzSTByYnJtbmZjX01JcFBYQ0UzdU9aTWNacHZpd3lPcmIweG5vNjE5cVNfTkVXX0VjRjhPSxIXS0FXRlo4andDSmVhd2JrUG9iV0w2QWsaIkFGWHJFY3BwWllHcnlveWhMUTZZVFQ3amVOM1doQ1BzTWc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/5d69e101dfd18a52/6785052829f2645234f0f8de.html",
        "prettify_html_file": "https://serpapi.com/searches/5d69e101dfd18a52/6785052829f2645234f0f8de.prettify",
        "total_time_taken": 2.62
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Bulgaria",
        "location_used": "Bulgaria",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVREJRYTBSVGNIUlNVRjlFYm04d1FuUk9OREppTm5CTE1uTm5kbmxQTkVaYVVYWkZRM2RNWDA4MlowdGFhMlIwYVRCNGVVUjNjbUV5Um1sak5scFBia1pHVlhZdFYzWm9XV3hIYUhRd2VYTlpiVTgwYkRSZk0yaEJZMkpYT1V4M1NWWkNVRXQyVTNsSmFFRnBRVGhRWWs1emMxcHNNWEJKYkhCR1pURkRlVFYzTm1Oc1MxTjZObkZNV1hFMVJVZFRRVGh1VURKcGFEUTNibEJ0UlMxSVIxcHpORE5FWWxVMldqa3pTMmxuT0VwVlJ6ZDBZVkpEVmtaME1VaGtTMGxNZW1KNVEwUm5ZMWcwZWxaaVFsOUdZbFJ6U1RCeVluSnRibVpqWDAxSmNGQllRMFV6ZFU5YVRXTmFjSFpwZDNsUGNtSXdlRzV2TmpFNWNWTmZUa1ZYWDBWalJqaFBTeElYUzBGWFJsbzRhbmREU21WaGQySnJVRzlpVjB3MlFXc2FJa0ZHV0hKRlkzQndXbGxIY25sdmVXaE1VVFpaVkZRM2FtVk9NMWRvUTFCelRXYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior Developer Advocate",
            "company_name": "RevenueCat",
            "location": "Bulgária (e mais 176)",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D&hl=pt-PT&shndl=37&shmd=H4sIAAAAAAAA_xXNsQ3CMBBGYdFmASSqqylihERBqAhI9DBA5Di_HCPHZ3xOlDUYgVlYjNC88nvFe1UcHwiOE10xwXNEonM3sdEZFUXIa3SiqQNhiAmWhQLTjdl6bE59zlEqpUR8aSXr7ExpeFAc0PKsntzKP430OiH6xWz2h91cxmC36_syDCMuOi821aO3309y-gf-imx4lAAAAA&shmds=v1_AUFQtOObV97wE-DvHzXRuIuykoPtvvUQmq1EGmHXqX673BW0HA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785052829f2645234f0f8de/images/fa2182c1ba20bb2650c140d35ca06f8172bf2c3fd20ec260bb6601f209e7a591.gif",
            "extensions": [
                "212 mil US$ por ano",
                "Tempo inteiro"
            ],
            "detected_extensions": {
                "salary": "212 mil US$ por ano",
                "schedule_type": "Tempo inteiro"
            },
            "description": "This a Full Remote job, the offer is available from: United States, EMEA\n\nAbout us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nRevenueCat helps apps of all shapes and sizes make more money across mobile, the web, and other platforms like Roku and Amazon. As a result, many different types of users log in to – and use – RevenueCat on a day-to-day basis. Product managers, support reps, lifecycle marketers, user acquisition specialists, data analysts, executives: The list goes on.\n\nNone of those users would make it onto RevenueCat unless a developer implements it first. And for smaller apps, developers are these users: They do the marketing, provide support, interpret the performance data, make pricing and packaging decisions, and more.\n\nWe’re looking for a Senior Developer Advocate to help ensure these developers are successful when using RevenueCat. You’d join forces with our current Advocate, and guy you might have seen walking around Seoul in the rain, Charlie Chapman. We’re specifically looking for someone with strong skills in producing written educational content targeted at developers that is technical but engaging. Your work will educate existing RevenueCat users, attract new search traffic, and position RevenueCat as the go-to resource when implementing in-app purchases across platforms.\n\nWhat you’ll be responsible for\n\nYour primary responsibility will be creating high-quality, developer-focused content focused on monetization and in-app purchases. This includes both scenarios where developers use RevenueCat to solve for these use cases, as well as alternative implementations.\n\nExamples of the type of content we’d expect you to produce include blogpost with titles like:\n• \"Migrating a native subscription app to Flutter: A step by step plan\"\n• \"Implementing your first subscription with RevenueCat: Disable ads for paid users\"\n• \"How to detect and highlight the platform of purchase for cross-device subscribers\"\n• \"Adding a multi-tier subscription to your Expo app\"\n\nIn addition to writing, you’ll:\n• Speak at conferences, webinars, and other events to share insights and represent RevenueCat\n• Record videos and collaborate on webinars to help developers implement and succeed with RevenueCat\n• Work cross-functionally to develop resources that support developers using RevenueCat\n\nWithin the first month, you’ll:\n• Learn RevenueCat inside and out\n• Familiarize yourself with our developer community and how to engage them\n• Have produced your first pieces of RevenueCat content\n\nWithin the first 3 months, you’ll:\n• Collaborate with Charlie on a joint content strategy playing to both your strengths\n• Independently research and develop content to fill current gaps in our documentation and other educational efforts\n• Repurpose existing content into new formats (e.g., blog posts into videos) to expand our reach\n\nWithin the first 6 months, you’ll:\n• Represent RevenueCat at industry conferences and webinars, delivering talks and engaging with developers\n• Support product launches with technical content (written or video)\n\nAfter 12 months, you’ll have:\n• Become a fixture across the developer community, having become synonymous with RevenueCat and in-app monetization for Android, Flutter, and/or React Native\n• Found new and novel ways to help us engage developers (think Shipaton, App Store Rejection socks, and similar initiatives)\n\nAbout you\n\nYou’re passionate about teaching and helping developers thrive. You’re deeply experienced in app development, particularly subscription apps, whether as part of a team or through indie projects (preferably both).\n\nWhat you’ll need to be successful\n• 5+ years of experience in app development or developer-focused roles, ideally in a subscription app environment, with a deep understanding of at least one major mobile development platform (Android, Flutter, React Native preferred; iOS a strong alternative) and the ability to learn and write about others\n• Strong independent project management skills, with the ability to manage multiple content initiatives, events, and deadlines across time zones without constant oversight\n• Excellent technical communication skills, capable of translating complex technical concepts into accessible and engaging written, video, and spoken formats for developers\n• A passion for teaching and empowering developers, with the ability to create content that educates and inspires action, including blog posts, tutorials, and videos\n• Proven ability to learn and explain new technologies, with expertise in Android development, Flutter, or React Native preferred (experience with iOS development is a plus if paired with a demonstrated ability to adapt to and write about other platforms)\n• Proven experience in producing content for a developer audience, preferably in a professional capacity as a developer advocate, but we’d consider exceptional candidates that have written, recorded video, and have spoken at conferences targeted at developers as a hobby or side-project\n• Resourcefulness and adaptability, with a problem-solving mindset to navigate the challenges of engaging a global developer community\n• Outcome-driven approach, ensuring your efforts lead to measurable impacts, such as increased content engagement, developer onboarding, and community growth\n• Comfort with a fully remote, asynchronous work environment, and tools like Notion, Zoom, Slack, and Linear. You’ll need to thrive in an environment that balances collaboration with ample time for focused, deep work\n\nWe’re looking for someone who embodies our team’s core values of agency and intellectual curiosity: taking initiative, solving problems, and continually learning to better serve our diverse developer audience. Regular travel may occasionally be required for conferences, events, or team gatherings.\n\nWhat we offer:\n• $212,000 USD salary, regardless of location\n• Competitive equity in a fast-growing, Series C startup backed by top-tier investors, including Y Combinator\n• 10-year window to exercise vested equity options\n• Fully remote and flexible work environment\n• 4-5 weeks of suggested time off annually for mental, physical, and emotional recharge\n• $2,000 USD for workspace setup and $1,000 USD annual stipend for continuous learning\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.\n\nThis offer from \"RevenueCat\" has been enriched by Jobgether.com and got a 90% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/674cc14db10568bbc7b1e688-senior-developer-advocate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGV2ZWxvcGVyIEFkdm9jYXRlIiwiY29tcGFueV9uYW1lIjoiUmV2ZW51ZUNhdCIsImFkZHJlc3NfY2l0eSI6IkJ1bGfDoXJpYSIsImh0aWRvY2lkIjoieDlUTWlQcFFsWjBDbG1tX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUlRblZzWjJGeWFXRSJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Bulgária (e mais 124)",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=pt-PT&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVw7OzndqIKNCC51U9FJqPgAJanXNJLm4l0q9XFcfBFfTF3-8fuz9yg7XzA4YjiRcR5hxySyKL1ODXEHe3ygp4gM04NjNFpwVkBEufdONFwRsIuMlgQCwZHIepxs2pSiFEqJ-NxK0snVeU2dooCGBnUjI_9U0mrG-HthtVovhzwGOx-XTINrnj8Ytr23nxc7_QWCzM8TqQAAAA&shmds=v1_AUFQtOMFu2kSWW1906YGOFgcSUCdXpGaUr1VnRw8T6kt5ppWnA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785052829f2645234f0f8de/images/fa2182c1ba20bb261438c143eb67f0eeae9039e3cf9f038b569394b071b8a2f9.gif",
            "extensions": [
                "Tempo inteiro"
            ],
            "detected_extensions": {
                "schedule_type": "Tempo inteiro"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkJ1bGfDoXJpYSIsImh0aWRvY2lkIjoiRC00WlVycUZVbVc1Rm5VM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUlRblZzWjJGeWFXRSJ9"
        },
        {
            "title": "Mobile Developer (React Native, JavaScript/TypeScript) - Remote",
            "company_name": "IQVIA",
            "location": "Bulgária (e mais 6)",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=aZY8vvvz2Ea0aMu8AAAAAA%3D%3D&hl=pt-PT&shndl=37&shmd=H4sIAAAAAAAA_yXMvQ4BQRSG4WiVStUpEXZEolkVkQgJiZ9oN7PryxiZ3TPmjA2X4xbcghtDNG_e6mm-Gs1szbl1oDlqOPYI1NlBF5E2OtoafVrpWu-LYH1Uh4fHf7s0oB1KjkjJQ643K5pOIJQ-wLBQxbRgNg7tyTlGL6lSIi4xEr9skRRcKq6Q811dOJdfMjnrAO90RDYaD--Jr0yvtdwel9MvS7ObM-9nsPoDmUbPobUAAAA&shmds=v1_AUFQtOPJqcwOD1fTySVfA7WTWt-N2fzVpuvvdgSPejBG3OINLg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=aZY8vvvz2Ea0aMu8AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785052829f2645234f0f8de/images/fa2182c1ba20bb26fe2be801db309170b8ec19742317158b78cb7302e75bea1e.gif",
            "extensions": [
                "há 29 dias",
                "Tempo inteiro"
            ],
            "detected_extensions": {
                "posted_at": "há 29 dias",
                "schedule_type": "Tempo inteiro"
            },
            "description": "This a Full Remote job, the offer is available from: Bulgaria, Poland, Romania, South Africa, Portugal, Spain, Slovakia\n\nJoin Us at IQVIA!\n\nWe are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment (eCOA) platform. Our fast, flexible, and proven solution enhances efficiencies, delivers real-time data, and sharpens insights, all while providing a superior patient experience.\n\nWho we’re looking for:\n\nYou will be part of a growing team of developers located across the world, focused on building new and modern software that’s positioned to disrupt the clinical trial space. In this remote role, you’ll be empowered and encouraged to think “outside the box” to develop innovative solutions to drive business and the industry forward. You believe that pushing yourself out of your comfort zone is the only way to grow. You love the idea of owning a product, from developing new mobile app features to scaling to meet market demands. Not only are you fluent with React Native, but you’re an expert with JavaScript/TypeScript.\n\nPosition overview:\n\nWe’re seeing immense growth in the industry, and our core focus is scaling our native application’s feature set. Bring your talent and drive to our team of passionate, creative, and innovative thinkers, focused on developing a sophisticated product that uses modern JavaScript. We have the support and resources of a large company but operate with a start-up culture. You’ll thrive in a fast-paced and agile environment, during which you see real-time results. As we work to rapidly expand our team, you’ll have the opportunity to grow your career in the direction that’s right for you.\n\nRESPONSIBILITIES:\n• Serve as critical development resource on cross platform mobile application\n• Work collaboratively and efficiently across functional teams in a fast-paced startup-like environment.\n• High standard of engineering quality through source control, code reviews, continuous integration, and unit tests.\n• Extend our platform to handle an expanding set of features.\n• Improve infrastructure and application development\n• Review and refactor legacy code\n• Provide input on the establishment of development best practices and standards for the organization\n\nSKILLS:\n• Expert in React Native, React, and Redux\n• Expert in JavaScript and TypeScript\n• Experience with SQL databases (SQLite/Postgres)\n• Experience with Swift, Objective-C, Java, and Kotlin are a plus\n• Experience with mobile application deployments (Android/iOS)\n• Experience with data/event streams (Amazon Kinesis/Apache Pulsar)\n\nIQVIA is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. We create intelligent connections to accelerate the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide. Learn more at https://jobs.iqvia.com\n\nAt IQVIA, we believe that diversity, inclusion, and belonging empower our mission to accelerate innovation for a healthier world. We create a culture of belonging by valuing the perspectives of all talented employees worldwide and providing them with the opportunity to power smarter healthcare for everyone, everywhere. When our talented employees bring their authentic selves and their diverse experiences to work, they enable us to accomplish extraordinary things. Multifaceted thought processes spark innovation. Multi-talented collaboration harnesses innovation to deliver superior outcomes.\n\nThis offer from \"IQVIA\" has been enriched by Jobgether.com and got a 79% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/675f6db6ca73aaf74f2a1f38-mobile-developer-react-native-javascript-typescript---remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIChSZWFjdCBOYXRpdmUsIEphdmFTY3JpcHQvVHlwZVNjcmlwdCkgLSBSZW1vdGUiLCJjb21wYW55X25hbWUiOiJJUVZJQSIsImFkZHJlc3NfY2l0eSI6IkJ1bGfDoXJpYSIsImh0aWRvY2lkIjoiYVpZOHZ2dnoyRWEwYU11OEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUlRblZzWjJGeWFXRSJ9"
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Bulgária (e mais 26)",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D&hl=pt-PT&shndl=37&shmd=H4sIAAAAAAAA_xXMvQ3CMBAGUNGmpqK6miLmRzShAwQDMEDkhE9O0MVnfBeUCdiDWVgMaF75itesWJ95NEOmE55gScgVJehj7NXTDYQhZQRRikIXkcBY7DuzpJVzqlwGNW99W7YyOIloZHJ3afRPrZ3PSOwN9Wa3msoUw3J-bT1je_zFdBg5fN6591_-xJndiQAAAA&shmds=v1_AUFQtOPNhyUf4E-kSh5JCgv8cBHSAvbTyTS4nRmWh_8lzbaL9Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785052829f2645234f0f8de/images/fa2182c1ba20bb2626d3ee9c970a9f04e76b7e9fc0ad3dc3da0280376522ddb9.gif",
            "extensions": [
                "há 21 dias",
                "192 mil € por ano",
                "Estágio"
            ],
            "detected_extensions": {
                "posted_at": "há 21 dias",
                "salary": "192 mil € por ano",
                "schedule_type": "Estágio"
            },
            "description": "This a Full Remote job, the offer is available from: European Union\n\nWho we are\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\nWhat we are looking for\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environmentInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\nTalent acquisition team\n\nThis offer from \"Scale3C\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/677c07d256373d87f2b9cbc6-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJCdWxnw6FyaWEiLCJodGlkb2NpZCI6ImxTTFFkZWd3NlpROEZZZFJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lJUW5Wc1oyRnlhV0UifQ=="
        }
    ]
}