{
    "search_metadata": {
        "id": "678505374b67786c703257a6",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/86f3cc4340b1b33b/678505374b67786c703257a6.json",
        "created_at": "2025-01-13 12:21:11 UTC",
        "processed_at": "2025-01-13 12:21:11 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EuICCqICQUpHOUprTkVYbXVXTk1wSENtcm01eGUyLWEwUWE2eENfZThVVEh5QVRsTHlhaG9maGVnWU9fQ0MycWtBTXpQYVh1bUtTUFhnV3ctb1JUS3NveU9mOUlaV1d0X28wYkFsNUN5dHpXVzRrTEFnNU10ZDg0OVdTUEhIWkhXaXU4WG45OWQwX0xrbG44N1hCUGY5d0toLXY3RjdVVjMydTFOS2xGOGdIQjZ2dmFLRkhRYk1TbTlTQjdKamVXdEZweE9odXhWSVNpelF2NUs2Y2g2SWhpUGFVemtjY3RwZWFfSFlEbWhUOW9LemhvZ1FjbFBzWlhCUmx1ejhnR3MwZUlweE9ZVzZiRG1udWJhNUxNTWJtS1ZweEt0aDVFUnNmSC1yekESF05nV0ZaLU8yRl95dzVOb1BncVRMdVFzGiJBRlhyRWNvOThMbzhHUTJ5VTBGUnptaWpYczZ4RHZnekpB&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/86f3cc4340b1b33b/678505374b67786c703257a6.html",
        "prettify_html_file": "https://serpapi.com/searches/86f3cc4340b1b33b/678505374b67786c703257a6.prettify",
        "total_time_taken": 1.48
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJUa1ZZYlhWWFRrMXdTRU50Y20wMWVHVXlMV0V3VVdFMmVFTmZaVGhWVkVoNVFWUnNUSGxoYUc5bWFHVm5XVTlmUTBNeWNXdEJUWHBRWVZoMWJVdFRVRmhuVjNjdGIxSlVTM052ZVU5bU9VbGFWMWQwWDI4d1lrRnNOVU41ZEhwWFZ6UnJURUZuTlUxMFpEZzBPVmRUVUVoSVdraFhhWFU0V0c0NU9XUXdYMHhyYkc0NE4xaENVR1k1ZDB0b0xYWTNSamRWVmpNeWRURk9TMnhHT0dkSVFqWjJkbUZMUmtoUllrMVRiVGxUUWpkS2FtVlhkRVp3ZUU5b2RYaFdTVk5wZWxGMk5VczJZMmcyU1docFVHRlZlbXRqWTNSd1pXRmZTRmxFYldoVU9XOUxlbWh2WjFGamJGQnpXbGhDVW14MWVqaG5SM013WlVsd2VFOVpWelppUkcxdWRXSmhOVXhOVFdKdFMxWndlRXQwYURWRlVuTm1TQzF5ZWtFU0YwNW5WMFphTFU4eVJsOTVkelZPYjFCbmNWUk1kVkZ6R2lKQlJsaHlSV052T1RoTWJ6aEhVVEo1VlRCR1VucHRhV3BZY3paNFJIWm5la3BCIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "iOS Engineer, Shopper Engagement",
            "company_name": "Instacart",
            "location": "Anywhere",
            "via": "Startup Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=qO84jgXUdeyk5aDrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCQAyAYVz7CE6ZpfZEEEFHEdHBDnUv6RnuTtrkuGToo_i42uUfPvir76o6praDK4fERKWGLkrOVBbBQBOxwRYeMoASFh9BGG4iYaT1OZplPTmnOjZBDS35xsvkhGmQ2X1k0CW9RiyURzTq94fd3GQOG7jz__BYDBLDS4qwSQ3ts4YLMr7xB9TXr6WbAAAA&shmds=v1_AUFQtOO0D8Ras0BHvIlPst_8rAGzq33dqQ5rxcNILs6e_Z7OLQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=qO84jgXUdeyk5aDrAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c804e4f49d4e0241e89b69d29db7d8e63fd7c80e15366b7948b.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "We're transforming the grocery industry\n\nAt Instacart, we invite the world to share love through food because we believe everyone should have access to the food they love and more time to enjoy it together. Where others see a simple need for grocery delivery, we see exciting complexity and endless opportunity to serve the varied needs of our community. We work to deliver an essential service that customers rely on to get their groceries and household goods, while also offering safe and flexible earnings opportunities to Instacart Personal Shoppers.\n\nInstacart has become a lifeline for millions of people, and we’re building the team to help push our shopping cart forward. If you’re ready to do the best work of your life, come join our table.\n\nInstacart is a Flex First team\n\nThere’s no one-size fits all approach to how we do our best work. Our employees have the flexibility to choose where they do their best work—whether it’s from home, an office, or your favorite coffee shop—while staying connected and building community through regular in-person events. Learn more about our flexible approach to where we work.\nOverview\n\nAbout the Role\n\nWe are seeking an iOS Engineer with strong ownership and a passion for user-facing products. In this crucial role, you will directly enhance the shopper experience and service quality, contributing to transformative changes in the grocery delivery industry. Your work will significantly impact critical shopper user flows and affect millions of end-users, underpinning our company's success.\n\nAbout the Team\n\nThe Shopper Engagement Team is a dynamic, cross-functional group dedicated to innovating at the intersection of technology and user insight. With a diverse team of nine engineers across backend, Android, and iOS, our efforts focus on enriching shopper quality and fulfillment efficiency through strategic touchpoints:\n\nShopper Positioning: We provide clear, actionable data that demystifies work access, helping shoppers understand where and when to work and what to expect.Shopper Earnings & Work Evaluation: Our systems enable shoppers to evaluate work effectively and maximize earnings by presenting insightful, data-driven job choices.Shopper Motivation: We develop reward systems that incentivize top-tier service, enhancing both customer experience and shopper satisfaction.\n\nOperating within Instacart's broader Shopper organization, our team plays a critical role in enhancing marketplace performance, ensuring that our strategies lead to high-quality shopper engagements and efficient fulfillment solutions.\n\nWhat We Offer:\n\n• Impact: Make a direct positive impact on the earnings and satisfaction of millions of shoppers, influencing the customer experience profoundly.\n• Growth: Handle high-leverage projects that enhance your career growth, providing opportunities for significant domain ownership and leadership in engineering solutions.\n• Learning and Development: Work alongside industry-leading engineers and leaders who are at the forefront of online grocery innovation.\n• Team Culture: Thrive in an environment that values collaboration, support, and innovation, with a strong focus on speed, quality, and efficiency.\n\nAbout the Job\n\nIn this role, you will:\n\n• Develop and enhance an iOS app used by shoppers.\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Collaborate cross-functionally to create project roadmaps for delightful and accessible user experiences\n• Participate in code reviews to maintain high development standards\n• Participate in cross-organizational efforts with other engineering teams\n\nAbout You\n\nMinimum Qualifications\n\n• 3+ years of experience in mobile development, Software Engineering or related experience\n• Experience developing iOS applicationsExperience with iOS fundamentals, including Swift, Swift UI, RxSwift etc.\n• Solid communicator, comfortable seeking and receiving feedback.\n• Strong analytical and debugging skillsA collaborative mindset to be able to partner with engineers, designers, and PMs from multiple teams to co-create impactful solutions while supporting system contributions.\n\nPreferred Qualifications\n\n• Bachelor's degree in Computer Science or equivalent experience\n\nInstacart provides highly market-competitive compensation and benefits in each location where our employees work. This role is remote and the base pay range for a successful candidate is dependent on their permanent work location. Please review our Flex First remote work policy here. Currently, we are only hiring in the following provinces: Ontario, Alberta and British Columbia.\n\nOffers may vary based on many factors, such as candidate experience and skills required for the role. Additionally, this role is eligible for a new hire equity grant as well as annual refresh grants. Please read more about our benefits offerings here.\n\nFor Canadian based candidates, the base pay ranges for a successful candidate are listed below.\nCAN\n$140,000—$155,000 CAD",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/ios-engineer-shopper-engagement-instacart-3-5696391?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/ca/job/eac0415e197a3959abf018a84e9a74551?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/ca-ios-engineer-shopper-canada-boundlessfellows-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRW5naW5lZXIsIFNob3BwZXIgRW5nYWdlbWVudCIsImNvbXBhbnlfbmFtZSI6Ikluc3RhY2FydCIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6InFPODRqZ1hVZGV5azVhRHJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior iOS Developer (F/M/D)",
            "company_name": "Arlo Technologies Canada Limited",
            "location": "Richmond, BC, Canada",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=pU3vqTeghhKhYl89AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3JsQrCMBAAUFz7CU43qtRGFEF00hYFUQR1L2l6JCfpXUmC9KP8SBFc3vKyzyhbPZBJAtDtARW-0UuPASZHdVXVFOZwlgYi6mAcCMNJxHoc71xKfdwqFaMvbEw6kSmMdEoYGxnUS5r4o45OB-y9Tlgv14uh6NnONvvgBZ5oHIsXSxih1KxbDRfqKGELxHAn4zrhNodDmf__C-e9WpuvAAAA&shmds=v1_AUFQtOPNOC2fovplWQjc9egVflcsgtCBkn_rYjyFm8LqnpAT7g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=pU3vqTeghhKhYl89AAAAAA%3D%3D",
            "extensions": [
                "5 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At Arlo, we're passionate about creating innovative and reliable solutions that help people protect what matters most to them. Our team is dedicated to delivering products that exceed our customers' expectations, while always pushing the boundaries of what's possible in the world of protection technology. Arlo’s deep expertise in AI- and CV-powered analytics, cloud services, user experience, product design, and innovative wireless and RF connectivity enables the delivery of a seamless, smart security experience for Arlo users that is easy to set up and interact with every day.\n\nAs a Senior iOS Engineer, you will play a pivotal role in delivering high-quality, scalable iOS applications across a variety of projects. Problem Solving & Innovation: Identify challenges and propose innovative solutions to enhance app performance and user experience.\n• Architect and Implement Solutions: Collaborate with product and design teams to translate business requirements into scalable, maintainable technical solutions.\n• Code Review and Quality Assurance: Ensure high coding standards and performance optimization through detailed code reviews, promoting best practices and continuous improvement.\n• Collaboration: Work closely with firmware engineers, product managers, and UX team to deliver exceptional products that align with business objectives.\n• Strong experience in building native mobile (iOS) applications with an emphasis on performance and robustness.\n• Familiarity with SOLID Design Principles.\n• Familiar with version control, issue tracking, continuous integration environment (Git/JIRA/Confluence/Jenkins or similar).\n• Experience working in Agile environments.\n\nDemonstrated expertise in audio/video real-time communication and streaming video protocols (RTSP/RTP/HLS).\n\n# The pay range for this position reflects the minimum and maximum target for new hire salaries at commencement of employment and is expected to be between CAD$105,000-165,000/year. Studies have shown that candidates from certain underrepresented communities may be less likely to apply for jobs unless they believe they meet every single one of the qualifications as described in a job description. We are committed to building a diverse and inclusive company and we are most interested in finding the BEST candidate for the job, regardless of their background. We value diversity and inclusion and are committed to a diverse, inclusive, and harassment-free workplace. We prohibit discrimination and harassment based on Indigenous identity, race, colour, ancestry, place of origin, political belief, religion, marital status, family status, physical or mental disability, sex, sexual orientation, gender identity or expression, or age, or any other legally protected status in all hiring and employment.",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/rjdp/-2462406387614612336?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAoRi9NL0QpIiwiY29tcGFueV9uYW1lIjoiQXJsbyBUZWNobm9sb2dpZXMgQ2FuYWRhIExpbWl0ZWQiLCJhZGRyZXNzX2NpdHkiOiJSaWNobW9uZCwgQkMsIENhbmFkYSIsImh0aWRvY2lkIjoicFUzdnFUZWdoaEtoWWw4OUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Middle IOS Developer (Swift)",
            "company_name": "LightSpeed Retail",
            "location": "Grise Fiord, NU, Canada",
            "via": "Ladders",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=mVK0IFEy1hY4IaRwAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMzQ4BMRAA4LjuIzjNEVlbIS4cCSF-EhvnTXc72kp1ms4Ej-NRcfmOX_HpFbOjNyYg7M41rPGJgRJmGNQvf5MhjGFPLTDq3DmgCFsiG7C_dCKJF0oxh8qyaPFd1dFDUcSW3upOLf9p2OmMKWjBZjqfvKsU7ag8eOukTogGLijaB_C_OXtG2HjKpoTTtYSVjtroL3MwuzGjAAAA&shmds=v1_AUFQtOMpwm19UqpZkEFa8uQX3CYfwPCwrGeJe-R4M99xuREPlQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=mVK0IFEy1hY4IaRwAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c8094b32e7cff2881fbb44c43aa021db98d3e62594c68e16b16.gif",
            "extensions": [
                "80,811–121,217 a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "80,811–121,217 a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Hi there! Thanks for stopping by\n\nAre you actively looking for a new opportunity? Or just checking the market? Well... you might just be in the right place!\n\nWe are looking for a Middle iOS Developer to join our mobile team, where we develop mobile applications for Ecwid by Lightspeed. Our mission is to create apps that help effectively manage online stores, making the process simpler, more convenient, and enjoyable for users.\n\nIn this role, you will join the Ecwid by Lightspeed team, an iOS app designed to help our clients manage their businesses effectively from anywhere at any time. Our goal is to provide the best app that allows business owners to solve tasks faster, process orders more efficiently, and track key metrics on the go.\n\nYou will be warmly welcomed by a friendly, collaborative team that values engineering excellence, builds modern solutions, and enjoys what they do. Your contributions will help thousands of businesses work more efficiently and make their lives easier.\n\nRequirements:\n• At least 3 years of proven experience in iOS development;;\n• Strong knowledge of Swift, clean architecture, and clean code practices;\n• Experience in building adaptive and responsive user interfaces using UIKit and SwiftUI;\n• Understanding of REST API principles and experience integrating with backend services;\n• Proficiency in working with Git;\n• English level sufficient for understanding technical documentation (Intermediate or higher);\n• Russian level sufficient for understanding abstract ideas in spoken language.\n\nTechnology Stack:\n• Storage: Realm\n• Network: URLSession\n• Async: GCD, OperationQueue, Swift concurrency\n• UI: UIKit, SwiftUI, Auto Layout\n• Architecture: MVC, MVVM, Clean Swift\n• Images: Kingfisher\n• Navigation: Coordinator Pattern, UIKit Navigation Controllers\n• Analytics: Firebase Analytics, Amplitude, Facebook\n• CI/CD: TeamCity\n• Tests: XCTest, XCUITest\n\nResponsibilities:\n• Develop and maintain an iOS app for online stores;\n• Design, discuss, and implement technical solutions that address user's business needs;\n• Identify and fix performance issues and optimize the app for fast and stable operation;\n• Collaborate with the team to learn and share best practices and knowledge;\n• Participate in discussions about architectural decisions and task planning;\n• Work closely with product managers, designers, and developers to implement product features on time;\n• Fix bugs and maintain high-quality code standards;\n• Conduct code reviews;\n• Write and maintain unit and UI tests.\n\nWhat's in it for you?\n• Flexible hours and hybrid work\n• People Experience - Our PX benefit allows you to work from pretty much anywhere in the world for 60 days a year\n• Lightspeed equity scheme (we are all owners)\n• Health & Wellness Credit - expense up to 1300 GEL per year towards your gym membership, yoga classes, a new bike or whatever else you do for your health\n• Mental Health Support through the Modern Health App - whether it is meditation, coaching or counseling you need - each employee gets access to this platform.\n• Support to talk with external Russian speaking psychologists (up to 7 sessions/year)\n• A medical insurance plan that covers dental care\n• At Lightspeed we value your professional development; you'll have regular performance reviews and opportunities to make growth\n• Variety of resources. We provide Apple MacBooks for work, free access to LinkedIn Learning for any course of your choice and cover 50% of the cost of SkyEng English classes\n• Time off to volunteer and give back to your community\n• Awesome office space located in Saburtalo (Tbilisi)\n\nTo all recruitment agencies: Lightspeed does not accept unsolicited agency resumes. If we have not directly engaged your company in writing to supply candidates for a specific vacancy, Lightspeed will not be responsible for any fees related to unsolicited resumes.\n\nLightspeed is a proud equal opportunity employer and we are committed to creating an inclusive and barrier-free workplace. Lightspeed welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.\n\nWhere to from here?\nObviously, this has to be mutually beneficial: we want you to step into a role you love, and we want to offer you a place you're proud to come to every day. For a glimpse into our world check out our career page here.\n\nLightspeed is building communities through commerce, and we need people from all backgrounds and lived experiences to do that. We were founded in 2005, in Montreal's gay village and our original members were all part of the LGBTQ+ community. The ethos of our business has been about inclusion from the very beginning, and we strive to provide a workplace where everyone belongs.\n\nWho we are:\nPowering the businesses that are the backbone of the global economy, Lightspeed's one-stop commerce platform helps merchants innovate to simplify, scale, and provide exceptional customer experiences. Our cloud commerce solution transforms and unifies online and physical operations, multichannel sales, expansion to new locations, global payments, financial solutions, and connection to supplier networks.\n\nFounded in Montréal, Canada in 2005, Lightspeed is dual-listed on the New York Stock Exchange (NYSE: LSPD) and Toronto Stock Exchange (TSX: LSPD). With teams across North America, Europe, and Asia Pacific, the company serves retail, hospitality, and golf businesses in over 100 countries.\n\nLightspeed handles your information in accordance with our Applicant Privacy Statement.",
            "apply_options": [
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/middle-ios-developer-swift-lightspeedretail-grise-fiord-nu_78409364?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUgSU9TIERldmVsb3BlciAoU3dpZnQpIiwiY29tcGFueV9uYW1lIjoiTGlnaHRTcGVlZCBSZXRhaWwiLCJhZGRyZXNzX2NpdHkiOiJHcmlzZSBGaW9yZCwgTlUsIENhbmFkYSIsImh0aWRvY2lkIjoibVZLMElGRXkxaFk0SWFSd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Highly Experienced iOS Developer Wanted for Contract Opportunity",
            "company_name": "Randstad",
            "location": "Vancouver, BC, Canada",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Niv_cj9BRSgkctR7AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOMQrCQBAAsc0TrNZWNBHBRjujKDYBBS1lc1mTk3P3uNuE5Gn-zthMMTAwyXeSPM62btwAx95TsMSGKrDFDQ7UkZPRwQNZR_mSALmwBjQKhfcStGWrAyzhIiVEwmAaEIaTSO1oumtUfdxmWYwuraOiWpMa-WTCVEqfvaWMfzxjg4G8Q6XnerPqU8_1fHZFrsZmfGG4IxtpOwoL2OcLyJGxwh_KNZn9vAAAAA&shmds=v1_AUFQtONtaXhIINZF-XBNadZX-N64b5l8MZuW7Hor3pZsvfGthA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Niv_cj9BRSgkctR7AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c80c9de153a109ccdd75652fbf36f2e20c9ab91adfe025863f8.gif",
            "extensions": [
                "26 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Are you a skilled developer looking for your next challenge? We have an exciting opportunity for a talented iOS Developer to join our client's team on a 6-month contract with a strong possibility of extension.\nAbout the Job\n\nThis is a fantastic chance to work with a high-profile client and contribute to their innovative projects. As a consultant, you'll have the opportunity to work on a variety of tasks and develop your skills in a dynamic environment.\nWhat's in it for You\n• Competitive Market Rates: Enjoy highly competitive hourly rates that reflect your expertise and value as a developer.\n• Flexible Contract: Work on a 6-month contract with a strong possibility of extension, giving you stability and security.\nRequirements\n\nTo be successful in this role, you'll need to have:\n• A solid understanding of iOS development principles and best practices.\n• Experience working with a variety of technologies and tools.\n• Strong problem-solving skills and attention to detail.\nBenefits\n\nAs a consultant with our client, you'll enjoy a range of benefits, including:\n• Opportunity to work on high-profile projects: Contribute to innovative and challenging projects that will help you grow professionally and personally.\n• Diverse and dynamic work environment: Collaborate with a talented team of professionals who share your passion for technology and innovation.\nEstimated Salary:\n\nRoughly $100-$150 per hour, depending on experience and location.",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ca.trabajo.org/job-3051-53c14f28935a236456834fd8436087a2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJIaWdobHkgRXhwZXJpZW5jZWQgaU9TIERldmVsb3BlciBXYW50ZWQgZm9yIENvbnRyYWN0IE9wcG9ydHVuaXR5IiwiY29tcGFueV9uYW1lIjoiUmFuZHN0YWQiLCJhZGRyZXNzX2NpdHkiOiJWYW5jb3V2ZXIsIEJDLCBDYW5hZGEiLCJodGlkb2NpZCI6Ik5pdl9jajlCUlNna2N0UjdBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Staff Ios Engineer H/F",
            "company_name": "Score Media and Gaming Inc.",
            "location": "Toronto, ON, Canada",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=qiPCrQFODzsfmcQEAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQ6CMBAA0LjyCU43G2gNiYuORhETdcCdHOUoNXBHeh34HD_V-IaXfTdZ0SQcBqhF4cI-MFGEm71CAXfpQAmjG0EYKhE_0fY0prTo0VrVyXhNmIIzTmYrTJ2s9iOd_mt1xEjLhIna8rBfzcJ-VzZOIsGD-oCA3EOFc2APNTsDgeEtUThJDq9nDmdk7PEHpfXYkqMAAAA&shmds=v1_AUFQtOMToHeYbXY_GYGySLIimJz5NCZAXt_LVf76EQXpsXYALQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=qiPCrQFODzsfmcQEAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c80b68d6d672de340e443506746a69d3a82871f41b192f8e097.gif",
            "extensions": [
                "6 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time"
            },
            "description": "The Mobile Platform team provides the foundation for our mobile clients and enables our mobile teams to build and deliver features faster and with high quality. This team is responsible for the overall developer experience on both iOS and Android as we strive to leverage the latest capabilities of each platform. We embrace collaboration to drive new architecture and improve the iOS community at Penn Interactive. Work with the product team to design, architect, and ship our amazing applications.\n\nImplement polished user interfaces with the help of our design team.\n\nWork with other engineers through technical collaboration, discussion, and code review.\n\nCreate efficiencies by building custom and innovative mobile tooling.\n\nMaintain and enhance the mobile CI/CD pipeline and tooling.\n\nSolve difficult problems related to large data sets and responsive UIs.\n\nHelp our QA team to automate testing and continuous integration.\n\n6+ years of experience in commercial iOS development.\n• Demonstrates significant technical expertise while working independently and in collaboration with others.\n• Experience creating custom UI elements and creating a rich, interactive mobile UX.\n• Experience with unit testing.\n• Solid understanding of modern software architectures.\n• Solid knowledge of object-oriented design, software development principles, and design patterns.\n• Solid knowledge of concurrency best practices and pitfalls.\n• A degree in Computer Science, Engineering, and/or equivalent experience.\n• A passion for sports and/or gaming is considered an asset.\n• Desired Skills: Git, iOS, Xcode, Swift, Objective-C, UIKit, GCD, Async/Await, CocoaPods, Dependency Injection (Dip), Unit Testing, GraphQL.\n\n#",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/rjdp/8327758739742169078?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GlobalCareer.io",
                    "link": "https://globalcareer.io/remote-jobs/staff-ios-engineer-platform/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBJb3MgRW5naW5lZXIgSC9GIiwiY29tcGFueV9uYW1lIjoiU2NvcmUgTWVkaWEgYW5kIEdhbWluZyBJbmMuIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04sIENhbmFkYSIsImh0aWRvY2lkIjoicWlQQ3JRRk9EenNmbWNRRUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Mobile Application Developer - Vancouver",
            "company_name": "Yeah! Global",
            "location": "Vancouver, BC, Canada",
            "via": "ZipRecruiter",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Rf4uW320SVZTilMtAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0WNsQrCMBRFce0nOD0HF6mNCC46iFYoCK6CU3mJjybyzAtJLP0h_9Pq4nI5w-Hc4j0p9hfRjgkOIbAzmJ14OFFPLIEiLOGK3sir__FZNCTCaCyMViPSMU13NueQtkqlxFWX8pgwlZGnEk9aBvUQnb7TJouRAmOmdr1ZDVXw3WJ-I7QzaFg0Mjj_vyvhWJdQo8c7fgAW_GUSqAAAAA&shmds=v1_AUFQtOM8NWiWknr1NaNqtfqq2t1MexqlYkEfjtjx-G3juhYGSg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Rf4uW320SVZTilMtAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Note: This position does not offer any Visa sponsorship. We are only looking for applicants who are either local to Vancouver, Canada, or ready to relocate to the employer's location.\n\nJob Summary: Our Client is looking for a creative and skilled Mobile Application Developer to join their team. You will be responsible for designing, developing, and maintaining high-quality mobile applications for both iOS and Android platforms. Your role will involve close collaboration with cross-functional teams to deliver innovative mobile solutions that enhance user experience.\n\nKey Responsibilities:\n• Develop and maintain advanced applications for both iOS and Android platforms.\n• Collaborate with cross-functional teams to define, design, and implement new features.\n• Integrate mobile applications with backend services, ensuring seamless data flow and performance.\n• Optimize application performance, quality, and responsiveness.\n• Identify and resolve bugs, and improve application reliability.\n• Continuously explore and implement new technologies to enhance development efficiency.\n• Write clean, maintainable, and well-documented code.\n• Participate in code reviews and provide constructive feedback to peers.\n• Stay informed about the latest industry trends and technologies to ensure the applications are up-to-date.\n\nQualifications:\n• Bachelors degree in Computer Science, Information Technology, or a related field.\n• 3+ years of proven experience as a Mobile Application Developer or in a similar role.\n• Proficiency in programming languages such as Swift, Objective-C, Java, and Kotlin.\n• Experience with mobile development frameworks like React Native or Flutter.\n• Strong understanding of the full mobile development lifecycle, including design, coding, testing, and deployment.\n• Excellent knowledge of UI/UX principles and best practices.\n• Familiarity with RESTful APIs to connect mobile applications to backend services.\n• Strong problem-solving and analytical skills.\n• Excellent communication and teamwork abilities.\n\nPreferred Skills:\n• Experience with CI/CD practices and tools.\n• Knowledge of mobile app security best practices.\n• Familiarity with cloud services and mobile backend-as-a-service (MBaaS) platforms.\n• Certification in mobile application development (e.g., Certified iOS Developer, Android Developer).",
            "apply_options": [
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Yeah!-Global/Job/Mobile-Application-Developer-Vancouver/-in-Vancouver,BC?jid=c85029f223d36fad&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Career Page",
                    "link": "https://www.careers-page.com/yeah-global/job/QYXX6865?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/4286205883749182111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.ca",
                    "link": "https://www.monster.ca/job-openings/mobile-application-developer-vancouver-vancouver-bc--b01c9578-1e25-4da5-989c-cb4fba0e5ba3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Dice",
                    "link": "https://www.dice.com/job-detail/fdad64dd-e974-43b8-81fa-c4541c896201?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/mobile-application-developer-vancouver-at-yeah%21-global-4086234180?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Career Beacon",
                    "link": "https://www.careerbeacon.com/en/job-9/1739031/yeah-global/mobile-application-developer-vancouver/vancouver-bc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/mobile-application-developer-vancouver-jobs/D0337746FC44BD2E?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIC0gVmFuY291dmVyIiwiY29tcGFueV9uYW1lIjoiWWVhaCEgR2xvYmFsIiwiYWRkcmVzc19jaXR5IjoiVmFuY291dmVyLCBCQywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJSZjR1VzMyMFNWWlRpbE10QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Senior iOS Developer",
            "company_name": "Pelmorex Corp.",
            "location": "Oakville, ON, Canada",
            "via": "Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=MG_HXkPkhRVjGVzCAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43OWhNRHDRsYLgYIV-QLnWo4lecyEXSr7DLxbf8Krvqtp1FLwk8G0HV1qIJVKCPdxlACVMowMJcBOZmNYXl3PUs7WqbCbNmP1oRpmtBBqk2LcM-q9Xh4kiY6b-eDoUE8O03TyJZ0lUoJEUDfgALX4Wz0w1tI8aGgz4wh_RWMQ2lQAAAA&shmds=v1_AUFQtOPleP8VbMzEFp2cGuSLwjaEk4vb7Soc0GGEuj7gAbLD0w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=MG_HXkPkhRVjGVzCAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c80e9626319af199f17811cbbe652cbcf15d68432fe70810f7a.gif",
            "extensions": [
                "28 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time"
            },
            "description": "We are seeking an experienced Senior iOS Developer to join our team at Pelmorex Corp. in Canada.\nJob Description:\n\nYou will play a key role in the development and enhancement of one of Canada's most popular apps, The Weather Network/MétéoMédia, as part of our Apps team.\n\nYour responsibilities will include requirement analysis, design, implementation, integration, testing, and deployment of our iOS application.\n\nYou will ensure the app is defect-free by writing unit and functional tests using TDD/ATDD approach.\n\nMaintain and execute a pipeline of automated tests to continuously integrate and test code changes.\n\nWork closely with other Developers, the Tech Lead, QA, Product Owner, Designer, and stakeholders to deliver high-quality production-ready code.\nRequirements:\n• University degree in Computer Science or College diploma in Computer Programming, Information Technologies, or a related discipline\n• Solid Object Oriented Design and Analysis Skills and modern development practices\n• Experience working with Test Driven Development\n• Data retrieval and management including remote sources and techniques\n• Caching data and efficiently loading data for use\n• Excellent automation testing skills\n• A creative and innovative thinker to provide high value-of-service to clients\nBenefits:\n• Frequent employee pulse surveys to gather feedback and improve the work environment\n• Pelmorex Learning Academy offering training and development opportunities\n• Free online doctor visits with Maple Online Healthcare\n\nThe estimated salary for this position is between $80,000-$120,000 per year, depending on experience and qualifications.",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://ca.trabajo.org/job-3051-d2315bcdb3f4179732c0c6ea262cecbf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlBlbG1vcmV4IENvcnAuIiwiYWRkcmVzc19jaXR5IjoiT2FrdmlsbGUsIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6Ik1HX0hYa1BraFJWakdWekNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior iOS Developer (OTT) (English Services) (Telework) in\n            \n              Toronto, Ontario",
            "company_name": "CBC/Radio-Canada",
            "location": "Toronto, ON, Canada",
            "via": "Academic Jobs Teaching Education University College Nonprofit",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=TSzQt_FD1b2kv0VXAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1WOvQrCQBCEsc0jWG3nDyYngo12RhEsDJj0solLcnruhtsjWvm4PoeKjU7xwXzNTPTsRY-c2IoHm-Wwpo6ctORhmBXFCIYbrp3VBnLyna1I36ogRzfxlxFYjuAnfwWgEC8cZAIZB_RWIIadlKCEvmpAGLYitaP-sgmh1YUxqi6pNWCwVVLJ1QhTKXdzllI_OGqDnlqHgY6z-fSetFyPB-kqNQc8WYlTZDzh-9TP8n4CX_0CHoRhV-kAAAA&shmds=v1_AUFQtOPglSJ_HU4CSB22Q3vVQZiSTRYdED545Lz2tje9hqlfEQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=TSzQt_FD1b2kv0VXAAAAAA%3D%3D",
            "extensions": [
                "Contractor"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor"
            },
            "description": "Position Title:\n\nSenior iOS Developer (OTT) (English Services) (Telework)\n\nStatus of Employment:\n\nContractee Long-Term (Fixed Term)\n\nPosition Language Requirement:\n\nLanguage Skills:\n\nWork at CBC/Radio-Canada\n\nAt CBC/Radio-Canada, we create content that informs, entertains and connects Canadians on multiple platforms. Our successes and accomplishments are driven by embodying and upholding values, which include creativity, integrity, inclusiveness and relevance.\n\nDo you think you have the ability and drive to keep up with this exciting, ever-changing industry? Whether it be in front of the camera, on air, online or behind the scenes, you would be joining a team that thrives on making connections and telling stories that are important to Canadians.\n\nUnposting Date:\n\n2024-11-21 11:59 PM\n\nThis role offers the possibility of full-time telework. Work schedule to be discussed with Hiring Manager according to the guidelines defined by the department. This is a permanent / full-time opportunit\n\nWhy is this role important?\n\nYou will be an important element of our over-the-top platform team. As such, working closely with the product owners, architects and technical managers, your role is to ensure the smooth execution of product front-end development and coordinate the technical work required to deliver requested features, while adhering to the standards and practices agreed to by the development management team.\n\nThe team you will be part of is in charge of an harmonized product, powering CBC Gem and ICI Tou.TV.\n\nPerks you can look forward to:\n• Flexible work schedules, allowing you to prioritize yourself, your family and your work;\n• Work from home opportunities;\n• Competitive total rewards package;\n• Opportunities to work with cutting edge technology;\n• Opportunities for continued learning and professional development;\n• Opportunities to become a member of our Employee Resource Groups;\n• Pair programming and mentorship opportunities, where you can learn from the best in the industry and help coach new talent;\n• A creative and dynamic work environment, where your ideas and contributions can be heard, valued and respected;\n• A supportive management team committed to upholding the highest standards of diversity and inclusivity;\n• An environment which favours experimentation and an iterative approach in order to achieve the highest form of technical innovation.\n\nYour responsibilities:\n• Design and/or modify reusable components for Radio-Canada's digital platforms; such as the audio/video player\n• Ensure compliance with standards and control the quality of the product throughout the project's execution;\n• Stay informed of new trends in the various fields of digital development;\n• By being proactive, propose solutions to the challenges encountered;\n• Participate in Agile Scrum activities designed to review ongoing production projects in order to make necessary corrections and adjustments, or completed projects to measure their results.\n• Participate in the development of user stories for our various products;\n• Ensure the good performance of developed applications to handle high loads;\n• Participate in sprint planning, retrospectives, and application deployments;\n• Participate in code reviews and solution deployments.\n\nWe are looking for a candidate matching the following profile:\n• University degree or equivalent experience;\n• At least 3 years of experience in software development;\n• Experience in developing complex and high-performance mobile applications;\n• Proficiency with Xcode, Git, and the Swift language;\n• Experience in developing an application published on the App Store;\n• Experience in developing within code review context (pull request).\n• Knowledge of programming patterns (such as MVC, MVP, or MVVM);\n• Knowledge of SOLID architecture principles is an asset;\n• Ability to read, produce, and adhere to software architecture diagrams (UML, sequence diagram, etc.);\n• Interest in working on an application available on multiple form factors (mobile/tablet/TV).\n• Knowledge of SwiftUI, Combine;\n• Knowledge of AVPlayer, CoreData, and AlamoFire is an asset;\n• Knowledge of Cocoapods (including the design/maintenance of internal pods).\n• Knowledge of audio-video broadcasting on the web (streaming) is an asset;\n• Knowledge of other programming languages is an asset;\n• Knowledge of design patterns is an asset;\n• Good general knowledge and strong intellectual curiosity (to acquire and develop new knowledge and skills);\n• Critical thinking (to question and propose new ideas);\n• A keen interest in the major trends and challenges of the digital world;\n• Meticulousness, independence, and resourcefulness;\n• Excellent stress management and priority setting;\n• Analytical and conceptual thinking skills;\n• Flexibility, initiative, and dynamism;\n• Ability to work in a team, excellent communicator;\n• Bilingualism (English and French) spoken and written, mandatory.\n\nCandidates may be subject to skills and knowledge testing.\n\nWe thank all applicants for their interest, but only candidates selected for an interview will be contacted.\n\nCBC/Radio-Canada is committed to being a leader in reflecting our country’s diversity. That’s because we can only create and tell the stories that connect Canadians, by having a workforce that mirrors the ever-changing makeup of our country. That’s why we, as an employer, value equal opportunity and nurture an inclusive workplace where our individual differences are not only recognized and valued, but also extend to and pervade all the services we provide as Canada’s public broadcaster. For more information, visit the Diversity and Inclusion section (http://cbc.radio-canada.ca/en/working-with-us/jobs/diversity-inclusion-cbc-rc) of our website. If you have accommodation needs at this stage of the recruitment process, please inform us as soon as possible by sending an e-mail to recruitment@cbc.ca .\n\nYou are invited to consult and familiarize yourself with our Code of Conduct, which can be found on our corporate website (http://cbc.radio-canada.ca/en/vision/governance/corporate-policies/values-ethics/conduct) . All employees must adhere to the Code as a condition of employment. We also invite you to take a look at our policy on conflicts of interest (http://cbc.radio-canada.ca/en/vision/governance/corporate-policies/human-resources/conflicts) . In the event that you become an employee, it will be important to inform us, as quickly as possible, of any situation that, because of your hiring, constitutes or could appear to constitute a conflict of interest.\n\nPrimary Location:\n\nBroadcast Centre 205 Wellington St. W., Toronto, Ontario, M5V 3G7\n\nNumber of Openings:\n\n1\n\nWork Schedule:\n\nFull time\n\nAt CBC/Radio-Canada (http://cbc.radio-canada.ca/en) , we create content that informs, entertains and connects Canadians on multiple platforms. Our successes and accomplishments are driven by embodying and upholding values, which include creativity, integrity, inclusiveness and relevance.\n\nApply Now\n\nTo help us track our recruitment effort, please indicate in your cover/motivation letter where (vacanciesincanada.ca) you saw this job posting.",
            "apply_options": [
                {
                    "title": "Academic Jobs Teaching Education University College Nonprofit",
                    "link": "https://vacanciesincanada.ca/job/senior-ios-developer-ott-english-services-telework-in-toronto-ontario/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAoT1RUKSAoRW5nbGlzaCBTZXJ2aWNlcykgKFRlbGV3b3JrKSBpblxuICAgICAgICAgICAgXG4gICAgICAgICAgICAgIFRvcm9udG8sIE9udGFyaW8iLCJjb21wYW55X25hbWUiOiJDQkMvUmFkaW8tQ2FuYWRhIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04sIENhbmFkYSIsImh0aWRvY2lkIjoiVFN6UXRfRkQxYjJrdjBWWEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Experienced iOS Developer Wanted for Large-Scale Projects",
            "company_name": "LGS, une Société IBM  an IBM Company",
            "location": "Montreal, Quebec, Canada",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=azNkLoAQ_tWmPANUAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3IMW7CQBBGYdFyBKq_joyNItEkHSRCQaCAXFCi8TKxFy0zq90hMkfiHByBCwXSvCd9w_tguPnsIyfP4vgA_13jg3856MOwI7EH_mjCilLL49pRYGySHtlZxhhLbZCZkuuggoVqG3j03pnF_FZVOYeyzUbmXen0VKlwo3111CY_s88dJY6BjPev00lfRmlfZqtFXeAsjFqdv13tdsXXbA2Q_H-up0hygResVSwxhQLbMzfsCsxJ6EB_qcQPDdYAAAA&shmds=v1_AUFQtOPffLmfHoXLJyA_Ef8naE2r-GNLQBlQXHj6XypxcbZsfw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=azNkLoAQ_tWmPANUAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c80dd79d9fd4eccc1fcdd319f1104f09aa75a6399c094b7ce6c.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "LGS, an IBM Company, is committed to providing a workplace that values professional growth and fosters diversity and inclusivity. We welcome talents from both local and international backgrounds.\n\nAs a key member of our team, you will play a crucial role in driving major projects that propel our clients' businesses forward and improve people's lives. You will be at the heart of collaborative large-scale digital transformation projects in both the public and private sectors.\n\nThe IBM Client Innovation Centre Quebec employs professionals who collaborate on projects within technology practices, offering local and remote services. Our employees, regardless of their level of experience, are paired with a coach to support their professional growth. As part of IBM's global network, we have offices in Montreal, Gatineau, Rimouski, and Quebec City.\n\nWe offer a competitive salary of $120,000 - $180,000 per year, depending on experience.\nJob Description\n\nParticipate in the development of client projects: new Apps, new feature development on existing applications, and maintenance; helping our clients to build highly scalable Apps.\n\nKey Responsibilities:",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ca.trabajo.org/job-3051-fca919681e78f7ac0b4893a3bf0e0f9c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBpT1MgRGV2ZWxvcGVyIFdhbnRlZCBmb3IgTGFyZ2UtU2NhbGUgUHJvamVjdHMiLCJjb21wYW55X25hbWUiOiJMR1MsIHVuZSBTb2Npw6l0w6kgSUJNICBhbiBJQk0gQ29tcGFueSIsImFkZHJlc3NfY2l0eSI6Ik1vbnRyZWFsLCBRdWViZWMsIENhbmFkYSIsImh0aWRvY2lkIjoiYXpOa0xvQVFfdFdtUEFOVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Software Engineer (iOS)",
            "company_name": "Rakuten",
            "location": "Toronto, ON, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=q3ywKN_7NjwBFaYlAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCQAwAUFz7CQ6SUaXeieCio4jgYMG6l7TG62lNyiVif8J_Vpc3vuwzylwpN3tjIthziEyUYBqLcgYLOEoNSpiaFoThIBI6Gm9bs1433qt2LqihxcY18vTCVMvg71Lrn0rbX9p3aFSt1svB9RzmkzM-XkYMkeEiSdgkh-KUww4Zr_gFUUxAw5AAAAA&shmds=v1_AUFQtOOO3sM9YfPsXByFRY4J0DDlO9DTHZd9TCFjGJg5QDyzbQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=q3ywKN_7NjwBFaYlAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505374b67786c703257a6/images/36595d975d003c80b318ce05e6c754cbb63852396cea8d1deeaa3e40db5c6def.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Job Description:\n\nRakuten International oversees 7 businesses with over 4,000 employees globally. The brand is recognized for its leadership and innovation in e-commerce, digital content, advertising, entertainment, and communications, bringing the joy of discovery and access to more than 1 billion members across the world. Our teams deliver on the company’s mission to delight merchants and customers through innovation, optimism, and teamwork\n\nRakuten Rewards is looking for an iOS engineer to join our rapidly growing engineering team. We’re an international team spanning across 3 continents responsible for building software used by hundreds of millions of users.\n\nWorking within a Squads structure, you will collaborate with product, design and engineering teammates to build, and maintain our next generation of iOS applications while identifying and fixing application bottlenecks, maintaining the core code, and updating applications published on the App Store.\n\nKEY RESPONSIBILITIES:\n• Designing and building mobile applications for Apple’s iOS platform.\n• Collaborating with the design team to define app features.\n• Ensuring quality and performance of application to specifications.\n• Identifying potential problems and resolving application bottlenecks.\n• Fixing application bugs before final release.\n• Publishing application on App Store.\n• Maintaining the code and atomization of the application.\n• Designing and implementing application updates.\n\nMINIMUM REQUIREMENTS:\n• Proven experience as an app developer.\n• Proficiency in Swift and the iOS ecosystem.\n• Knowledge of Apple’s design principals and application interface guidelines.\n• Familiarity with push notifications, APIs and cloud messaging.\n• Experience with continuous integration.\n\nQUALIFICATION REQUIREMENTS:\n• Bachelor’s degree in Computer Science or Software Engineering\n• 3+ years building native applications for iOS devices\n• Proficient in Objective-C, Swift, and Cocoa Touch.\n• Proficient with Git version control\n\nFive Principles for Success\nOur worldwide practices describe specific behaviors that make Rakuten unique and united across the world. We expect Rakuten employees to model these 5 Shugi Principles of Success.\n\nAlways improve, Always Advance - Only be satisfied with complete success - Kaizen\nPassionately Professional - Take an uncompromising approach to your work and be determined to be the best\nHypothesize - Practice - Validate – Shikumika - Use the Rakuten Cycle to succeed in unknown territory\nMaximize Customer Satisfaction - The greatest satisfaction for our teams is seeing their customers smile\nSpeed!! Speed!! Speed!! - Always be conscious of time - take charge, set clear goals, and engage your team\n\nRakuten provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type. Rakuten considers applicants for employment without regard to race, color, religion, age, sex, national origin, disability status, genetic information, protected veteran status, sexual orientation, gender, gender identity or expression, or any other characteristic protected by federal, state, provincial or local laws.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://emplois.ca.indeed.com/viewjob?jk=a97761e15e3ec388&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Ebates-Canada,-Inc./Job/Software-Engineer-(iOS)/-in-Toronto,ON?jid=102891fea6880c23&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Welcome To The Jungle",
                    "link": "https://app.welcometothejungle.com/jobs/PV32TR4x?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/software-engineer-ios-rakuten-JV_IC2281069_KO0,21_KE22,29.htm?jl=1009459043907&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/software-engineer-ios-at-rakuten-rewards-4034715190?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Otta",
                    "link": "https://app.otta.com/jobs/PV32TR4x?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://fr.simplyhired.ca/job/MyXaC2FhPJPJ80fEFW98vh7PrYJuSrocTLpDfq5iUU299-Va6Lsgpg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talentify",
                    "link": "https://www.talentify.io/job/software-engineer-ios-toronto-ontario-ca-rakuten-1023319?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoaU9TKSIsImNvbXBhbnlfbmFtZSI6IlJha3V0ZW4iLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJxM3l3S05fN05qd0JGYVlsQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRFZYVHpodGMwNXdWR3B0VWtwd1IwcDZlV1J2VUVkTlMwcDFXRE5JWTNkclQydGFVbmhHVERkaldYWTJVV05DTm5kaFN6SkViM1kwVFZabGNHdDVWMUZxTTFNME5XWlNRMFJGUW1kZlMxRnlOVnBKY0Vrd2FFTmhaMDlNUmtsMWRXcDJPVlZLYkU1cVNDMUlXVVpuY0hscmExZHBRMUJXUldONmNEZ3dVVWQyYjNSUlNXUTJOMlI0V1hwVFdIQjNNQzA0ZFdWb1RtZGFXR3ByWW0weFdWOURkRVp4YjBoYVJUQlRaMVpDUkhwSmVYWnVUSGt3V0VOVldFRlFXVkZOZW5OT1Yzb3RTWE5CV1MxQmNuTm5PRGMxVWpWWmQwRm1VWEpHVlhJMllYTkhhemhwVWtSSlFrb3RhM1p6VlhSMkxWRllRbmxyYTAxRmFWZENNMjFuVGtGMGJrd3dPQklYVDBGWFJsbzNlVmhLTm1Kb2NEZzBVRGhrVjFOelFVMGFJa0ZHV0hKRlkyODVVRmwxVFd0RFRsZE1OVXRMZUVvNWIwTnhUa1p0WlVwMVgyYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Canada&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRFZYVHpodGMwNXdWR3B0VWtwd1IwcDZlV1J2VUVkTlMwcDFXRE5JWTNkclQydGFVbmhHVERkaldYWTJVV05DTm5kaFN6SkViM1kwVFZabGNHdDVWMUZxTTFNME5XWlNRMFJGUW1kZlMxRnlOVnBKY0Vrd2FFTmhaMDlNUmtsMWRXcDJPVlZLYkU1cVNDMUlXVVpuY0hscmExZHBRMUJXUldONmNEZ3dVVWQyYjNSUlNXUTJOMlI0V1hwVFdIQjNNQzA0ZFdWb1RtZGFXR3ByWW0weFdWOURkRVp4YjBoYVJUQlRaMVpDUkhwSmVYWnVUSGt3V0VOVldFRlFXVkZOZW5OT1Yzb3RTWE5CV1MxQmNuTm5PRGMxVWpWWmQwRm1VWEpHVlhJMllYTkhhemhwVWtSSlFrb3RhM1p6VlhSMkxWRllRbmxyYTAxRmFWZENNMjFuVGtGMGJrd3dPQklYVDBGWFJsbzNlVmhLTm1Kb2NEZzBVRGhrVjFOelFVMGFJa0ZHV0hKRlkyODVVRmwxVFd0RFRsZE1OVXRMZUVvNWIwTnhUa1p0WlVwMVgyYyIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}