{
    "search_metadata": {
        "id": "67850553a6f6737e4a4ed17c",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/313e9e513231578c/67850553a6f6737e4a4ed17c.json",
        "created_at": "2025-01-13 12:21:39 UTC",
        "processed_at": "2025-01-13 12:21:39 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHRGVubWFyaw&udm=8&fc=EswCCowCQUpHOUprT1BNV0drNUhaSzlMc0Q3MHhaa3kzYTRVN2pobGV4VGxpUGxITXBKZkt0ek5SUzN6amVFeGxSeHhxQ3VWaHgzbmtrZ1ZUaUpKSXpMT1lqWU9ZTlRsMU84aENJbWRmVUlzT3ZLUVBoNnpyOF80TnhIMEtPN3JiazZ2SDJudU1fTWExM1hnaURtdGJtNzhESXhucnhhVDBORUlvSmJtenpNYXQtOHhSb21sX3ktTHVCNlV0UHViOWlWNDVod1d3LS1peUhkNjZPQmp6QVZ0czctcGNRbWt1NjR1bTJHbXdrZlNVblhqelA5QzlrMTNuVGFEYXRIcFpBbFlZdDEyaF9CNEUzdVVWUhIXVHdXRlo1enFNZURkcHRRUDA5eUZ1QUUaIkFGWHJFY3BSd2FNakgtaWcwSGFCQm5WRTdpWWMtYzNvNEE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/313e9e513231578c/67850553a6f6737e4a4ed17c.html",
        "prettify_html_file": "https://serpapi.com/searches/313e9e513231578c/67850553a6f6737e4a4ed17c.prettify",
        "total_time_taken": 1.79
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Denmark",
        "location_used": "Denmark",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMUJOVjBkck5VaGFTemxNYzBRM01IaGFhM2t6WVRSVk4ycG9iR1Y0Vkd4cFVHeElUWEJLWmt0MGVrNVNVek42YW1WRmVHeFNlSGh4UTNWV2FIZ3pibXRyWjFaVWFVcEtTWHBNVDFscVdVOVpUbFJzTVU4NGFFTkpiV1JtVlVselQzWkxVVkJvTm5weU9GODBUbmhJTUV0UE4zSmlheloyU0RKdWRVMWZUV0V4TTFobmFVUnRkR0p0TnpoRVNYaHVjbmhoVkRCT1JVbHZTbUp0ZW5wTllYUXRPSGhTYjIxc1gza3RUSFZDTmxWMFVIVmlPV2xXTkRWb2QxZDNMUzFwZVVoa05qWlBRbXA2UVZaMGN6Y3RjR05SYld0MU5qUjFiVEpIYlhkclpsTlZibGhxZWxBNVF6bHJNVE51VkdGRVlYUkljRnBCYkZsWmRERXlhRjlDTkVVemRWVldVaElYVkhkWFJsbzFlbkZOWlVSa2NIUlJVREE1ZVVaMVFVVWFJa0ZHV0hKRlkzQlNkMkZOYWtndGFXY3dTR0ZDUW01V1JUZHBXV010WXpOdk5FRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Engineer",
            "company_name": "Public",
            "location": "Copenhagen, Denmark",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=W_ldtwg7pbDqaEThAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQrCMBAAQLz2CYKw56KJCF70qCJ4UegDShKWZGu6G7IR-gSfLc5huu-q6wdkkgr0HODGkRixwg4e4kHR1ZBAGO4iMeP6nForerJWNZuozTUKJshshdHLYifx-m_U5CqW7BqOh-N-MYVjv3l9fKYAxHCRgpxcRN7CFXl29f0DQ4qQ84sAAAA&shmds=v1_AUFQtOO-1SVEc1nwUcV3mfyZzlIZIxzh1PiiewWsXN1oKskHdQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=W_ldtwg7pbDqaEThAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862cabcf88a619cb1c6c766c1cc3d0c5fb108f68024c09247488.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Us\n\nPublic is an investing platform that makes building a multi-asset portfolio fast, frictionless, and secure. Members can trade stocks, options, bonds, crypto, ETFs, and alternative assets—all in one place. Alongside its robust suite of investing tools, Public offers Alpha, a layer of artificial intelligence that provides fundamental data and custom analysis to support informed investment decisions.\n\nSince 2019, Public has raised over $300 million. Investors include Accel, Tiger Global, Will Smith's Dreamers VC, The Chainsmokers' Mantis VC, and Shari Redstone's Advancit Capital, as well as renowned figures in business and culture, like Maria Sharapova, Tony Hawk, and NYU Stern professor Scott Galloway.\n\nWhat You’ll Do\n\nWe're looking for a Senior iOS Engineer to join our team. You’ll be responsible for working on our top rated iOS products installed by millions. The ideal candidate is both forward-thinking and hands-on, has a strong sense of ownership and drive for high-quality delivery, and is a good mentor and co-worker. At Public, we pride ourselves on collaboration, and you will work closely with Product and Design to create impactful features for our users and propel our growth initiatives.\n\nThis role is onsite in our Copenhagen office.\n\nWhat We’re Looking For\n• 5+ years of professional software development experience building production iOS apps\n• Experience working in a fast-paced, startup environment\n• Excellent communication skills\n• Strong experience with Swift; knowledge of SwiftUI\n• Knowledge of reactive programming (RxSwift and/or Combine)\n• Attention to detail and appreciation for creating delightful user experiences\n• Proficiency in using RESTful APIs\n• Source code management skills (Git)\n• Must enjoy learning and be self-motivated with the ability to switch contexts as the needs of the business evolve\n\nBonus Points\n• Experience in the Financial Services and/or Financial Technology sectors\n• Experience working for an international company operating across time zones\n\nPublic is an equal employment opportunity employer to all employees and applicants for employment and prohibits discrimination and harassment of any type. We celebrate people of all race, color, religion, age, sex, national origin, disability status, genetics, veteran status, sexual orientation, gender identity, or expression.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://dk.linkedin.com/jobs/view/senior-ios-engineer-at-public-4066387243?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Org",
                    "link": "https://theorg.com/org/public/jobs/senior-ios-engineer-95d53f05?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Jobs - Forecast Labs",
                    "link": "https://jobs.forecastlabs.com/companies/public-com/jobs/41845985-senior-ios-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/too-good-to-go/senior-ios-software-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-ios-engineer-too-good-to-go-6009784?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://dk.trabajo.org/job-3042-2f92506e2203d6269f4b092468cdd1bc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/denmark/job/full-time/others/senior-ios-engineer-132599804?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://dk.indeed.com/viewjob?jk=8c2b33704ac20b2a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiUHVibGljIiwiYWRkcmVzc19jaXR5IjoiQ29wZW5oYWdlbiwgRGVubWFyayIsImh0aWRvY2lkIjoiV19sZHR3ZzdwYkRxYUVUaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSR1Z1YldGeWF3In0="
        },
        {
            "title": "Experienced Flutter Developer - Fully Remote",
            "company_name": "ViaBill",
            "location": "Anywhere",
            "via": "Startup Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=aOkYO_5X9rofvY5DAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOsQrCMBRFce0nOMibRRsRXHSzWsHRwbWk8ZFEX98LSSr1d_xS43LhnOXc6jurmvMUMHpkgw9oacwZI5zwjSTFwxrakegDNxwkY8Gr9JBQR-NAGC4ilnB-cDmHtFcqJaptyjp7UxsZlDD2Mqmn9Ok_XXI6YiCdsdvuNlMd2C4Xd6-Pngg8Q1Oi7LRFXpUTPOj4-gFazO1HpQAAAA&shmds=v1_AUFQtOOsEPY9iwV-Mjd7Uhxin0Ef0xmKHNsM4QTtq8ztoEbIeg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=aOkYO_5X9rofvY5DAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862c598d8eb33a679bba1e93a71856b94620830c61164670be54.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "ViaBill operates at the intersection of the eCommerce, payments and consumer credit sectors, and is an industry pioneer and early market entrant in the BNPL industry, which is experiencing rapid growth. Becoming the best at something isn’t easy. It takes skill, hard work, and an unmatched level of ambition and determination. Our team is international, experienced and most of all, hardworking. In just a few years, we’ve grown from our first office in an art gallery in Denmark to having our teams located all over the globe.\n\nFrom a handful of customers to handling transactions worth more than $150M per year, we aren’t afraid of new challenges and new markets. Our strategy has been validated with external investment from leading VC’s Headline and BlackFin Capital Partners.\n\nThe position:\n\nAs we take our business to the next level, ViaBill is looking to hire a motivated Flutter Developer to expand our tech, processes, and client applications. You will be driving the main development efforts on our mobile payments application made with Flutter and build production-ready plugins to Android and iOS.\nWe are looking for a developer that should have solid experience in:\n\n• Implementing sophisticated and highly scalable apps using Flutter\n• Implementing applications for the iOS & Android platform with at least two years of experience\n• Familiarity with RESTful APIs\n• Familiarity with the GIT\n• Understanding of the Agile development life-cycle\n• Experience with CI/CD for mobile applications\n• Focus on QA by using unit and integration tests\n• B.Sc/M.Sc or equivalent experience in computer science or a related field\n• You speak and write English fluently\n\nYou are:\n\n• Used to working in a fully remote setup\n• Ultra-focused on the end user\n• Motivated in a fast-paced, changing environment\n• Able to keep calm, focused, and prioritize under pressure\n• Independent and take initiative\n\nAbout our team:\nWe are a team of highly motivated developers who work remotely from our own offices. We collaborate much like open-source projects with core maintainers for our services. Each developer has a lot of freedom working in a flat hierarchy in a very streamlined process where the domain experts are easily available on Slack or via Meet. We work with a very rapid release schedule, often releasing multiple times per day. This gives us a quick and motivating feedback loop. This also makes it very easy for a developer to see their effect on business! This allows us to experiment and adopt new trends/frameworks quickly.\n\nMeet our Developers!\n\nPlease read more about our Privacy Policy https://viabill.dk/gdpr/",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/experienced-flutter-developer-fully-remote-viabill-2425168?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBGbHV0dGVyIERldmVsb3BlciAtIEZ1bGx5IFJlbW90ZSIsImNvbXBhbnlfbmFtZSI6IlZpYUJpbGwiLCJhZGRyZXNzX2NpdHkiOiJDb3BlbmhhZ2VuLCBEZW5tYXJrIiwiaHRpZG9jaWQiOiJhT2tZT181WDlyb2Z2WTVEQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        },
        {
            "title": "Developer Support Engineer",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Built In Toronto",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVy7uzjdLJio4KKjFcFRH6Ak4Uhq07uQu0rfwNe2Lv_wLX_zXTWHFj-YuWCF11QKV4UbxZ5wgR082IOgqyEBE9yZY8bNJakWOVsrkk0UddoHE3i0TOh5tm_28k8nyVUs2Sl2x9N-NoXidv1cfjTh1Sn0BC3S6OrwA4NTdg-KAAAA&shmds=v1_AUFQtOORThIhJxOA2tpLHCtP18SeJhLfxMoEZ2gDSZtm1s_7lw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862cb78f164318fd676dc55a89689c604123efba4696ea4e0cf8.gif",
            "extensions": [
                "18 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "18 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like ChatGPT, VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nIf you’re looking to jumpstart your career in tech and have a direct impact on apps used by billions of end-users, the Developer Support Engineer (DSE) role at RevenueCat is a fantastic opportunity. This is one of the few entry-level positions we offer, and it has proven to be an incredible stepping stone—our current Support Lead, a Product Manager, and a Technical Account Manager each started out as DSEs.\n\nIn this role, you’ll help developers integrate the RevenueCat SDK into their apps, troubleshoot tricky edge cases, and unlock new possibilities in subscription monetization. You’ll provide hands-on support for some of the biggest apps in the world—imagine helping the teams behind ChatGPT, VSCO, PhotoRoom, Notion, and others get the best out of RevenueCat. You’ll be empowered to own the support experience, build out internal tools, and identify improvements that shape how developers everywhere use RevenueCat.\n\nIn 2024, our DSEs spoke at conferences in Berlin, Logroño, New York, London, and Tokyo. This is optional, but if you're interested, you can meet RevenueCat customers face to face, have fun working our booth, and share your knowledge with developers worldwide.\n\nWhat you’ll be responsible for\n• Supporting developers daily. You’ll debug issues, untangle complex code paths, and guide developers through onboarding so they can ship subscription features confidently.\n• Collaborating cross-functionally. You’ll partner closely with Engineering and Product to influence the developer experience—everything from our documentation to new features.\n• Building tooling and processes. You’ll craft or improve the internal apps and dashboards that make troubleshooting faster and easier, both for you and your teammates.\n• Driving user success. From investigating stack traces to clarifying best practices, you’ll ensure developers can move from “blocked” to “shipped” without missing a beat.\n\nWithin your first month, you’ll:\n• Deep-dive into the frustrations and roadblocks developers face, helping them get unblocked so they can launch their apps.\n• Familiarize yourself with our support tools and processes.\n• Propose and implement quick wins in our documentation and support articles to reduce common developer pitfalls.\n• Work alongside our engineering team to resolve complex issues and learn the ins and outs of subscription infrastructure.\n\nWithin your first 3 months, you’ll:\n• Spot opportunities for product improvements that will reduce developer friction.\n• Build out test apps and reproducible environments to tackle issues head-on.\n• Own onboarding and solution engineering for new developers using RevenueCat, providing a seamless start-to-finish experience.\n\nWithin your first 6 months, you’ll:\n• Identify recurring blockers and implement targeted improvements—both in our products and in your own support workflows.\n• Craft (and refine) internal dashboards and tooling that accelerate the DSE team’s efficiency.\n• Make meaningful, self-directed contributions to how we scale support for an ever-growing developer community.\n\nAfter 12 months, you’ll have:\n• Gained super-hero level intuition for diagnosing the root causes of even the trickiest tickets.\n• Led the charge on hiring, mentoring, and growing our support engineering team.\n• Found new ways to delight developers, turning frustrating subscription problems into smooth, joyful experiences.\n\nAbout you\n• You’re eager to learn and grow; this is one of the few entry-level positions at RevenueCat and has historically launched multiple careers within our company.\n• You have 2-3 years of experience in an engineering or technical role, or have built and shipped a mobile app that integrates RevenueCat.\n• You’re comfortable with either iOS (Swift / Objective-C) or Android (Java / Kotlin) and have a grasp of app development and release processes.\n• You can debug code with minimal info, diagnosing issues from cryptic logs or stack traces.\n• You thrive in an environment that requires creative problem-solving and a “get it done” mentality.\n• You have strong written and verbal communication skills, and you’re empathetic towards the developer journey.\n\nWhat you’ll need to be successful\n• Technical curiosity and a willingness to learn new tools and frameworks.\n• Resourcefulness in figuring out solutions when the path isn’t obvious.\n• Clear communication skills to translate complex issues into helpful, actionable steps.\n• Outcome-oriented mindset, ensuring your support leads to measurable developer success—fewer tickets, better documentation, and happier customers.\n• Collaboration and comfort with a fully remote, asynchronous setup using tools like Slack, Zoom, Linear, and Notion.\n\nWhat we offer:\n• $112,000 USD Salary regardless of your location\n• Competitive equity in a fast-growing, Series B startup backed by top tier investors including Y Combinator\n• 10 year window to exercise vested equity options\n• Fully remote work environment that promotes autonomy and flexibility\n• Suggested 4 to 5 weeks time off to recharge and focus on mental, physical, and emotional health\n• $2,000 USD to build your personal workspace\n• $1,000 USD annual stipend for your continuous learning and growth\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.",
            "apply_options": [
                {
                    "title": "Built In Toronto",
                    "link": "https://builtintoronto.com/job/developer-support-engineer/3641684?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXZlbG9wZXIgU3VwcG9ydCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlJldmVudWVDYXQiLCJhZGRyZXNzX2NpdHkiOiJEZW5tYXJrIiwiaHRpZG9jaWQiOiJoNjRHdmhGZU83eXJ0S2FWQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        },
        {
            "title": "Senior Mobile Developer",
            "company_name": "Driversnote",
            "location": "Copenhagen, Denmark",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Vg3w-dCQP2V24BoNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU6Ho2gigouOLQiCkx9QknAk0fQu3IXS3_CPrctbX_fddOaFlFngyT4XhAFnLFxR4AgP9qDoJCRggjtzLLi9pdaqXq1VLSZqcy0HE3iyTOh5sW_2-mfU5ARrcQ3H8-W0mEpxvxskzyhK3BAyQb9OlFxEOqwzTU4-P23AKO2UAAAA&shmds=v1_AUFQtOMTUJLJQUJ1JLYPm-by5IaUSWPipgDWYvewXM8Zwfyl5w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Vg3w-dCQP2V24BoNAAAAAA%3D%3D",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "THE BUSINESS\n\nDriversnote is a product-centric and profitable tech startup based in central Copenhagen. We help more than 3 million users in over 50 countries track their mileage conveniently and accurately in a fully automated manner using our mobile app and, optionally, an iBeacon placed in their car. We are 30 people doing design, product management, mobile and web development, marketing, support and customer success in close collaboration.\n\nTHE PRODUCT\n\nTo the majority of our users, Driversnote is first and foremost a free mobile app they find via App/Play store and install to get automated mileage tracking. They will often start out with motion-based tracking, become aware of free user limitations and become a paying customer on a subscription to remove limitations and get an iBeacon for improved tracking accuracy.\n\nThe mobile app is backed by a substantial backend, and at driversnote.com we offer our more advanced users and larger teams a fully fledged web application with advanced trip management, team management and workflows for teams. We have a B2C-like relationship with many of our users, but we are gradually moving more and more into traditional B2B space with all that this entails of further product enhancements.\n\nTHE WAY WE WORK\n\nWe use a product development process known as Shape Up, where a few key people take the role as shapers and define projects that can be designed, implemented and released within 6 weeks, known as cycles. For each 6 week cycle, we form new cross-functional teams with designers, developers, marketing and customer support people on them, and we let the teams focus exclusively on finishing their projects within the cycle. Each 6 week cycle is followed by a 2 week cool-down period, where we fix bugs, execute functional projects, evaluate how we did and plan the next cycle.\n\nWe’ve learned that people thrive on being able to choose freely when they want to work from the office and when they want to work from home, and after our onboarding period you will also be free to work as you prefer. However, we don’t currently have anyone in fully remote positions and we expect to keep it that way.\n\nWe like to say that our unfair advantage is that we care more than our competition, and our users and customers tend to agree when they review our app, respond to NPS surveys and rate our support. We also care a lot about our employees, and between each cycle the entire company has a Team Health Check together, where we rate and discuss how we work together and thrive in our roles. We have a generous budget set aside for each employee to learn and develop, and we try to do a lot of fun stuff together.\n\nIf you're curious to read more about who we are and the way we work, visit our Careers page:\n\nTHE TECH STACK\n\nOur mobile app is built in React Native with TypeScript relying heavily on native modules in Kotlin and Swift to handle core things like iBeacon monitoring, Motion detection and Location tracking. We use a range of other technologies like: Kotlin Multiplatform, Redux, GraphQL, Firebase, Realm, Storybook, Jest, Detox and Jenkins.\n\nOur website is a fully fledged SaaS offering that does everything the mobile app does (except actual tracking, of course), plus a lot more: Backend with sync API for the mobile app, admin tool, email campaigns, subscription flow with Stripe integration - the list goes on.\n\nThe web backend is a modular Ruby on Rails application with a PostgreSQL database and a GraphQL API. We run everything on Google Cloud and we deploy every day. The web frontend is built in modern React and Typescript.\n\nOur tech stack is not set in stone. We're pragmatic about choosing the right tools for the job at hand and often explore new technologies to solve our problems.\n\nTHE ROLE\n\nAs our new Senior Mobile Developer you’ll be responsible for keeping us up-to-date on any developments within iOS regarding CoreLocation, iBeacon/BLE monitoring etc. We expect you to know your way around XCode, provisioning profiles, build settings and everything else iOS related.\n\nWe're in the process of moving our tracking code from javascript to native with Kotlin Multiplatform, which obviously creates a lot of very interesting challenges. A big part of our daily work with the app codebase is still in Javascript though, so this is where you’ll also spend a big part of your time building new features and improving existing UI and business logic.\n\nYOU\nGenerally speaking, you are a great fit for this role if you see yourself as more of a \"backend mobile developer\" who feels confident around app lifecycle, app architecture, OS interaction (e.g. CoreLocation), state management, etc. related to the challenge of keeping the app active and ready to start tracking our user's drives at all times.\n\nThat being said, we imagine you have some of the below qualifications:\n• 3 years of experience with native iOS development\n• 5 years experience with Javascript\n• Professional experience with React Native\n• Experience with TypeScript\n• Experience with testing; unit tests, functional UI tests and/or integration tests\n\nNeedless to say that it’s a big advantage if you have worked with location tracking apps before but in general we greatly value it if you like complex challenges and take your time getting to the bottom of all aspects so you can find simple solutions that ensure the future of the codebase.\n\nWe care about details, structure and clean code and we expect you to care too. We love Uncle Bob's version of the boy/girl scout rule applied to coding:\"Always leave the code a little better than you found it\".\n\nWHAT WE BELIEVE IN\n\nVision & mission:We work to eliminate work-life hassles to let people focus on what matters. Today, that means removing the pain and trivial work of handling mileage, while providing peace of mind that nothing is forgotten and all rules are followed.\n\nProduct-led:We focus our work on the end-user and optimise for bottom-up adoption. People's use of our product is what leads to our growth. We sell through our product and as self-service. We invest in customer success instead of outbound sales. Our marketing is focused on people with a need, leading them to the product.\n\nLean & data-driven:We try to get a deep understanding of the problems we’re solving. But we also acknowledge that we often can’t predict the outcome of our work. So we believe in an experiment-based approach to product development with short build-measure-learn cycles. For this reason, we also don’t believe in detailed plans for more than 3 months ahead.\n\nLong-term & compounding:We invest in things that will have a continuous return and compound. We e.g. prefer a 1% improvement of activation rate over a €100k deal. We’re self-funded, so we don’t stress about the next funding round, and take the time to go into depth with our work.\n\nWHAT WE OFFER\n\nAt Driversnote you will be part of a team composed of talented people that are fun to be around. You will have ample opportunity to influence decisions at all levels, and we hope we can both teach you something and learn something new from you. You’ll get to work with and learn from a team of highly experienced entrepreneurs and tech people. We’ll set aside resources for independent skill development to help you grow and develop your career.\n\nWe work in a relaxed environment with new offices near The Meatpacking District. We have tasty freshly cooked lunch every day, great coffee, cozy Friday drinks, and great events from our running club, gaming nights and of course epic Christmas and summer parties - that we hope you will help plan.\n\nCheck out our LinkedIn for pictures and see the team events we host.\n\nSince many of us have spouses and kids that we enjoy spending time with, we can honestly say that we offer a healthy work-life balance along with a competitive salary and all the benefits you would expect.\n\nYou can read more about our benefits on our Careers page.\n\nHOW TO APPLY\n\nWe will be accepting applications until January 31st 2025 and will review applications in the following days.\n\nWe look forward to hearing from you!",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://dk.jooble.org/jdp/653980834134902062?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://dk.linkedin.com/jobs/view/senior-mobile-developer-at-driversnote-4106095243?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Hub",
                    "link": "https://thehub.io/jobs/67632acb49fe31e3477d1624?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://dk.trabajo.org/job-3042-ed2545e8d9ba2dd4bafe1f60ab188f54?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkRyaXZlcnNub3RlIiwiYWRkcmVzc19jaXR5IjoiQ29wZW5oYWdlbiwgRGVubWFyayIsImh0aWRvY2lkIjoiVmczdy1kQ1FQMlYyNEJvTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSR1Z1YldGeWF3In0="
        },
        {
            "title": "Senior Developer Advocate",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVy7uzjdLJgUwUUnURAc9QFKEo8kNr0LuVj6BD63cfnH_-u-q65_IkUucMUZE2cscH7N7ExF2MGdLQia4gIwwY3ZJ9ycQq1ZjlqLJOWlmhqdcjxpJrS86Ddb-WeQYArm1FbD_tAvKpPfrh_NoQ9eTIVITaXJlPEHlM2jSYkAAAA&shmds=v1_AUFQtONfkEYGOYHczp960IghReuGMOor12TDgtO4FH0rPrgqmA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862c252efa5e9fd1fbf23d5ed3e525df0eaa791f1f5640162ef2.gif",
            "extensions": [
                "212K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "212K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: United States, EMEA\n\nAbout us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nRevenueCat helps apps of all shapes and sizes make more money across mobile, the web, and other platforms like Roku and Amazon. As a result, many different types of users log in to – and use – RevenueCat on a day-to-day basis. Product managers, support reps, lifecycle marketers, user acquisition specialists, data analysts, executives: The list goes on.\n\nNone of those users would make it onto RevenueCat unless a developer implements it first. And for smaller apps, developers are these users: They do the marketing, provide support, interpret the performance data, make pricing and packaging decisions, and more.\n\nWe’re looking for a Senior Developer Advocate to help ensure these developers are successful when using RevenueCat. You’d join forces with our current Advocate, and guy you might have seen walking around Seoul in the rain, Charlie Chapman. We’re specifically looking for someone with strong skills in producing written educational content targeted at developers that is technical but engaging. Your work will educate existing RevenueCat users, attract new search traffic, and position RevenueCat as the go-to resource when implementing in-app purchases across platforms.\n\nWhat you’ll be responsible for\n\nYour primary responsibility will be creating high-quality, developer-focused content focused on monetization and in-app purchases. This includes both scenarios where developers use RevenueCat to solve for these use cases, as well as alternative implementations.\n\nExamples of the type of content we’d expect you to produce include blogpost with titles like:\n• \"Migrating a native subscription app to Flutter: A step by step plan\"\n• \"Implementing your first subscription with RevenueCat: Disable ads for paid users\"\n• \"How to detect and highlight the platform of purchase for cross-device subscribers\"\n• \"Adding a multi-tier subscription to your Expo app\"\n\nIn addition to writing, you’ll:\n• Speak at conferences, webinars, and other events to share insights and represent RevenueCat\n• Record videos and collaborate on webinars to help developers implement and succeed with RevenueCat\n• Work cross-functionally to develop resources that support developers using RevenueCat\n\nWithin the first month, you’ll:\n• Learn RevenueCat inside and out\n• Familiarize yourself with our developer community and how to engage them\n• Have produced your first pieces of RevenueCat content\n\nWithin the first 3 months, you’ll:\n• Collaborate with Charlie on a joint content strategy playing to both your strengths\n• Independently research and develop content to fill current gaps in our documentation and other educational efforts\n• Repurpose existing content into new formats (e.g., blog posts into videos) to expand our reach\n\nWithin the first 6 months, you’ll:\n• Represent RevenueCat at industry conferences and webinars, delivering talks and engaging with developers\n• Support product launches with technical content (written or video)\n\nAfter 12 months, you’ll have:\n• Become a fixture across the developer community, having become synonymous with RevenueCat and in-app monetization for Android, Flutter, and/or React Native\n• Found new and novel ways to help us engage developers (think Shipaton, App Store Rejection socks, and similar initiatives)\n\nAbout you\n\nYou’re passionate about teaching and helping developers thrive. You’re deeply experienced in app development, particularly subscription apps, whether as part of a team or through indie projects (preferably both).\n\nWhat you’ll need to be successful\n• 5+ years of experience in app development or developer-focused roles, ideally in a subscription app environment, with a deep understanding of at least one major mobile development platform (Android, Flutter, React Native preferred; iOS a strong alternative) and the ability to learn and write about others\n• Strong independent project management skills, with the ability to manage multiple content initiatives, events, and deadlines across time zones without constant oversight\n• Excellent technical communication skills, capable of translating complex technical concepts into accessible and engaging written, video, and spoken formats for developers\n• A passion for teaching and empowering developers, with the ability to create content that educates and inspires action, including blog posts, tutorials, and videos\n• Proven ability to learn and explain new technologies, with expertise in Android development, Flutter, or React Native preferred (experience with iOS development is a plus if paired with a demonstrated ability to adapt to and write about other platforms)\n• Proven experience in producing content for a developer audience, preferably in a professional capacity as a developer advocate, but we’d consider exceptional candidates that have written, recorded video, and have spoken at conferences targeted at developers as a hobby or side-project\n• Resourcefulness and adaptability, with a problem-solving mindset to navigate the challenges of engaging a global developer community\n• Outcome-driven approach, ensuring your efforts lead to measurable impacts, such as increased content engagement, developer onboarding, and community growth\n• Comfort with a fully remote, asynchronous work environment, and tools like Notion, Zoom, Slack, and Linear. You’ll need to thrive in an environment that balances collaboration with ample time for focused, deep work\n\nWe’re looking for someone who embodies our team’s core values of agency and intellectual curiosity: taking initiative, solving problems, and continually learning to better serve our diverse developer audience. Regular travel may occasionally be required for conferences, events, or team gatherings.\n\nWhat we offer:\n• $212,000 USD salary, regardless of location\n• Competitive equity in a fast-growing, Series C startup backed by top-tier investors, including Y Combinator\n• 10-year window to exercise vested equity options\n• Fully remote and flexible work environment\n• 4-5 weeks of suggested time off annually for mental, physical, and emotional recharge\n• $2,000 USD for workspace setup and $1,000 USD annual stipend for continuous learning\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.\n\nThis offer from \"RevenueCat\" has been enriched by Jobgether.com and got a 90% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/674cc14db10568bbc7b1e688-senior-developer-advocate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGV2ZWxvcGVyIEFkdm9jYXRlIiwiY29tcGFueV9uYW1lIjoiUmV2ZW51ZUNhdCIsImFkZHJlc3NfY2l0eSI6IkRlbm1hcmsiLCJodGlkb2NpZCI6Ing5VE1pUHBRbFowQ2xtbV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUkdWdWJXRnlhdyJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAGYFw7OjrdqEJbEVx0VFQEoeADlKRc22iaP9wFqc_iy1qXb_2y7yy7Pjg4CN1hnWc6ClTzypvUQgY68Zs9Igstz07YGuUV5XSDJWUjTU8IdAE6z4tDn1LUfVmq-qLTZJJrigZDicAWY_mE1T-19kY4TgXX291mLGLo1vNKMLr2Qy5MaRiMvH44Su23ngAAAA&shmds=v1_AUFQtONz1LMR7kfxLEeZDltVkHssXFQhtJtOX1KowF6JswkbfQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862c5b8d01b073a204877110e59f3d368d2d0113ff4a1deb30ff.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkRlbm1hcmsiLCJodGlkb2NpZCI6IkQtNFpVcnFGVW1XNUZuVTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUkdWdWJXRnlhdyJ9"
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQoCMQyA4f1GR6eMItiK4qKjouDqAxxpCe1prilNlANf3nP5-ba_-3arK7_NqMGFPsRSZ23gLgGUsMUMUuAmkpiWp2xW9ei9KrukhjZEF2X0UijI5J8S9J9eMzaqjEb97rCdXC1pvXhEZNqfYSjzqYzYXj-1v-kHfQAAAA&shmds=v1_AUFQtONfg4A7fTRTHCAg5s9Imnlfckp_SiKoki_uzs4csSjWMQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850553a6f6737e4a4ed17c/images/0de5bdf79ca7862cd9e6673b4a00e82fd5fed921d7355d8fd3f9e2fc5c6cc007.gif",
            "extensions": [
                "21 days ago",
                "€192K a year",
                "Work from home",
                "Internship",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "salary": "€192K a year",
                "work_from_home": true,
                "schedule_type": "Internship",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: European Union\n\nWho we are\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\nWhat we are looking for\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environmentInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\nTalent acquisition team\n\nThis offer from \"Scale3C\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/677c07d256373d87f2b9cbc6-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJEZW5tYXJrIiwiaHRpZG9jaWQiOiJsU0xRZGVndzZaUThGWWRSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFJHVnViV0Z5YXcifQ=="
        }
    ]
}