{
    "search_metadata": {
        "id": "67850561c0574937f714caa9",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/ec302f780bef7134/67850561c0574937f714caa9.json",
        "created_at": "2025-01-13 12:21:53 UTC",
        "processed_at": "2025-01-13 12:21:53 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIGRnJhbmNl&udm=8&fc=EswCCowCQUpHOUprTWFTQWl2aGdHeXFubjBjTTVKWHVWUkRYbWhrNGtNdWE2dXhMbUFlQjlPeGthRDNLRGxDR1hLaVNxd1BjQTZoUjNGamFJVTlESFZTc1ZFZGNha0IwSWNBNmRzdTBkQ0J6RHN6a0RmcTljZEV0VXBPM3BNakdjUXN1dWJENFhXNE9DZGpjQUc2WGJVOEI0SDhhaVRpRkRTd0tNME5tdjFLOEJLRzRIUVNlWjNZRnFfQXpnXzlTbDFVTUtYdVljWVIwUk42NVVmTGgyTXpodVllWmZaTjZ5UXdxdXJabzMtOEdZN3dqVEpoX1NrZWxqSWtRd0phR3ZTeUM1NHZVWEVZX0RZdVk4cBIXWUFXRlo5ZU1JOU9ncHRRUDE5V1VzQTQaIkFGWHJFY3IxaFVlSFZBUHdDemY2eENtaHlRRjVXS2hjMWc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/ec302f780bef7134/67850561c0574937f714caa9.html",
        "prettify_html_file": "https://serpapi.com/searches/ec302f780bef7134/67850561c0574937f714caa9.prettify",
        "total_time_taken": 0.42
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "France",
        "location_used": "France",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUV0ZUUVdsMmFHZEhlWEZ1YmpCalRUVktXSFZXVWtSWWJXaHJOR3ROZFdFMmRYaE1iVUZsUWpsUGVHdGhSRE5MUkd4RFIxaExhVk54ZDFCalFUWm9Vak5HYW1GSlZUbEVTRlpUYzFaRlpHTmhhMEl3U1dOQk5tUnpkVEJrUTBKNlJITjZhMFJtY1RsalpFVjBWWEJQTTNCTmFrZGpVWE4xZFdKRU5GaFhORTlEWkdwalFVYzJXR0pWT0VJMFNEaGhhVlJwUmtSVGQwdE5NRTV0ZGpGTE9FSkxSelJJVVZObFdqTlpSbkZmUVhwblh6bFRiREZWVFV0WWRWbGpXVkl3VWs0Mk5WVm1UR2d5VFhwb2RWbGxXbVphVGpaNVVYZHhkWEphYnpNdE9FZFpOM2RxVkVwb1gxTnJaV3hxU1d0UmQwcGhSM1pUZVVNMU5IWlZXRVZaWDBSWmRWazRjQklYV1VGWFJsbzVaVTFKT1U5bmNIUlJVREU1VjFWelFUUWFJa0ZHV0hKRlkzSXhhRlZsU0ZaQlVIZERlbVkyZUVOdGFIbFJSalZYUzJoak1XYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior Android Developer (W/M/D)",
            "company_name": "AVIV Group",
            "location": "Paris, France",
            "via": "Smart Recruiters Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=yeMJBIfgNwmwnT_VAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQrCMAwAULzuE_SSo4quIoigp8FwKAiCMI-j68JWqUlJquw__GHxHV72nWT7O5JngYI6Yd9BiR8MHFFg_jBXUy5gDRduQdGKG4AJKuY-4PQ4pBT1YIxqyHtNNnmXO34ZJmx5NE9u9V-jgxWMwSZstrvNmEfql7OiPtdQCb8jeIKbFa8rOIklhz_ZnmnzlgAAAA&shmds=v1_AUFQtOMKHpYuX3Q8_7BQ7zCRHaMXoNyWL3YzbH6igf8lSNQV8A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=yeMJBIfgNwmwnT_VAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850561c0574937f714caa9/images/bd285a859d793c1721287757e490157169c9d21544a5f1b7b637af1cc989bbd6.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Company Description\n\nYou'll be joining one of the world’s largest privately owned real estate tech companies and a subsidiary of Axel Springer. Our mission is to unlock everyone’s perfect place!\n\nYou'll work across some of Europe’s best known digital real estate brands including: 🇫🇷 Meilleurs Agents, 🇫🇷 Groupe SeLoger, 🇧🇪 Immoweb, 🇩🇪 Immowelt, 🇪🇸 Housell and 🇮🇱 Yad2.\n\nJob Description\n\nAs a Senior Android Engineer within the AVIV Group, you will benefit from great flexibility and true experts in native technologies within a team of more than 60 mobile developers (android, ios, back-end).\n• Attached to the Mobile Experience Team, you will be in charge of:\n• Design and develop Android mobile applications for the Group's different brands\n• Continuously improve the quality and performance of applications\n• Ensure the monitoring and maintenance of the applications produced\n• Be a force for proposals to implement new innovative features (virtual/3D tour, voice recognition, geofencing, etc.)\n• Monitoring and creation of prototypes around new technological opportunities (connected watches, TV applications, Google Home, etc.)\n\nOur technical stack :\n• Android Studio 4.1 / Kotlin 1.6\n• Partial tooling based on the Atlassian suite (Jira, Confluence)\n• GitHub as source code controller\n• MVVM + Clean Archi application architecture\n• Responsive programming “coroutines Flow”\n• Jetpack tools (navigation component, compose, viewmodel, room datastore,...)\n• White label: Design System, Atomic Design & Backend Driven Design approach\n• Modular feature\n• Dagger for dependency injection\n• Nexus as package manager\n• CI/CD via Cloud\n• Unit testing with JUnit and source code analysis with Sonarqube\n• Automated UI Testing with Espresso\n• Crash management with Crashlytics\n• Management of application tracking with GTM\n• Firebase for Remote Config or A/B Testing\n\nQualifications\n\nThe skills we are looking for:\n• Significant experience in developing native applications on Android (Kotlin + Compose)\n• Solid foundations in the particularities and constraints of application development\n• You love automation and dream of your code coverage\n• Your autonomy combined with your desire to learn and share your knowledge make you the ideal candidate for this position.\n• You like working in a team, are organized and know how to stay light to join a friendly and fun team.\n• Your obsession: damaging the Crashfree!\n• Good knowledge of the use of REST services, the implementation of the MVVM pattern and mobile application architecture in general\n• Mastery of local data storage\n• Working in a high-load environment (several hundred thousand users each day)\n• Good ability to express yourself in English\n\nAdditional Information\n\nWhat we offer you :\n• We are one of the leading PropTech platforms in Europe. If you’ve ever rented or purchased a property then you may have used one of our classified portals. This is a great time to join us to help elevate our AVIV brand.\n• The opportunity to work hybrid within our operating footprint with international travel to our locations in France, Belgium and Germany.\n• The freedom to tell us which tools you need to be successful in your job so we can set you up to make it happen.\n\nAt Aviv, we are an equal opportunities employer and an organisation where everyone is welcomed to be their authentic selves. We strongly encourage individuals with visible and non visible disabilities, all educational backgrounds, people from minority backgrounds, those from the LGBTQIA+ community and parents and carers to apply. If you need reasonable adjustments at any point in the application or interview process, or wish to discuss part time or flexible working requirements, please let us know.\n\nIn your application, please feel free to note which pronouns you use (For example - she/her/hers, he/him/his, they/them/theirs, etc).\n\nOur ambition is to be the leading Employer in PropTech across Europe and this is a pivotal time to join us and unlock your perfect job !",
            "apply_options": [
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/AVIVGroup/744000027187826-senior-android-developer-w-m-d-?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://fr.indeed.com/viewjob?jk=2a2a03eb8503ca44&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://fr.bebee.com/job/2c66052a27a3f834438cc9887ecd6c14?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://fr.jooble.org/jdp/-6329255169272299664?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Emplois Trabajo.org",
                    "link": "https://fr.trabajo.org/offre-2893-1ed9d5b05185ee90b90abdefcdb51e9e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "AndroidDev.careers",
                    "link": "https://androiddev.careers/android-senior-developer-at-matchgroup-1020?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://fr.linkedin.com/jobs/view/senior-developer-h-f-at-sollers-consulting-4101118643?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Okko Jobs",
                    "link": "https://okkojobs.com/android-senior-developer-payment-match-group-8pkZ9jy3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQW5kcm9pZCBEZXZlbG9wZXIgKFcvTS9EKSIsImNvbXBhbnlfbmFtZSI6IkFWSVYgR3JvdXAiLCJhZGRyZXNzX2NpdHkiOiJQYXJpcywgRnJhbmNlIiwiaHRpZG9jaWQiOiJ5ZU1KQklmZ053bXduVF9WQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1JuSmhibU5sIn0="
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVz7BjrdLNiI4KKjWlFwqntJ0jONxFy4O7GP46Nal3_7v-o7q5pb7PuEpsUcieFGLiaEJr1VkaGlh34sI5xyiBmRBVZwJQeClv0AlOFMFBIu9oNqkZ0xIqkOolajrz29DGV0NJonOfmnk2HySrKK3Wa7HuuSw3J-Od7hQFyIp29CY4aGbfb4Ax-IkjWjAAAA&shmds=v1_AUFQtON3Ji1Ts0t5Jg4cvnBf8FOxNEil6caXZwyuRQQLhfwyPA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850561c0574937f714caa9/images/bd285a859d793c177730a58b48e9d476679d1c917f6ddf64c7aefd99d7a9d5fd.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkZyYW5jZSIsImh0aWRvY2lkIjoiVDF4dnRsakpuY2Qxb3UwYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "Android Developer - Apps Team (F/M)",
            "company_name": "RAKUTEN FRANCE S.A.S.",
            "location": "France",
            "via": "Workday",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=QY8ev0vKHbVRp0WOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7CS7eqIKJCC51CtoKih3aOpc0PdpKmgu5IP0Wv1Zd3vCSzyJJlesCjR1c8I2WPAbYgfKeoUY9wTqXj81vbtQCow5mAHJwJeotLk9DjJ5TKZmt6DnqOBphaJLksKVZvqjlPw0POqC3OmJzOO5n4V2_XZXq_qyzAvJSFecMKqFEJWB0kAftDH4BCik5VJ0AAAA&shmds=v1_AUFQtONqO_YGP2MuAVHZY48hmFY2Y_WGJ6QlCkg4wTswgNDGJg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=QY8ev0vKHbVRp0WOAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Job Description: Prêt à vous déployer ? ✨ Alors bienvenue chez Rakuten France ! A vous : - le projet exaltant - le mouvement et les perspectives - le plaisir de se lever le matin - le management qui fait grandir - l’envergure et la taille humaine Si vous vous retrouvez dans nos piliers, rejoignez l’équipe Apps au poste d'Android Developer ! A propos de l’équipe Tech: Notre équipe de Développement a pour but d’implémenter les nouvelles fonctionnalités de notre site web, sa version mobile ainsi que ses applications mobiles en mêlant du développement Backend et Frontend. Elle met un point d’honneur à la technicité et au partage de connaissances : nos ingénieurs travaillent ensemble et communiquent leurs idées via des conférences techniques internes et sujets transverses. L’équipe est organisée autour de 12 features teams (2 tribes) qui ont chacune un domaine de l’application, et qui sont toutes constituées d’un Lead Tech, de Développeurs, d’un Product Owner et d’un QA, qui constituent le tri-amigos. A propos de la Feature Team Apps : L'équipe Apps, chargée du développement des applications natives iOS et Android de Rakuten France, fonctionne en méthode agile SCRUM. Elle est constituée d'une Product Owner, d'un Lead Technique, d'une Lead Développeuse Android, des Développeurs et de deux QA. De plus, vous ferez partie d'une équipe technique globale forte de nombreuses compétences, qui se challenge et partage ses connaissances, assiste à des conférences techniques internes et sujets transverses. L'équipe Apps propose à nos utilisateurs mobiles la majeure partie des features de notre marketplace, telles que les annonces, la recherche, la partie checkout (passage en caisse, méthodes de paiement…), ce qui est relatif à notre club de fidélité, la mise en ligne d'annonces et bien d'autres ! Vos missions : Être impliqué(e) sur toutes les phases des projets, de la conception à la production ; Participer à la conception technique des projets et proposer des technos pour les développements ; Contribuer aux estimations des projets pour construire la roadmap, et aider le Product Owner à construire une roadmap réaliste ; Développer les stories priorisées avec un niveau de qualité avancé (TU / TI / BDD) ; Être garant de la qualité du code : participer aux tests et à la documentation des projets, et avoir à cœur que les nouvelles features ravissent nos utilisateur(trice)s ; Aimer être en quête de nouveautés et améliorations techniques. Cette veille régulière permettra de briller pendant nos TechWeeks ; Echanger avec les autres équipes de développement afin d’apporter une expérience utilisateur homogène entre les différentes plateformes. Votre profil : De formation ingénieur Bac+5 ayant une solide expérience en développement Android (3 ans minimum). Être proactif(ve) et curieux(se) et aimer les technologies innovantes que vous étudierez et analyserez au cours de TechWeeks et lors de conventions comme les Android Makers. Aimer discuter avec les pair(e)s, et aimer également être incollable sur les nouvelles technos et pratiques tendances. L’anglais sera également très utile pour la documentation et les pull requests. Être autonome tout en sachant travailler en équipe, organisé(e) Environnement technique : Framework Android Kotlin / RxJava & Coroutines / Flow API Restfull BDD Room Patterns : MVVM / Repository Git (Github / Gitflow) / Jira / Firebase Intégration Continue (Github Actions) Méthodologie : Agiles / Scrum / Kanban Serait un plus : Clean Archi Jetpack Compose Les Avantages de Rakuten Une politique de télétravail flexible, incluant une participation annuelle De superbes bureaux au cœur de Paris (Sentier) Une carte Edenred à utiliser pour le déjeuner La prise en charge des frais de transport à 50% La mutuelle prise en charge à 50% par Rakuten 12 RTT annuels, en plus des 25 jours de congés Des moments de convivialité organisés toute l’année Programme avantageux de stock-options Rakuten Group Des équipes multiculturelles & internationales Si vous vous reconnaissez dans ces différents points et que vous avez envie de rejoindre des équipes motivées, talentueuses & bienveillantes alors vous êtes la bonne personne, c’est pour vous l’occasion de participer à l’évolution d’une marketplace qui met au cœur de sa stratégie ses marchands et ses membres. Process de recrutement Echange avec Céline, Talent Acquisition Manager Test technique Rencontre avec Pauline, Lead Dev Android et Lionel, Tech Lead IOS Rencontre avec l'équipe Apps : Sid-Ali, QA et Lucas, Product Owner Rakuten France recrute, reconnait et intègre tous les Talents. Rakuten est un leader mondial des services en ligne et l’inventeur du modèle de place de marché B2B2C. Fondé en 1997 au Japon, Rakuten propose un écosystème de plus de 80 services digitaux complémentaires, disponibles dans 30 pays, dans des domaines aussi variés que l’e-commerce, les télécommunications, les Fintech, la publicité ou encore l’Intelligence Artificielle. En France, Rakuten est le pionner de l’économie collaborative et circulaire. Sa plateforme inclusive permet aux grandes enseignes comme aux TPE/PME locales de commercialiser leurs produits à une très large communauté d’acheteurs et de bénéficier d’outils technologiques et de services innovants pour développer leur activité, en ligne comme en magasins, via le click & collect notamment. L’engagement de Rakuten en faveur d’un e-commerce vertueux se traduit aussi par son approche non concurrentielle, qui encourage les commerçants comme les particuliers à revendre leurs produits, faisant de la plateforme un acteur majeur de la seconde main. La réussite de Rakuten repose ainsi sur une double promesse : le pouvoir d’acheter et de revendre. Aujourd’hui, plus de 10 millions de Français profitent de cet engagement via le Club R. Plus qu’un programme de fidélité, le Club R récompense acheteurs et vendeurs et favorise le développement de l’économie circulaire. Fidèle à ses valeurs fondatrices, Rakuten prône un modèle de digitalisation responsable, pour les commerçants, pour l’environnement et pour le consommateur : un e-commerce qui met tout le monde d’accord. Rakuten is a world leader in online services and the inventor of the B2B2C marketplace model. Founded in 1997 in Japan, Rakuten offers an ecosystem of over 80 complementary digital services available in 30 countries in areas as varied as online shopping, telecoms, fintech, advertising and artificial intelligence. In France, Rakuten is the pioneer of the collaborative and circular economy. Its inclusive platform enables everyone from major industrial companies to small local businesses to sell their products to a very wide community of buyers, benefiting from innovative technological tools and services to develop their business online and in store through click & collect in particular. Rakuten’s commitment to virtuous online shopping is also evident in its non-competitive approach which encourages retailers and individuals to resell their products, making the platform a key player in the second-hand sector. Rakuten’s success is founded on a two-fold promise: the power to buy and the power to resell. Today, over 10 million French people benefit from this commitment through Club R. More than a loyalty programme, Club R rewards buyers and sellers and helps the circular economy develop. Faithful to its founding values, Rakuten advocates a responsible digital model for retailers, for the environment and for the consumer: online shopping approved by everyone.",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://rakuten.wd1.myworkdayjobs.com/fr-FR/RakutenFrance/job/Paris-France/Android-Developer---Apps-Team--F-M-_1024381?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.fr/details/4977915232?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/fr-cdi-developer-android-f-h-france-sephora-usa-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIERldmVsb3BlciAtIEFwcHMgVGVhbSAoRi9NKSIsImNvbXBhbnlfbmFtZSI6IlJBS1VURU4gRlJBTkNFIFMuQS5TLiIsImFkZHJlc3NfY2l0eSI6IkZyYW5jZSIsImh0aWRvY2lkIjoiUVk4ZXYwdktIYlZScDBXT0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "Flutter Mobile Developer",
            "company_name": "Raketech",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQoCMQyAYVxvdHTKLNiK4KKrnCC4-AJHWkJ7mmtKE-Vmn9xz-Ydv-LvvqvM9v82owV3CyAQX-hBLXWAHNwmghC1mkAJXkcS0OWezqifvVdklNbQxuiiTl0JBZv-UoP8MmrFRZTQaDsf97GpJ2_UDX2S0DMcCfcMS6QfNcIQvhQAAAA&shmds=v1_AUFQtOMSCYFwxQBzVqxEQK74NqpL98Ut5gdn-9d2iW2FbhzmVQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850561c0574937f714caa9/images/bd285a859d793c177555fd5048413eb3268c4d49ba650d643f5b17e6e6e095b0.gif",
            "extensions": [
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Portugal\n\nThe role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or Malta.\n\nWe are looking for an enthusiastic Flutter Mobile Developer to help maintain and develop our sports mobile applications.\n• As a Flutter Mobile Developer you are expected to …\n• Write clean, well-documented, and maintainable code for Flutter application\n• Develop and maintain technical documentation for the applications\n• Identify the causes of the most complex issues and implement practical and efficient technical solutions\n• Implement both backend and front-end features\n• Coordinate with UX/UI designers, developers, and test engineers in an Agile environment\n• Abide by industry and company software development standards\n• Conduct code reviews and give feedback to other developers\n• Understand the big picture and offer insightful advice about technologies and projects\n• Be proactive in identifying and communicating potential risks and issues to the team and stakeholders\n• Participate in sprint planning, estimation, and retrospective meetings\n• Keep up-to-date with the latest mobile app development trends and technologies\n• Work in close partnership with cross-functional teams and management\n• Ensure code quality by writing tests, using SonarQube, etc.\n• Success in this role means...\n• Collaborating towards a team effort to improve the overall user experience of our applications.\n• Developing DRY, clean, maintainable and scalable code that can be comprehended and worked on solely through documentation created.\n• Increasing the performance, scalability and security of our mobile applications.\n• You have acquired proficient communication skills in the English language through team collaboration.\n\nThis offer from \"Raketech\" has been enriched by Jobgether.com and got a 86% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66e4d25a5ae7155b1774745b-flutter-mobile-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIE1vYmlsZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJSYWtldGVjaCIsImFkZHJlc3NfY2l0eSI6IkZyYW5jZSIsImh0aWRvY2lkIjoic0Z5YUw3eXVHVGRTZEk0TkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        },
        {
            "title": "React native developer | medtech",
            "company_name": "Urban Linker",
            "location": "Anywhere",
            "via": "Urban Linker",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=crXXap6I_QN4UVY_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNsQrCMBRFce0nOL1ZaiOCCLp1UBAnwbkk6SONpu-F5LV08HP8UONyOWc5t_ququMDtRUgLX5G6HHGwBETfGDEXtAOsIUbG8ioUxEmuDK7gOvzIBLzSamcQ-OylIBtLI-KCQ0v6sUm_6fLg04Ygxbs9ofd0kRym_qZjCa4e3qXL0_Q8hTYEW5bH4Imy1OSGi6pIP4AmNVUUKcAAAA&shmds=v1_AUFQtOMAltQqB7fJJ5l2W1Dlk7ftK6r7QZICXQFt04Y9Atxs2Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=crXXap6I_QN4UVY_AAAAAA%3D%3D",
            "extensions": [
                "€55K–€60K a year",
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "€55K–€60K a year",
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Au sein d'une équipe agile, tu participes au développement en ayant à cœur d'apporter le plus de valeur aux utilisateurs de l'application.\n• Tu assures les développements au sein de l'équipe en lien avec le PO et le QA\n• Tu participes à la conception, à l'architecture et aux tests unitaires\n• Tu es garant de l'agilité et la qualité technique du projet, dans un contexte de 'scale up'\n• Vous serez un référent technique pour les autres développeurs de votre équipe",
            "apply_options": [
                {
                    "title": "Urban Linker",
                    "link": "https://urbanlinker.com/en/jobs/tech/react-native-developer-medtech-1676450698?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Tech Funding News Jobs",
                    "link": "http://jobs.techfundingnews.com/job/react-native-developer-medtech-z2_3-3A6Kw-at-urban-linker-3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJSZWFjdCBuYXRpdmUgZGV2ZWxvcGVyIHwgbWVkdGVjaCIsImNvbXBhbnlfbmFtZSI6IlVyYmFuIExpbmtlciIsImFkZHJlc3NfY2l0eSI6IkJvdWxvZ25lLUJpbGxhbmNvdXJ0LCBGcmFuY2UiLCJodGlkb2NpZCI6ImNyWFhhcDZJX1FONFVWWV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUm5KaGJtTmwifQ=="
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAGYFy7uTrdqEIbEVx0VKoIQsEHKEk520iaP9wFqa_i06rLt37FZ1Zc7hw9hG5wPjAdBaplE2x-QEY68YsDEgstay_srPKKSrrCkbKVbiBEOgN94MVhyDnp3hjVUPWabfZd1WE0iOwwmSec_ml1sMLpV3C73W2mKsV-PW8Ek3-8yUeqxcaOv8bDb9ydAAAA&shmds=v1_AUFQtOMlNt3u3C5OPVZ1VH5F8p4RSQQXI3DdKIwRtClsb3BLIA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850561c0574937f714caa9/images/bd285a859d793c1741d47ad85747b1c1c560397c4b9d2c2710491177bd9665c3.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkZyYW5jZSIsImh0aWRvY2lkIjoiRC00WlVycUZVbVc1Rm5VM0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdSbkpoYm1ObCJ9"
        }
    ]
}