{
    "search_metadata": {
        "id": "6785057b1d0609c0bef4ae26",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/5e06b381489fe560/6785057b1d0609c0bef4ae26.json",
        "created_at": "2025-01-13 12:22:19 UTC",
        "processed_at": "2025-01-13 12:22:19 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHSXJlbGFuZA&udm=8&fc=EswCCowCQUpHOUprUEZqYUVaMVM3NjlBNUo5ak0tcHVDaFVKcmtkNnQ5TEdjbGJVWmpsTHFZUjFUSHlDSjB4VVlST3pzRnV1NFNhdVRMYThBTWZxeHFtbWhTSG5QZW1sOUlVZUtLSTd5Ri1fWERIRklVaEtvRENYOUNtSG5mQlRwNkRHdU5vWUhaRU83ME5ueHBXNTJxX3NyLUtNR0kyYXF1YWE4cC04Rk4tVGJDMTFDUmI4aFNCWXh0RGFSV0Z6cUNFYUNZbEdLZ1U4UTNycERIVWs5RUFadU9yNFJQenBySkw3a0F3NWo5b0duRHRJeFJaRExGNHcyQ1dtVUdseEgwZkc5ZGsxNl85V1NlbUZobhIXZXdXRlo3cWJELWlXa1BJUHlPYURtUUkaIkFGWHJFY3BfWll4S1ZvbTZEOVpPRHIzLTRkdjZGc1J2RVE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/5e06b381489fe560/6785057b1d0609c0bef4ae26.html",
        "prettify_html_file": "https://serpapi.com/searches/5e06b381489fe560/6785057b1d0609c0bef4ae26.prettify",
        "total_time_taken": 1.27
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Ireland",
        "location_used": "Ireland",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVRVpxWVVWYU1WTTNOamxCTlVvNWFrMHRjSFZEYUZWS2NtdGtOblE1VEVkamJHSlZXbXBzVEhGWlVqRlVTSGxEU2pCNFZWbFNUM3B6Um5WMU5GTmhkVlJNWVRoQlRXWnhlSEZ0YldoVFNHNVFaVzFzT1VsVlpVdExTVGQ1UmkxZldFUklSa2xWYUV0dlJFTllPVU50U0c1bVFsUndOa1JIZFU1dldVaGFSVTgzTUU1dWVIQlhOVEp4WDNOeUxVdE5SMGt5WVhGMVlXRTRjQzA0Ums0dFZHSkRNVEZEVW1JNGFGTkNXWGgwUkdGU1YwWjZjVU5GWVVOWmJFZExaMVU0VVROeWNFUklWV3M1UlVGYWRVOXlORkpRZW5CeVNrdzNhMEYzTldvNWIwZHVSSFJKZUZKYVJFeEdOSGN5UTFkdFZVZHNlRWd3WmtjNVpHc3hObDg1VjFObGJVWm9iaElYWlhkWFJsbzNjV0pFTFdsWGExQkpVSGxQWVVSdFVVa2FJa0ZHV0hKRlkzQmZXbGw0UzFadmJUWkVPVnBQUkhJekxUUmtkalpHYzFKMlJWRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Staff Mobile Developer (iOS)",
            "company_name": "Signify Health Ireland",
            "location": "Galway, Ireland",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=DzaWZ8xTXEfF4VSbAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXMPQ7CMAxAYbH2CEweKYIGgVjKisSPhBh6gMopbhJk4iiJoD0MdwUGljd8wyvek2LTZOx7uIh2TLCnJ7EEijBz16aEJZxFQyKMnQXxcBAxTNOdzTmkWqmUuDIpY3Zd1clDiSctg7qLTr-0yWKkwJipXW9XQxW8mZeNM971IxwJOVs4RWL0N3DfPfILx8WfPt33ufugAAAA&shmds=v1_AUFQtOMcXaFo8rR9OaoRuCOdlbdrAD4nJkJHgeQDgJuTdn-czQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=DzaWZ8xTXEfF4VSbAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f0520f232c29bdca59e4864dec62a32a64db75886d2b0c1da.gif",
            "extensions": [
                "26 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "schedule_type": "Full-time"
            },
            "description": "CVS Health, the parent company of Signify Health, is increasing investments in digital, data, analytics and technology and Signify Health is excited to be involved!\n\nWe are hiring for a dynamic new initiative for CVS Health that will run out of our state-of-the-art offices at Bonham Quay. This is your opportunity to be involved with a pioneering business that is transforming health care in the United States by making customer experiences more seamless, convenient and personalised.\n\nCVS Health is focused on driving business agility and growth through technology, data, digital and experiential innovations. ‘Digital First, Technology Forward and Data Driven’ is not simply an aspirational goal for the company, but a prerequisite to accelerated growth.\n\nBring your heart to CVS Health. Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver.\n\nOur Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable.\n\nAs we reflect on our learnings and successes from remote work, we aim to provide a new state of the art flexible work environment in our Galway facility at Bonham Quay to support those objectives. Careers with offer flexible work arrangements and individuals who live and work in the Republic of Ireland will have the opportunity to divide their time between our Galway office and their home office.\n\nPosition Summary\nThe Staff Engineer - Mobile Apps, will work on the team that brings CVS customers their “Shopping & Health Super-power” – the customer-facing Flagship CVS Shopping and Health apps. As a Staff Engineer, you will be helping advance our architecture and Mobile Product, working with cross-functional teams such as design, product, analysts to deliver great user experiences. You will partner with Apps Platform Engineers, Product Managers, Engineering Managers and fellow Feature Team engineers to build products used make our powerful omni channel shopping an easy and seamless experience. You will participate in software engineering best practices for the full software development life cycle as well as in our Health and e-Commerce domain.\n\nAbout this business unit: CVS Mobile Apps (aka Retail Apps) is the fastest growing business unit in the organization – more than million daily average users. Apart from engineering, the team consist of talented Product Owners and UX designers.\nWork breakdown structure for this role:\n\nIn this role, you will be focusing on improving developer experience, updating especially complex foundational use-cases and creating integration ready core features for all mobile flagship teams. In addition, you will be partnering with Product, UX and Engineers to iterate on features and improve our Product. For this role, the scope of development is focused on foundational architecture and code structure improvements with some feature development mixed in.\n\nOther responsibilities may include (but not limited to):\n• Improve and maintain our mobile apps CI and CD infrastructure and pipelines. Provide high level tooling support to team engineers\n• Collaborate to drive solutions that would reduce cost and time to market\n• Be responsible for end-to-end application delivery including coordination with required teams for production deployment\n• Continuously monitoring application health and KPIs, support triage of any production issues as and when needed\n• Collaborate in troubleshooting complex data, features, service, platform issues and perform root cause analysis to proactively resolve product and operational issues\n• Be an advocate of security best practices, champion and support the importance of security within engineering\n\nRequired Qualifications\n• 7+ years in designing/developing iOS mobile applications\n• 5+ years of experience with modern iOS development frameworks such as Swift and SwiftUI\n• 5+ years of experience working with cross-functional teams such as design, product, data teams to deliver great user experiences\n• 5+ years of experience in influencing large organizations on best practices in mobile iOS development\n• 5+ years of accessibility experience\n\nPreferred Qualifications\n• Experience working with cross-functional teams such as design, product, data teams to deliver great user experiences\n• Experience in influencing large organizations on best practices in Mobile iOS development\n• Accessibility experience. Telemetry & observability experience beyond Firebase\n• Strong desire to build in test from the start with TDD development experience. Continuous delivery in mobile, code review, static analysis, continuous integration, automation and functional testing (using XCUI)\n• Experience designing retail or ecommerce applications\n• Experience with authenticated session using OAuth and authenticated tokens\n• Significant contributions of released Customer facing applications on the Apple Store\n\nEducation\nBachelor’s degree or, equivalent experience",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://ie.linkedin.com/jobs/view/staff-mobile-developer-ios-at-signify-health-ireland-4103746856?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/8652965805459243008?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBNb2JpbGUgRGV2ZWxvcGVyIChpT1MpIiwiY29tcGFueV9uYW1lIjoiU2lnbmlmeSBIZWFsdGggSXJlbGFuZCIsImFkZHJlc3NfY2l0eSI6IkdhbHdheSwgSXJlbGFuZCIsImh0aWRvY2lkIjoiRHphV1o4eFRYRWZGNFZTYkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Senior iOS Software Engineer, Poster Experience",
            "company_name": "Reddit",
            "location": "Dublin, Ireland",
            "via": "Startup Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=9RKBSGAK6d1PpZyaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQ7CMAwAQLH2BzB5RtAgJBZYKQgWEH1AlaQmNQp2FAfR5_BUYLn1qs-kOrTIJBno0kIr9_K2GaHhQIyYF3AVLZihGRNmQvYISziLA0Wb_QDCcBQJEWe7oZSkW2NUYx202EK-9vI0wuhkNA9x-qfT4TekaAt2681qrBOH-fSGfU8FiGH_cpF4AaeM0XL_BYNuSoejAAAA&shmds=v1_AUFQtOP9UlkaY7_X5uyJpNQ9EXKqxMexXk1iP1BbVs3kbP0ktg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=9RKBSGAK6d1PpZyaAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f1169f1b00fa0130a97bf16d397ab9839da2a205358c69b48.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 82M+ daily active unique visitors, Reddit is one of the internet’s largest sources of information. For more information, visit redditinc.com.\nThe Core Experience organization's mission is to empower people to participate in global conversations through communities. Poster Experience specifically focuses on the user journey in creating posts at Reddit, which is the main source of user content for the product. We aim to make it easier, faster, and smarter to create and participate in conversations, and we drive several core product metrics for the entire Reddit ecosystem.\n\nThis is a high impact role where you will own projects from ideation to production, working with our super-talented cross-functional team. You'll closely collaborate with product and design teams, and be responsible for the engineering architecture and execution of key product features.\n\nWhat You’ll Do:\n\n• Design, build, and ship iOS code, experiments and products for millions of users.\n• Work cross-functionally, collaborate and partner with product, design, and other engineering counterparts to execute on product and business strategy and build novel products and features that our users will love.\n• Communicate effectively, within the team and across disciplines. Work closely with product managers and designers to craft compelling user experiences.\n• Contribute meaningfully to our team’s strategy. We give everyone a seat at the table and encourage active participation in planning our future. Don’t just come along for the ride.\n• Participate in product reviews and team meetings, providing technical insight. Help scope, estimate, and prioritize between conflicting needs.\n• Foster a healthy engineering culture and collaborate with other engineers.\n\nWho You Might Be:\n\n• Minimum of 3+ years of post-internship, full-time, hands-on, professional software development experience developing user-facing iOS mobile native applications at scale, using Swift.\n• Expertise in Swift\n• Familiarity with software engineering best practices such as unit/integration/end-to-end testing, design documents, CI/CD, A/B testing, code reviews, and documentation\n• Strong organizational skills, the ability to prioritize tasks and keep projects on schedule.\n• BS degree in Computer Science, a similar technical field of study or equivalent practical experience.\n• Entrepreneurial spirit. You are self-directed, innovative, and biased towards action in fast-paced environments. You love to build new things and thrive in ambiguity and even failure.\n• Excellent communication skills. You collaborate effectively with teams in a fully remote environment and discuss complex topics with technical and non-technical audiences.\n• Additional knowledge around GraphQL, REST, HTTP basics, and the ability to design maintainable APIs is a plus.\n\nBenefits:\n\n• Private Medical, Dental and Vision Benefits\n• Retirement Savings plan with matching contributions\n• Workspace benefits for your home office\n• Personal & Professional development funds\n• Family Planning Support\n• Commuter Benefits\n• Flexible Vacation & Reddit Global Days Off\n\nReddit is proud to be an equal opportunity employer, and is committed to building a workforce representative of the diverse communities we serve. Reddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at ApplicationAssistance@Reddit.com.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-ios-software-engineer-poster-experience-reddit-5892745?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobted",
                    "link": "https://www.jobted.ie/job/71bcefc8f97df18bee5966143fc91f66?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/6111236320401555456?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Www.cathojobs.com",
                    "link": "https://www.cathojobs.com/ie/jobad/78cce345989c3425/9307679650/8282504725/senior-software-engineer-backend-quote-buying-experience-dublin-county-dublin.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Emprego.pt",
                    "link": "https://www.emprego.pt/jobs/show/31536466767629446484022347153?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIFNvZnR3YXJlIEVuZ2luZWVyLCBQb3N0ZXIgRXhwZXJpZW5jZSIsImNvbXBhbnlfbmFtZSI6IlJlZGRpdCIsImFkZHJlc3NfY2l0eSI6IkR1YmxpbiwgSXJlbGFuZCIsImh0aWRvY2lkIjoiOVJLQlNHQUs2ZDFQcFp5YUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Senior iOS Engineer",
            "company_name": "Distilled",
            "location": "Dublin, Ireland",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=j8IXuAvxNH2Xc0L2AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CeJwc9FGBBddK6KLQz-gJOmRXDnvSi5C_8DfFt_wmu-maQcU0gL0GuAmiQSxwAGeGsDQl5hBBe6qiXF7zbUudnHOjLtk1VeKXdS3U8Ggq5s12L_Rsi-4sK84ns7HtVsktbuerBIzTkAC_ScwyR4eBdnL9AODgHsrigAAAA&shmds=v1_AUFQtOM1WuDMNKBaQtT0dm7JsCSZ_UgxQn6HGuXbONIL4kGzOA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=j8IXuAvxNH2Xc0L2AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f25bdaa1c23d702001e7b8f5a936f040caec718e42ecab042.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "What’s the Opportunity\n\nWe are seeking to recruit a Senior iOS Engineer who is up-to-date with developing modern native applications and has a passion for building phenomenal iOS experiences.\n\nOur team is always looking at what is the next step forward in the mobile world and are already targeting iOS 14+, using SwiftUI in production, utilising Swift Package Manager as well as using Xcode Cloud. The successful candidate will be eager to learn and explore emerging frameworks and how they can help build and enhance app development.\n\nThis is more than a technical role, you will contribute to the overall product development effort. You’ll use your experience to inform our engineering process and decisions when building new features.\n\nThis is a permanent position and the successful candidate will have a passion for building chart-topping mobile experiences and will thrive in a fun, fast paced and challenging environment\n\nWhat will I be doing\n• Building and maintaining features across our apps (DoneDeal, Daft & Adverts)\n• Ensuring the codebase is clean, scalable and tested\n• Working with other iOS and Android Engineers as part of an Agile team\n• Collaborating with our product, quality and design teams\n• Keeping up-to-date with new technologies and techniques within iOS development.\n\nWhat skills and experience do I need\n• Minimum of 5 years iOS development experience\n• Highly proficient in Swift\n• Comprehensive expertise with UIKit and the iOS SDK (RxSwift or SwiftUI experience is a bonus)\n• Extensive experience with modern mobile architectures (MVVM, MVP etc)\n• Extensive experience in writing robust unit tests and maintaining high code quality.\n• In-depth knowledge of integrating with RESTful APIs\n• Experience with Source Control (Git)\n• Experience with CI/CD\n• Excellent social, teamwork and collaboration skills\n\nWhat’s it like to work here\n\nYou will have the opportunity to work with one of Ireland's fastest growing Internet companies. You will get the chance to create a significant contribution to our strategic direction. Projects are exciting and employees are given wide scope for creativity and innovation\n\nBenefits - what you can expect\n• Our goal is to maintain a culture where people look forward to work – whether in our centrally located office in Dublin or working\n\nfrom home, which is optional for all employees.\n• We do that by making Distilled a place you'll be listened to and trusted to do your job. Where you can have fun, learn and feel appreciated. And where you get focused career development, growth and progression opportunities.\n• We want you to feel confident that this is the right place for you, your career, your wellbeing and your future.\n• Above all, your health and wellbeing are at the forefront of how we build the business. That means looking after you while you're here and later in life. So you'll receive life insurance, fully-paid healthcare and a 5% contribution towards your pension.\n\nMore about Distilled\n\nWe exist to make buying and selling in Ireland simple.\n\nWe put our people first, creating an inclusive environment where we can develop products that put our users first. We value people’s work and time, creating a community where they have an opportunity to make an impact and grow.\n\nOur challenge is to enhance our market-leading products using insights and empathy to present our users with the perfect match.\n\nWhat we build is technology, but what we do is create connections for life’s most meaningful moments. We are Distilled and we bring people together.\n\nOur Values\n\nWe have five core values: We have a growth mindset. We like to simplify things and make things happen. We collaborate across teams, business units and brands. We're passionate about what we do.\n\nThese values give us a framework for leadership and daily decision making. They embody how we behave and present ourselves — as individuals and as a business — both internally and externally for our colleagues, our users and our customers.\n\nWe are a diverse bunch of people here in Distilled, and we want to continue to attract and retain a diverse range of people into our Company. We do not discriminate based on gender, marital status, family status, sexual orientation, religion, age, disability, race and membership of the Traveller community.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ie.indeed.com/viewjob?jk=6b0213db1a7c7191&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ie.trabajo.org/job-862-e5c55c0025a830bff353d08d2b432fde?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Expertini | Ireland Jobs Expertini",
                    "link": "https://ie.expertini.com/jobs/job/senior-ios-engineer-dublin-distilled-4e5d680170/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiRGlzdGlsbGVkIiwiYWRkcmVzc19jaXR5IjoiRHVibGluLCBJcmVsYW5kIiwiaHRpZG9jaWQiOiJqOElYdUF2eE5IMlhjMEwyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNYSmxiR0Z1WkEifQ=="
        },
        {
            "title": "iOS Developer",
            "company_name": "Solas Consulting Group",
            "location": "Ireland",
            "via": "Jobrapido.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=fNz79INyAcwAK5_xAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU4nOAkmIrjoqFB0cegHlCQeScp5F3Kp9Av8bvENr_uuum1-DnDDD5IUrLCHh3hQdDUkEIZeJBKuL6m1omdrVclEba7lYIK8rTB6WewkXv-NmlzFQq7heDwdFlM47jaDkFO4CutMLXOEvspcIDPcK5Lj1w-lKPtHiQAAAA&shmds=v1_AUFQtOPNCBVNL-jzehpUjg0-7tknv39oCw6hz9zhmd6-mYgMOQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=fNz79INyAcwAK5_xAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "My Client are looking for a Senior iOS Mobile Developer to join their team. You will be responsible for developing applications for mobile devices powered by Apple’s iOS operating system. You will work closely with talented engineers, product managers, customers, architects, and various stakeholders to deliver our best in class mobile applications.\n\nResponsibilities:\n\nResponsible for developing our best in class iOS application\nDesign and build applications for the iOS platform with Quality, Security, Performance and Documentation in mind\nCollaborate with mobile team members, other engineers and product owners to identify best in class software solutions to complex problems in our industry\nTake a quality-first approach to software development by producing unit tests and automate functional testing as much as possible\nConduct code reviews with other developers, including security checks\nIdentify and correct bottlenecks and fix bugs\nHelp maintain code quality\nProvides regular updates on progress, schedules, issues, risks with team members and Software Development Manager.\n\nRequirements:\n\n5+ years proven experience in iOS/mobile development.\nSolid software engineering background.\nStrong background of iOS apps development\nExpert knowledge of iOS SDK\n3+ years exp developing apps using Swift\nExperience designing and architecting iOS apps and understand various design patterns\nMultithreaded programming using GCD and operation queues",
            "apply_options": [
                {
                    "title": "Jobrapido.com",
                    "link": "https://ie.jobrapido.com/jobpreview/39079093?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU29sYXMgQ29uc3VsdGluZyBHcm91cCIsImFkZHJlc3NfY2l0eSI6IklyZWxhbmQiLCJodGlkb2NpZCI6ImZOejc5SU55QWN3QUs1X3hBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "IOS DEVELOPER",
            "company_name": "PlaceMe Recruitment",
            "location": "Galway, Ireland",
            "via": "Expertini | Ireland Jobs Expertini",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=TAl84qspo7HmhRA1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43iINoI4KLrhapKC0VXMs1HmklzZXcifUb_Gl1eeNLPpNklhdXOGS37FyUWQUrOHEDQhhtCxzgyOw8Tfet6iA7Y0R86kRRO5ta7g0Hang0D27kTy0tRho8KtWb7XpMh-AW89KjpQtBRTY-O-0pKHS_G_0L30vII3kM9y_C5-WvjgAAAA&shmds=v1_AUFQtOMoGezaDFZahTAsl97gWCb_i-vbepLGpyE22g5Jm3dlmg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=TAl84qspo7HmhRA1AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f5da1bd7df495ec82de2b43c3211d6c7771b603fbc0b03f95.gif",
            "extensions": [
                "6 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "6 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Description\n\nMy client is recruiting for an iOS Engineer within the Mobile Development team. The successful candidate will work in the ever-growing IoT space, developing products to work in conjunction with IoT devices, wireless technology, server and database solutions. An excellent career opportunity for anyone looking to be part of the big data revolution. We are looking for an individual with a demonstrated interest in iOS development, who thrives on the challenges of learning new technologies and enjoys working as part of a highly skilled team.\n\nThey run projects in a close team environment, resulting in excellent experience opportunities, exposure to evolving technologies, project methodologies and dedicated talent development programs with opportunities for future career opportunities.\n\nKey Responsibilities\n• Design – working with Product Management, Project Management and end user stories on new product design architecture.\n• Development – taking designs and making them happen. Writing and testing code using strict development methodologies including code reuse, maintainability, testing and documentation.\n• Building high volume platforms - linking millions of users worldwide at the same time.\n• Quality Assurance – developing test cases in line with best practice methodology.\n• Project Environment - Working in a cross-functional agile team to develop features with collaboration across the software stacks.\n\nQualification:\n• 3-5+ years Objective C & Swift programming skills experience required along with a relevant 3rd level qualification\n• Proven experience developing and debugging mobile applications.\n• Understanding of the iOS operating system and programming environments.\n• Strong coding skills with proven ability to write well documented, maintainable, and testable code.\n• Excellent problem-solving skills and the ability to demonstrate logical troubleshooting steps when working on software bugs\n• A genuine passion and interest in technology and software development with a thorough knowledge of best practices and new technologies.\n• Self-management skills, particularly in respect to prioritization and execution\n• Detail-oriented individual with the ability to rapidly learn and take advantage of new concepts, business models, and technologies.\n• Have the ability to communicate technical concepts to non-technical people.\n\nFurther skills which are desirable … and will be developed in this role:\n• Unit Test driven development\n• Bluetooth classic or BLE development\n• Experience with networking and clientserver integration\n• Experience with SwiftUI\n• Sensor integration\n• Examples of Apps on the App Store",
            "apply_options": [
                {
                    "title": "Expertini | Ireland Jobs Expertini",
                    "link": "https://ie.expertini.com/jobs/job/ios-developer-galway-placeme-recruitment-748b8f8664/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter Ireland",
                    "link": "https://www.ziprecruiter.ie/jobs/357438948-ios-developer-at-placeme?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgREVWRUxPUEVSIiwiY29tcGFueV9uYW1lIjoiUGxhY2VNZSBSZWNydWl0bWVudCIsImFkZHJlc3NfY2l0eSI6IkdhbHdheSwgSXJlbGFuZCIsImh0aWRvY2lkIjoiVEFsODRxc3BvN0htaFJBMUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhTWEpsYkdGdVpBIn0="
        },
        {
            "title": "Web and Mobile App Developer",
            "company_name": "FUSIO",
            "location": "Dublin, Ireland",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Xpfpqpq2tWgj4EvDAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOMQoCMRAAQGzvBWK1tWgiio1WwqGcIBYilkcSlySyZkM2yj3CR6vN1NN8Rs3qhhZMusOJbSSEXc7Q4huJMxaYw5EtCJriAnCCA7MnnGxDrVk2WouQ8lJNjU45fmpOaHnQD7byp5dgCmYyFfvlejGonPx0vL9eujPEBO3LUkwz6ArSr_AFur0XOY8AAAA&shmds=v1_AUFQtONU7_Bqzxkb255-waw7VWnBLZihrowcVHmw05Et7S2Wnw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Xpfpqpq2tWgj4EvDAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "10th May 2023\n\nFUSIO have a vacancy for a Web and Mobile App Developer. This role will involve working on a wide variety of web and mobile projects for clients ranging from small business and NGOs to enterprise size organisations. You will be reporting to our Senior Development manager. Professional experience is desired but is not essential if you can provide evidence of appropriate educational qualifications and projects you have worked on.\n\nSkills required / desired:\n\n– PHP development experience, particularly with WordPress, Laravel and CodeIgniter.\n– Android Native app development experience (Kotlin experience a plus).\n– Front end development experience, particularly with VueJS.\n– TDD experience a huge plus.\n\nIdeally we would like to see some of your code so please give us access to a Git repository or sample of code you’ve worked on.\n\nWe are located in Dublin city centre close to Luas, Dart, Irish Rail and Dublin Bikes services.\n\nPlease send CVs to jobs@fusio.net – we’re looking forward to hearing from you\n\nNo agency calls please.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ie.indeed.com/viewjob?jk=ba76fc0b017126dd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Bashlee Recruitment",
                    "link": "https://bashlee.com/jobs/mobile-app-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ie.trabajo.org/job-1450-6466bc95521ba003e7506dd409a15131?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruitment.ie",
                    "link": "https://www.recruitment.ie/jobs/96089022-web-and-mobile-app-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GetIrishJobs",
                    "link": "https://www.getirishjobs.com/jobs/view/graduate-mobile-app-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter Ireland",
                    "link": "https://www.ziprecruiter.ie/jobs/355403792-mobile-app-developer-at-qptech?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJXZWIgYW5kIE1vYmlsZSBBcHAgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiRlVTSU8iLCJhZGRyZXNzX2NpdHkiOiJEdWJsaW4sIElyZWxhbmQiLCJodGlkb2NpZCI6IlhwZnBxcHEydFdnajRFdkRBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "iOS Software Engineer III, Commenting Experience",
            "company_name": "Reddit",
            "location": "Dublin, Ireland",
            "via": "Greenhouse",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=uELBkIRVRzMK_z_bAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7BzrdLLURwUVHLSUugn5ASdIzjaR3ITmxv-OfqstbX_VZVF243uHOD3mbjNCSD4SYQWtdw4mnCUkCeWjnhDkgOYQNXNhCQZPdCEzQMfuIq-MokspBqVJi44sYCa5xPCkmtDyrJ9vypy_jb0rRCPa7_XZuEvn18obDEAQCwfllY6AadMZoaPgCXvPKdaQAAAA&shmds=v1_AUFQtONRXBbqij3IFT2nZV8GXw2_9sC9NKi69puDwvR69fV_7A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=uELBkIRVRzMK_z_bAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "The Conversation Experiences team is responsible for one of the highest traffic pages on the platform: the Comments page. We know that conversations are the lifeblood of Reddit, so we strive to ensure viewing content and the surrounding conversation is appealing, intuitive and delightful. This is a high impact role where you will drive related technical & product strategy, operations, architecture, and execution for one of the largest sites in the world.\n\nWhat You’ll Do:\n• Work cross-functionally, collaborate and partner with product, design, and other engineering counterparts to execute on product and business strategy and build novel products and features that our users will love.\n• Contribute to the full development cycle: technical design, development, test, experimentation, analysis, and launch. You’ll be reviewing code and design docs, giving feedback on product specs and mocks.\n• Participate with a team of thoughtful, fast-moving, and motivated engineers. Contribute to standards that improve developer workflows, recommend best practices, and help mentor engineers on the team to grow their technical expertise.\n• Continuously learn and improve your technical and non-technical abilities.\n\nMinimum Candidate Qualifications for this role:\n• Minimum of 3+ years of post-internship, full-time, hands-on, professional software development experience developing user-facing iOS mobile native applications at scale, using Swift.\n• Expertise in Swift and Objective-C\n• Familiarity with software engineering best practices such as unit/integration/end-to-end testing, design documents, CI/CD, A/B testing, code reviews, and documentation\n• Strong organizational skills, the ability to prioritize tasks and keep projects on schedule.\n• Excellent communication skills. You collaborate effectively with teams in a fully remote environment and discuss complex topics with technical and non-technical audiences.\n• BS degree in Computer Science, a similar technical field of study or equivalent practical, professional, hands-on experience.\n• You love to build new things and thrive in ambiguity and even failure. You care about innovation.\n• Software development experience in one or more general-purpose programming languages; Java, Python, Go, Rust, C++.\n• Additional knowledge around GraphQL, REST, HTTP basics, and the ability to design maintainable APIs is a plus.\n\nBenefits:\n• Comprehensive Health Benefits\n• Retirement Savings plan with matching contributions\n• Workspace benefits for your home office\n• Personal & Professional development funds\n• Family Planning Support\n• Flexible Vacation & Reddit Global Days Off",
            "apply_options": [
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/embed/job_app?for=reddit&token=6293671&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Wellfound",
                    "link": "https://wellfound.com/jobs/3114827-ios-software-engineer-iii-commenting-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/ios-software-engineer-iii-commenting-experience/3347707?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In Dublin",
                    "link": "https://builtindublin.ie/job/ios-software-engineer-iii-commenting-experience/3347707?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/ios-software-engineer-iii-subreddit-success-reddit-5892741?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ie.linkedin.com/jobs/view/ios-software-engineer-iii-commenting-experience-at-reddit-inc-4037104978?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Initialized Capital Job Board",
                    "link": "https://jobs.initialized.com/companies/reddit/jobs/40983612-ios-software-engineer-iii-commenting-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter Ireland",
                    "link": "https://www.ziprecruiter.ie/jobs/356780777-ios-software-engineer-iii-commenting-experience-at-reddit?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgU29mdHdhcmUgRW5naW5lZXIgSUlJLCBDb21tZW50aW5nIEV4cGVyaWVuY2UiLCJjb21wYW55X25hbWUiOiJSZWRkaXQiLCJhZGRyZXNzX2NpdHkiOiJEdWJsaW4sIElyZWxhbmQiLCJodGlkb2NpZCI6InVFTEJrSVJWUnpNS196X2JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "Senior iOS Developer",
            "company_name": "MCS Group",
            "location": "Ireland",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=_KXp1b_XCbXcqiOrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFw7OzndrJiI4KKjQlEQh35ASeKRpMS7cBelo58uvuF130W3GZAyC-THABf8YOGKAlu4sQdFJyEBE_TMseDqlFqrerRWtZiozbUcTOCXZULPs53Y679RkxOsxTUc94fdbCrF9fJ-HqAXflfIBFfB4uj5Azl5_JeDAAAA&shmds=v1_AUFQtOM9RloIn5DVub-b6zhuK6w5XhIClc5M8fi5v4sqNoYNpA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=_KXp1b_XCbXcqiOrAAAAAA%3D%3D",
            "extensions": [
                "14 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "14 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "MCS Group is thrilled to be working with a brand-new startup that is expanding quickly in Northern Ireland! They are looking for a Senior IOS Developer to join them as they set up a hub here in Belfast and are poised to dominate their industry.\n\nIs this your next job Read the full description below to find out, and do not hesitate to make an application.\n\nDo you love the buzz of a start-up? Autonomy in your role? A local team to collaborate with? The Role: In this position, you will be responsible for of developing their main mobile application alongside carrying out greenfield work on a future new product.\n\nYou will be exposed to all platforms and have complete control over every facet of the software development life-cycle.\n\nThis is a fantastic chance to become a part of a close-knit, highly skilled, and technically proficient engineering team.\n\nYou'll be able to truly influence how this business and its products are developed in the future.\n\nYou will have complete autonomy and the chance to contribute your thoughts in building out this companies iOS application.\n\nYour new employer will provide you with the time and resources to learn new technologies if this is something you are passionate about.\n\nRole Requirements: Solid Experience as an iOS Developer Experience using Swift / UI principals It is preferred if you have experience with startups or small to medium sized businesses.\n\nWilling to occasionally travel, sometimes internationally, for team events.\n\nAbove all, you will be a passionate, self-directed, and driven engineer who loves learning new technologies and imparting knowledge to the team.\n\nWhat's in it for you? Highly Competitive base salary, flexible dependant on experience.\n\nGenerous annual leave and pension contribution Local Belfast office with flexible and remote working options Steer the direction of a brand new/ soon to be multi-award-winning product worldwide Ownership and freedom to put your own stamp on the work you do Join a team where all ideas are encouraged and welcomed To speak in absolute confidence about this opportunity please contact Luke Graham, IT Recruitment Consultant at MCS Group or click the apply button below.\n\nIf this position is not right for you, we may have others that are.\n\nPlease visit MCS Group to view a wide selection of our current jobs or give us a call .\n\nAll conversations will be treated in the strictest of confidence.\n\nMCS Group is committed to Equality, Diversity, and Inclusion for all, being the first recruitment agency in NI to achieve Bronze Diversity Mark accreditation, if you have a disability which means you require a reasonable adjustment to be considered at any stage of the recruitment process, please contact us and we will endeavour to facilitate the request.\n\nSkills: ios Developer Developer Mobile developer",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ie.jooble.org/jdp/8174503658028557413?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6Ik1DUyBHcm91cCIsImFkZHJlc3NfY2l0eSI6IklyZWxhbmQiLCJodGlkb2NpZCI6Il9LWHAxYl9YQ2JYY3FpT3JBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        },
        {
            "title": "iOS Engineer, Consumer Engineering",
            "company_name": "Rent the Runway",
            "location": "Galway, Ireland",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=qorQuXERHL61eDQdAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_z2MMQrCQBAAsc0TrBZLiXciWKiliGgjxAeES1zuTi674XaD8S8-1tjYDMMUU3xmxS7e7nAiHwkxl3BkkqHD_E-RPKzgyg0IutwGYIIzs084PwTVXvbWiiTjRZ3G1rTcWSZseLRPbuSHWoLL2CenWG-269H05JeLCklBA0I10Mu9IU5flyYr4ZIxOXp8AaXt9H6fAAAA&shmds=v1_AUFQtOMMmhNb2YhKYA74tYys8tMH3U9f195Eoikou0kbk5j2pg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=qorQuXERHL61eDQdAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f0cc19660ca8167f5345afe211ee9049f3f809342b2a194fe.gif",
            "extensions": [
                "25 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "25 days ago",
                "schedule_type": "Full-time"
            },
            "description": "iOS Engineer, Consumer Engineering\n\nAbout Rent the Runway\n\nFounded in 2009, Rent the Runway is disrupting the trillion-dollar fashion industry and changing the way women get dressed through the Closet in the Cloud, the world's first and largest shared designer closet. RTR's mission has remained the same since its founding: powering women to feel their best every day. Through RTR, customers can subscribe, rent items a-la-carte and shop resale from hundreds of designer brands. The Closet in the Cloud offers a wide assortment of millions of items for every occasion, from evening wear and accessories to ready-to-wear, workwear, denim, casual, maternity, outerwear, blouses, knitwear, loungewear, jewellery, handbags, activewear, ski wear, home goods and kidswear. RTR has built a two-sided discovery engine, which connects deeply engaged customers and differentiated brand partners on a powerful platform built around its brand, data, logistics and technology. Under CEO and Co-Founder Jennifer Hyman's leadership, RTR has been named to CNBC's \"Disruptor 50\" five times in ten years, and has been placed on Fast Company's Most Innovative Companies list four times, while Hyman herself has been named to the \"TIME 100: Most Influential People in the World\" and as one of People Magazine's \"Women Changing the World.\"\n\nGalway Office\n\nRent The Runway established its European Technology Hub in Galway in April 2019. Based in the historic Claddagh area of the city, the growing team in Galway tackles core technology challenges and influences the next generation of services critical to Rent The Runway's success and continued growth.\n\nThe Galway office is Rent the Runway's first international office outside the US and enables the company to significantly expand its Software Engineering, Product Development, Machine Learning Engineering and Data Science footprint. Rent The Runway's Galway-based employees have the opportunity to grow their careers across several roles and career paths in Technology.\n\nOur engineering team is smart, pragmatic, and entrepreneurial. We are a collaborative and supportive group that practices continuous learning and development.\n\nWe are always interested in speaking with developing and experienced iOS engineers who are interested in joining our team. If that's you, read on for a snapshot of the type of work our iOS engineers do across our various teams, share your details and a member of our Talent team will be in touch!\n\nAbout the Job:\n\nAt Rent the Runway, you will architect, design, develop, deploy our iOS app, which is the platform of choice for our 100k+ subscribers (they use the app on average 3-4 times a week!). We are looking for someone who can drive development and delivery, architecture & evangelize best practices in mobile. We believe that every person deserves a \"Cinderella\" experience, whether they are a first time user or monthly subscriber. Many of our millions of members have used Rent the Runway for the most important events in their lives, and in the process, we are changing the meaning of ownership and revolutionizing retail.\n\nWhat You'll Do:\n• Create and maintain features in a fast-paced, startup environment.\n• Participate in technical discussions on building product features and the technical vision of a modern and composable/scalable app.\n• Be an advocate of the iOS platform and promote and employ software development best practices.\n• Work closely with cross-functional teams across Engineering, Product, Analytics, Marketing, Creative, and Design.\n• Drive continuous improvement for the release process.\n\nAbout You:\n• You have a BA/BS in Computer Science, related degree, or equivalent practical experience.\n• You have 5+ years of professional experience in software development, working on robust, complex systems that serve a high volume of users.\n• You have professional experience building iOS applications using Swift, and bonus points for familiarity with SwiftUI and/or The Composable Architecture.\n• You are comfortable working with various architectural patterns and understand when best to apply them.\n• You have a strong command of algorithms, data structures, and best practices.\n• You have a passion for bringing great products into our world through collaboration and ingenuity.\n• You're able to understand, diagnose, and effectively articulate technical challenges and solutions.\n• You're able to handle ambiguous problems and make the tradeoffs without compromising quality.\n\nBenefits:\n\nAt Rent the Runway, we're committed to the happiness and wellbeing of our employees, and aim to create a workplace that fosters both personal and professional growth. Our inclusive benefits include, but are not limited to:\n• Generous Paid Time Off including annual leave, paid bereavement, and family sick leave - every employee needs time to take care of themselves and their family.\n• Universal Paid Parental Leave for both parents + flexible return to work program - because we know your newest family member(s) deserve your undivided attention.\n• Paid Sabbatical after 5 years of continuous service - unplug, recharge, and have some fun.\n• Competitive Stakeholder Pension - taking care of your future.\n• Comprehensive health, dental care and dependents care from day 1 of employment - Your health comes first and we've got you covered.\n• Company wide events and outings - our team spirit is no joke - we know how to have fun!\n• Hybrid Work - This is a hybrid role based in our Galway, Ireland office. Employees have to option to work remotely 2-3 days per week.\n\nRent the Runway is an equal opportunity employer. In accordance with applicable law, we prohibit discrimination against any applicant or employee on any legally-recognised basis, including, but not limited to: gender, marital status, family status, age disability, sexual orientation, race, religion, and membership of the Traveller community.\n\n#LI-EM1\n\nBy submitting your application below, you agree that you have read and acknowledge Rent the Runway's Candidate Privacy Policy, found here.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ie.indeed.com/viewjob?jk=8df080b315263102&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/ios-engineer-consumer-engineering/3705139?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Org",
                    "link": "https://theorg.com/org/rent-the-runway/jobs/ios-engineer-consumer-eng-c94719d9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Muse",
                    "link": "https://www.themuse.com/jobs/renttherunway/ios-engineer-consumer-engineering-0f37cf?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/ios-engineer-consumer-engineering-renttherunway-6085339?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ie.linkedin.com/jobs/view/ios-engineer-consumer-engineering-at-rent-the-runway-4105394300?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ie.jooble.org/jdp/1828704792149608753?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruitment.ie",
                    "link": "https://www.recruitment.ie/jobs/99840451-ios-engineer-consumer-engineering?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRW5naW5lZXIsIENvbnN1bWVyIEVuZ2luZWVyaW5nIiwiY29tcGFueV9uYW1lIjoiUmVudCB0aGUgUnVud2F5IiwiYWRkcmVzc19jaXR5IjoiR2Fsd2F5LCBJcmVsYW5kIiwiaHRpZG9jaWQiOiJxb3JRdVhFUkhMNjFlRFFkQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFNYSmxiR0Z1WkEifQ=="
        },
        {
            "title": "Flutter Mobile Developer",
            "company_name": "Raketech",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQoCMQyAYVxvdXPKLNiK4KKrKAouvsCR1tCexqY0UW73xT2Xf_iGv_vOOn_ktxk1uEoYmOBAH2KpE6zgIgGUsMUMUuAkkpgW-2xWdee9KrukhjZEF-XlpVCQ0T8k6D-9ZmxUGY36zXY9ulrScn7DJxlNw6HAuRFjuf8A7i07TIYAAAA&shmds=v1_AUFQtONIYMj9UFWkUUB9hEk3yUX5keGU7yoPRCaId-ndSYjzTQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785057b1d0609c0bef4ae26/images/05e4989cdabd196f04458a74973e182b88ba3d5047bdc0d4d337ddd21df87796.gif",
            "extensions": [
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Portugal\n\nThe role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or Malta.\n\nWe are looking for an enthusiastic Flutter Mobile Developer to help maintain and develop our sports mobile applications.\n• As a Flutter Mobile Developer you are expected to …\n• Write clean, well-documented, and maintainable code for Flutter application\n• Develop and maintain technical documentation for the applications\n• Identify the causes of the most complex issues and implement practical and efficient technical solutions\n• Implement both backend and front-end features\n• Coordinate with UX/UI designers, developers, and test engineers in an Agile environment\n• Abide by industry and company software development standards\n• Conduct code reviews and give feedback to other developers\n• Understand the big picture and offer insightful advice about technologies and projects\n• Be proactive in identifying and communicating potential risks and issues to the team and stakeholders\n• Participate in sprint planning, estimation, and retrospective meetings\n• Keep up-to-date with the latest mobile app development trends and technologies\n• Work in close partnership with cross-functional teams and management\n• Ensure code quality by writing tests, using SonarQube, etc.\n• Success in this role means...\n• Collaborating towards a team effort to improve the overall user experience of our applications.\n• Developing DRY, clean, maintainable and scalable code that can be comprehended and worked on solely through documentation created.\n• Increasing the performance, scalability and security of our mobile applications.\n• You have acquired proficient communication skills in the English language through team collaboration.\n\nThis offer from \"Raketech\" has been enriched by Jobgether.com and got a 86% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66e4d25a5ae7155b1774745b-flutter-mobile-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIE1vYmlsZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJSYWtldGVjaCIsImFkZHJlc3NfY2l0eSI6IklyZWxhbmQiLCJodGlkb2NpZCI6InNGeWFMN3l1R1RkU2RJNE5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIU1hKbGJHRnVaQSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUbTlhTjBoVFRscHdWSGR4UkMwMU0xbHNaakl4V1hGMVpFRm9jbEpVZGxjdFlVZ3laMDVXY2w5UmNsOTFiekpRVXpaQmNtdENTR1p6YkdJM1NtcE1Ra3h1ZVRCUWVYSm5VbE5oVTNoYWNWRmxXR3Q1YTFCRFoySTJaVFJHYmtZNE5qRnZhVVV5ZVcxcmNsTm9iRlZzVG1kc1pURXpRV1kyTUcxcVdEVmtMVE5LUjNoZk1WaG9WbVEzVVhBeVJGRmxlVUUxTTFKSlYxQmFRMXB1TVRSRGJITnZURVV6ZVVSYVNuWlZYMjVGV2pKRk5WVjVTakJHUkZkZlRGbE9jbXRPUW01R04xVmxRWEpSY2t3MVFWZDRiSFZvUkVkVFdVWnFRVkZOY1hNellUWjVXVmQ0UkRKeFgwSm1TVU5TUmxBd1kxOU1NVVp3VWtSbFJXeGtSekY2ZEcxR1pIRmpXaElYWmtGWFJsbzBhV1pNVEcxS2QySnJVSGhsTTJnd1VWa2FJa0ZHV0hKRlkzQmhaME4xVFhwdFJqaHVSVWxsTWpWMlYyRmlPR05aY2tJMmIxRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Ireland&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUbTlhTjBoVFRscHdWSGR4UkMwMU0xbHNaakl4V1hGMVpFRm9jbEpVZGxjdFlVZ3laMDVXY2w5UmNsOTFiekpRVXpaQmNtdENTR1p6YkdJM1NtcE1Ra3h1ZVRCUWVYSm5VbE5oVTNoYWNWRmxXR3Q1YTFCRFoySTJaVFJHYmtZNE5qRnZhVVV5ZVcxcmNsTm9iRlZzVG1kc1pURXpRV1kyTUcxcVdEVmtMVE5LUjNoZk1WaG9WbVEzVVhBeVJGRmxlVUUxTTFKSlYxQmFRMXB1TVRSRGJITnZURVV6ZVVSYVNuWlZYMjVGV2pKRk5WVjVTakJHUkZkZlRGbE9jbXRPUW01R04xVmxRWEpSY2t3MVFWZDRiSFZvUkVkVFdVWnFRVkZOY1hNellUWjVXVmQ0UkRKeFgwSm1TVU5TUmxBd1kxOU1NVVp3VWtSbFJXeGtSekY2ZEcxR1pIRmpXaElYWmtGWFJsbzBhV1pNVEcxS2QySnJVSGhsTTJnd1VWa2FJa0ZHV0hKRlkzQmhaME4xVFhwdFJqaHVSVWxsTWpWMlYyRmlPR05aY2tJMmIxRSIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}