{
    "search_metadata": {
        "id": "678505eaaa5dddd26477e1db",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/02793a58f64733ed/678505eaaa5dddd26477e1db.json",
        "created_at": "2025-01-13 12:24:10 UTC",
        "processed_at": "2025-01-13 12:24:10 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=EswCCowCQUpHOUprTXduTG96NFE3RFpoTGpfQ2hONnZ4ZmZkaFZxc3o1Vi1UeDdqbWoyOU8xdFdEbkFIOHVTMUNoNEwxUThEc3lwSlRjSUNmLU5FTEI3WV9jXzc3NnBWbWRpQjBiQ1ZVVnpHenJNUkdlbHdPYjFMQjZObUsyOUREc2RzVy1hVjBFcFJPc010R3RDVmRSN1lXNmVXYi1jclRCVmtFRVBYeUszRU4tWHh2cDFHTlNhZC1QaVVtOWUzSzBUMmhQRmZYdDNyNVQyMHRmMk5UbmYtbElEU3ctTUNZejNWcE5sZ2lmSXRBb28wWWQtVjdvQ1pJOXY2ajU4UGtXWF9HZUR1eXR4eDgyXzhQSRIXNlFXRlo4MmFOSTdKd040UDB0M2E2QXcaIkFGWHJFY3A2ZmNVSlVHV0YzZVJkdjRuMGlMWVdsZm1DT3c&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/02793a58f64733ed/678505eaaa5dddd26477e1db.html",
        "prettify_html_file": "https://serpapi.com/searches/02793a58f64733ed/678505eaaa5dddd26477e1db.prettify",
        "total_time_taken": 1.13
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUWGR1VEc5Nk5GRTNSRnBvVEdwZlEyaE9Oblo0Wm1aa2FGWnhjM28xVmkxVWVEZHFiV295T1U4eGRGZEVia0ZJT0hWVE1VTm9ORXd4VVRoRWMzbHdTbFJqU1VObUxVNUZURUkzV1Y5alh6YzNObkJXYldScFFqQmlRMVpWVm5wSGVuSk5Va2RsYkhkUFlqRk1RalpPYlVzeU9VUkVjMlJ6VnkxaFZqQkZjRkpQYzAxMFIzUkRWbVJTTjFsWE5tVlhZaTFqY2xSQ1ZtdEZSVkJZZVVzelJVNHRXSGgyY0RGSFRsTmhaQzFRYVZWdE9XVXpTekJVTW1oUVJtWllkRE55TlZReU1IUm1NazVVYm1ZdGJFbEVVM2N0VFVOWmVqTldjRTVzWjJsbVNYUkJiMjh3V1dRdFZqZHZRMXBKT1hZMmFqVTRVR3RYV0Y5SFpVUjFlWFI0ZURneVh6aFFTUklYTmxGWFJsbzRNbUZPU1RkS2QwNDBVREIwTTJFMlFYY2FJa0ZHV0hKRlkzQTJabU5WU2xWSFYwWXpaVkprZGpSdU1HbE1XVmRzWm0xRFQzYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "iOS Developer – Expo AS – Remote – Inside IR35",
            "company_name": "The Bridge",
            "location": "England, United Kingdom",
            "via": "The Bridge IT Recruitment",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=8cTVHo_6tsEiGYoAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3GMQrCMBQAUFx7BKe_uIg2onTRSbFI7SC0Ope0-SSR9P_QBOnoHTyJV_IkosvjJe9JUtpLDUd8oGOPA3yeL8hHz7Cv_6-w54j_FhSsQiiqTQZLOHMLAeXQGWCCE7N2ON2ZGH3YChGCS3WIMtou7bgXTNjyKO7chh9NMHJA72TEZp2txtSTns-uBuEwWKURLEFO2klSC7iRjaigtKQV91-n8iRytAAAAA&shmds=v1_AUFQtOOrsE1S1TEfwL6XZcUlRxfh-ZNXvMcCsBsc6MUL82sh5g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=8cTVHo_6tsEiGYoAAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee888ba6fad1247fe91af6a116014fb1965e3c03160106c6de6.gif",
            "extensions": [
                "4 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "4 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This is a fantastic opportunity to work as an iOS Developer for a well known logistics company, on a remote contract, inside IR35.\n\nThe key experience required for this iOS Developer role is:\n• iOS\n• Android familiarity\n• EXPO AS\n\nIf you do have the relevant experience for this remote iOS Developer vacancy, please apply.",
            "apply_options": [
                {
                    "title": "The Bridge IT Recruitment",
                    "link": "https://thebridgeit.com/job/ios-developer-expo-as-remote-inside-ir35-3145/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIOKAkyBFeHBvIEFTIOKAkyBSZW1vdGUg4oCTIEluc2lkZSBJUjM1IiwiY29tcGFueV9uYW1lIjoiVGhlIEJyaWRnZSIsImFkZHJlc3NfY2l0eSI6IkVuZ2xhbmQsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiI4Y1RWSG9fNnRzRWlHWW9BQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Mobile Engineer (iOS)",
            "company_name": "Blue Light Card",
            "location": "Leicester, United Kingdom (+1 other)",
            "via": "Blue Light Card Careers",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=3uGh5chwDjPy4PLJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43qtRGBBfdFBG04iDOJUmP5CS9K8kJ_RX_VnzDq76zqr6Lo4Rw5kCMmGFBj-cS1nAVBwVt9hGE4SISEs4PUXUse2NKSU0oapV842UwwuhkMm9x5V9Xos04JqvYbXebqRk5rOpj-iC0FKLCyeYeiKFF8lgUcw0vJsUebsShl-EHNJ3tTJwAAAA&shmds=v1_AUFQtOPMbH2C2U4lDMBxK8Pvri39aobiy6uAY26rVRwJAVZxKQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=3uGh5chwDjPy4PLJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8d082c288e14de542dd173a5da913c252b376602264382c45.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Blue Light Card. Individually great, together unstoppable\n\nThe Role and the Team\n\nWe’re looking for an iOS developer passionate about creating intuitive and impactful apps to join a newly established cross functional team here at Blue Light Card. Now is a great time to join as we’re entering an exciting new chapter! Our tech team is completing a replatforming project, transitioning to a modern, serverless environment. With this foundation in place, we’re poised to embark on innovative greenfield projects that will redefine our app experience.\n\nThis is your chance to work at the forefront of technology, contribute to fresh ideas, and play a pivotal role in crafting solutions that make a real difference to our members. If you thrive in dynamic environments and love building exceptional mobile experiences from the ground up, we’d love to hear from you!\n\nWhat You’ll Do\n• Build great mobile applications with highly readable code. Be a part of the mobile community of practice and champion this within the wider Blue Light Card team\n• Collaborate on designing solutions that meet functional and non-functional requirements following Blue Light Card architectural standards\n• Write clean, maintainable, and testable code while participating in code reviews to ensure coding standards and best practices\n• Work with product managers, designers, and backend engineers to define and deliver features that align with the overall product vision\n• Implement and maintain unit tests and UI tests to enhance code quality. Diagnose and fix bugs or performance bottlenecks to improve user experience\n• Support automated build, test, and deployment processes to ensure seamless and rapid release cycles\n• Document technical requirements, specifications, and decisions to ensure a clear knowledge base and maintainable code\n\nWhat You’ll Bring\n• Expertise in Swift and SwiftUI, with strong experience in UIKit, Storyboards, and Swift packages for building scalable, high-quality mobile applications\n• Proven ability to implement robust testing using XCTest for unit tests, TestFlight for app testing, and Appium for UI testing, ensuring high-quality and reliable code\n• Proficiency in using GitHub for source control and GitHub Actions for CI/CD pipelines to streamline development workflows\n• Experience with shared business logic using Kotlin Multiplatform Mobile (KMM) to enhance cross-platform development and ensure code consistency\n• Familiarity with key tools and services like Amplitude for analytics, Braze for push notifications and in-app messaging, Firebase for Crashlytics, and Stripe for card payments to build engaging, data-driven applications\n• Strong experience with server-driven UI and working with cloud technologies, including deploying serverless applications on AWS and managing app distribution via XCCloud\n• Excellent communication skills, with the ability to collaborate effectively with both technical and non-technical stakeholders, mentor junior developers, and foster a culture of continuous learning and process improvement\n\nOur Culture\n\nOur members, partners and colleagues are at the heart of everything we do.\n\nOur colleagues are integral to helping create the unique experience we deliver, so we’re genuinely committed to creating a place where our team love to work, and people want to join. We work as a team and try to have a bit of fun while we do it, and we recognise the importance of culture and the positive impact it can have on performance for you, the team, our organisation and our members. We believe in attracting the best talent no matter where you are, and have a hybrid working model, with colleagues based in London, the East Midlands and around the country.\n\nWe're also officially recognised as a Top 100 Great Place To Work UK, one of the UK's Best Workplaces for Wellbeing, Top 100 Best Workplaces for Women and recognised as investors in wellbeing by Investors in People.\n\nWhat We Offer\n• Hybrid working and flexible hours\n• Free parking and EV charging onsite\n• 25 days plus public holidays, buy and sell and an additional day off for your birthday \n• A company bonus scheme\n• Great social events e.g., Christmas party, family fun day, summer party, sports matches\n• Relaxed dress code and modern office space (games area, chill-out areas, book club, free coffee/tea/soft drinks/snacks)\n• Onsite gym (including access to free HIIT & stretch classes)\n• Learning and development opportunities \n• Group auto-enrolment pension plan\n• Enhanced maternity, paternity, sick pay\n• Company funded private medical insurance\n• Healthcare cashback plan\n• Employee assistance programme (including mental health support)\n• 35 hour working week",
            "apply_options": [
                {
                    "title": "Blue Light Card Careers",
                    "link": "https://careers.bluelightcard.co.uk/jobs/5226743-mobile-engineer-ios?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=b0cfeb451970de78&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRW5naW5lZXIgKGlPUykiLCJjb21wYW55X25hbWUiOiJCbHVlIExpZ2h0IENhcmQiLCJhZGRyZXNzX2NpdHkiOiJMZWljZXN0ZXIsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiIzdUdoNWNod0RqUHk0UExKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "iOS Developer",
            "company_name": "Moneybox",
            "location": "England, United Kingdom",
            "via": "Theround",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=_J7uPManHP6kOmWYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAAUFz7CU4HOokmIrjYVREUcRDnkqRHEknvQi5I_QM_27q86TXfWbOM9wcc8Y2JMxbYwIUtCJriAjDBmdknnLeh1iwHrUWS8lJNjU45HjQTWh71i6386SSYgjmZit1uvx1VJr9a3Kb1mRpEghP5ZKhfw5NixR6ukXzPww8Xap5uiwAAAA&shmds=v1_AUFQtOPmxytfc45EhsUafsQu27bdS1ZcT5ygjHjacppCrEyCDw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=_J7uPManHP6kOmWYAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8ee0161cfa1aa721790c6383324745fa7da4b475e57171c98.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are building a financial service that people love. We are looking for an iOS Developer, who will be responsible for the development and maintenance of the Moneybox app. Your primary focus will be development of iOS applications and their integration with back-end services. You will be working alongside a team of engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\n\nYou can explore our events here, and our community on Discord here for more information on the exciting things we do, including tech FAQs and our Tech Blog\n\nWhat you’ll do\n• The position will be responsible for supporting the Lead iOS Developer to work on the iOS application. You will help to create a reliable application that makes investing simple and enjoyable for users. You will be involved in the whole life cycle from suggesting new features to releasing the application.\n• Develop new features and maintain the Moneybox iOS application.\n• Lead development and take ownership for streams of work that enable customers to reach their financial goals.\n• Mentor and support members of the iOS team.\n• Help to suggest new features for the application that will make the app experience better for users, and that will make the application more reliable.\n• Ensure the performance, quality, and responsiveness of applications.\n• Collaborate with the wider team to define, design, and ship new features\n• Support the design of the architecture of the iOS application. Lead large scale improvements to the design of the application.\n• Identify and fix bottlenecks and bugs.\n• Help to maintain the quality and organisation of the codebase\n• Be responsible for releasing the app to the store and monitor the app post-release.\nWho you are\n• Someone who is excited about making an application you would use personally that helps make saving and investing easier and more accessible.\n• Thrives in a fast-pace startup environment.\n• Interested in all areas of the business and enjoys hearing about what other team members are working on.\n• Genuine interest in financial technology.\n• Constantly looking to improve all areas that you can affect.\n• Excited about learning and experiencing new ways of thinking.\nExperience and skills- Essential\n• At least 2 years of professional experience in developing native iOS apps.\n• Proficient in Swift and iOS frameworks.\n• Exposure to all aspects of software development from gathering requirements to releasing.\n• Applied knowledge of design patterns and SOLID principles.\n• Advocates good and clean design of the code, in an enthusiastic way.\n• Experience and desire about mentoring and supporting other developers.\n• Experience in designing RESTful APIs together with backend developers.\n• Experience in developing user interfaces with auto-layout and collaborating with UX/UI designers.\n• Extensive knowledge of the general mobile landscape, architecture, trends, and emerging technologies.\n• Experience with modern architecture such as MVP, MVVM, VIPER etc.\n• Proficient understanding of Git.\n• Experience in implementing unit tests.\n• Familiarity with continuous integration.\nExperience and skills- Desirable\n• Computer science or related degree.\n• Use of CoreData, or other data persistence frameworks.\n• Experience with complex interfaces and architectures.\n• Experience with Security and Cryptography.\n• Experience in implementing custom native animations.\n• Proficient with continuous integration tools.\nWhat's in it for you?\n• Opportunity to join a fast-growing, award-winning and super ambitious startup\n• Work with a friendly team of highly motivated individuals\n• Be in an environment where you are listened to and can actually have an impact\n• Thriving collaborative and inclusive company culture\n• Company Shares\n• Company pension scheme\n• Subsidised private medical insurance\n• Cycle to work scheme\n• Gympass subscription\n• Enhanced parental pay & leave\n• Personal L&D allowance\n• Membership to online learning & teaching platform\n• 25 days holiday + bank holidays\n\n#LI-NZ1\n\nPlease read before you apply!\n\nBy sending us your application you acknowledge and agree to Moneybox using your personal data as described below.\n\nWe collect applicants’ personal data to manage our recruitment related activities. Consequently, we may use your personal data to evaluate your application, to select and shortlist applicants, to set up and conduct interviews and tests, to evaluate and assess the results, and as is otherwise needed in the recruitment process generally.\n\nWe do not share your personal data with unauthorised third parties. However, we may, if necessary, share your personal data to carefully selected third parties acting on our behalf. This may include transfers to servers and databases outside the country where you provided us with your personal data. Such transfers may include for example transfers and/or disclosures outside the European Economic Area and in the United States of America.\n\nPlease note if offered a position, the offer is conditional and subject to the receipt of satisfactory pre-employment checks which we will conduct such as criminal record and adverse credit history checks. As a regulated financial business, an adverse financial history could impact your suitability for the role. If you are aware of anything that could affect your suitability for the role, please let us know in advance.\n\nIf you are unsuccessful in your application, we may keep your details on file so that we can tell you about other suitable vacancies which may be of interest to you when they arise in the future. If you would rather we did not keep your details on file, you can contact us at email: DPO@moneyboxapp.com\n\nYour application will be subject to criminal record and adverse credit history checks (such as CCJs, IVAs and bankruptcy). As a regulated financial business, an adverse financial history could impact your suitability for the role. If you are aware of anything that could affect your suitability for the role, please let us know.",
            "apply_options": [
                {
                    "title": "Theround",
                    "link": "https://www.theround.com/moneybox-jobs/ios-developer/ed7a7e5b-f5eb-4554-a0a3-9dc8eb662ab6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Study International Jobs",
                    "link": "https://jobs.studyinternational.com/job/ios-developer-keia6Au6fV-at-oho-group-ltd-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=3e1f01eca093&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/gb-england-westminster-ios-developer-cure-talent-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTW9uZXlib3giLCJhZGRyZXNzX2NpdHkiOiJFbmdsYW5kLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiX0o3dVBNYW5IUDZrT21XWUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "iOS Developer",
            "company_name": "All In The Loop",
            "location": "Wilmslow, United Kingdom",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=nH3UxNFzcHhmf34gAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEOwoCMRAAUGz3CFZTWPnZiGCjlSCIH7BQsVyy2SGJzM6ETNA9hkcWX_Gq76iaxOsN9vhGkoQZFnCSFhRtdgGE4SDiCcfbUErSjTGqVHsttkRXO-mNMLYymJe0-q_RYDMmsgWb1Xo51In9dLYjgiPDPSBcRBJEhmekXkk-c3hwLNjBObLvpP8BzxJ6UZMAAAA&shmds=v1_AUFQtOOH4pYIzHdhfKOrfMLYH82X8Xx9MQLufqGWe6MZEAOxkw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=nH3UxNFzcHhmf34gAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8b82e313798860277746785ea7848011f1c12b47911577266.gif",
            "extensions": [
                "£30K–£45K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "£30K–£45K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About us\n\nAll In The Loop is an event technology company which has supported over 10,000 events worldwide. We provide customized apps that improve networking, registration and badging systems. Our team and knowledge have grown since our inception in 2015 and we feel we have the best offering and service in the business.\n\nThe IOS Developer role is a newly created role to keep up with the demand of our ever-growing client base, as well as supporting our existing apps. In this role, you will be instrumental in developing and maintaining our iOS applications. Working within an Agile framework, you will deliver innovative and robust solutions, ensuring our software is flexible, reliable, efficient, and secure.\n\nKey Responsibilities:\n• Collaborating with teams to design, build and continuous improvements of their IOS platforms\n• Involved in the upgrades legacy IOS application to modern frameworks\n• Convert product and architecture requirements into code with accurate timeframes and delivery estimates.\n• Ensure top-notch code quality by adhering to best practices and coding standards.\n• Maintain various applications and services to support our platform.\n• Stay proficient in multiple mobile development technologies, coding languages, and disciplines.\n\nSkills and Experience:\n• Background in iOS Development and Swift\n• Experience with Swift, SwiftUI, Xcode, and testing with tools such as XCTest.\n• Knowledge of web technologies and UI/UX standards.\n• Understand Google’s design principles and interface guidelines.\n• Experience with performance and memory optimisation using tools like Android Studio Profiler.\n• Familiar with cloud message APIs and push notifications.\n• Proficient in code versioning tools like Git.\n• Experience with Android development is a plus but not required.\n• Familiarity with industry best practices, development processes, and methodologies.\n• Experience delivering complex software solutions in an Agile setting.\n\nAll In The Loop is proud to be an equal opportunities employer. Qualified applicants will receive consideration for employment regardless to race, colour, religion, sex, sexual orientation, gender identity or nationality.\n\nThe Benefits – What we’ll do for you\n\nAn exciting and supportive office culture with regular socials and team events\n\nWeekly team meetings to support wellbeing and professional growth\n\nCasual dress\n\nPizza Fridays\n\nPing Pong Table & Darts\n\nBonus pay\n\nJob Type: Full-time\n\nPay: £30,000.00-£45,000.00 per year\n\nAdditional pay:\n• Bonus scheme\n\nBenefits:\n• Company pension\n• Flexitime\n\nSchedule:\n• 8 hour shift\n• Day shift\n• Monday to Friday\n\nAbility to commute/relocate:\n• Wilmslow: reliably commute or plan to relocate before starting work (required)\n\nWork Location: In person",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=5f895371dff61450&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQWxsIEluIFRoZSBMb29wIiwiYWRkcmVzc19jaXR5IjoiV2lsbXNsb3csIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJuSDNVeE5GemNIaG1mMzRnQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "iOS Software Developer",
            "company_name": "TPP",
            "location": "Leeds, United Kingdom",
            "via": "Prospects",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Zvax7x6tiIPcI3Z5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CeJws9hGBBddBUEFC9W5pO2ZRNK7kDu03-BXq8sbX_GZFWW4NtDwQ982IxzwhZETZijhxB0I2tx7YIIjs4s433vVJDtjRGLlRK2Gvup5NEzY8WSe3MmfVvzvS9EqtpvteqoSueXiVtcQCC6Ig6zgTkFxgHMgN_D4BQHevriNAAAA&shmds=v1_AUFQtOOBw0Ueqe04KJX26xhyrd8wkMr6anhif_wU4zJoTktLXw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Zvax7x6tiIPcI3Z5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8fb17971d6f7d601e2d9256e0fd3e89337c331f2fa3c05e9b.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for iOS software developers with a passion for programming to help develop our global digital healthcare solution. As part of an agile development team, you will be working on apps used by hundreds of thousands of doctors and millions of patients across the world.\nYou will work on a wide variety of projects such as:\n- Developing smartphone apps that help patients manage their own care.\n- Writing electronic observations systems to capture vital signs and calculate risk scores for patients in hospital.\n- Deploying machine-learning algorithms to help with the symptom-checking and prevention of disease.\nDevelopers at TPP are involved in the full software life cycle, and work closely with all teams across the company.\nSalary and Benefits\nWe will give you an excellent starting salary of £60,000 with outstanding annual pay reviews and no crazy working hours! Your salary will increase rapidly during your time at the company.\nYou will also receive a range of benefits, including:\n- Fantastic holiday entitlement\n- Regular social events\n- Opportunities to travel internationally\n- Life insurance\n- BUPA Health, Dental and Travel cover\n- £300 birthday meal allowance\n- Pub Fridays\nRead what it’s like to work at TPP and to see our full list of benefits.\n\n- Natural ability, enthusiasm and desire to learn\n- Great problem solving skills\n- Experience in Objective C or Swift preferable\nAcademic Prerequisites - Predicted 2:1 or above at degree level\n- Minimum ABB/AAC at A-level\nInternational equivalents are accepted, see below for details.\nInternational equivalents\nDegree Level\n- GPA of 3.5 or above\nA Level\n- 33 or above in the International Baccalaureate\n- AABBBB at Scottish Higher / ABB at Advanced Scottish Higher\n- 550/750 or above in Gaokao",
            "apply_options": [
                {
                    "title": "Prospects",
                    "link": "https://www.prospects.ac.uk/employer-profiles/tpp-19539/jobs/ios-software-developer-2701582?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "TargetJobs",
                    "link": "https://targetjobs.co.uk/jobs/ios-software-developer-122162?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "EarlyCareers.co.uk | UK's Early Careers Marketplace",
                    "link": "https://earlycareers.co.uk/job/ios-software-developer-tpp-leeds/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgU29mdHdhcmUgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVFBQIiwiYWRkcmVzc19jaXR5IjoiTGVlZHMsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJadmF4N3g2dGlJUGNJM1o1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Senior iOS Developer",
            "company_name": "BrainStation",
            "location": "England, United Kingdom",
            "via": "Wellfound",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=tV3bJXtB-a5lJ_3eAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMvwrCMBCAcVz7CE63Cf5pRHCxmyiCDg7FuSTpkZ6kdyEXpO_hC2uXb_t91XdRbVpkkgz0bOGCH4ySMMMO7uJA0WY_gDDcRELEZTOUkvRkjGqsgxZbyNdeRiOMTibzFqdzOh1sxhRtwe5w3E914rBenbMlbmf0PxLDlUO03G_hxVSwhwdx6GX8ATxengqWAAAA&shmds=v1_AUFQtOOjjbB10qZBZ2z-EWUg80hPputGE5jckv-6AZO_1RXFEQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=tV3bJXtB-a5lJ_3eAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8c14c53f061aa9e7427f808f338b98ec421079d8be8b0f37a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who We Are\n\nKonrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners.\n\nAbout The Role\n\nAs a Senior iOS Developer, you'll be tasked with developing iOS applications. Working within the software development team, your duties will require you to assist in the development of consumer and enterprise applications. This role is ideal for developers who feel confident in their technical ability and want to be a part of the highly skilled and constantly improving development team at Konrad.\n\nWhat You’ll Do\n• Write maintainable, testable, and performant software in collaboration with our world class team.\n• Lead development of major product features, working in conjunction with designers, project managers, and developers on other platforms.\n• Provide mentorship to other developers in your area of expertise.\n• Participate in code review and perform extensive testing to ensure high-quality software.\n• Research new technology and tools and share those findings with the team.\n• Communicate clearly and effectively with all members of our team.\n\nQualifications\n• 3+ years of professional experience in a software development role.\n• A strong command of important programming and computer science concepts.\n• A strong understanding of how mobile applications are built from end-to-end, including how they interact with server-side components.\n• Advanced knowledge of core mobile principles (UI implementation, common development frameworks, API integrations, testing, accessibility, etc).\n• Extensive experience building Swift applications using UIKit, SwiftUI, or both.\n• A detailed knowledge of architectural patterns such as MVVM, MVP, MVC and well-articulated opinions on their use.\n• Great interpersonal skills - we work very closely together as a team and require a lot of communication.\n• A proactive personality, and a desire to deliver your best work.\n• A love for improving software development workflows and processes.\n\nNice To Have\n• Experience with or an understanding of newer approaches to networking, like GraphQL.\n• Experience building CI/CD pipelines.\n• Knowledge of older iOS technologies such as Objective-C.\n• Other mobile development experience, such as Android development using Kotlin or Java, or cross-platform development with React Native, Flutter, Ionic, Xamarin, or Cordova.\n\nPerks and Benefits\n• Comprehensive Health & Wellness Benefits Package\n• Socials, Outings & Retreats\n• Retirement Planning\n• Parental Leave Program\n• Annual tech & travel allowance\n• Culture of Learning & Development\n• Flexible Working Hours\n• Work from Home Flexibility\n• Service Recognition Programs\n\nBonus Points\n\nHave you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have!\n\nKonrad is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation.\n\nWhile we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.\n\n#LI-Hybrid",
            "apply_options": [
                {
                    "title": "Wellfound",
                    "link": "https://wellfound.com/jobs/3151024-senior-ios-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Information Age Jobs",
                    "link": "https://jobs.information-age.com/job/senior-ios-developer-kJ30xTpL0b-at-oliver-bernard-3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "HitPraca.pl",
                    "link": "https://www.hitpraca.pl/oferta/senior-ios-developer-7b4fa16c5107f74/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Org",
                    "link": "https://theorg.com/org/joinblink/jobs/senior-ios-developer-50c9b465?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkJyYWluU3RhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkVuZ2xhbmQsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJ0VjNiSlh0Qi1hNWxKXzNlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "iOS Developer",
            "company_name": "LEO Club Maastricht",
            "location": "Liverpool, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=BphiZzKfMK5d-_yZAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43OIk2RXDRUUXQSgdxLkl6JJE0F3Jn6Y_4v-IbXvVdVKvQPeGME0bKWGALNzLAqIv1QAmuRC7i8uhFMh-UYo61Y9ESbG1pVJTQ0KzeZPhfz14XzFEL9rt9M9c5uXXTXjo4xY-Bh9YsJVgvEBK0YcKSieIGXikIDnAPyQ00_gDY00E6mAAAAA&shmds=v1_AUFQtOPR6z1x_6hzysqNhBu5k-tx2d4DHxrv_piT9hz1ZlqucQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=BphiZzKfMK5d-_yZAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee8b9d62210d525bf8e8db2349e4fef7ae81a137ae1485904ee.gif",
            "extensions": [
                "5 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Snr iOS Engineer\n\n£50,000 - £60,000\n\nHybrid Work | Flexible Hours | Greenfield Project Work + Lead Prospects\n\niOS | Swift\n\nThe Client\n\nWe representing a high growth Software House who're building bespoke enterprise performance software for global clients. They're looking for a motivated iOS Engineer to collaborate with their skilled technical team working closely with the CTO to raise the bar in tech. The Company are in high growth phase and considered the primary licensing partner in their market. This is an opportunity to be part of a team who are passionate about the work and products they deliver with innovation at it's heart\n\niOS | XCode | Swift |\n\nThe Role\n\nYou'll be joining a talented Development team helping build out their native mobile applications used by customers across the world. The Apps have a variety of new iterations in the development roadmap and you'll work closely alongside the main iOS Engineer helping built out new functionality. Junior level Devs are welcome who've completed a degree or similar and can show some code in native iOS\n• Experience of, Swift or Objective-C\n• SDK, UIKit, Auth, MapKit, CoreData, GeoServices\n• MVC, RestServices,\n\niOS | XCode | Swift |\n\nThe Benefits\n\nYou'll work in a creative team of talented developers sharing knowledge and raising the bar in marketing software design. The company have a start-up culture with flexible hours, creative freedom and high career growth prospects with plans to expand the business significantly\n\niOS | XCode | Swift | Objective-C",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/ios-developer-at-leo-club-maastricht-4121522208?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/ios-developer/hyperloop-recruitment-job104102778?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "reed.co.uk",
                    "link": "https://www.reed.co.uk/jobs/ios-developer/54280012?source=searchResults&filter=/jobs/ios-developer-jobs&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SaluteMyJob",
                    "link": "https://salutemyjob.com/jobs/ios-developer-liverpool-merseyside/1544628700-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Aspire Media Group Jobs",
                    "link": "https://jobs.aspiremediagroup.net/jobs/ios-developer-liverpool-merseyside/1544628700-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WAVY Jobs",
                    "link": "https://jobs.wavy.com/jobs/ios-developer-liverpool-merseyside/1544628700-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KHON2 Jobs",
                    "link": "https://jobs.khon2.com/jobs/ios-developer-liverpool-merseyside/1544628700-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/ios-developer-jobs/1EF0C49B79CB3364?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiTEVPIENsdWIgTWFhc3RyaWNodCIsImFkZHJlc3NfY2l0eSI6IkxpdmVycG9vbCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkJwaGlaektmTUs1ZC1feVpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "iOS Developer (Swift)",
            "company_name": "Founders Arm",
            "location": "London, United Kingdom",
            "via": "Rapha",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=l5wlrUiLxiEu29FyAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43iUptRHDRSRAFFRzEuaTNmUbSu5A7tf_hD4tveMV3VJTheoM9vjFywgzT2yc8dAYLOHEDgja3HTDBkdlHHG871SQbY0Ri5UWthrZquTdM2PBgntzIv1o6mzFFq1iv1suhSuTnkwO_yGEW2OUeAsGFyTGVcKeg6OAcyDvuf5xh6kmWAAAA&shmds=v1_AUFQtOOYRuyWrsrgG5LzWAnyFH6-djVv0QkI0VSw9k0SDMU2HQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=l5wlrUiLxiEu29FyAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee83cb9620e491f7d485da4b83f70336be246963e53b08e1e2f.gif",
            "extensions": [
                "9 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "9 days ago",
                "schedule_type": "Full-time"
            },
            "description": "About Us:\n\nHey! We’re Founders Arm, a recruitment company that pairs companies with awesome offshore talent and US-based businesses.\n\nWe’re currently looking for iOS Developers to help a social media agency build innovative and scalable mobile applications that drive user engagement and business growth through creative problem-solving and cutting-edge development practices.\n\nKey Responsibilities:\n• Design and develop native iOS applications using Swift.\n• Build and maintain high-performance, reusable code and libraries.\n• Optimize application performance and responsiveness for iOS platforms.\n• Debug and resolve issues across various iOS devices.\n• Write clean, maintainable code and create technical documentation.\n• Collaborate with cross-functional teams to integrate backend services and APIs.\n\nWhat We Look For in Candidates:\n• Native or highly proficient English communication skills (written + spoken).\n• Strong experience in Swift development for iOS.\n• Familiarity with Apple’s Human Interface Guidelines and mobile app architecture.\n• Proficiency with RESTful APIs, third-party integrations, and Apple SDKs.\n• A portfolio of iOS projects demonstrating UI/UX capabilities (attach links to your published apps or GitHub projects).\n• A detailed breakdown of your role in each project (what tasks were owned vs. collaborated).\n• Bachelor’s degree in Computer Science or related field not required.\n• Nice to have: direct links to Testflights that we can download play around with!",
            "apply_options": [
                {
                    "title": "Rapha",
                    "link": "https://app.withrapha.com/job/1086?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChTd2lmdCkiLCJjb21wYW55X25hbWUiOiJGb3VuZGVycyBBcm0iLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJsNXdsclVpTHhpRXUyOUZ5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "IOS Developer SwiftUI (Remote)",
            "company_name": "VitraCash",
            "location": "England, United Kingdom",
            "via": "Vitracash-1635266382340.Freshteam.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=nz85MfJEiyiWaOqZAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43OKhoI0IXHVWkOgiWupa0PZNImgu5Q_stfq34hpd9J1lR3io44hs9RUxQfdxT6hLmdxxIcAFruFALjDp1FijAmch4nO6tSOSdUsw-NyxaXJd3NCgK2NKoXtTyv4atThi9Fmy2xWbMYzDL2cNJ0gfNFlyAUzBeh34FdXCCPVxdMD0NPyulYWKdAAAA&shmds=v1_AUFQtONTb3DUW3gjLcMOzHGZ7U8hVmtbuAl2Afruox2quHhuoQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=nz85MfJEiyiWaOqZAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee84e618b81fabbc95588917b80e699e3711e07c783e8577730.gif",
            "extensions": [
                "5 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About VitraCash We love the convenience of cashless payments, but using your credit cards while travelling proved to be quite a hassle. As every card has so many pros and cons, it has become nearly impossible to keep track of all the benefits and hidden fees.\n\nVitraCard aims to offer an app alongside physical and digital debit cards to combine all cards a customer owns. For every transaction our AI-driven algorithm will automatically select the best card.\n\nWe are a small and fully remote team and the founders are still very involved in the technical development of the company.\n\nRequirements\n• Significant experience in developing native iOS applications with Swift (Ideally with SwiftUI)\n• Experience in at least one other programming language\n• Worked with or have a strong motivation to work with SwiftUI, iOS Design Patterns, Kotlin Multiplatform, and more\n• Experience with automated testing\n• Experience working on agile projects\n• An excellent standard of written and spoken English\n\nWe are currently searching for developers within the EU timezones; GMT, +1, +2, +3.\n\nThis is currently a must-have requirement.\n\nWhat you’ll be doing\n• Developing next-generation financial applications to make our customers’ lives better\n• Working with the newest technologies available\n• Applying Agile and Lean principles in your work\n• Collaborating with other developers through GitHub pull requests and code reviews\n\nBenefits\n• Independent, self-managed working with responsibility as part of a small team of top developers\n• Startup atmosphere\n• Global Health Insurance\n• 4 weeks of paid vacation\n• Remote working\n• Flexible work times\n• Expense allowance\n• Up to 95 000 a year",
            "apply_options": [
                {
                    "title": "Vitracash-1635266382340.Freshteam.com",
                    "link": "https://vitracash-1635266382340.freshteam.com/jobs/yhtd9xl_inKe/ios-developer-swiftui-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgRGV2ZWxvcGVyIFN3aWZ0VUkgKFJlbW90ZSkiLCJjb21wYW55X25hbWUiOiJWaXRyYUNhc2giLCJhZGRyZXNzX2NpdHkiOiJFbmdsYW5kLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoibno4NU1mSkVpeWlXYU9xWkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Lead IOS / Mobile Applications Developer",
            "company_name": "Talent Locker",
            "location": "London, United Kingdom",
            "via": "Talent Locker",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=am8-400n_-oG4R-xAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNuwrCQBAAsc0nWG0niOZEsNEiCIKoEQu1DvdYLqeX3SN7SP7I3zQ2wzTDFN9JUdWoHZxud1BwZRMiwj6lGKzOgUnggB-MnLCHJZzZgKDubQtMcGT2Eae7NuckW6VEYuklj50tLXeKCQ0P6sVG_mik1T2mqDM2681qKBP5-eyhI1KGmu17XAQajRzTAp4UMjq4BPKOux-MniimqgAAAA&shmds=v1_AUFQtOOa0EnbJ_ZdqFRa9iKGfDZL5K7LHhiEam_FbRyVwfeOzA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=am8-400n_-oG4R-xAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505eaaa5dddd26477e1db/images/e50c5a7cae3ccee82982b5c05e76eb0762efb341ab6365a39af0fa87feb087f9.gif",
            "extensions": [
                "5 days ago",
                "£60K–£95K a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "5 days ago",
                "salary": "£60K–£95K a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Lead iOS / Mobile Applications Developer £60-95k + Bonus\n\nAre you a mobile apps developer with a focus on iOS and can work at a senior level?\n\nWorking for an ever growing global company where you can develop, progress, be mentored and mentor others. You will be joining a technology team who lead the way in creating a best in class experience. You will join of a friendly, professional and successful team.\n\nYou can have a 1-2-1 development plan and career pathways and frameworks should you wish to progress further in a leadership position. There is a great benefits package on offer and the opportunity to continue and grow your career further.\n\nUltimately you will lead the way in improving the mobile applications, on iOS & Android, focusing on features, functionality, and modular architecture. You will manage the software development lifecycle, including building, testing, releasing, and documenting solutions. Stakeholder engaged is key as you will solve complex technical problems, apply modern engineering standards and be able to translate to cross functional teams.\n\nCollaboration is key, with responsibilities including engaging with stakeholders to align on business requirements & technology design.\n\nThey key tech experience required is to show experience working across a range of back end technologies, specifically related to mobile applications with strong experience in native mobile application development for IOS (swift) and Android (Kotlin/java). There is currently more expertise in the team in Android, so ideally you will be stronger in iOS.\n\nFlexibility with working patterns and location are fine. There are offices in the South, London and Manchester.\n\nReally good benefits package with private medical, enhanced pension, bonus scheme and a flexible working arrangement.",
            "apply_options": [
                {
                    "title": "Talent Locker",
                    "link": "https://jobs.talentlocker.co.uk/job/33906?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/lead-ios-mobile-applications-developer/talent-locker-job104086932?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.co.uk",
                    "link": "https://www.monster.co.uk/job-openings/lead-ios-mobile-applications-developer-city-of-london-greater-london--85b0e28b-48e4-47d1-b56b-711a16e18d8f?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WKRN Jobs",
                    "link": "https://jobs.wkrn.com/jobs/lead-ios-mobile-applications-developer-city-london/1543661047-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Diversity Dashboard",
                    "link": "https://diversitydashboard.co.uk/jobs/lead-ios-mobile-applications-developer-city-london/1543661047-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/uk/job/full-time/others/aso-lead-app-store-optimization-android-ios-128959801?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/5002431867?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "New Job Today",
                    "link": "https://www.new-job-today.co.uk/jobs/lead-ios-mobile-applications-developer-city-london/1543661047-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIElPUyAvIE1vYmlsZSBBcHBsaWNhdGlvbnMgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVGFsZW50IExvY2tlciIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImFtOC00MDBuXy1vRzRSLXhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRk16UTNoMk0wNWtRa1ZxVlRjNE9IbGhVbWM1TjNSTlpXcEVZVmR0ZUhGWVRqSkxjM2xCU21KR2MyVTFiVTlPTURRd1oxaExPVkpRVVZkTU9GOXpRMGxSYjFReVVFRnpNWFUyVFhBM1JqbFpRVVZLZW05TFVrWm9PRGxyUVVwbFR6RnViRXBQVUVWbk4ydFFXR2d3WDJ0ek9VeEpkMEUzYTFSb2VEQkZXWFF5VDIxMFpVWlNPRmQyY1hsaVNsSlZSV0ZyVWtkeVRUVkJWVmRaWlhjMlNIa3pNbWMwVGxaemNYSnRRV2hrTVZWbVUyMHlSMmhWTjI5cGFERjNhMGxSU0VOUWEzaDVjalV0U0hWYWJ6QmZaVFZyY2w4NFVVRm5aV1p5ZUVweE1XNU9ORGhSWmpWUlRHaE9TVmQwTVdSTGNtMXhVM1JKVDNoU1VVTTFPVlJhYkVVM1YyWjRiR0ZaUjJ3MllYbG1WazE0YkZKT2FIcHRlSFZmYzJjU0Z6Wm5WMFphTlY4d1R6WnBlakJRUlZCMGRuSldNa0ZaR2lKQlJsaHlSV052ZUdwUlUzbHBkVFZrYVVwVWNIbHpVVUp4WDJneFEwVndZVmhuIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkV1SUNDcUlDUVVwSE9VcHJVRk16UTNoMk0wNWtRa1ZxVlRjNE9IbGhVbWM1TjNSTlpXcEVZVmR0ZUhGWVRqSkxjM2xCU21KR2MyVTFiVTlPTURRd1oxaExPVkpRVVZkTU9GOXpRMGxSYjFReVVFRnpNWFUyVFhBM1JqbFpRVVZLZW05TFVrWm9PRGxyUVVwbFR6RnViRXBQVUVWbk4ydFFXR2d3WDJ0ek9VeEpkMEUzYTFSb2VEQkZXWFF5VDIxMFpVWlNPRmQyY1hsaVNsSlZSV0ZyVWtkeVRUVkJWVmRaWlhjMlNIa3pNbWMwVGxaemNYSnRRV2hrTVZWbVUyMHlSMmhWTjI5cGFERjNhMGxSU0VOUWEzaDVjalV0U0hWYWJ6QmZaVFZyY2w4NFVVRm5aV1p5ZUVweE1XNU9ORGhSWmpWUlRHaE9TVmQwTVdSTGNtMXhVM1JKVDNoU1VVTTFPVlJhYkVVM1YyWjRiR0ZaUjJ3MllYbG1WazE0YkZKT2FIcHRlSFZmYzJjU0Z6Wm5WMFphTlY4d1R6WnBlakJRUlZCMGRuSldNa0ZaR2lKQlJsaHlSV052ZUdwUlUzbHBkVFZrYVVwVWNIbHpVVUp4WDJneFEwVndZVmhuIiwiZmN2IjoiMyJ9&q=iOS+developer"
    }
}