{
    "search_metadata": {
        "id": "678505fe13865cea354489f7",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/15dc203fbf34e806/678505fe13865cea354489f7.json",
        "created_at": "2025-01-13 12:24:30 UTC",
        "processed_at": "2025-01-13 12:24:30 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=ErcCCvcBQUpHOUprUHVZMmhFdjNRRDdscDl2dmFTY2E4ZDdvcllxQlJ5TUVFVm9GbGw2Z0VscTBncFYzYXZwMHdWeFUyY2p4MjdWcHIzQm5SSFo3eXVvcWw3YUtDbXhQVlVKbVlzd2FUNGd2VTk2UF9nN1FwNWEyeVRnakJaNzF3OHZFcWk1UUYzNXhGY1BBQldQaU8tcG1IcXlCVVdxX0ZaeldyZlZCd3FVQk9rQXUwUzZ3c3ZyY3pLdFA5UHU3S1JIU1ZxdWNTd3NNamUzOG9TZUxHamdZaGhyQXo0YTFHYWdZVjh6WDhvWFFld1lKLUttMDI1V0QtQTdTURIXX1FXRlo5VFpGTnkzcHRRUGdvSGh3QW8aIkFGWHJFY3JtaXZEMGFuWi1VemgyaDJXenFmVkprd1h1VXc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/15dc203fbf34e806/678505fe13865cea354489f7.html",
        "prettify_html_file": "https://serpapi.com/searches/15dc203fbf34e806/678505fe13865cea354489f7.prettify",
        "total_time_taken": 1.11
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJVSFZaTW1oRmRqTlJSRGRzY0RsMmRtRlRZMkU0WkRkdmNsbHhRbEo1VFVWRlZtOUdiR3cyWjBWc2NUQm5jRll6WVhad01IZFdlRlV5WTJwNE1qZFdjSEl6UW01U1NGbzNlWFZ2Y1d3M1lVdERiWGhRVmxWS2JWbHpkMkZVTkdkMlZUazJVRjluTjFGd05XRXllVlJuYWtKYU56RjNPSFpGY1drMVVVWXpOWGhHWTFCQlFsZFFhVTh0Y0cxSWNYbENWVmR4WDBaYWVsZHlabFpDZDNGVlFrOXJRWFV3VXpaM2MzWnlZM3BMZEZBNVVIVTNTMUpJVTFaeGRXTlRkM05OYW1Vek9HOVRaVXhIYW1kWmFHaHlRWG8wWVRGSFlXZFpWamg2V0RodldGRmxkMWxLTFV0dE1ESTFWMFF0UVRkVFVSSVhYMUZYUmxvNVZGcEdUbmt6Y0hSUlVHZHZTR2gzUVc4YUlrRkdXSEpGWTNKdGFYWkVNR0Z1V2kxVmVtZ3lhREpYZW5GbVZrcHJkMWgxVlhjIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "iOS Engineer - Swift",
            "company_name": "Photon",
            "location": "London, United Kingdom",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=yx3RPw5mp_X1v1eXAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMPQrCQBBAYWxzBKup_cmKYKN1EFRQCNZhNxl3R5KZsDNgDuGhjc37uld8F8Wa7jVUHIkRM2yh_tDLZi8SQNHnNoEwnEVij8tTMhv16JxqX0Y1b9SWrQxOGINM7i1B_2k0-Yxj7w2b_WE3lSPHFTyS2PwihptwJ7yBJ5NhB1fi2MnwA5d19R-PAAAA&shmds=v1_AUFQtON9FrJT3MdPCaICRrtrmXjzhfUmIbBEl0Yw58SttAtaVw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=yx3RPw5mp_X1v1eXAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fe13865cea354489f7/images/d3b0a3e25b06921dd6773cee7e775b2b81fcb5d784d1e058631dad5b04e6e4db.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: iOS Engineer\n\nPosition Overview:\nAn exciting opportunity for a forward-thinking Mobile iOS Developer who thrives on producing customer-facing digital experiences. You will join a leading name in the food and beverage market with 500+ stores across the world. As a Mobile iOS Developer, you will play a hands-on role in designing, building, and maintaining iOS applications. Experience in backend APIs is an added advantage. You will collaborate with your team, fostering a culture of continuous learning and innovation.\n\nResponsibilities:\nDesign and develop scalable and performant mission-critical iOS apps.\n\nEngage and contribute actively to various external interfaces and APIs to enhance mobile-first capabilities.\n\nEnsure that best practices, design patterns, and coding standards are incorporated during development.\n\nAdvocate for a culture of quality and innovation, promoting Extreme Programming ways of working.\n\nCollaborate with cross-functional teams, participating in Agile processes, code reviews, and unit testing.\n\nUtilize strong debugging skills to troubleshoot and resolve complex issues in both front-end and back-end systems (including both internal and third-party systems).\n\nExperience working on cloud platforms, with knowledge of Google Cloud Platform (GCP) being an advantage.\n\nFamiliarity with e-commerce platforms and solutions is highly desirable.\n\nStay abreast of emerging technologies and industry trends, evaluating their potential impact and advocating for them to be included in the product roadmap and development processes.\n\nChampion continuous improvement, performance optimization, and security throughout the development lifecycle.\n\nSkills:\nProven experience as a hands-on iOS developer with proficiency in Swift.\n\nHands-on experience in backend API development using Node.js will be an advantage.\n\nExperience in technical decision-making and the ability to propose solutions that implement standard methodologies for a maintainable product.\n\nStrong leadership skills with the ability to inspire and mentor other engineers.\n\nExperience working in the Quick Service Restaurant (QSR), Retail, or E-commerce industries is a plus.\n\nExcellent problem-solving and communication skills.\n\nA passion for automation-tested code and setting high standards for code quality.\n\nA keen team player with strong interpersonal skills.\n\nAbility to thrive in a fast-paced, dynamic environment and drive change through innovation and collaboration.\n\nLocation:\nHybrid – 2 days per week in our London office.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=72ecb702908c97a0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/ios-engineer-swift-photon-JV_IC2671300_KO0,18_KE19,25.htm?jl=1009356685307&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.co.uk/job/zU4Ma8FQ1dsNi61zirt1vPLLFY1gCNn9q5DdVcnUEMZwFNMOREDFfw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Simplify Jobs",
                    "link": "https://simplify.jobs/p/0853a10b-4cc1-48ed-90b0-c9f40c2bfae7/IOS-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRW5naW5lZXIgLSBTd2lmdCIsImNvbXBhbnlfbmFtZSI6IlBob3RvbiIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Inl4M1JQdzVtcF9YMXYxZVhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Mobile Software Engineers - London, Salford & Glasgow (iOS & Android) - EXTEND",
            "company_name": "BBC",
            "location": "Salford, United Kingdom",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=ruOCjUDU3fJSLmIcAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zWOuwrCQBBFsfUTLGQqUdFEBButfISAzyIKdmGTHTcrm5mws6Af6IcZC5vDPXCL0_10unjiwjqEjB_hpTxCQsYSoheYwpFJM00gU-7BXsMAUqfE8AuG9pK1uibt2epR-03u1-S8a8eeCxBUvqyACVJm47C3qkJoZBnHIi4yElSwZVRyHTNhwe_4yYX8kEvVRjROBczni9k7asiM-5vNFiz9MyZwIxtQw8GS0Vx_ARuvFl3HAAAA&shmds=v1_AUFQtOMnT0cyMWdzWyc35Gm25M-Z4Gddswl_HxjNZZPRPRZbWA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ruOCjUDU3fJSLmIcAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fe13865cea354489f7/images/d3b0a3e25b06921d423a8fb7aec89c33215547a332ba932b3fc473b6646b8328.gif",
            "extensions": [
                "7 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "7 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Package Description\n\nThis role is advertised as part of our BBC Extend programme for disabled people. To apply for this role you should identify as deaf, disabled or neurodivergent and must meet either: the definition of disability in the Equality Act (2010) , or the definition of disability in the Disability Discrimination Act (1995) if applying in Northern Ireland. You’re broadly defined as disabled under both acts if you have a physical or mental impairment that has a substantial and long-term negative or adverse effect on your ability to do normal daily activities. This definition includes both apparent and non-apparent conditions and impairments, and medical conditions such as Cancer, HIV or Multiple Sclerosis.\n\nWe are committed to making the process of applying for this role as accessible as possible. If you need to discuss adjustments or access requirements for the application process, or have any questions about our Extend programme, please contact the BBC Extend team via extend@bbc.co.uk\n\nThe BBC are fully committed to providing workplace adjustments to help eliminate barriers in the workplace that disabled people face. To do this, we have our own dedicated BBC Access and Disability Service that provides assessments and support throughout employment with us. If you are successful in applying for this role and require workplace adjustments, we will work with you to get your adjustments in place.\n\nIf you’d like more information on BBC Extend, please visit the BBC Extend webpage .\n\nJob Reference: 19658\n\nBand: C / D\n\nSalary: Mid-level Software Engineers - £50,000 - £59,000 per annum / Senior Software Engineers - £60,000 - £75,000 per annum depending on relevant skills, knowledge and experience. The expected salary range for this role reflects internal benchmarking and external market insights.\n\nContract type: Permanent\n\nLocation: Office Base is Salford, London or Glasgow (This is a hybrid role and the successful candidate will balance office working with home working)\n\nWe’re happy to discuss flexible working. Please indicate your choice under the flexible working question in the application. There is no obligation to raise this at the application stage but if you wish to do so, you are welcome to. Flexible working will be part of the discussion at offer stage.\n\nExcellent career progression – the BBC offers great opportunities for employees to seek new challenges and work in different areas of the organisation.\n\nUnrivalled training and development opportunities – our in-house Academy hosts a wide range of internal and external courses and certification.\n\nBenefits - We offer a negotiable salary package, a flexible 35-hour working week for work-life balance and 25 days annual leave with the option to buy an extra 5 days, a defined pension scheme and discounted dental, health care and gym.\n\nYou can find out more about working at the BBC by selecting this link to our candidate pack .\n\nIf you need to discuss adjustments or access requirements for the interview process please contact the reasonable.adjustments@bbc.co.uk . For any general queries, please contact: bbchr@bbc.co.uk .\n\nJob Introduction\n\nStep into the world of the BBC, one of the UK's most iconic and beloved brands, where every working day is as unique as it is rewarding. Every tick of the clock, our content reaches millions of people globally, which is made possible by our top-notch Software Engineering team. They've been instrumental in pioneering innovative products and unique features that have firmly positioned us at the forefront of our industry. We don't merely adapt to an ever-changing world - we set the pace.\n\nWe are growing our engineering hub of excellence and looking for mid-level and senior software engineers with mobile experience (iOS and Android) to join our teams in Salford, London and Glasgow.\n\nWe offer a warm welcome with full support settling in and foster a culture where everyone has an opportunity to succeed. We're deeply proud of our values, which are intrinsic to the way we behave every day. We take them seriously because we want our culture to thrive. We want people to really enjoy working with us and get a buzz from knowing that what they are doing is making a difference and enhancing people's lives.\n\nOur engineers receive 10% development time built into the 35-hour working week. We want to give you the time and space to stay fresh in the ever-changing technology landscape.\n\nCome work on fantastically high-scale systems with us!\n\nSDD24\n\nMain Responsibilities\n\nSoftware engineers at the BBC are more than just programmers – we’re people who are builders, designers, and problem solvers at heart, people with a passion to make things better for our audiences. You will help innovate and design new features and products, work with the team to build them, and support and grow them after they’re live.\n\nAs a developer in our team, you will ensure high quality code is delivered in line with project goals and delivery cycles. You will thrive using agile methods and enjoy working collaboratively and as part of a multidisciplinary team focused on several projects.\n\nWorking in our mobile applications team, you will contribute to the design, development and maintenance of high-performance features using the latest mobile technologies. You will use your software engineering skills and experience to build features, solve bugs, address technical debt. You will also bring a strategic lens to team operating processes and tooling to improve how we work and ultimately deliver valuable, high-quality software to our users.\n\nPairing on all aspects of the development process, you will deliver secure, reliable, and scalable software within your team.\n\nThere’s a lot of scope for widening your skills in this role because it allows you to move into different areas, cover lots of ground and really broaden your understanding of how the business works. When you want to take the next step up, we'll support your progression.\n\nSome Practices We Like\n• Pair-programming. We like knowledge sharing and learning from one another\n• Shipping great products, not just writing superb code\n• Hybrid work environment. We balance working from home with in-person collaboration.\n• Global view. We work with peers in different geo-locations\n• Mentoring and coaching. We care about each other\n• Tapping into our creativity and learning. You get 10% development time every week to invest in your own learning and development\n• Continuous deployment\n• Working in an Agile environment with strong attention to a well-documented code, unit testing and continuous integration\n• Pragmatism and obsession for simplicity, efficiency and performance\n\nAre you the right candidate?\n\nWe’re looking for mobile software engineers who are passionate about code, curious and eager to learn in a team of engineering excellence.\n\nSome Of The Things We Love\n• Extensive experience of native Android app development using Kotlin and Java\n• Or Extensive experience of native iOS app development using Swift/Objective-C\n• Comfortable with Compose functional programming\n• Or Comfortable with Swift-UI functional programming\n• Experience with large and complex applications\n• Experience with source control\n• Experience with the end-to-end software development lifecycle (SDLC), including requirements gathering, design, development, testing, deployment and maintenance\n• App signing and deployment knowledge\n• Knowledge of writing automated tests and taking a TDD approach to your work\n• Experience with experimentation and A/B testing\n• Experience building accessible applications\n• Experience with JavaScript/TypeScript desirable\n• Knowledge and practice of testing, writing unit tests, TDD, UI Tests and broader testing concerns\n• Exposure to trunk-based development & release trains with feature flags\n• An aspiration for engineering excellence, using knowledge sharing to learn from each other\n\nInterview Process\n\nWe run virtual assessment centres on Thursday mornings for shortlisted candidates. There are two elements:\n• Live pair programming exercise with two of our software engineers which you get in advance of your assessment centre date\n• Blended interview questions with two of our software engineers\n\nWe give you the pair programming test in advance to allow you to practice and prepare for the live exercise. We also give you insight into in the interview questions to help with your preparation.\n\nAbout The BBC\n\nThe BBC is committed to redeploying employees seeking suitable alternative employment within the BBC for different reasons and they will be given priority consideration ahead of other applicants. Priority consideration means for those employees seeking redeployment their application will be considered alongside anyone else at risk of redundancy, prior to any individuals being considered who are not at risk.\n\nWe don’t focus simply on what we do – we also care how we do it. Our values and the way we behave are important to us. Please make sure you’ve read about our values and behaviours here .\n\nDiversity matters at the BBC. We have a working environment where we value and respect every individual's unique contribution, enabling all of our employees to thrive and achieve their full potential.\n\nWe want to attract the broadest range of talented people to be part of the BBC – whether that’s to contribute to our programming or our wide range of non-production roles. The more diverse our workforce, the better able we are to respond to and reflect our audiences in all their diversity.\n\nWe are committed to equality of opportunity and welcome applications from individuals, regardless of age, gender, ethnicity, disability, sexual orientation, gender identity, socio-economic background, religion and/or belief. We will consider flexible working requests for all roles, unless operational requirements prevent otherwise.\n\nTo find out more about Diversity and Inclusion at the BBC, please click here .",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/mobile-software-engineers-london-salford-glasgow-ios-android-extend-at-bbc-4114819115?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobMonkeyJobs.com",
                    "link": "https://www.jobmonkeyjobs.com/career/26381240/Mobile-Software-Engineers-London-Salford-Glasgow-Ios-Android-Extend-Any-Salford-2990/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/mobile-software-engineers-london-salford-glasgow-ios-android-extend-bbc-JV_IC3528162_KO0,67_KE68,71.htm?jl=1009587730251&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=86916372604297926&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/ec4ef367a7a45b1d664525792cf25078?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=caec8e4b23e0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jora UK",
                    "link": "https://uk.jora.com/job/Software-Engineer-55f584fc19755c9d7a57cff2581edbdd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgU29mdHdhcmUgRW5naW5lZXJzIC0gTG9uZG9uLCBTYWxmb3JkIFx1MDAyNiBHbGFzZ293IChpT1MgXHUwMDI2IEFuZHJvaWQpIC0gRVhURU5EIiwiY29tcGFueV9uYW1lIjoiQkJDIiwiYWRkcmVzc19jaXR5IjoiU2FsZm9yZCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6InJ1T0NqVURVM2ZKU0xtSWNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "iOS Developer Swift – Open Banking App",
            "company_name": "British Heroes",
            "location": "London, United Kingdom",
            "via": "Tier 2 Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=6dnYWCHH2BpW9PeEAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQrCMBQAUFx7BKc_imgrgosOYhEUFToU55K23ySa_h_yg3b0Dl7Cc3kSdXnrS96DZG2LErZ4R8ceA5QPe4nweb6g8EiQK7pZ0rDxHqZw4BoEVWgMMMGOWTscrkyMXpZZJuJSLVFF26QNdxkT1txnV67lTyVGBfRORazmi1mfetLjUR5stGJgj4FRwBKcmFqmCZzJRmzh-Otb7r4qhMgeqwAAAA&shmds=v1_AUFQtOM2VLx8v07sB_l-1pYbR2HS_tNfTl2fbIOG6PNnN9HAeQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=6dnYWCHH2BpW9PeEAAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "iOS Developer Remote / WfH / London to £70k\n\niOS Developer / Mobile Engineer (iOS Swift) *Remote / WfH*. Would you like to work on Greenfield applications at a fast growing Open Banking FinTech start-up? You’ll take ownership, quickly see the impact of your work and be instrumental in the company’s growth – quickly progressing your career.\n\nAs an iOS Developer you’ll be to creating native app experiences for users, ensuring they are fast, responsive and easy to use. You’ll be collaborating with a small team including UI/UX Designers, Product and Engineering teams and working with a great deal of autonomy, you’ll be able to influence the technical direction working on a healthy pipeline of Greenfield projects with no legacy code.\n\nYou’ll be part of a small team of tech and finance entrepreneurs building solutions to help streamline the payments process for both businesses and personal users; the company is well backed and set to be highly successful.\n\nYou can enjoy a range of perks including personal training budget, employee care packages, a new MacBook Pro to work on as well as summer and Christmas parties.\n\nThere’s a remote interview and onboarding process as well as the ability to work from home full-time with the caveat that following social distancing measures you’ll meet up with the team once or twice a month in the London office.\n\nRequirements:\n• You have strong native iOS development experience using Swift with frameworks / tools such as Core Data ORM and Codable\n• You have experience of integrating with REST APIs\n• You have experience of building and releasing apps on the AppStore\n• You have a good knowledge of responsive design principles\n• You have experience with unit testing tools\n• You’re collaborative, with a genuine enthusiasm for technology; excited by the idea of working for a growing start-up where you can make a difference",
            "apply_options": [
                {
                    "title": "Tier 2 Jobs",
                    "link": "https://www.tier2jobs.co.uk/job/ios-developer-swift-open-banking-app?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIFN3aWZ0IOKAkyBPcGVuIEJhbmtpbmcgQXBwIiwiY29tcGFueV9uYW1lIjoiQnJpdGlzaCBIZXJvZXMiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiI2ZG5ZV0NISDJCcFc5UGVFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Senior iOS Developer - Spanish/English - Full Remote",
            "company_name": "Jobs4java.eu",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMTQrCMBBGcdsj6GbWgomIbnTrDyoi2AOUtIxJyjQTMqn0Rl7TuPke7y2-6jur7jUGzwn8s4YjfpA4YoIV1NEEL06fgqXCUs4jEbxw4IzFbtyCoEmdAw5wYbaE84PLOcpeaxFSVrLJvlMdD5oDtjzpnlv5TyPOJIxkMjab3XpSMdjlolzKtjcfo3AEH-AqhMBveJjwAy_C9jGqAAAA&shmds=v1_AUFQtOMKouD8gkPxQnHM75-Tv6fxmCKqGmAT6a5iU7YigV6-BQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fe13865cea354489f7/images/d3b0a3e25b06921dcb0aea78dd362d90ad1f41b68c16df3ebc464bcf554818b8.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "This a Full Remote job, the offer is available from: Europe\n\nThis is a remote position.\n\nWe are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improve/learn.\n\nThis position is only open for employees, who would like to work remote. Candidates need to be willing to go to the office in Murcia for 5 days on a quarterly base.\n\nTasks and Responsibilities:\n\n​\n• Design and develop software solutions to client requirements;\n• Participate in identifying problem areas and defining solutions;\n• Able to articulate problems and solutions in non-technical language to stakeholders;\n• Understand interactions and dependencies between software components;\n• Support the product engineering lead(s) in project set up, execution and key ceremonies including backlog refinement, sprint planning, demos and retrospectives;\n• Support learning and development activities for junior product engineering resources;\n\nProfile:\n• College / university degree, Bacc. Ing. Comp (or similar);\n• +2 years of iOS mobile development experience (Swift, Objective-C, ...);\n• +5 years of software development experience;\n• Strong understanding of Apple’s design principles & interface guidelines;\n• Candidates need to have a good level of English and/or willing to improve/learn;\n\nOffered:\n• Attractive salary package (employees);\n• Career development training;\n• English classes;\n\nInterested: Please send your resume to\nresume@jobs4java.eu\n\nThis offer from \"Jobs4java.eu\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/65ef62f6f235ccdf79169158-senior-ios-developer---spanish-english---full-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAtIFNwYW5pc2gvRW5nbGlzaCAtIEZ1bGwgUmVtb3RlIiwiY29tcGFueV9uYW1lIjoiSm9iczRqYXZhLmV1IiwiYWRkcmVzc19jaXR5IjoiSXNsZSBvZiBNYW4iLCJodGlkb2NpZCI6IkRZS2RuVGpvVXg1eWIyMDlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "IOS Senior Developer",
            "company_name": "Mounts",
            "location": "Edinburgh, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=8joVHQRAWbvd56ebAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFz7CE4Hbv40IrjoqoiKOBTnkrRHEknvQu4qfQtfWfyGr_rOqtX12UCDFLnACT-YOGOBDdzYgaAtXQAmuDD7hPNjUM1yMEYk1V7UauzqjgfDhI4n82Yn_1oJtmBOVrHd7bdTnckvFw8eSQUiwbmP5MbiwxpeFBV7uEfyPQ8_8VGqr5IAAAA&shmds=v1_AUFQtOPnPzF_UjXRBN8te8lGzT648YplddNcWptpOHQupo4kWw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=8joVHQRAWbvd56ebAAAAAA%3D%3D",
            "extensions": [
                "2 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "2 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior iOS Developer, UK Wide\n\nA seasoned Lead iOS Developer is sought to collaborate with a renowned digital transformation agency boasting a significant UK presence. The agency has adopted a hybrid working model, allowing for flexible arrangements and minimal office expectations.\n\nThe company's extensive expertise spans data, web, mobile, and strategy, providing opportunities to work on innovative projects with prominent household names. This role involves working within joint client teams to deliver solutions, leveraging strong communication skills and enthusiasm for emerging mobile technologies.\n\nKey Responsibilities:\n• Designing and implementing architectural approaches, including MVC, MVP, and MVVM\n\nBenefits:\n\nA competitive salary of up to £80,000 per annum, along with generous company benefits, will be offered to the successful candidate. Flexible working arrangements are also available.",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/ea02734ec5d675c8d1eb044a08d44ebd?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/uk/info_technology/3718360232/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=8226ae01af78&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgU2VuaW9yIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6Ik1vdW50cyIsImFkZHJlc3NfY2l0eSI6IkVkaW5idXJnaCwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6Ijhqb1ZIUVJBV2J2ZDU2ZWJBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "iOS Developer (Native Swift)",
            "company_name": "Glance Group Ltd.",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=AaNruaVjdrKbgwu4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBAAUFz7CU4HLiqYiOKiq1BQ0aE4lzQ900h6F5Kz9k_8XXV52ys-k2LrbxUcccDAERPMr0b8gFC9_UMWsIITN5DRJNsBE5TMLuD00InEvNc656Bclt-xynKvmbDhUT-5yX_q3JmEMRjBerNbjyqSW87KYMgilIlfES7SKvAEd_KCLZw9uZb7L65y2FqaAAAA&shmds=v1_AUFQtOPklwFtclZJ0-qSZgaWBMApk7xJxVyTFp1vph1tGpPFeA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=AaNruaVjdrKbgwu4AAAAAA%3D%3D",
            "extensions": [
                "£35K–£45K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "£35K–£45K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who We Are:\nGlance is a small, boutique mobile design and development agency with a fully remote, worldwide team. We build mobile apps and supporting systems for clients ranging from startups to prominent household names and cover almost all market verticals. We are growing our UK presence and looking for an iOS Developer (Native Swift) to work join our remote delivery team. Could you be the perfect fit for us?\n\nWhat We Need:\nWe are looking for a proactive iOS Developer (Native Swift) to build and test mobile products and platforms for our clients, ensuring we release high-quality code through an efficient and repeatable process.\n\nYou will work closely with other remote developers and designers forming a cross-functional team building both mobile products and supporting backend services. You will propose best-fit approaches for mobile development to keep us on the leading-edge of our industry. In addition, you will work closely with clients to ensure their business goals are met in the simplest and most efficient way.\n\nYou will form part of our Agile team and will attend all Agile ceremonies (such as stand-ups, retrospectives and product workshops) to help plan, estimate and refine your work and execute on the clients vision to the highest standard.\n\nIf you join us, you will need to:\n• Design and deploy high-performance Swift applications for mobile.\n• Write clean, efficient, and reusable code.\n• Collaborate with cross-functional teams to define, design, and ship new products.\n• Unit-test code for robustness, including edge cases, usability, and general reliability.\n• Integrate with server-side APIs and third-party services.\n• Perform diagnostic tests, fix bugs, and provide technical support to clients.\n• Document software development processes and prepare project reports.\n• Provide suggestions for improvement and apply them to daily tasks and processes.\n\nTo be successful in this role, you will need to be:\n• An experienced iOS developer for technology companies.\n• Knowledgeable in Swift, SwiftUI, libraries, frameworks, and tech stacks.\n• A detail-orientated person, especially in identifying and fixing errors.\n• A proactive and confident communicator.\n• A collaborative team player - you will work closely with our designers, developers and directly with our clients.\n• Analytical - you should be comfortable gathering and analysing information for timely decision-making and problem-solving to create the best products.\n• Comfortable with pushing back and saying “No” when required.\n• Adaptable to a fast-paced and changing environment.\n• An ideas person with a hands-on approach.\n• A naturally curious and driven person.\n\nWhat we can offer you in return:\n• A fully-remote, flexible and highly-collaborative working environment.\n• Benefits include pension, training budget and annual bonus.\n• The opportunity to play a vital role in our business and shape our processes.\n• The chance to work on exciting products across all market verticals.\n\nSalary: £35,000 - 45,000 annually.\n\nAbout Glance Group Ltd.:\n\nWe’re award-winning app developers, taking a fresh approach to mobile app development. We use psychology to create award-winning, chart-topping, customer-pleasing apps.Our creative team have been crafting unique mobile-focused applications for the world’s biggest brands and brightest startups for over 7 years. In that time they have worked with the likes of Canon, CHANEL, The Times, The Ministry of Defence, Lucozade, CMC Markets and Universal Music as well as smaller startups and individuals across all manner of market sectors.Our team have produced products which have hit the number 1 spot on the App Store and are regularly in the top 5 for various categories. Our team have also had products regularly featured in the national press and blogs including The Mail, The Sun, The Independent, Stylist, Glamour, ShortList, Women’s Health, The Guardian, BuzzFeed, Men’s Fitness, the BBC and of course Apple themselves.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=0b6e4a38037d83ce&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/ios-developer-native-swift-at-glance-4089822552?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.co.uk",
                    "link": "https://www.monster.co.uk/job-openings/ios-developer-native-swift-london-greater-london--d5407f32-75d9-4a97-a765-ebc66756d853?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glance Group Ltd. Careers",
                    "link": "https://glance.betterteam.com/ios-developer-%28native-swift%29?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=79455424926884550&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/336216b1c511950d42d97452c0963bb9?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobrapido.com",
                    "link": "https://uk.jobrapido.com/jobpreview/766081176?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The BIG Jobsite",
                    "link": "https://www.thebigjobsite.com/details/1FF9ADAFFF04D29486B00FBF7D79337E/ios-developer--native-swift?source=attbus&utm_source=googlejobs&utm_medium=api2&key=31EB711C76E628947D77DCCC4D7A3032&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChOYXRpdmUgU3dpZnQpIiwiY29tcGFueV9uYW1lIjoiR2xhbmNlIEdyb3VwIEx0ZC4iLCJhZGRyZXNzX2NpdHkiOiJVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiQWFOcnVhVmpkcktiZ3d1NEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Full stack developer",
            "company_name": "Artissary India Pvt Ltd",
            "location": "Mumbles, United Kingdom",
            "via": "Klimb.io",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=bwTY3xEIK_k2uXN6AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLOQ7CMBAAQNHmCVRbc8QoEg1UNCAuiYY68rFyDI7X8m5Q-AxvBZrppvpMqvl-iBFYtH2CwxdGylhgCScywKiL7YASHIh8xOm2E8m8UYo51v6XJNjaUq8ooaFRPcjwn5Y7XTBHLdg269VY5-Rnza5IYNblDcfkgobbS-AiDkKC69CbiLyAewqCDs4heUf9F4rpZ8-hAAAA&shmds=v1_AUFQtOOOrXHKXlXzlm0XG0aQGk6kbr_-hGie0-jwRoB-yxPrmQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=bwTY3xEIK_k2uXN6AAAAAA%3D%3D",
            "extensions": [
                "Internship",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Internship",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for an iOS developer responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers. Your primary focus will be development of iOS applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.\n\nWe are looking for an iOS developer responsible for the development and maintenance of applications aimed at a range of iOS devices including mobile phones and tablet computers. Your primary focus will be development of iOS applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and the creation of quality products is essential.",
            "apply_options": [
                {
                    "title": "Klimb.io",
                    "link": "https://jobs.klimb.io/artissary/65ec84dfa627c2f3a95d2b91?source=careers&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGdWxsIHN0YWNrIGRldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFydGlzc2FyeSBJbmRpYSBQdnQgTHRkIiwiYWRkcmVzc19jaXR5IjoiTXVtYmxlcywgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImJ3VFkzeEVJS19rMnVYTjZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "IOS Developer​/Webview – Banking – Hybrid",
            "company_name": "Salt Digital Recruitment",
            "location": "London, United Kingdom",
            "via": "Learn4Good",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=EqoSaoBLTOyPivsfAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3Ov2oCQRCAcdL6CKmmDnorQhrtRPwbEDwkpezuDXujezPH7qiXzj5lnsbX8Uli0nz8yq93f-nNV9sSZnjBKC2mx-3bfKK7EF7hcfuBqeUTcfj38sslqmAAa3GQ0SZfgzAsRELE10mt2uaxMTnHImS1Sr7w0hhhdNKZo7j8l0OubcI2WsXD6H3YFS2Ht1Fpo8KMAqmNsEOfzqQNsgIxfAhXwn3YMylWsHn-VNL8AiSowOW8AAAA&shmds=v1_AUFQtOPvHOUtGC49mQ396G8IiMQWg1W3I458HTU1spw3ka7x5Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=EqoSaoBLTOyPivsfAAAAAA%3D%3D",
            "extensions": [
                "£500–£650 a day",
                "Full-time and Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "£500–£650 a day",
                "schedule_type": "Full-time and Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "iOS Developer (Webview) – Banking – Hybrid\n\nDay rate: £500 – £650 (inside IR35)\n\nDuration: 6 months\n\nStart: ASAP\n\nMy banking client is looking for a highly skilled iOS Developer to join the team on a contract basis.\n\nRequirements:\n• Native iOS mobile application development\n• Experience developing banking grade mobile solutions\n• Experience with developing with bank grade security requirement, PCI DSS compliant mobile security solutions, encryption, certificate pinning, OIDC/OAuth2, session management\n• Designing and implementing Mobile App interacting with REST API and GraphQL\n• Developing solutions with iOS UI as well as embedded Webview\n• Developing and shipping mobile applications maintained by multiple external and internal teams and contributors\n• Developing to engineering metrics and standards (automated testing, code quality etc.)\nJob Information\n\nJob Reference: JO-\n\nSalary: £500 - £650 per day\n\nJob Duration: 6 months\n\nJob\n\nStart Date:\n\nASAP\n\nJob Industries: Software Engineering\n\nJob Location s: Greater London\n\nJob Types: Contract\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/london/uk/software_development/3718269997/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgRGV2ZWxvcGVy4oCLL1dlYnZpZXcg4oCTIEJhbmtpbmcg4oCTIEh5YnJpZCIsImNvbXBhbnlfbmFtZSI6IlNhbHQgRGlnaXRhbCBSZWNydWl0bWVudCIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IkVxb1Nhb0JMVE95UGl2c2ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior iOS Engineer, Europe",
            "company_name": "Goodnotes",
            "location": "Anywhere",
            "via": "LinkedIn",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=OTetMvSA5zyZ6yAFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCQAwAUFz7CU4BN6k9KbjoXAQVHIpzufbCNaVNjkuEfonfqy5vfMVnU9QtMkkGerbQcCRGzCU07ywJ4QA36UHR52EEYbiKxBm3l9Es6dk51bmKat5oqAZZnDD2srpJev3T6egzptkbdvXpuFaJ4373SwKLoQIxPISDcAkvJsMAd-IYZPkCxgck9JkAAAA&shmds=v1_AUFQtOPNcs3mmi3VOH8QhxkTcPCoDPFs21k2Efy_ZE5sbhVxlA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=OTetMvSA5zyZ6yAFAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fe13865cea354489f7/images/d3b0a3e25b06921d3214e8ac2fb1bff8e4eecdaf6c49e8dd09dbbd89aacd6215.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We want to make work and study more efficient and enjoyable, by providing the best digital paper solution possible. We plan to be the go-to tool for all forms of notes. Our digital paper and learning ecosystem inspires anyone to take notes, share what they know, collaborate with others, and learn as a community\n\nAbout the team:\n\nAt Goodnotes, we are driven by a mission: to transform the classroom into a dynamic and interactive environment where students and teachers can seamlessly connect through our innovative product. As a Senior Engineer, you will play a pivotal role in bringing this vision to life. You will collaborate closely with external educators and cross-functional teams within Goodnotes, leveraging your expertise to build and refine a new product that enhances the educational experience for users worldwide. Join us in creating a platform that not only facilitates learning but also fosters meaningful interactions and connections in the digital classroom.\n\nYou'll be:\n• Build mission-critical services used by tens of millions of users.\n• Architect and design scalable solutions that are easy to maintain to allow development of exciting features and support more users.\n• Implement elegant solutions with clean code.\n• Enable communication with the Mobile, Web frontend and QA teams\n• Define and drive the completion of new initiatives and features by removing blockers for the team\n• Continuously improve the development practices through research, automation, documentation and testing\n• Share your knowledge and experience with the rest of the team\n\nYou'll need:\n• Expertise in Swift programming. Knowledge of SwiftUI is advantageous\n• Strong understanding of computer science fundamentals, you enjoy solving algo and data structure puzzles\n• Excellent problem solving, communication, and storytelling skills\n• A love of software craftsmanship\n• Strong sense of the best tools for any task\n• Shipped one or more non-trivial iOS apps on respective app stores\n• Big plus if you have experience cross-compiling codebase on different mobile platforms\n\nEven if you don't meet all the criteria listed above, we would still love to hear from you! Goodnotes places a lot of value on learning and development and will support your growth if needed.\n\nThe stack:\n• Programming Language: The vast majority of our code is written in Swift\n• Concurrency: We have a large, old, but modular codebase. We use modern Swift Concurrency as much as possible as we gradually move away from RxSwift\n• UI code: As much new UI code as possible is in SwiftUI. We fall back to UIKit when needed and re-use the majority of it on macOS using Catalyst\n• Cross-platform: We re-use our core packages on cross-platform using SwiftWasm, UI for other platforms is written using React or their respective native APIs\n• Dependencies: We exclusively use Swift Package Manager and frequently make new local packages\n• Source control and builds: We have a mono-repo and use GitHub and Pull Requests. We kick off builds using a Slack bot\n• Continuous Integration: We use CircleCI which means our configuration is checked in with our code. We have unit tests for all of our modules which run on every branch. UI tests are run daily and before release\n• Release cadence: We QA and release on a weekly schedule\n\nThe interview process:\n• Introduction: The Talent Team want to hear more about your background, what you are looking for, and why you'd like to join Goodnotes.\n• Technical Screening: A timed coding challenge on the Hackerrank platform.\n• Live coding & Technical interview: A live coding call with one of our engineers. This is where you get to see what it would be like working at Goodnotes as well as the chance to ask any engineering questions you may have\n• Hiring Manager interview: A call with your hiring manager. This is the person who will be managing you day to day, working on your growth and development with you as well as support you throughout your career at Goodnotes.\n• Values interview – Meeting with members of the Goodnotes Team to answer questions relating to take ownership AND build great things\n\nWhat's in it for you:\n• Remote friendly\n• Flexible working hours and location\n• Medical insurance for you and your dependents\n• Great annual leave allowance\n• Meaningful equity in a profitable tech-startup\n• Budget for things like noise cancelling headphones, setting up your home office, personal development, professional training, and health & wellness\n• Sponsored visits to our Hong Kong or London office every 2 years\n• Company wide annual offsite\n• Fantastic maternity/ paternity packages and and allowances\n\nNote: Employment is contingent upon successful completion of background checks, including verification of employment, education, and criminal records.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://uk.linkedin.com/jobs/view/senior-ios-engineer-europe-at-goodnotes-4068289451?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=95451003586781894&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIEVuZ2luZWVyLCBFdXJvcGUiLCJjb21wYW55X25hbWUiOiJHb29kbm90ZXMiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJPVGV0TXZTQTV6eVo2eUFGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Experienced iOS Developer",
            "company_name": "ASOS",
            "location": "Belfast, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=DL6oSkSNBIlmROhFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7CC7eLNoUwUUnRRF0cCjOJU2vSSS9C71D-hg-snX5h3_5iu-iqK5TxjEiOewgPmu44AcTzw-2cOcWBO3oAjDBjdknXB6DapaDMSKp9KJWoysdD4YJW57Mm1v5p5FgR8zJKja7fTWVmfx6dapnIxKcMfVWdAMvijrTj0i-4-EHdqDiWZMAAAA&shmds=v1_AUFQtOPrQbLrBRWiOeIiWwp9vcLO5MG6qnu5LDW43PHbK7l1rQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=DL6oSkSNBIlmROhFAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fe13865cea354489f7/images/d3b0a3e25b06921d5dffbc24ae81fbee6a89a969799a4f426756ce84dc31b194.gif",
            "extensions": [
                "1 day ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "1 day ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: iOS Engineer\nAbout ASOS Technology\n\nWe're at the heart of ASOS, delivering innovative technology solutions that drive customer experience.\nJob Description\n\nWe're expanding our Mobile Development team and seeking a skilled iOS Engineer to join our Customer Experience team. The successful candidate will contribute to the development and maintenance of our iPhone and iPad app, used by over 8 million active users worldwide.\n\nThe ideal candidate will have:\n• Strong coding knowledge in Swift 5 and foundational iOS frameworks;\n• Experience with Xcode, IB, and Auto Layout for creating advanced UIs;\n• Deep understanding of Apple's Human Interface Guidelines (HIG) and design best practices;\n• Knowledge of software design patterns, architecture principles, and REST API consumption.\n\nYou'll be working closely with our design team to implement clean and modern designs that respect the platform. Your proactive approach and hands-on attitude will ensure top-quality projects delivered on time.\nWhat We Offer\n\nAs an iOS Engineer at ASOS, you can expect:\n• A competitive salary (£60,000 - £80,000 per annum, depending on experience);\n• Employee discount (ASOS Develops);\n• Personal development opportunities across the business;\n• Access to LinkedIn learning materials;\n• 25 days paid annual leave + extra celebration day;\n• Discretionary bonus scheme;\n• Private medical care scheme;\n• Flexible benefits allowance.\n\nIf you're passionate about iOS development, keen to learn and grow, and want to be part of a dynamic team driving innovation, apply now!",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/ce482cd0017077c1d263e4cdbe7649d2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQVNPUyIsImFkZHJlc3NfY2l0eSI6IkJlbGZhc3QsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJETDZvU2tTTkJJbG1ST2hGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUaTEwTmtOcWRYQnpPREkyU0RGWk1qSlpWMkZyYUZSelMzbG1Za0ZVWldkb1ZrVTBUMmhrWlRKcWFWaFVZVXBJZVZwRFdqaFdabmg0WnpoRFNITkZkbVpOVTFZMFNVRk1jR0Y1Y1dsTllqaE9kMEpYVDBGNU5WbHFUbXc0VlZsYVVEUXpRVWx2VG5acVJqRlJRa2R4TkcxVWRqVjJkVXBqVEZCaGFXOVNhR1YyUkZCWE9WZHRVR281V0VwdVgxUnhPR1JHVW5Ga09URnBhREJZTW5WaFEwaGlaM05XWVZRNGNXUm9jMFphYW0xRFNHSlhVMUZNZVhkWVptbFJUV000VWw5ZlQwWmlkRXgwV0RSWmFXbFBheTFUZEdKbVN6TnRURVpQUTJOTVUxSTJkR0pEZFMxclJYcDZSR1JZUlhCQmN6TXdTMHRHTVdVMVRrUm1jV1YwT0VGbGJYbG1laElYWDJkWFJsbzBkbXhMVFRORmNEZzBVRzlRVkZaeFFVVWFJa0ZHV0hKRlkzQnpRMlppTFhjMFVrWlhWRXhoWjNWNlIyOHhiR2hQUkc1WmVXYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUaTEwTmtOcWRYQnpPREkyU0RGWk1qSlpWMkZyYUZSelMzbG1Za0ZVWldkb1ZrVTBUMmhrWlRKcWFWaFVZVXBJZVZwRFdqaFdabmg0WnpoRFNITkZkbVpOVTFZMFNVRk1jR0Y1Y1dsTllqaE9kMEpYVDBGNU5WbHFUbXc0VlZsYVVEUXpRVWx2VG5acVJqRlJRa2R4TkcxVWRqVjJkVXBqVEZCaGFXOVNhR1YyUkZCWE9WZHRVR281V0VwdVgxUnhPR1JHVW5Ga09URnBhREJZTW5WaFEwaGlaM05XWVZRNGNXUm9jMFphYW0xRFNHSlhVMUZNZVhkWVptbFJUV000VWw5ZlQwWmlkRXgwV0RSWmFXbFBheTFUZEdKbVN6TnRURVpQUTJOTVUxSTJkR0pEZFMxclJYcDZSR1JZUlhCQmN6TXdTMHRHTVdVMVRrUm1jV1YwT0VGbGJYbG1laElYWDJkWFJsbzBkbXhMVFRORmNEZzBVRzlRVkZaeFFVVWFJa0ZHV0hKRlkzQnpRMlppTFhjMFVrWlhWRXhoWjNWNlIyOHhiR2hQUkc1WmVXYyIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}