{
    "search_metadata": {
        "id": "67850811e34dfc3cd5274103",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/60b4317347899523/67850811e34dfc3cd5274103.json",
        "created_at": "2025-01-13 12:33:21 UTC",
        "processed_at": "2025-01-13 12:33:21 UTC",
        "google_jobs_url": "https://www.google.at/async/callback:550?q=iOS+developer&uule=w+CAIQICIHQXVzdHJpYQ&udm=8&fc=ErcCCvcBQUpHOUprTkU5UFpHd2Q4WVB5bGd4cUtUNlE5WlNRMmZXdDd5UVpZYkYtSElVeTZFMm5CY1ZVdkNCSVRzWW1NWVJRcExOMG43Q0dYQ3JYZDdjTEdBWUxSdWQxSkZSR0VkRXNBX3dsQVp0ZEcwTUkteEl1Wl9wMEs5VkQ3MlB5bVo4cDdpaWI0U3ctOTBSbVpjc3ZWY2lEV0NpWXV2Y1VIX3JGbTFsSFJpdHk1Z0g4SmJPM0lnT2pTSFF5bDlfTzJTbkUzOVd5czl3ZjJ5NW5acUk4MlItNzZDTUExV0tBYVVvT0tQOG51UWFIX2xubWFzUFhiQmpxQRIXRUFpRlotYm1LcUdraUxNUGxNemlrUXcaIkFGWHJFY29mMDZnTzBsNzlQdXFfU1c1eGlQSVNqZ21YNkE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/60b4317347899523/67850811e34dfc3cd5274103.html",
        "prettify_html_file": "https://serpapi.com/searches/60b4317347899523/67850811e34dfc3cd5274103.prettify",
        "total_time_taken": 1.35
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Austria",
        "location_used": "Austria",
        "google_domain": "google.at",
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJUa1U1VUZwSGQyUTRXVkI1YkdkNGNVdFVObEU1V2xOUk1tWlhkRGQ1VVZwWllrWXRTRWxWZVRaRk1tNUNZMVpWZGtOQ1NWUnpXVzFOV1ZKUmNFeE9NRzQzUTBkWVEzSllaRGRqVEVkQldVeFNkV1F4U2taU1IwVmtSWE5CWDNkc1FWcDBaRWN3VFVrdGVFbDFXbDl3TUVzNVZrUTNNbEI1YlZvNGNEZHBhV0kwVTNjdE9UQlNiVnBqYzNaV1kybEVWME5wV1hWMlkxVklYM0pHYlRGc1NGSnBkSGsxWjBnNFNtSlBNMGxuVDJwVFNGRjViRGxmVHpKVGJrVXpPVmQ1Y3psM1pqSjVOVzVhY1VrNE1sSXROelpEVFVFeFYwdEJZVlZ2VDB0UU9HNTFVV0ZJWDJ4dWJXRnpVRmhpUW1weFFSSVhSVUZwUmxvdFltMUxjVWRyYVV4TlVHeE5lbWxyVVhjYUlrRkdXSEpGWTI5bU1EWm5UekJzTnpsUWRYRmZVMWMxZUdsUVNWTnFaMjFZTmtFIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Buscojobs | Senior Software Engineer, Ios Apps",
            "company_name": "Tideri Jobbörse",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=y_pjOlinH9ahCX1sAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQ7CMAxAUbFyBFg8I2gQEgtMRaoQrGWvkmBSoxJHsSs6cBkuwQW4GHT54_vT92RaHXrxfGcn8IIaI3GGmm_6tBmhioEiYl7CiQXKlARWcGYHgjb7FjjCkTl0ONu3qkl2xoh0RRC1Sr7w_DAc0fFgxsGYRto_nDqr2Gy266FIMSzmF7piplF2308WBIpQ9qKZ7A_YxLlcpAAAAA&shmds=v1_AUFQtONhdAaNSanvhw__VmwF1y9amXlML95buKHPT2qtJbZW6g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=y_pjOlinH9ahCX1sAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44dfcedc19ba5e723368b8c87789c17666b90a6627b40beb889.gif",
            "extensions": [
                "9 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "9 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Software Engineer, iOS Apps\nFull Time Chatswood, Sydney, Australia\nWe are seeking a talented Senior Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia.\nAs part of our team, you will contribute to the development and maintenance of mobile applications, revolutionizing the way users interact with advanced networked audio players.\n\nKey Responsibilities:\nAnalyzing project requirements and devising effective solutions Implementing innovative features to enhance user experience Troubleshooting and resolving bugs in a timely manner Conducting thorough development testing to ensure high-quality deliverables Architecting and optimizing code and projects for optimal performance Collaborating seamlessly with both local and remote team members across multiple locations Providing valuable technical feedback and participating in code reviews Researching the latest APIs, tools, and features to stay at the forefront of technology Utilizing version control tools effectively Managing assigned tasks within Agile sprint cycles Required Skill Sets: Must Have:\nMinimum of 7 years of professional software engineering experience At least 4 years of hands-on experience in native iOS app development Proficiency in Swift and Objective-C programming languages Strong understanding of the UIKit framework In-depth knowledge of Xcode, including Projects, Targets, Instruments, and Simulator Solid grasp of software design principles and patterns Familiarity with version control systems such as SVN and Git Experience integrating third-party software libraries and frameworks Proficiency in utilizing web service APIs Thorough understanding of iOS Human Interface Guidelines Excellent written and verbal communication skills Self-motivation and a proactive approach to problem-solving Nice to Haves:\nProficiency in C++ and Python programming languages Experience with the SwiftUI framework Familiarity with dependency managers such as Swift Packages and CocoaPods Exposure to build systems like xcodebuild, CMake, and SCons Proficiency in creating XCFrameworks Experience with automated testing using XCTest Knowledge of tools like Jira, Fisheye, Crucible, and Confluence Familiarity with Continuous Integration and Continuous Delivery tools (e.g., Jenkins) Exposure to Firebase for analytics, crash reporting, and messaging Familiarity with Google Analytics, including Big Query and Data Studio Experience with app localization and localization management tools like Lokalise Knowledge of asset management tools such as Figma and Zeplin Understanding of data serialization formats like Protobuf, XML, and JSON Familiarity with App Store Connect for publishing, analytics, and ratings/reviews Understanding of the app code signing process Exposure to cross-platform development frameworks like Xamarin, Flutter, and React Native Join Our Team: At our company, we are passionate about delivering immersive sound experiences that captivate and delight.\nWith our growing portfolio of innovative audio and video products, we continue to push the boundaries of design, technology, and performance.\nOur dedication to customer satisfaction has earned us industry recognition and loyal customers worldwide.\n\nWe offer a competitive salary, attractive incentive program, and a collaborative, open work environment.\nAs part of our team, you will have access to professional development opportunities, enabling you to expand your skills and expertise.\nTake the next step in your career and join us on our exciting journey to shape the future of sound technology.\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-942b6ebdcd6a7163ca3000bccadbd808?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJCdXNjb2pvYnMgfCBTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIElvcyBBcHBzIiwiY29tcGFueV9uYW1lIjoiVGlkZXJpIEpvYmLDtnJzZSIsImFkZHJlc3NfY2l0eSI6IkF1c3RyaWEiLCJodGlkb2NpZCI6InlfcGpPbGluSDlhaENYMXNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUVhWemRISnBZUSJ9"
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQoCMQwA0P1GR6eMItiK4qKTKAqufsCRltCe5JrS5OTAn1eXx-s-3erGkxk1uNKbWOpvG3hIACVsMYMUuIskpuUpm1U9eq_KLqmhDdFFGb0UCjL7lwT902vGRpXRqN8dtrOrJa0Xz4hM-wsMBc6TWhvwCwLm5bR9AAAA&shmds=v1_AUFQtOO08HirDxT9UU_VJWEXajuBgrX_b6UguOCIQqciv9QmuA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=lSLQdegw6ZQ8FYdRAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44dd4168effe0dfcc41f45dc261eafc56abc40d0d680d7d21a2.gif",
            "extensions": [
                "21 days ago",
                "€192K a year",
                "Work from home",
                "Internship",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "21 days ago",
                "salary": "€192K a year",
                "work_from_home": true,
                "schedule_type": "Internship",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: European Union\n\nWho we are\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\nWhat we are looking for\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environmentInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\nTalent acquisition team\n\nThis offer from \"Scale3C\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/677c07d256373d87f2b9cbc6-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJBdXN0cmlhIiwiaHRpZG9jaWQiOiJsU0xRZGVndzZaUThGWWRSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFYVnpkSEpwWVEifQ=="
        },
        {
            "title": "Senior Ios Engineer/Tech Lead",
            "company_name": "Ncs Australia",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=xF7jXiN2bLpk-VdXAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXIMQoCMRBAUWz3BGI1tWAioo1WW4goYqP9MolDEokzIRNhL-GdVWw-vN-9J936SpykwlEU9hwSE1V7Ix_hTHiHBZzEgRLW7xGGg0jINNvF1opurVXNJmjDlrzx8rTC5GS0D3H6y6ARK5WMjYbVZjmawmE-vXiF_qWtYk4Iif9I-AEuildokAAAAA&shmds=v1_AUFQtONzq86yPTHOTknCXv6xfHCHObxiYo6DYJmgOlZyRowO0g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=xF7jXiN2bLpk-VdXAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44d45af51ebd873de4a3ff98acd2565311f9e1c93251d8fcea8.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Company Description At NCS Australia, we believe in doing technology services better.\nOur commitment to quality, focus on people, and willingness to challenge traditional thinking set us apart.\nOur team brings this belief to life by partnering with our clients and communities to make tomorrow together.\nWe are committed to creating an environment that prioritises innovation, collaboration, and purposeful work.\nOur diverse team is empowered to make a meaningful impact with curiosity, creativity and resilience to shape better outcomes.\nJoin us and accept the challenge of creating a better tomorrow.\nJob Description You will be involved in the design and development of innovative solutions to both technical and business problems along with architecture and development of iOS applications.\nYou will communicate regularly, write clean code, review, analyse and resolve application issues as needed.\nYou will collaborate with the team members to consult on the design and implementation of new functionalities and solutions in-line with the departments' visions.\nMoreover you will evaluate strategies, make recommendations on changes and improvements.\nYou will continuously learn and keep up to date with emerging technologies to evaluate impact to business and member value.\nOn a daily basis you will be testing your outputs to ensure that they are in excellent working order.\nMoreover, you will be deploying developments and monitoring uptake by the target audience and will use clients' feedback to inform the creation of subsequent versions of each development.\nOn offer is an exciting career where you'll make an impact and work with innovative technology solutions.\nYou'll perfect your skills alongside a talented and collaborative team while enjoying the recognition, progression and extensive benefits of a global organisation.\nQualifications Prior experience in a similar role as a Senior iOS Developer/Tech Lead Demonstrable work on the current iOS platform Strong understanding of multi-tier architectures, design patterns and good engineering practices Proficient in Swift and SwuiftUI experience a plus Familiarity with common stacks Strong experience on how to implement and manage RESTful API's Deep understanding of UIKit, Foundation, and other core iOS frameworks Familiarity with agile development practices Excellent communication and teamwork skill.\nAbility to assess feasibility, difficulty, and provide time estimates on implementing new features to an application Great attention to detail Additional Information Why join us: NCS Australia is where you can feel at home, nurturing your talents and skills as we make tomorrow together, one day at a time.\nOur benefits include paid parental leave, initiatives focused on your well-being and discounted health insurance.\nYou will also enjoy discounts on various products and services and be regularly recognised and rewarded for high performance.\nWe are committed to your career development through our Capability Fingerprint, industry and partner training programs, special interest groups, and an AI-driven learning platform.\nNo matter where you are in your career, we offer meaningful work and opportunities for growth.\nNCS Australia is an equal-opportunity employer, and we take pride in our commitment to valuing and supporting our people and the communities we serve.We are dedicated to attracting, retaining and developing our people regardless of gender identity, ethnicity, sexual orientation, disability and age.\nApplications are encouraged from all sectors of the community and we strongly encourage applications from the Veterans, Aboriginal and/or Torres Strait Islander community.\nAt NCS Australia, we are committed to supporting adjustments throughout the recruitment and selection process, as well as during employment.\nWe actively support and encourage people with disability to apply.\nTo discuss adjustment requirements, please email ******.\nAgencies: We've got this.\nWe request that you do not contact NCS employees outside of the Talent Acquisition team.\nNCS exclusively accepts resumes from agencies on our preferred supplier panel through the NCS Agency Portal.\nAgencies that submit resumes must have a valid fee agreement and be assigned to the particular requisition by the Talent Acquisition team.\nAny resumes that are submitted outside of this process will become the sole property of NCS.\nIf a candidate is hired outside of this process, no fee or payment will be given.\nWork rights and background checks: To be eligible for a position with us, applicants will need to have valid work rights for Australia and be willing to undergo a comprehensive background checking process, including probity and police checks",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-ecf48cd67ef7b73f213348aebaa09cce?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSW9zIEVuZ2luZWVyL1RlY2ggTGVhZCIsImNvbXBhbnlfbmFtZSI6Ik5jcyBBdXN0cmFsaWEiLCJhZGRyZXNzX2NpdHkiOiJBdXN0cmlhIiwiaHRpZG9jaWQiOiJ4RjdqWGlOMmJMcGstVmRYQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFYVnpkSEpwWVEifQ=="
        },
        {
            "title": "Mobile Applications Developer",
            "company_name": "Swipejobs Pty Ltd",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=RJp8JS_qZ1iEyjl6AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLMQoCMRBAUWz3CGIxtWAioo1WC4IgCoIHWJI4ZCMxM2RGXY_hjXWbX73ffCfN-kw-ZYSWOafgNFER2OMLMzFWWMCRPAi6GnqgAgeimHG661VZttaKZBNF_18wgR6WCnoa7J28jOmkdxU5O8VutVkOhkucz67vxDgSuOgHTnqDVKB9itbkfuA2wZGUAAAA&shmds=v1_AUFQtOMrqihF-RdfeT37exBEDaf2HRsG1SwkNfFLQb6fPkF3zg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=RJp8JS_qZ1iEyjl6AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44d838b93413d15a8de66c5c5a174f800ab579e3cfeb5cf758b.gif",
            "extensions": [
                "30 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "30 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "swipeJobs is a fast-growing, disruptive, and award-winning staffing platform that is transforming the way people find work and businesses manage their workforce.\nOur platform connects job seekers with employers, allowing businesses to easily fill their staffing needs.\nWe are slowly becoming the stand-alone market leader in the US market and are looking for the right professional to join us on this exciting journey.We are looking for a skilled Mobile Application Developer to drive the development of our mobile platforms.\nYou'll work closely with cross-functional teams including product, design, and backend engineers to create intuitive, user-friendly apps for both iOS and Android.\nYour work will directly impact thousands of users and will be central to expanding our mobile offerings.Key Responsibilities:Design, develop, and maintain high-quality mobile applications for iOS and AndroidCollaborate with the product and UX/UI design teams to implement new features and improve user experienceWork with backend developers to integrate APIs and ensure seamless app performanceDebug, troubleshoot, and optimise mobile applications for maximum performanceStay updated with the latest industry trends, tools, and technologies to continually improve our mobile platformsWhat We're Looking For:Proven experience in mobile application development (iOS and/or Android)Proficiency in Swift, Kotlin, Flutter, or React Native (TypeScript)Strong understanding of mobile UI/UX best practicesExperience with RESTful APIs and third-party libraries integrationKnowledge of mobile application architecture, design patterns, and performance optimisationFamiliarity with Agile development methodologies and version control systems (Git)Problem-solving mindset with attention to detail and a focus on delivering exceptional user experiencesWhy swipejobs:A chance to work on a market-leading US software productEnd-to-end exposure to the full software development life cycleWorking in a start-up environment with modern offices located in North SydneyA flat organisational structure where everyone is always accessibleOperating in a fast-paced and dynamic environment that provides exciting challenges dailyA chance to work on a modern technology stack that is cutting edge even for the USFood is provided throughout the day whilst working in the office including a free lunchRegular social events in and outside the officeIf you are talented, driven and interested in joining us in our journey; we would like to hear from you.\nPlease click apply nowswipejobs is an equal opportunity employer.\nWe celebrate diversity and are committed to creating an inclusive environment for all employees.#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-1e623c8b93cc7e21f384cf88e7f8468a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb25zIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlN3aXBlam9icyBQdHkgTHRkIiwiYWRkcmVzc19jaXR5IjoiQXVzdHJpYSIsImh0aWRvY2lkIjoiUkpwOEpTX3FaMWlFeWpsNkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRWFZ6ZEhKcFlRIn0="
        },
        {
            "title": "Developer - Mobile",
            "company_name": "Tideri Jobbörse",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=4tH0pA0Sf9akdk1SAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQoCMRBAUWz3CNpMq2Aigo1WgiAIdvZLEockks2EmVH2Al7JC3gx3ebzqt-9Z93yhC8s1JBhDVfyueAfF_Ig6DgkoApnolhwfkiqTfbWihQTRZ3mYAINlip6Gu2DvEzpJTnGVpxiv91tRtNqXC1u-Y6cp7P_flgQcoXjU5Sz-wGOVmmKiAAAAA&shmds=v1_AUFQtOOpvZ2fiPCFZujqCMXxZ6s6C-TRxqS8Rg6Mkwak3t5Q4g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=4tH0pA0Sf9akdk1SAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44d10b43fbaab516a0e4f7af37ea4822e7cfe088d2c07bd3b6f.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Android Developer\nPermanent role based in Melbourne or Sydney We are certified carbon neutral and committed to reducing our impact on the environment.\nWe have long-term partnerships with charities working to address homelessness.\nWe're REA\nREA Group is not your average digital business.\nFrom humble beginnings in a garage in Melbourne's east in 1995, we have grown into a leading global digital business, specialising in property.\nWith bold and ambitious goals, we are changing the way the world experiences property.\nNo matter where you're at on your property journey, we're here to help with every step - whether that's finding or financing your next home.\nOur people are the key to our success.\nAt the heart of everything we do, is a thriving culture centred around high performance and care.\nWe are purpose driven and collaborative, which drives innovation and our ability to make a real impact.\nAs such, we're proud to be named in Australia's \"Top 5\" Best Workplaces two years in a row, as well as being recognised as a Best Workplace for Women.\n\nWhere the team fits in\nThis role will be focused on supporting the Ignite Platform, more specifically the App/Native side of the experience.\nFor a little bit more context, the Ignite Platform is positioned to be the tool of choice for all customers that utilise REA to support their business.\nIgnite is available to our customers across both web and apps which is underpinned by a backend that integrates with many core systems across our business.\n\nWhat the role is all about\nDevelop and maintain the Ignite App for Android platform Collaborate with cross-functional teams to define, design, and ship new features Ensure the performance, quality, and responsiveness of the app Identify and fix bugs and performance bottlenecks Conduct code reviews and provide constructive feedback to team members Participate in Agile ceremonies and contribute to continuous improvement initiatives Integrate third-party APIs and services into the application Work with CI/CD pipelines to automate build and deployment processes Stay up-to-date with the latest trends and technologies in Android development Optimise the app for scalability and speed of delivery Support our federating teams by providing guidance, technical expertise and options to solve technical problems, whilst ensuring our federating teams maintain our high-quality standards.\nCreate and maintain technical documentation Align and share knowledge with mobile community at REA on coding patterns and architecture Conduct unit testing and ensure code quality is maintained Assist in the discovery process including analysis, design, and architecture of new features and components Who we're looking for\nPrior experience as an Android Developer Can write clean, maintainable, and efficient code in Kotlin and Jetpack compose Experience practising CLEAN architecture Friendly, approachable, and skilled in relationship management Committed advocate of our inclusive culture, celebrating diversity and ensuring that everyone feels they belong Enjoy pairing and working closely with other developers Strong understanding of Android development and its lifecycle Experience with GraphQL APIs Experience with Analytics, A/B experimentation, and third party SDKs Knowledge of modern architectural patterns and design principles.\nUnderstanding of CI/CD pipelines and automated testing frameworks.\nStrong communication and collaboration skills.\nProactive, self-motivated, and able to manage the competing demands of multiple projects Align and collaborate with Android app developers to maintain feature parity across the two applications Demonstrate interest in learning new tools and technology A constant desire to learn and adapt to new technologies and challenges.\nBachelor's degree in Computer Science, Engineering, or a related field (or equivalent work experience) The REA experience\nThe physical, mental, emotional and financial health of our people is something we'll never stop caring about.\nThis is a place to learn and grow.\nWe're committed to your development – both professionally and personally.\nYour experience with us is something we take seriously.\n\nWe offer:\nA hybrid and flexible approach to working Flexible parental leave offering for primary and secondary carers Programs to support mental, emotional, financial and physical health & wellbeing Our Because We Care program offers employees volunteering leave, community grants, matched payroll giving and our Community Café donates 100% of revenue to charity.\nHack Days so you can bring your big ideas to life Performance recognition programs because hard work should never go unnoticed Our commitment to Diversity, Equity, and Inclusion\nWe are committed to providing a working environment that embraces and values diversity, equity and inclusion.\nWe believe teams with diverse ideas and experiences are more creative, more effective and fuel disruptive thinking - be it cultural and ethnic backgrounds, gender identity, disability, age, sexual orientation, or any other identity or lived experience.\nWe know diverse teams are critical to maintaining our success and driving new business opportunities.\nIf you've got the skills, dedication and enthusiasm to learn but don't necessarily meet every single point on the job description, please still get in touch.\n\nJoin our Talent Neighbourhood\nKeen to be part of REA but didn't find a perfect match with this opportunity?\nPerhaps the timing isn't right?\nYou should join our Talent Neighbourhood\n\nBy joining, you will receive information about our working culture and life at REA, industry updates from various areas of our business, invites to our events or materials to help you succeed in interviews at REA.\nIn addition, our recruiters will reach out to you if there's a role that matches your interests, skills and aspirations.\n\nUpload your details today\n\n#LI-HYBRID\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-3030b35101645a34450acf2b2e5f9c9e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXZlbG9wZXIgLSBNb2JpbGUiLCJjb21wYW55X25hbWUiOiJUaWRlcmkgSm9iYsO2cnNlIiwiYWRkcmVzc19jaXR5IjoiQXVzdHJpYSIsImh0aWRvY2lkIjoiNHRIMHBBMFNmOWFrZGsxU0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRWFZ6ZEhKcFlRIn0="
        },
        {
            "title": "Buscojobs | Mobile Applications Developer",
            "company_name": "Tideri Jobbörse",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=eRnffMZeHFnSI_ajAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQoCMRBAUWz3CNpMLZiIYKONK4Ig2NkvSRyys8RMyGRlC4_iObyAF9M0v_uvec-aw3EUxwNbgRdc2VJAaFMK5EwhjgInfGLghBlWcGELgia7HjjCmdkHnO_7UpLstBYJykv5f045fmiOaHnS1a7ppDcZUzAFu812PakU_XJxoztmqrL9frIgUIR2lJLJ_ACBiCN0nwAAAA&shmds=v1_AUFQtOM52uPDp7H_nUhF5qpcFBzRes7O7ildC3tPP6RUHel9AQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=eRnffMZeHFnSI_ajAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44d0303e0005157457c0d54b6978218b882f8b66e1bc0f79aa1.gif",
            "extensions": [
                "11 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "11 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "swipeJobs is a fast-growing, disruptive, and award-winning staffing platform that is transforming the way people find work and businesses manage their workforce.\nOur platform connects job seekers with employers, allowing businesses to easily fill their staffing needs.\nWe are slowly becoming the stand-alone market leader in the US market and are looking for the right professional to join us on this exciting journey.\n\nWe are looking for a skilled Mobile Application Developer to drive the development of our mobile platforms.\nYou'll work closely with cross-functional teams including product, design, and backend engineers to create intuitive, user-friendly apps for both iOS and Android.\nYour work will directly impact thousands of users and will be central to expanding our mobile offerings.\n\nKey Responsibilities:\nDesign, develop, and maintain high-quality mobile applications for iOS and Android Collaborate with the product and UX/UI design teams to implement new features and improve user experience Work with backend developers to integrate APIs and ensure seamless app performance Debug, troubleshoot, and optimise mobile applications for maximum performance Stay updated with the latest industry trends, tools, and technologies to continually improve our mobile platforms What We're Looking For:\nProven experience in mobile application development (iOS and/or Android) Proficiency in Swift, Kotlin, Flutter, or React Native (TypeScript) Strong understanding of mobile UI/UX best practices Experience with RESTful APIs and third-party libraries integration Knowledge of mobile application architecture, design patterns, and performance optimisation Familiarity with Agile development methodologies and version control systems (Git) Problem-solving mindset with attention to detail and a focus on delivering exceptional user experiences Why swipeJobs:\nA chance to work on a market-leading US software product End-to-end exposure to the full software development life cycle Working in a start-up environment with modern offices located in North Sydney A flat organisational structure where everyone is always accessible Operating in a fast-paced and dynamic environment that provides exciting challenges daily A chance to work on a modern technology stack that is cutting edge even for the US Food is provided throughout the day whilst working in the office including a free lunch Regular social events in and outside the office If you are talented, driven and interested in joining us in our journey; we would like to hear from you.\nPlease click apply now\n\nswipeJobs is an equal opportunity employer.\nWe celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nFor more information about swipeJobs and our services, visit swipejobs.com .\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-76568d1f02e7d97812ef30187632fcc2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJCdXNjb2pvYnMgfCBNb2JpbGUgQXBwbGljYXRpb25zIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlRpZGVyaSBKb2Jiw7Zyc2UiLCJhZGRyZXNzX2NpdHkiOiJBdXN0cmlhIiwiaHRpZG9jaWQiOiJlUm5mZk1aZUhGblNJX2FqQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFYVnpkSEpwWVEifQ=="
        },
        {
            "title": "Sandbox Innovation Sdn. Bhd. | Senior Mobile App Developer/Specialist",
            "company_name": "Tideri Jobbörse",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=L93d6d9RwR35OJ0sAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVz7CLrcLJiI4KKTIoiCUx0FSdqjOYl3IRelg88l7r6YdfnH768-o-pSO2699HBglqcrJAx1ywa2oTXwghqZJMNJPEWETUqwwydGSZhtnbAhF0kLzOAoHhRdbgIMxF6kizheh1KSrqxVjabTMviNaeRuhXGY2pt4_eeqwWVM0RW8Lpbz3iTuppMztZjpL_vvOysCMWweWjK5H326bp27AAAA&shmds=v1_AUFQtONdWneLaWvZMi9ogKdJZ5EZ5ZSOJeRlagN_VAEzCJVKaA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=L93d6d9RwR35OJ0sAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850811e34dfc3cd5274103/images/ad9cc95f4d1cd44deac9d5f22208354ab83835a9f8bd1ce14124717bdbd1e772.gif",
            "extensions": [
                "18 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "18 days ago",
                "schedule_type": "Full-time"
            },
            "description": "We are a dynamic FinTech company headquartered in Australia, now expanding our footprint to Malaysia.\nSpecializing in innovative payment and remittance solutions.\n\nWhy Join Us?\n\nYoung & dynamic workplace & culture (with office recreational amenities provided) Progressive career prospects Well rewarding project contributions Responsibilities:\nDevelop, test, and deploy high quality mobile apps for Android/iOS with a focus on performance, scalability, and reliability.\nCollaborate with product managers, designers, and developers to deliver tailored FinTech/Payments/Remittance solutions.\nImplement responsive design, accessibility, and security best practices.\nStay updated on mobile development trends and integrate new tools to improve efficiency.\nParticipate in code reviews, debugging, and troubleshooting to maintain code quality.\nOptimize mobile development processes for productivity and workflow efficiency.\nDesign scalable mobile applications using native and/or Flutter frameworks.\nManage priorities to ensure timely project delivery.\nRequirements:\nEducational Background: Bachelor's degree in Computer Science, Information Technology, or a related field.\nProfessional Experience: 6–8 years in mobile app development, specializing in Android (Java, Kotlin) or iOS (Swift).\nFlutter experience is a plus.\nTechnical Skills: Proficiency in Android SDK, React Native, or Flutter.\nExpertise in mobile UI/UX design, RESTful APIs, and app optimization.\nStrong skills in Git, API integration, debugging, and testing.\nCore Skills: Required: Flutter, Java, Swift; programming and system analysis skills are a plus.\nStrong communication in English (Mandarin/Malay is a bonus).\nProven ability to collaborate with cross-functional teams.\nPriority considering candidate(s) with 30 days notice period or less.\nHow do your skills match this job?\nSign in and update your profile to get insights.\n\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-046617262d43545d6e99460bbd4ecba1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTYW5kYm94IElubm92YXRpb24gU2RuLiBCaGQuIHwgU2VuaW9yIE1vYmlsZSBBcHAgRGV2ZWxvcGVyL1NwZWNpYWxpc3QiLCJjb21wYW55X25hbWUiOiJUaWRlcmkgSm9iYsO2cnNlIiwiYWRkcmVzc19jaXR5IjoiQXVzdHJpYSIsImh0aWRvY2lkIjoiTDkzZDZkOVJ3UjM1T0owc0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRWFZ6ZEhKcFlRIn0="
        }
    ]
}