{
    "search_metadata": {
        "id": "678508101c208be6aa10ed27",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/4988ef185d58c358/678508101c208be6aa10ed27.json",
        "created_at": "2025-01-13 12:33:20 UTC",
        "processed_at": "2025-01-13 12:33:20 UTC",
        "google_jobs_url": "https://www.google.at/async/callback:550?q=iOS+developer&uule=w+CAIQICIHQXVzdHJpYQ&udm=8&fc=ErcCCvcBQUpHOUprTU13WHkxdUw3RWNlWWthY2M0NU5GZ0lFYklmQV9mWlF1NVoySkJKLUZCb0hoYl93ZWNtWGR3X3B4TV8wWDNLXzVXbDBEd2RmaHN6YlFfdWxzaTVLU1I3RTF5b1hBQWdzS29lUG44MWI3eVhDLWN5aGhCelQ0UENtSjZVNVdHZGhqZVcwZGtGeUNQeUNmRWRfeG5iTVcwSUZxNnJWaXlzeWQ4S1NrZUQ2S1ctWGxLREdxcU9oaDNfQy1MWFpnY01OX0tUbEZTaUFlSVZMcGo0NDB2MXVLb2ZSbi1mZ0YyRHF2dE5UaE12YU05cjYwYjVHOBIXRHdpRlpfV0NQSWZJd3QwUGhvWE15UTQaIkFGWHJFY3BZclpFc01iZ3AtM1J5TnNaTE1TdHhYeWJwS0E&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/4988ef185d58c358/678508101c208be6aa10ed27.html",
        "prettify_html_file": "https://serpapi.com/searches/4988ef185d58c358/678508101c208be6aa10ed27.prettify",
        "total_time_taken": 0.43
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Austria",
        "location_used": "Austria",
        "google_domain": "google.at",
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJUVTEzV0hreGRVdzNSV05sV1d0aFkyTTBOVTVHWjBsRllrbG1RVjltV2xGMU5Wb3lTa0pLTFVaQ2IwaG9ZbDkzWldOdFdHUjNYM0I0VFY4d1dETkxYelZYYkRCRWQyUm1hSE42WWxGZmRXeHphVFZMVTFJM1JURjViMWhCUVdkelMyOWxVRzQ0TVdJM2VWaERMV041YUdoQ2VsUTBVRU50U2paVk5WZEhaR2hxWlZjd1pHdEdlVU5RZVVObVJXUmZlRzVpVFZjd1NVWnhObkpXYVhsemVXUTRTMU5yWlVRMlMxY3RXR3hMUkVkeGNVOW9hRE5mUXkxTVdGcG5ZMDFPWDB0VWJFWlRhVUZsU1ZaTWNHbzBOREIyTVhWTGIyWlNiaTFtWjBZeVJIRjJkRTVVYUUxMllVMDVjall3WWpWSE9CSVhSSGRwUmxwZlYwTlFTV1pKZDNRd1VHaHZXRTE1VVRRYUlrRkdXSEpGWTNCWmNscEZjMDFpWjNBdE0xSjVUbk5hVEUxVGRIaFllV0p3UzBFIiwiZmN2IjoiMyJ9"
    },
    "jobs_results": [
        {
            "title": "Senior Django+Angular Developer (Full-Stack or FE + BE)",
            "company_name": "iRonin - Web DevOps Mobile Developers: Ruby on Rails Elixir Phoenix iOS AWS",
            "location": "Austria",
            "via": "StudySmarter - Talents",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=D3o41LTaWyLctQh_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0WPQUvDQBCF8dqf4GmOamkigpd6ipgWBK0kYI9lNgybqdOdZWcj8Qf7P9ycvDx48Pjee6vfq9V7T4E1wcsZg9d1E_wkWCx9k2ikBDe7SWTTZxy-oOR2Lazhub2FDbyqAyNMwwgaYK_qha6fxpyjbevaTCpvGTMP1aCXWgM5neuzOlvkZCMmioKZTg-P93MVg7_75E4Dh8I-kls2HKLBmzoW-l9kW-gm97N0dshi0ArPnOBj1HJlBj700Bx7KJxmspwY_wAGd_C46AAAAA&shmds=v1_AUFQtOOST3ny_AJsykOF4ZnyqglRGPV57hqusG-YTdr5kUWHDg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D3o41LTaWyLctQh_AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior Django+Angular Developer (Full-Stack or FE + BE)\n\nRemote\n• We are seeking two experienced developers to enhance our legacy product catalog application—a critical platform that bridges communication between data providers and recipients.\n• You’ll be instrumental in developing new features that allow providers to input product data with both standard and custom attributes. After administrative verification, this data becomes accessible via APIs to entities like government agencies, e-commerce companies, and various businesses across multiple sectors.\n• Collaborate with our Poland-based team to make a significant impact on the efficiency and quality of data exchange in diverse industries.\nYour Profile\n• Experience: Minimum 5 years in software development.\n• Expertise: Full-Stack Developers preferred but we’re open to specialists in Frontend (Angular) or Backend (Django).\n• Frontend skills: Proficiency in Angular (v18), experience with NgRx for state management.\n• Backend skills: Strong knowledge of Django (v4.2), RESTful APIs, PostgreSQL.\n• Experience with AWS deployment and CI/CD pipelines (Jenkins).\n• Familiarity with addressing technical debt in legacy systems.\n• Quality Focused: Commitment to high code quality, including writing tests and participating in mandatory code reviews.\n• Communication: Fluent in English and/or Polish.\n• Availability: Able to start ASAP, working full-time during standard European hours.\nOur offer\n• Flexible working hours . The most important thing for us is the success of the project and excellent communication, which translates into the satisfaction of all team members. If these assumptions are met, working hours don’t matter!\n• 100% remote work . We have been working remotely since the very inception of our organization over a decade ago. We know how to do it, and we’ll be happy to put you into this mode!\n• Option to work from an office . Whether you’d like to work from an office a few times a month or full-time we’ve got you covered, as we do in Rzeszow, Warsaw and Wroclaw.\n• Stable cooperation. We run long-term projects. We have been working mainly with clients from the US and Europe for the past two decades.\n• Paid leave . Our B2B contracts are flexible and can include paid time off.\n• Benefits+ . Standard benefits such as Multisport card, premium medical package, group insurance and more!\nAbout us\n\niRonin , or IT Samurai , is an IT professional striving to continuously improve their craft and provide IT services at the highest level . This concept holds true in every team of our company, which has been on the market since 2010 .\nWhy us?\n\nJoin an experienced and close-knit team and have an impact on the development of our organization. We offer a professional and friendly atmosphere, where unnecessary procedures are kept to a minimum.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "StudySmarter - Talents",
                    "link": "https://talents.studysmarter.de/companies/ironin-web-devops-mobile-developers-ruby-on-rails-elixir-phoenix-ios-aws/senior-djangoangular-developer-full-stack-or-fe-be-847280/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGphbmdvK0FuZ3VsYXIgRGV2ZWxvcGVyIChGdWxsLVN0YWNrIG9yIEZFICsgQkUpIiwiY29tcGFueV9uYW1lIjoiaVJvbmluIC0gV2ViIERldk9wcyBNb2JpbGUgRGV2ZWxvcGVyczogUnVieSBvbiBSYWlscyBFbGl4aXIgUGhvZW5peCBpT1MgQVdTIiwiYWRkcmVzc19jaXR5IjoiQXVzdHJpYSIsImh0aWRvY2lkIjoiRDNvNDFMVGFXeUxjdFFoX0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRWFZ6ZEhKcFlRIn0="
        },
        {
            "title": "Ios Engineer",
            "company_name": "Australian Broadcasting Corporation",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=V5lJqvJF1_cVq8kuAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2NQQoCMQwA8bpP8BTwJtiK4EVPKiL6iSVbQ7dSk5JE8B2-2NXLnIaZ7jPrFlcxOHMuTKSwgpsMYISaRhCGi0iuNN-P7s12MZrVkM3RSwpJnlGYBnnHhwz2Q28jKrWKTv1mu36HxnkZDi9zxVqQ4aiC94TmhTOcRJvo1JpGheGvFfwCdhUgSpUAAAA&shmds=v1_AUFQtOO-9ygnQlBICI1wbVdAtvdklmaUdztkWvaToVR6CzuX_Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=V5lJqvJF1_cVq8kuAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530ea6aba36c4669d90573893472d192452562d7249fdde5c1db6.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Apply now Job no: 504406Work type: Contract Full TimeLocation: VariousCategories: IT/Technology About the ABC The ABC is the nation's most trusted and independent source of Australian conversations, culture, and stories.\nWith over 4,000 employees from diverse backgrounds across over 50 locations around Australia and overseas, we are proud to create, curate and deliver high-quality content that informs, educates and entertains Australian communities.\nAbout the Team Whether it's staying informed of the latest breaking News, bringing some great TV on iview, streaming the Hottest 100 on the triple j app, or entertaining the kids with our ABC Kids app, the ABC's Digital Product offerings are some of Australia's most loved and most used platforms.\nWe operate as a united, cohesive mobile team, that has a keen focus on quality, automation, data driven decisions, empowerment and teammate-ship.\nJoin a dynamic close-knit team exploring how emerging mobile technologies can provide rich, engaging & dependable mobile apps to the Australian public.\nAbout the Role This exciting opportunity will have you working within the mobile app engineering team on a wide range of apps.\nWe're seeking an engineer that believes in quality software development practices such as clean code, automation build pipelines & testing, continuous integration, agile software development all with a pragmatic approach to providing value to our end users.\nOur team culture is founded on respect, open-mindedness, growth and transparency and in turn would be seeking a great teammate willing to work alongside others.\nYou will have the opportunity to: Develop high quality & engaging user facing features and experiencesContribute as part of a high performing team to the analysis, design and development of complex, re-usable components for use across our mobile applicationsChampion a high level of awareness of best practice in the industry for software engineering, particularly in areas such as stability, performance, security and accessibilityMentor and help grow your fellow teammates career paths technically and non-technicallyAbout You You have a passion for new and emerging technologies, and solid fundamentals in software engineering to explore possibilities in these areas in an impactful and sustainable way.\nYou will have demonstrated strengths in the following:\nDeveloping scalable, complex and high-performing iOS applications in Swift.A strong and keen focus on clean codeAutomated testing and setting up/maintaining automation pipelines for CI/CDStrong capability in core iOS API's, frameworks and featuresEffective navigation & mitigation of production issues with prompt time to resolutionAble to collaborate and communicate effectively in a creative, cross functional teamThe iOS release process and monitoring and working with stakeholders post releaseOur apps are built in Swift using the MVVM architecture and are comprised of a mixture of UIKit with more recent and new features being built in SwiftUI.\nHaving knowledge of these and the following patterns and frameworks is useful; SwiftUICombineReactive programmingTooling we use; BitriseFastlaneFirebaseBitbucketFor further information on this position please contact Jamie Nedved, Digital Talent Acquisition Lead via email We respectfully request that Recruitment Agencies do not submit applications for this position. In line with our focus on diversity, applications are strongly encouraged from Indigenous Australians, people from a range of cultural and linguistic backgrounds, people with disability and LGBTIQA+ individuals.\nThe ABC also aims to achieve a gender-balanced workforce.\nFor more information on inclusive employee networks within the ABC please refer to Life Page on ABC LinkedIn.\nAdvertised: 22 Nov 2024 12:00 AM E. Australia Standard TimeApplications close: 20 Dec 2024 5:00 PM E. Australia Standard Time\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-1cc87a6080f6fde9dc74f774984d9823?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJb3MgRW5naW5lZXIiLCJjb21wYW55X25hbWUiOiJBdXN0cmFsaWFuIEJyb2FkY2FzdGluZyBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkF1c3RyaWEiLCJodGlkb2NpZCI6IlY1bEpxdkpGMV9jVnE4a3VBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUVhWemRISnBZUSJ9"
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVz7CJ1uFmxEcNFJ1IpCp7qXpD3TSMyFuyv6Or6pdfm3_yu-i6JuwjBENC2mQAwNuRAR6jipIkNLD31bRjgnHxIiC6zgRg4ELfcjUIILkY9Y7kfVLDtjRGLlRa2GvurpZSiho495kpN_OhlnL0er2G2260-Vk1-W19MdjsSZeP5mNCQ4TKIc7A8PXT9jpAAAAA&shmds=v1_AUFQtONZ1v2YsnO20OO2CGF0dxP7Mlef6JwZyeDMyvhLkF4WQA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530ea9054a41c622187fb47f957b48b398e8bd8e23f29090e1e8c.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkF1c3RyaWEiLCJodGlkb2NpZCI6IlQxeHZ0bGpKbmNkMW91MGFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUVhWemRISnBZUSJ9"
        },
        {
            "title": "Buscojobs | Bykon | Sr. Ios Developer",
            "company_name": "Tideri Jobbörse",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=zr6jcE88fAgql2UlAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMQQrCMBAA8don6GXPgokIXtSLRRC96r0kcWlTYzbsplLBh_gSP-DHbC8zl2GKz6TYlZ04askKvKF83SkOvrCCEwkc8ImBEjIs4EwWBA27BobmSFQHnG6bnJNstBYJqpZssnfK0UNTREu9Hr8jKmkMYwomY7VaL3uVYj2fXf0N2Y9n-_uyIPgI-04ye_MHQCE2dJsAAAA&shmds=v1_AUFQtOMnJcqEVFh4gTFBqIq-7XB_qs8AVxY_aZjU8xxpNAEecA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=zr6jcE88fAgql2UlAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530ea260a323fe41b0880d5c530b4b1fcb6a602a486b723dd9226.gif",
            "extensions": [
                "11 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "11 days ago",
                "schedule_type": "Full-time"
            },
            "description": "In ByKon we're looking for an exceptional Sr. iOS Developer to join our fast-growing team.\nThis is an opportunity to work alongside world-class technology and data science experts paving the way for fast-paced career growth and learning.\n\nMain Responsibilities:\nDevelop the structure of the architecture and creation of views Translate concept design to iOS mobile user interface Take conceptual product and design ideas and turn them into valuable and delightful experiences for our users Ensure the performance, quality, and responsiveness of the application.\nRequirements:\n5 years of experience in iOS Development Bachelor's degree in Computer Systems Engineering or related field Advanced English Technical Skills:\nStrong knowledge of Swift programming language Strong knowledge of Clean Code and S.O.L.I.D principles Experience with architectures (MVVM, MVC, Singleton, Delegate, or related) Experience in UX Design, able to translate concept design into user interface on iOS mobiles Experience and knowledge using Git, JIRA, and Agile processes Skilled at writing Unit and Automation tests Knowledge of RX Swift and Pipelines Soft Skills:\nExperience in performance optimization of mobile applications Strong verbal and written communication skills Able to work independently and manage time effectively If you want to be part of ByKon's team, send us your resume to:\nJ-18808-Ljbffr\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-1487c44d138245ffed413f5858459b2a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJCdXNjb2pvYnMgfCBCeWtvbiB8IFNyLiBJb3MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVGlkZXJpIEpvYmLDtnJzZSIsImFkZHJlc3NfY2l0eSI6IkF1c3RyaWEiLCJodGlkb2NpZCI6InpyNmpjRTg4ZkFncWwyVWxBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUVhWemRISnBZUSJ9"
        },
        {
            "title": "Software Engineer, Ios Apps",
            "company_name": "Buscojobs",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=kvmIVJtiPs76wrHAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVw7OzndLJpIwUWnCiK6-gAlCWeaEu9C7op9A19bu_zTx998V0375Jd-XEW4UkyEWHdwZ4GuFIE9PNiDoKthACa4MceMm_OgWuRkrUg2UdRpCibw2zKh59mO7GVJL8N_XLJT7NvjYTaF4nZ9mSTwQiARdJNoTe4HLEvSlYoAAAA&shmds=v1_AUFQtONvvGoaaYmgmoz0iE0oWZrj1NDEoCVoP9EV4aYjVdjrWA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=kvmIVJtiPs76wrHAAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530ea65905ab19f917d6f96b730074ee92fb8f8f26a10317b33aa.gif",
            "extensions": [
                "12 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "12 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Software Engineer, iOS Apps\nFull Time, Hybrid, Chatswood, Sydney, Australia We are seeking a talented Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia.\nAs part of our team, you will contribute to the development and maintenance of mobile applications, revolutionizing the way users interact with advanced networked audio players.\nKey Responsibilities: Analyzing project requirements and devising effective solutionsImplementing innovative features to enhance user experienceTroubleshooting and resolving bugs in a timely mannerConducting thorough development testing to ensure high-quality deliverablesArchitecting and optimizing code and projects for optimal performanceCollaborating seamlessly with both local and remote team members across multiple locationsProviding valuable technical feedback and participating in code reviewsResearching the latest APIs, tools, and features to stay at the forefront of technologyUtilizing version control tools effectivelyManaging assigned tasks within Agile sprint cyclesRequired Skill Sets: Must Have: Minimum of 7 years of professional software engineering experienceAt least 4 years of hands-on experience in native iOS app developmentStrong understanding of the UIKit frameworkExperience with the SwiftUI framework and Objective-C programming languagesIn-depth knowledge of Xcode, including Projects, Targets, Instruments, and SimulatorSolid grasp of software design principles and patternsFamiliarity with version control systems such as SVN and GitExperience integrating third-party software libraries and frameworksProficiency in utilizing web service APIsThorough understanding of iOS Human Interface GuidelinesExcellent written and verbal communication skillsSelf-motivation and a proactive approach to problem-solvingNice to haves: Proficiency in C++ and Python programming languagesFamiliarity with dependency managers such as Swift Packages and CocoaPodsExposure to build systems like xcodebuild, CMake, and SConsProficiency in creating XCFrameworksExperience with automated testing using XCTestKnowledge of tools like Jira, Fisheye, Crucible, and ConfluenceFamiliarity with Continuous Integration and Continuous Delivery tools (e.g., Jenkins)Exposure to Firebase for analytics, crash reporting, and messagingFamiliarity with Google Analytics, including Big Query and Data StudioExperience with app localization and localization management tools like LokaliseKnowledge of asset management tools such as Figma and ZeplinUnderstanding of data serialization formats like Protobuf, XML, and JSONFamiliarity with App Store Connect for publishing, analytics, and ratings/reviewsUnderstanding of the app code signing processExposure to cross-platform development frameworks like Xamarin, Flutter, and React NativeJoin Our Team: At our company, we are passionate about delivering immersive sound experiences that captivate and delight.\nWith our growing portfolio of innovative audio and video products, we continue to push the boundaries of design, technology, and performance.\nOur dedication to customer satisfaction has earned us industry recognition and loyal customers worldwide.\nWe offer a competitive salary, attractive incentive program, and a collaborative, open work environment.\nAs part of our team, you will have access to professional development opportunities, enabling you to expand your skills and expertise.\nTake the next step in your career and join us on our exciting journey to shape the future of sound technology.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-b81a3a2862623f861f8926e2deef707a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciwgSW9zIEFwcHMiLCJjb21wYW55X25hbWUiOiJCdXNjb2pvYnMiLCJhZGRyZXNzX2NpdHkiOiJBdXN0cmlhIiwiaHRpZG9jaWQiOiJrdm1JVkp0aVBzNzZ3ckhBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFYVnpkSEpwWVEifQ=="
        },
        {
            "title": "Senior Developer Advocate",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVy7uzjdLJgUwUWnoiA46gOUSzzSSJoLuWvpE_jc1uUfv7_5bpr2RTlyhRvNlLhQhe49s0clOMCDHQhh9QNwhjtzSLS7DKpFztaKJBNEUaM3nkfLmRwv9sNO_ullwEolrVR_PLWLKTnst8_1kye6okLM0E2iNeIPI5Sv-okAAAA&shmds=v1_AUFQtOOOlAhHoT6l_RZyF1Ty8fZDxV96ajz84KpbixxT6VXCsA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530eac159da545c0faee89dd1e8d9cc65a2b4bcb4c988b9394896.gif",
            "extensions": [
                "212K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "212K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: United States, EMEA\n\nAbout us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nRevenueCat helps apps of all shapes and sizes make more money across mobile, the web, and other platforms like Roku and Amazon. As a result, many different types of users log in to – and use – RevenueCat on a day-to-day basis. Product managers, support reps, lifecycle marketers, user acquisition specialists, data analysts, executives: The list goes on.\n\nNone of those users would make it onto RevenueCat unless a developer implements it first. And for smaller apps, developers are these users: They do the marketing, provide support, interpret the performance data, make pricing and packaging decisions, and more.\n\nWe’re looking for a Senior Developer Advocate to help ensure these developers are successful when using RevenueCat. You’d join forces with our current Advocate, and guy you might have seen walking around Seoul in the rain, Charlie Chapman. We’re specifically looking for someone with strong skills in producing written educational content targeted at developers that is technical but engaging. Your work will educate existing RevenueCat users, attract new search traffic, and position RevenueCat as the go-to resource when implementing in-app purchases across platforms.\n\nWhat you’ll be responsible for\n\nYour primary responsibility will be creating high-quality, developer-focused content focused on monetization and in-app purchases. This includes both scenarios where developers use RevenueCat to solve for these use cases, as well as alternative implementations.\n\nExamples of the type of content we’d expect you to produce include blogpost with titles like:\n• \"Migrating a native subscription app to Flutter: A step by step plan\"\n• \"Implementing your first subscription with RevenueCat: Disable ads for paid users\"\n• \"How to detect and highlight the platform of purchase for cross-device subscribers\"\n• \"Adding a multi-tier subscription to your Expo app\"\n\nIn addition to writing, you’ll:\n• Speak at conferences, webinars, and other events to share insights and represent RevenueCat\n• Record videos and collaborate on webinars to help developers implement and succeed with RevenueCat\n• Work cross-functionally to develop resources that support developers using RevenueCat\n\nWithin the first month, you’ll:\n• Learn RevenueCat inside and out\n• Familiarize yourself with our developer community and how to engage them\n• Have produced your first pieces of RevenueCat content\n\nWithin the first 3 months, you’ll:\n• Collaborate with Charlie on a joint content strategy playing to both your strengths\n• Independently research and develop content to fill current gaps in our documentation and other educational efforts\n• Repurpose existing content into new formats (e.g., blog posts into videos) to expand our reach\n\nWithin the first 6 months, you’ll:\n• Represent RevenueCat at industry conferences and webinars, delivering talks and engaging with developers\n• Support product launches with technical content (written or video)\n\nAfter 12 months, you’ll have:\n• Become a fixture across the developer community, having become synonymous with RevenueCat and in-app monetization for Android, Flutter, and/or React Native\n• Found new and novel ways to help us engage developers (think Shipaton, App Store Rejection socks, and similar initiatives)\n\nAbout you\n\nYou’re passionate about teaching and helping developers thrive. You’re deeply experienced in app development, particularly subscription apps, whether as part of a team or through indie projects (preferably both).\n\nWhat you’ll need to be successful\n• 5+ years of experience in app development or developer-focused roles, ideally in a subscription app environment, with a deep understanding of at least one major mobile development platform (Android, Flutter, React Native preferred; iOS a strong alternative) and the ability to learn and write about others\n• Strong independent project management skills, with the ability to manage multiple content initiatives, events, and deadlines across time zones without constant oversight\n• Excellent technical communication skills, capable of translating complex technical concepts into accessible and engaging written, video, and spoken formats for developers\n• A passion for teaching and empowering developers, with the ability to create content that educates and inspires action, including blog posts, tutorials, and videos\n• Proven ability to learn and explain new technologies, with expertise in Android development, Flutter, or React Native preferred (experience with iOS development is a plus if paired with a demonstrated ability to adapt to and write about other platforms)\n• Proven experience in producing content for a developer audience, preferably in a professional capacity as a developer advocate, but we’d consider exceptional candidates that have written, recorded video, and have spoken at conferences targeted at developers as a hobby or side-project\n• Resourcefulness and adaptability, with a problem-solving mindset to navigate the challenges of engaging a global developer community\n• Outcome-driven approach, ensuring your efforts lead to measurable impacts, such as increased content engagement, developer onboarding, and community growth\n• Comfort with a fully remote, asynchronous work environment, and tools like Notion, Zoom, Slack, and Linear. You’ll need to thrive in an environment that balances collaboration with ample time for focused, deep work\n\nWe’re looking for someone who embodies our team’s core values of agency and intellectual curiosity: taking initiative, solving problems, and continually learning to better serve our diverse developer audience. Regular travel may occasionally be required for conferences, events, or team gatherings.\n\nWhat we offer:\n• $212,000 USD salary, regardless of location\n• Competitive equity in a fast-growing, Series C startup backed by top-tier investors, including Y Combinator\n• 10-year window to exercise vested equity options\n• Fully remote and flexible work environment\n• 4-5 weeks of suggested time off annually for mental, physical, and emotional recharge\n• $2,000 USD for workspace setup and $1,000 USD annual stipend for continuous learning\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.\n\nThis offer from \"RevenueCat\" has been enriched by Jobgether.com and got a 90% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/674cc14db10568bbc7b1e688-senior-developer-advocate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGV2ZWxvcGVyIEFkdm9jYXRlIiwiY29tcGFueV9uYW1lIjoiUmV2ZW51ZUNhdCIsImFkZHJlc3NfY2l0eSI6IkF1c3RyaWEiLCJodGlkb2NpZCI6Ing5VE1pUHBRbFowQ2xtbV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUVhWemRISnBZUSJ9"
        },
        {
            "title": "Apple Inc. | Ios Engineer",
            "company_name": "Buscojobs",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=bjIOPrORmpCUaDotAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAAUFw7OzndLJgUwUWnCiLtT5QkHEkk3oXcFTq49r-ly5tetx26fqi1IIwUDPxgZIEXxUyIDS4wsQdB10ICJngzx4KnR1KtcrdWpJgo6jQHE_hrmdDzaj_sZWeW5BrW4hTn661fTaV4Pj4XCbwXyATDItqy-wP29YgsiAAAAA&shmds=v1_AUFQtONa3KyxfK_5qiJFCDLLkNuy6p-Mqb5GNm7wDxDtUWqM6g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=bjIOPrORmpCUaDotAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530eac42717f0a56f6ec64d9177e40df2327d99fa8c29994fdd7d.gif",
            "extensions": [
                "8 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "8 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Imagine what you could do here.\nAt Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly.\nBring passion and dedication to your job and there's no telling what you could accomplish\nWhen the App Store was first introduced it launched a cultural and economic phenomenon that changed the way people live, work and play.\nThese engineers continue to innovate the platform, now home to over 1.5 million apps and billions of users, to scale the service and help customers find the apps they love.\nWe are seeking a proactive, highly motivated engineer to share their mastery in building uniquely beautiful and robust user interfaces with Apple's frameworks.\nDescription The App Store team is looking for a top-tier UI engineer to build features that help developers showcase apps for customers to discover.\nMembers of the team have the opportunity to work cross-functionally with design, product, OS, and services engineering teams to deliver the App Store experience across all of Apple's platforms.\nMinimum Qualifications Bachelor of Computer Science or equivalent work experienceIn-depth development experience at the application and user interface level with Swift or Objective-CExperience with Apple frameworksStrong object-oriented programming and design skillsPreferred Qualifications Experience with networking protocolsExperience designing and maintaining APIsExperience with best in class user interface designsExperience with asynchronous programmingInvestigate requirements for projects independentlyAdvocate for outstanding development practicesExcellent problem-solving, critical thinking, and interpersonal skillsEager to learn new skills and tackle new tasksWork closely with a multi-functional team, handling expectations and ultimately delivering great work on time #J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-319cf8c3e648040b8ae7e87154c4ab9c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsZSBJbmMuIHwgSW9zIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQnVzY29qb2JzIiwiYWRkcmVzc19jaXR5IjoiQXVzdHJpYSIsImh0aWRvY2lkIjoiYmpJT1ByT1JtcENVYURvdEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRWFZ6ZEhKcFlRIn0="
        },
        {
            "title": "Senior Software Engineer, Ios",
            "company_name": "Fastiko",
            "location": "Austria",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.at/search?ibp=htl;jobs&q=iOS+developer&htidocid=BMe2gaorhnkq-JW3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsRIBMRAA0NFeqVRtbUiMoaFSYGjvA26SzEpC7Gaya9wf-G00r3zdZ9JteqTMDXq-6ds1hCPFTIhtARcWWMKVPQi6FhIwwZk5Fpztk2qVnbUixURRpzmYwE_LhJ5He2cvfwZJv7MWpzist6vRVIrz6cmJ5gdDJji8RFt2X7OQbRSKAAAA&shmds=v1_AUFQtOM4CshXB5HtfIqgkHtjQuHCeACi0wnPJ2YfwRqnyo8E1Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=BMe2gaorhnkq-JW3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508101c208be6aa10ed27/images/7a8ec94fb19530eaadb76e822406c3004794d06e1f287e59505469333b53dc8e.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About the Team DoorDash is building the world's most reliable on-demand, logistics engine for delivery. We are seeing hypergrowth and expanding ouroffices globally We are looking for Founding Engineers to join ourTeam and to work on building and maintaining a large scale 24x7 global infrastructure system that powers DoorDash's 3-sided marketplace of Consumers, Merchants and Dashers. About the Role We're looking for multiple product-focused iOS engineers who love building… no -- Principals only. Recruiters, please don't contact this job advertiser.no -- Please, no phone calls about this jobno -- Reposting this message elsewhere is NOT OK.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://at.trabajo.org/stellenangebot-3127-e5bf3fc5e0e782a9adef763ddb80c80a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIsIElvcyIsImNvbXBhbnlfbmFtZSI6IkZhc3Rpa28iLCJhZGRyZXNzX2NpdHkiOiJBdXN0cmlhIiwiaHRpZG9jaWQiOiJCTWUyZ2Fvcmhua3EtSlczQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFFYVnpkSEpwWVEifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJUa1U1VUZwSGQyUTRXVkI1YkdkNGNVdFVObEU1V2xOUk1tWlhkRGQ1VVZwWllrWXRTRWxWZVRaRk1tNUNZMVpWZGtOQ1NWUnpXVzFOV1ZKUmNFeE9NRzQzUTBkWVEzSllaRGRqVEVkQldVeFNkV1F4U2taU1IwVmtSWE5CWDNkc1FWcDBaRWN3VFVrdGVFbDFXbDl3TUVzNVZrUTNNbEI1YlZvNGNEZHBhV0kwVTNjdE9UQlNiVnBqYzNaV1kybEVWME5wV1hWMlkxVklYM0pHYlRGc1NGSnBkSGsxWjBnNFNtSlBNMGxuVDJwVFNGRjViRGxmVHpKVGJrVXpPVmQ1Y3psM1pqSjVOVzVhY1VrNE1sSXROelpEVFVFeFYwdEJZVlZ2VDB0UU9HNTFVV0ZJWDJ4dWJXRnpVRmhpUW1weFFSSVhSVUZwUmxvdFltMUxjVWRyYVV4TlVHeE5lbWxyVVhjYUlrRkdXSEpGWTI5bU1EWm5UekJzTnpsUWRYRmZVMWMxZUdsUVNWTnFaMjFZTmtFIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.at&location=Austria&next_page_token=eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJUa1U1VUZwSGQyUTRXVkI1YkdkNGNVdFVObEU1V2xOUk1tWlhkRGQ1VVZwWllrWXRTRWxWZVRaRk1tNUNZMVpWZGtOQ1NWUnpXVzFOV1ZKUmNFeE9NRzQzUTBkWVEzSllaRGRqVEVkQldVeFNkV1F4U2taU1IwVmtSWE5CWDNkc1FWcDBaRWN3VFVrdGVFbDFXbDl3TUVzNVZrUTNNbEI1YlZvNGNEZHBhV0kwVTNjdE9UQlNiVnBqYzNaV1kybEVWME5wV1hWMlkxVklYM0pHYlRGc1NGSnBkSGsxWjBnNFNtSlBNMGxuVDJwVFNGRjViRGxmVHpKVGJrVXpPVmQ1Y3psM1pqSjVOVzVhY1VrNE1sSXROelpEVFVFeFYwdEJZVlZ2VDB0UU9HNTFVV0ZJWDJ4dWJXRnpVRmhpUW1weFFSSVhSVUZwUmxvdFltMUxjVWRyYVV4TlVHeE5lbWxyVVhjYUlrRkdXSEpGWTI5bU1EWm5UekJzTnpsUWRYRmZVMWMxZUdsUVNWTnFaMjFZTmtFIiwiZmN2IjoiMyJ9&q=iOS+developer"
    }
}