{
    "search_metadata": {
        "id": "6785081d03318a8d2663adcf",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/2ddabbc0da937af5/6785081d03318a8d2663adcf.json",
        "created_at": "2025-01-13 12:33:33 UTC",
        "processed_at": "2025-01-13 12:33:33 UTC",
        "google_jobs_url": "https://www.google.ca/async/callback:550?q=iOS+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EswCCowCQUpHOUprT3dBY0ZKRzZWOG5meXpTQVVMUmNFbW5ELXdYdlZ0X19yemNaZzBnUEpnRk5QNHdOLW55RXFSNDJBT0NocUJPX3NNR0NqOEJ4V1ZyTWktUnFPVUkwZVlIb3ZPQXFTamxZTDJ0UFk4dDIxUC1rLXJrZGk2VEl6amE3QUFFR29XRFJOT2swdXRuWnE0SndSM1hTb0VyMzEzMEw3M1FpT3B3ZTZWT2FoTnlPZnk0X0d3Tk0xaWs2YzhJa0kteDV0UW16NEJjbHF6aC1jXzJ4cmVyQUJST3F3RFYwMnQzRk5Kc1BzQzJ1UG45bVY0cHQyMmhvMjhFUl92SllOWlAzMEZhNmliZ2FfVRIXSEFpRlo2S3hJWl9JcHRRUHRNQzVzQW8aIkFGWHJFY3JnaTM0SnNSM0Q2eUN2VHk1SjV6WEx3S2tKUXc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/2ddabbc0da937af5/6785081d03318a8d2663adcf.html",
        "prettify_html_file": "https://serpapi.com/searches/2ddabbc0da937af5/6785081d03318a8d2663adcf.prettify",
        "total_time_taken": 0.44
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.ca",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUM2RCWTBaS1J6WldPRzVtZVhwVFFWVk1VbU5GYlc1RUxYZFlkbFowWDE5eWVtTmFaekJuVUVwblJrNVFOSGRPTFc1NVJYRlNOREpCVDBOb2NVSlBYM05OUjBOcU9FSjRWMVp5VFdrdFVuRlBWVWt3WlZsSWIzWlBRWEZUYW14WlRESjBVRms0ZERJeFVDMXJMWEpyWkdrMlZFbDZhbUUzUVVGRlIyOVhSRkpPVDJzd2RYUnVXbkUwU25kU00xaFRiMFZ5TXpFek1FdzNNMUZwVDNCM1pUWldUMkZvVG5sUFpuazBYMGQzVGsweGFXczJZemhKYTBrdGVEVjBVVzE2TkVKamJIRjZhQzFqWHpKNGNtVnlRVUpTVDNGM1JGWXdNblF6Ums1S2MxQnpRekoxVUc0NWJWWTBjSFF5TW1odk1qaEZVbDkyU2xsT1dsQXpNRVpoTm1saVoyRmZWUklYU0VGcFJsbzJTM2hKV2w5SmNIUlJVSFJOUXpWelFXOGFJa0ZHV0hKRlkzSm5hVE0wU25OU00wUTJlVU4yVkhrMVNqVjZXRXgzUzJ0S1VYYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Developer - Tangerine",
            "company_name": "Scotiabank",
            "location": "Toronto, ON, Canada",
            "via": "Scotiabank Jobs",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=KIM7kx5fZN1HasRBAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQrCMBAAUFz7CU7nKrURQQQ7KggOdmj3colHGo13IRekv-LfqsvjVZ9FdeiJg2QIXQ9nelOURBk2MCB7yoHp96tYUMLsJhCGi4iPtGynUpIejVGNjdeCJbjGycsIk5XZPMTqn1EnzJQiFhp3--3cJPbrVe-kBLTITwgMg2ThIjV0txpOyHjHL12sehycAAAA&shmds=v1_AUFQtOPvWbAZHA7fSpv2iQ-UO0_wZCRZJc7CNNI41y1A35GuNQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=KIM7kx5fZN1HasRBAAAAAA%3D%3D",
            "extensions": [
                "23 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "23 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Requisition ID: 204334\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is and we continue to evolve on what it can be, using technology to create innovative, forward thinking banking solutions with our clients’ needs in mind. We are made up of high performing, curious, energetic and collaborative individuals who thrive in our high trust agile environment to deliver best in class solutions for our customers. We believe in giving people hands-on challenges and the responsibilities that come with them, allowing them to grow, evolve and create opportunities to build their career. Are you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\niOS Developer\n\nAs an iOS Developer, you'll be joining one of our teams that's rebuilding our mobile banking application. You will be contributing to the development of world-class digital products and experiences on the iOS platform that touch millions of Tangerine customers every day. We're looking to fill our team with influencers, makers, creators and leaders who are flexible, curious, adventurous, versatile and responsive; and who are ready to roll up their sleeves in a collaborative and productive environment to get things done. By joining our team, you will make an impact on our customers and the banking industry.\n\nIs this role right for you? In this role you will:\n• You dream in code\n• You spend your free time tinkering with new technologies or building apps on the side\n• You want to solve real problems that will flip a multi-billion dollar industry on its head\n• Interested in the impact that financial services technology can have on people’s everyday lives\n• Experienced in user-centered design\n• Eager to mentor, teach and share\n• Continuous integration and deployment makes you giddy\n• Knowledge of the latest and greatest approaches to Agile Technical Practices\n• You enjoy collaborating and working alongside people with different skillsets\n\nDo you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:\n• 5 or more years of iOS development (conceptualization, design, development and debugging)\n• Strong knowledge of the iOS platform, Swift, UIKit, Auto Layout and building UI programmatically\n• Bonus points for knowledge of RxSwift, SwiftUI and Combine\n• Familiarity with mobile architectural and design patterns\n• Experience with XCTest and unit-testing\n• Deep knowledge of iOS design best practices and Apple’s Human Interface Guidelines\n• Familiarity with mobile accessibility\n• Experience with building applications that consume RESTful APIs\n• Experience with tools such as Jira, Github and Confluence\n• Experience with debugging iOS applications and using Instruments\n\nWhat's in it for you?\n• Diversity, Equity, Inclusion & Allyship - We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow & participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability & veterans.\n• Accessibility and Workplace Accommodations - We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n• Upskilling through online courses, cross-functional development opportunities, and tuition assistance.\n• Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n• Community Engagement - no matter where you choose to work from; we offer opportunities for community engagement & belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\nWork arrangements: Hybrid\n\n#LI-Hybrid\n\nLocation(s): Canada : Ontario : Toronto\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
            "apply_options": [
                {
                    "title": "Scotiabank Jobs",
                    "link": "https://jobs.scotiabank.com/Tangerine/job/Toronto-Senior-iOS-Developer-Tangerine-ON-M2H0A1/586982017/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Akkodis",
                    "link": "https://www.akkodis.com/fr-ca/emplois/jobs/report-developer-senior-toronto/CA_EN_6_919740_1564536?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Air Canada - Careers",
                    "link": "https://careers.aircanada.com/jobs/14347915-senior-developer-customer-digital?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=c4f75e2ed80d80fb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Bitcoin-Devs-Company/Job/Senior-React-Developer-Trading/-in-Toronto,ON?jid=839f18efe3ff70f3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "CATS",
                    "link": "https://emergitel.catsone.com/careers/7701-General/jobs/16570268-RQ00217-Report-Developer-Senior?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.ca",
                    "link": "https://www.monster.ca/job-openings/software-developer-senior-toronto-on--d6223c3e-89d2-4fcb-a963-04ae5caa774e?mstr_dist=true&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Uvaro",
                    "link": "https://uvaro.com/jobs/j/6gPDmXfb/toronto/software-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAtIFRhbmdlcmluZSIsImNvbXBhbnlfbmFtZSI6IlNjb3RpYWJhbmsiLCJhZGRyZXNzX2NpdHkiOiJUb3JvbnRvLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJLSU03a3g1ZlpOMUhhc1JCQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "iOS Developer",
            "company_name": "Konrad Group",
            "location": "Hunter River, PE, Canada",
            "via": "Ladders",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=eWsQr6u6XnRlhKiSAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFz7CU43OIjURgQXO6pUdFD0A8q1PZpIvAu5tPQn_Gd1eevLPrNs4W5PONJIXgJFWMNFGlDC2FoQhkqk9zQvbUpB98ao-qLXhMm1RStvI0yNTOYljf6p1WKk4DFRvd1tpiJwv1pehSN2UEUZAjiG88Dpdz3cSDGH-ymHAzJ2-AVj9CxXkAAAAA&shmds=v1_AUFQtOPkLRU0-m3LbQtpVlB6fNRoRxifrIazmQUnqZVX14J-Sw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=eWsQr6u6XnRlhKiSAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9e81fa3bd3fc2046d1f7668ff276cd745a85e3ccbd1ae8dfc5.gif",
            "extensions": [
                "80,811–121,217 a year",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "80,811–121,217 a year",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who We Are\n\nKonrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of consumers around the world. We hire exceptionally smart, analytical, and hard working people who are lifelong learners.\n\nAbout The Role\n\nAs an iOS Developer you'll be tasked with working on iOS application development. Working within the software development team, your duties will require you to assist in the development of consumer and enterprise applications. This role is ideal for developers who feel confident in their technical ability and want to be a part of the highly-skilled and constantly improving development team at Konrad.\n\nWhat You'll Do\n• Write maintainable, testable, and performant software in collaboration with our world class team.\n• Participate in code review and perform extensive testing to ensure we deliver high quality software.\n• Research new technology and tools and share those findings with the team.\n• Communicate clearly and effectively with all members of our team.\n\nQualifications\n• Experience building iOS applications with Swift.\n• A strong command of important programming and computer science concepts.\n• Understanding of how mobile applications are built from end-to-end, including how they interact with server-side components.\n• Fundamental knowledge of core mobile principles (UI implementation, common development frameworks, REST APIs).\n• A working knowledge of common architectural patterns such as MVVM, MVP, MVC.\n• Great interpersonal skills - we work very closely together as a team and require a lot of communication.\n• A proactive personality, and a desire to deliver your best work.\n• A love for improving software development workflows and processes.\n\nNice To Have\n• Understanding of functional reactive programming and ReactiveX frameworks is a plus!\n• Experience with Objective-C.\n• Experience with or an understanding of newer approaches to networking, like GraphQL.\n• Other mobile development experience, such as Android development using Java or Kotlin, or cross-platform development with React Native, Flutter, Ionic, Xamarin, or Cordova.\n\nPerks and Benefits\n• Comprehensive Health & Wellness Benefits Package\n• Socials, Outings & Retreats\n• Retirement Planning\n• Parental Leave Program\n• Annual tech & travel allowance\n• Culture of Learning & Development\n• Flexible Working Hours\n• Work from Home Flexibility\n• Service Recognition Programs\n\nBonus Points\n\nHave you taken any courses at BrainStation? A lot of our design and development best practices and processes are taught during our courses - make sure to highlight this experience in your cover letter if you have!\n\nKonrad is committed to maintaining a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants, regardless of race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status will receive consideration for employment. If you have any accessibility requirements or concerns regarding the hiring process or employment with us, please notify us so we can provide suitable accommodation.\n\nWhile we sincerely appreciate all applications, only those candidates selected for an interview will be contacted.",
            "apply_options": [
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/ios-developer-konradgroup-hunter-river-pe_77762864?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiS29ucmFkIEdyb3VwIiwiYWRkcmVzc19jaXR5IjoiSHVudGVyIFJpdmVyLCBQRSwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJlV3NRcjZ1NlhuUmxoS2lTQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "iOS Developer",
            "company_name": "Push Interactions",
            "location": "Saskatoon, SK, Canada",
            "via": "Indeed",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=zv0RNfQqBNxN-VU9AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43OJXaiOCio4Kog0I_oFzj0UTjXcid0r_wl8U3vOo7qxbx2sGBPpQkU4ElnGUAJSw-gDAcRcZE810wy7p1TjW1oxpa9K2XlxOmQSb3kEH_9RqwUE5o1K83q6nNPNb17a0BTmxU0FsUVogMHeoTTYQb6C4N7JHxjj9tQYJ6kgAAAA&shmds=v1_AUFQtOMB4neGjLBGPL8GKnvRXrCzMW1XRoWW3PgDOVFDbKTiWQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=zv0RNfQqBNxN-VU9AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9e5bb9f49ec0b888aa0b38154436c674a4f84b5e5f4b246b9c.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Job Overview\nPush Interactions is seeking a Junior or Intermediate iOS Developer to join our team. We are looking for people who have a passion for delivering top-quality work on mission critical software. As a iOS Developer and part of our team, you will be responsible for creating iOS code mainly in Swift. Understanding of other languages like Objective-C are also useful. Push is a leader in custom mobile app development for iPhone and Android across a broad range of industries. The work for this job is in person at our Saskatoon office. Relocation may be required before starting work.\n\nResponsibilities\n\nYour job will be to deliver high-quality iOS code for our mobile applications for clients. You will in time also be looked upon to assist in other tasks such as mentoring other developers, assisting in planning and estimating projects, contributing ideas to improve our processes, and helping drive the team to hit deadlines – all while helping to deliver a quality applications to our clients. You will have the opportunity to contribute to many different projects that will challenge you and help hone your skills.\n\nTypical daily tasks may include\n• Creating a new or updating an existing iOS Application code\n• Developing a new features\n• Performing code reviews\n• Estimating on upcoming projects\n• Helping demo a new build to a client\n• Helping another developer solve a problem\n\nRequired Skills\n• 1+ years of iOS development experience\n• 2 years of software development experience\n• Strong understaffing of Swift\n• Drive to build and maintain quality software that is mission critical to our clients.\n• Ability to collaborate with a multi-disciplinary team\n• Initiative to deliver working software quickly and effectively\n• Enthusiasm to work in an iterative agile development process\n• Ability to think about long term maintenance when creating or maintaining software\n• Experience with Git\n• Familiarity with unit testing and test automation tools\n• Ability Stay up-to-date with industry trends and advancements in relevant server development technology\n• Experience consuming web services, including caching for offline usage\n\nEducation\n• Bachelor's Degree or higher (preferred)\n\nBonus Skills\n• Objective-C experience\n\nBenefits\n• Competitive salaries\n• Comprehensive health benefits\n• Performance based rewards and recognition\n• Personal development opportunities\n• Regular team events and parties\n• A team filled with enthusiastic developers\n• Casual dress\n• Dental care\n• Disability insurance\n• Extended health care\n• Life insurance\n• On-site parking\n• Paid time off\n• Vision care\n• Free drinks\n• Working with a team of skilled team members\n\nJob Types: Full-time, Permanent\n\nPay: From $50,000.00 per year\n\nBenefits:\n• Casual dress\n• Company events\n• Dental care\n• Discounted or free food\n• Employee assistance program\n• Extended health care\n• Life insurance\n• On-site parking\n• Paid time off\n• Vision care\n\nSchedule:\n• 8 hour shift\n• Day shift\n• Monday to Friday\n\nExperience:\n• iOS development: 1 year (required)\n• Software development: 2 years (required)\n\nWork Location: In person",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=4be00f4c5900b115&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiUHVzaCBJbnRlcmFjdGlvbnMiLCJhZGRyZXNzX2NpdHkiOiJTYXNrYXRvb24sIFNLLCBDYW5hZGEiLCJodGlkb2NpZCI6Inp2MFJOZlFxQk54Ti1WVTlBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Senior iOS Developer, Futures",
            "company_name": "Robinhood",
            "location": "Toronto, ON, Canada",
            "via": "Greenhouse",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=FD27BYUu-EoiDN1QAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAGYFz7CE43S21EdNFRUXCwYN1L2h5NJN4fcqn0RXxf8Ru-4rsodg2LRyJfN3TmDwdETiVdpjwlVlrTDR0p29Q7gtAVGAMvjy7nqAdjVEM1arbZ91WPt4Fwh9m80Om_Vp1NHIPN3G73m7mKMq7ogc6LAwbyQk8kSEZJ9b2kkxU72B_8gL0OmAAAAA&shmds=v1_AUFQtONkz6aTItngaXg5Ts_DA_bq22W0Lwtjn5XP2-c2NRBXxQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=FD27BYUu-EoiDN1QAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9e724a1244398ac8def9881f2d51eb0fa29bdda716170cd521.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About the team + role\n\nThe Futures team is introducing Futures trading as a new asset class on the Robinhood platform. We aim to be the best place for our customers to learn about Futures in a safe and accessible manner by building a streamlined, innovative and cost-efficient experience that our customers love and have come to expect from us. You'll be joining as a Senior iOS Developer where you'll contribute to the expansion of Robinhood's mobile experience for our customers! Come join us!\nWhat you’ll do\n• Work with a fast-growing team to revolutionize finance at speed and scale\n• Build smooth, stable, and elegant products with Swift and the newest iOS APIs\n• Mentor / coach other engineers & lead projects\n• Own features from inception to design, implementation, and launch\n• Work cross-functionally with Product Designers, Product Managers, Backend Developers, and Data Team\n• Work with Swift, RxSwift, UIKit, Custom Design System and Declarative UI Framework, Core Data, Bazel, VIPER-esque Architecture\nWhat you bring\n• At least 5 years of professional iOS development experience\n• Proficiency with Swift\n• Deep understanding of UIKit\n• Strong product sense and ability to collaborate with Product Managers and Designers\n• Excellent communication skills and passion for solving tough technical problems\n\nOur team is here to enable an inclusive and welcoming interview experience for all candidates. If you need additional assistance throughout the interview process related to a physical or mental condition, or if there is something our team can do to enable a more accessible experience at any time, please notify our team by completing this Applicant Accommodation Form.\n\nWe use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on September 19, 2024.\n\nPlease see the independent bias audit report covering our use of Covey here.",
            "apply_options": [
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/robinhood/jobs/6426363?gh_src=NaN&gh_jid=6426363&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/senior-ios-developer-futures/3643026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Robinhood/Job/Senior-iOS-Developer,-Futures/-in-Toronto,ON?jid=bc15e9dd97d28ae4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The Muse",
                    "link": "https://www.themuse.com/jobs/robinhood/senior-ios-developer-futures?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/senior-ios-developer-futures-at-robinhood-4087629538?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/thescore/senior-ios-developer-mobile-platform-b212ef3f/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/senior-ios-developer-payments-score-media-and-gaming-inc-6025424?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/7122994210437549206?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciwgRnV0dXJlcyIsImNvbXBhbnlfbmFtZSI6IlJvYmluaG9vZCIsImFkZHJlc3NfY2l0eSI6IlRvcm9udG8sIE9OLCBDYW5hZGEiLCJodGlkb2NpZCI6IkZEMjdCWVV1LUVvaUROMVFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Sr iOS Developer",
            "company_name": "Insight Global",
            "location": "Vancouver, BC, Canada",
            "via": "Insight Global",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=hNTTRSENUhLegYUCAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU63FaQmIrjoZoWii0PBtVzikURiLuRi6V_4y-IbXvNdNe1YINxHuNBMkTMV2MKNDQhhsR44wcDsIq1PvtYsR61FonJSsQarLL81JzK86Bcb-TeJx0I5YqVpf9gtKie3aa9JgvMVhsgGI4QED0yWPzOVDs59Bz0mfOIPhyP4SZIAAAA&shmds=v1_AUFQtOMbdrcjkcofqyXwSvUdT3EENMiozbAXJNgcwCUHqo42vg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=hNTTRSENUhLegYUCAAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Insight Global is looking for Sr iOS Developers to join a top Telecommunications company in Canada. This role is remote in Canada but requires the successful candidate to work PST hours.\n\nKey Responsibilities:\nDesign, build, and maintain efficient, reusable, and reliable code in Swift and Objective-C.\nOversee the use of Xcode and build process tooling, ensuring optimized and effective workflows.\nUtilize Instruments tools for memory management and debugging to enhance application performance.\nDevelop unit test cases to maintain code integrity and ensure robust performance.\nWork with version control systems, preferably Git/Github, for streamlined project management and collaboration.\nApply understanding of design patterns such as MVVM or MVI to deliver clean, modular code.\nLeverage tools like RxSwift, RxCocoa, and Dependency Injection (DI) to manage application states and dependencies.\nIntegrate third-party libraries and APIs as needed to extend functionality and improve user experience.\nManage deployments to the Apple App Store, maintaining compliance with app submission requirements (a plus).\nWork in an Agile environment with teams using Jira to manage project timelines and goals.\n\nWe are a company committed to creating diverse and inclusive environments where people can bring their full, authentic selves to work every day. We are an equal opportunity/affirmative action employer that believes everyone matters. Qualified candidates will receive consideration for employment regardless of their race, color, ethnicity, religion, sex (including pregnancy), sexual orientation, gender identity and expression, marital status, national origin, ancestry, genetic factors, age, disability, protected veteran status, military or uniformed service member status, or any other status or characteristic protected by applicable laws, regulations, and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please send a request to HR@insightglobal.com.\n\nTo learn more about how we collect, keep, and process your private information, please review Insight Global's Workforce Privacy Policy: https://insightglobal.com/workforce-privacy-policy/ .",
            "apply_options": [
                {
                    "title": "Insight Global",
                    "link": "https://jobs.insightglobal.com/find_a_job/british-columbia/job-390097/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTciBpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiSW5zaWdodCBHbG9iYWwiLCJhZGRyZXNzX2NpdHkiOiJWYW5jb3V2ZXIsIEJDLCBDYW5hZGEiLCJodGlkb2NpZCI6ImhOVFRSU0VOVWhMZWdZVUNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "iOS Developer",
            "company_name": "Venus Consultancy",
            "location": "Calgary, AB, Canada",
            "via": "Venus Consultancy",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=sGzTGkxNmgU8xzaUAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHsQrCMBAAUFz7CU43OIjURgQXO2kFwcVBcC3XeCSVeBdyqbQf4T-ry4NXfGbFor_e4ERvChIpwRou0oESJutBGM4iLtC89jlH3RujGiqnGXNvKysvI0ydjOYpnf5p1WOiGDBTu91txiqyWy3vxINCI6xDyMh2gp6hweAwTSUcjuUvjA_8AlxOsqaQAAAA&shmds=v1_AUFQtOMkaytE-VFVBMy9wSVvJqXIDFKiaSno6p6DTO_mX0SrvA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sGzTGkxNmgU8xzaUAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9ee5c4c0cee355dbe8920c5e4f70dc97c24a96e3ef8760693a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Responsibilities:\n• Design and build new iOS apps written in Swift & SwiftUI\n• Developing creative, innovative and practical mobile solutions\n• Estimating, tasking, and prototyping\n• Ensure the performance, quality, and responsiveness of applications\n• Collaborating with cross-functional team members on features, design, and implementation\n• Identify and correct bottlenecks and fix bugs\n• Help maintain code quality\n• Find new ways of bringing efficiency in the Development process\n\nMust Have Skills:\n• Proficient with Swift, and Cocoa Touch\n• Experience with iOS frameworks such as Core Data, Core Animation, etc.\n• Experience with AWS SDK\n• Experience with offline storage, threading, and performance tuning\n• Familiarity with RESTful APIs to connect iOS applications to back-end services\n• UI development with an understanding of Apple’s design principles and interface guidelines\n• Experience with 3rd party libraries & APIs – IBM Cloud / MFP, Social, Payment, Network, Crashlytics & Analytics.\n• Familiarity with Agile/ Scrum development process and continuous integration tools like Jenkins\n• Proficient understanding of code versioning tools such as Git, Mercurial or SVN\n\nNice to Have Skills:\n• Knowledge of other mobile development technologies is a plus.\n• Experience with Apple car play apps\n• Experience working on wearable technology, Camera, GPS, Maps and Sensors\n• Experience working with bi-lingual apps\n\nExpectations:\n• Must have 5 + Years of relevant experience\n• Must have hands-on experience & passion for mobile app development;\n• Must be eligible to work in Canada without restriction – we cannot support international candidates or VISA processes at this time;\n\nLocation: this candidate should be residing with in Calgary or should be willing to relocate to Calgary. These positions will require the candidate to visit the office premises post the current Pandemic situation.\n• Formal education in software development or equivalent experience;\n• Solid understanding of software development practices and design patterns;\n• Strong written and verbal communication skills in English.\n• Well-rounded knowledge of Agile principles and the flexibility to adapt your experience to new and evolving environments\n• Passion for well-designed products and not afraid to share and explain your ideas",
            "apply_options": [
                {
                    "title": "Venus Consultancy",
                    "link": "https://venushiring.ca/job/ios-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Iitjobs",
                    "link": "https://www.iitjobs.com/job/ios-developer/calgary-ab-canada/lancesoft-3290?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ca.trabajo.org/job-649-4c66cc48950803e81f649faeba05ed95?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiVmVudXMgQ29uc3VsdGFuY3kiLCJhZGRyZXNzX2NpdHkiOiJDYWxnYXJ5LCBBQiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJzR3pUR2t4Tm1nVTh4emFVQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "iOS Developer - Core Experience",
            "company_name": "TextNow",
            "location": "Canada",
            "via": "Lever",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=bANLdiSMZKSidKh0AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIMQoCMRBAUWy3s7WaWjARQQstVxEstNB-mcQhyRIzIRM0R_DYrs2H97vvrNuF2x2O9KbImQqsoOdCcGoTAiVL07mwASEs1gMnODO7SIuDrzXLXmuRqJxUrMEqyy_NiQw3PbKRfwbxWChHrDRstuumcnLL-YNavfIHQoIeEz7xByyOobuLAAAA&shmds=v1_AUFQtOM0cbzftX-GdvYw5nIGmdn2da91lkTnzmAaPPlSpuR-Aw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=bANLdiSMZKSidKh0AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9e856e9bd2d3ec880cd7452265c0e83eb4aaaa1530ecd59402.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We believe communication belongs to everyone. We exist to democratize phone service.  TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do.   We're the largest provider of free phone service in the nation. And we're just getting started.\n\nJoin us in our mission to break down barriers to communication and free the flow of conversation for people everywhere.\n\nTextNow is looking for an experienced iOS Developer to play a key role in the development of our voice and messaging platform on iOS. You will be responsible for building high-performance, scalable, and feature-rich mobile applications that integrate voice, video, and messaging capabilities. You will work alongside a talented team of developers, product managers, and UX/UI designers to create intuitive and user-centric experiences.\n\nWhat You’ll Do:\n• Design, develop, and maintain high-quality, testable iOS applications focused on voice and messaging features (voice calling, chat, real-time notifications, etc.).\n• Architect scalable and modular code for performance, reliability, and maintainability.\n• Collaborate with cross-functional teams to define, design, and ship new features.\n• Work with real-time communication protocols, such as WebRTC, SIP, and related messaging and voice frameworks.\n• Optimize app performance to ensure smooth voice and messaging functionality, including audio quality, latency, and bandwidth usage.\n• Stay current with iOS best practices, emerging technologies, and trends in the voice and messaging space.\n• Troubleshoot and debug issues related to performance, crashes, and other bugs, ensuring a smooth and stable user experience.\n• Own problems and solutions end-to-end, from ideation to deployment\n• Experimentation is a key part of your workflow; be data-driven and make the right decisions for our customers\n• Deploy your features to millions of users - your work will have an immediate impact.\n\nWho You Are:\n• A professional iOS developer with 2+ years of shipping performant iOS Apps.\n• Expertise in Swift, Objective-C, and the iOS SDK.\n• Bonus points for experience with real-time communication protocols and technologies like WebRTC, SIPor similar.\n• Proficiency in working with APIs and third-party libraries for real-time messaging and media streaming.\n• Knowledge of push notifications, background app tasks, and managing network connections for real-time updates.\n• Familiarity with modern iOS tools like Xcode, Instruments, and the debugging process.\n• Understanding of user experience (UX) principles, with the ability to design elegant, simple solutions for complex problems.\n• Experience with automated testing frameworks (Unit, UI, Integration testing) and CI/CD pipelines.\n\nMore about TextNow...\n\nOur Values:\n\n· Customer Obsessed (We strive to have a deep understanding of our customers)\n\n· Do Right By Our People (We treat each other with fairness, respect, and integrity)\n\n· Accept the Challenge (We adopt a \"Yes, We Can\" mindset to achieve ambitious goals)\n\n· Act Like an Owner (We treat this company like it's our own... because it is!)\n\n· Give a Damn! (We are deeply commited and passionate about our work and achieving results)\n\nBenefits, Culture, & More:\n\n· Strong work life blend\n\n· Flexible work arrangements (wfh, remote, or access to one of our office spaces)\n\n· Employee Stock Options\n\n· Unlimited vacation\n\n· Competitive pay and benefits\n\n· Parental leave\n\n· Benefits for both physical and mental well being (wellness credit and L&D credit)\n\n· We travel a few times a year for various team events, company wide off-sites, and more\n\nDiversity and Inclusion:\n\nAt TextNow, our mission is built around inclusion and offering a service for EVERYONE, in an industry that traditionally only caters to the few who have the means to afford it. We believe that diversity of thought and inclusion of others promotes a greater feeling of belonging and higher levels of engagement. We know that if we work together, we can do amazing things, and that our differences are what make our product and company great.\n\nTextNow Candidate Policy\n\nBy submitting an application to TextNow, you agree to the collection, use, and disclosure of your personal information in accordance with the TextNow Candidate Policy",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/textnow/ff7f1674-c0bb-4da2-9450-ee4507de7899?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=e06c88476f92a16f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/sr-ios-developer/3057001?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In Toronto",
                    "link": "https://builtintoronto.com/job/sr-ios-developer/3057001?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Finix/Job/Sr.-iOS-Developer/-in-Toronto,ON?jid=a4ca240ec0d37cef&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6735b1684a6b7352f3ccb3ae-sr.-ios-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/ios-developer-core-experience-textnow-JV_KO0,29_KE30,37.htm?jl=1009569926816&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/sr-ios-developer-finix-5742727?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIC0gQ29yZSBFeHBlcmllbmNlIiwiY29tcGFueV9uYW1lIjoiVGV4dE5vdyIsImFkZHJlc3NfY2l0eSI6IkNhbmFkYSIsImh0aWRvY2lkIjoiYkFOTGRpU01aS1NpZEtoMEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "IOS Developer",
            "company_name": "Beionse",
            "location": "Brampton, ON, Canada",
            "via": "Beionse",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=AkFPzJBVrqAAOOg2AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CS7e4CQ1EcFFtyqIDnbwA8qlHkkkvQu5IP0AP1x8w2u-i2Z9659woQ8lyVRgC3dxoIRlDCAMVxGfaHkKtWY9WquajNeKNY5mlMkKk5PZvsXpv0EDFsoJKw37w242mf1m1VEUVoLI0BWcchVuoX-0cEbGF_4AvKaYCIcAAAA&shmds=v1_AUFQtONuFZHAbciyn6sPAyznLnjRX9C0z5mnEbxMgK455rycrA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=AkFPzJBVrqAAOOg2AAAAAA%3D%3D",
            "extensions": [
                "Full-time and Part-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time and Part-time"
            },
            "description": "We are looking for an experienced iOS developer to design, build, and maintain the next generation of iOS apps. Your primary responsibility will be to create iOS applications and integrate them with back-end services.\n\nYou will be working with other engineers and developers on various layers of the infrastructure. As a result, a dedication to collaborative problem-solving, sophisticated design, and the production of high-quality products is required.\n\nResponsibilities:\n• An iOS developer should be well-versed in iOS Frameworks and proficient in Objective-C.\n• Developing mobile applications for Apple's iOS platform.\n• Working with the design team to define the app's features.\n• Ensuring that the application meets specifications in terms of quality and performance.\n• Recognizing potential issues and resolving application bottlenecks.\n• Resolving application bugs before the final release.\n• Uploading the app to the App Store.\n• Application atomization and code maintenance.\n• Creating and deploying application updates.\n\nSkills and Requirements:\n• A bachelor's degree in computer science or software engineering is preferred.\n• Demonstrated experience as an app developer.\n• In-depth knowledge of iOS frameworks such as Core Data and Core Animation.\n• Understanding of iOS back-end services.\n• Understanding of Apple's design principles as well as application interface guidelines.\n• Expertise in code versioning tools such as Mercurial, Git, and SVN.\n• Understanding of C-based libraries.\n• Minimum of 2 years of related experience\n• Understanding of push notifications, APIs, and cloud messaging.\n• Knowledge of continuous integration.",
            "apply_options": [
                {
                    "title": "Beionse",
                    "link": "https://beionse.com/jobs/ios-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/brampton/canada/info_technology/3771751560/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQmVpb25zZSIsImFkZHJlc3NfY2l0eSI6IkJyYW1wdG9uLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiJBa0ZQekpCVnJxQUFPT2cyQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "iOS Developer, International",
            "company_name": "Robinhood",
            "location": "Toronto, ON, Canada",
            "via": "Startup Jobs",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=ZlTI31KuvFn4fFFHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAGYFz7CE43S21EcdFRQXSwoO7l0h5NJN4fkiB9EB9YXb7pqz6zauPbOx3lLQFRUk1nLZKUi4dyoCVdYCkLp94RlE7AGGS-d6XEvDMm59CMufx63_R4GahYTOYJm_902XGSGLhIt96upibquKAbrFcHDOSVHkjQgpraa00HVh74C2rOGLmXAAAA&shmds=v1_AUFQtOMLpD6Cw3sdkQpS8IDRnbyqsNMdo6N4nFSp_ikAbdwBpQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ZlTI31KuvFn4fFFHAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785081d03318a8d2663adcf/images/6179420bbc397e9efc4a94043230b7878598f69138194c2507cdf46797e47683.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Join a leading fintech company that’s democratizing finance for all.Robinhood Markets was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood and its subsidiaries and affiliates are lowering barriers and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in.\n\nWith growth as the top priority...\n\nThe business is seeking curious, growth-minded thinkers to help shape our vision, structures and systems; playing a key-role as we launch into our ambitious future. If you’re invigorated by our mission, values, and drive to change the world — we’d love to have you apply.\nAbout the team + role You’ll be joining the International Team. This team is tasked with the ambitious goal of ensuring Robinhood can scale to new markets. We face challenges such as breaking rigid assumptions built in our systems and products to support new markets. The team will launch sophisticated mobile products and build new features/products to best serve local markets.\n\nWhat you’ll do• Work with a fast-growing team to revolutionize finance at speed and scale\n• Build smooth, stable, and elegant products with Swift and the newest iOS APIs\n• Own features from inception to design, implementation, and launch\n• Work cross-functionally with Product Designers, Product Managers, Backend Developers, and Data Team\n• Work with Swift, RxSwift, UIKit, Custom Design System and Declarative UI Framework, Core Data, Bazel, VIPER-esque Architecture\n\nWhat you bring • At least 2 years of professional iOS development experience\n• Proficiency with Swift\n• Deep understanding of UIKit\n• Strong product sense and ability to collaborate with Product Managers and Designers\n• Excellent communication skills and passion for solving tough technical problems\n\nOur team is committed to providing an inclusive and welcoming interview experience for all candidates. If you require a specific accommodation during the application or interview process due to a physical or mental condition, please complete this Applicant Accommodation Form to notify our team. The form should only be completed if you need a specific accommodation.\n\nWe use Covey as part of our hiring and / or promotional process for jobs in NYC and certain features may qualify it as an AEDT. As part of the evaluation process we provide Covey with job requirements and candidate submitted applications. We began using Covey Scout for Inbound on September 19, 2024.\n\nPlease see the independent bias audit report covering our use of Covey here.\n\nBase pay for the successful applicant will depend on a variety of job-related factors, which may include education, training, experience, location, business needs, or market demands. The expected salary range for this role is based on the location where the work will be performed. This role is also eligible to participate in a Robinhood bonus plan and Robinhood’s equity plan.\nToronto, ON\n$119,000—$140,000 CAD\nClick here to learn more about available Benefits, which vary by region and Robinhood entity.\n\nWe’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing finance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people invigorated by our mission, values, and drive to change the world, not just those who simply check off all the boxes.\n\nRobinhood embraces a diversity of backgrounds and experiences and provides equal opportunity for all applicants and employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and skills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone. Additionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy rights. Please review the specific Robinhood Privacy Policy applicable to the country where you are applying.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/ios-developer-international-robinhood-5842685?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/robinhood/ios-developer-crypto/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Ladders",
                    "link": "https://www.theladders.com/job/ios-developer-international-robinhood-toronto-on_73684515?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyLCBJbnRlcm5hdGlvbmFsIiwiY29tcGFueV9uYW1lIjoiUm9iaW5ob29kIiwiYWRkcmVzc19jaXR5IjoiVG9yb250bywgT04sIENhbmFkYSIsImh0aWRvY2lkIjoiWmxUSTMxS3V2Rm40ZkZGSEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJVRGh3TkZkekxYTllNRWROYWsxTlp5MWZUbEV4YzJ0R1UxZHdURVZVTjFSSmEwcHJWRUZyY1ZKVVRWQndVSFpVTUhwTlNXRnJRWGxFZEU5SmFYVldRV3hyWTE5MGFqaGFWQzFOVkdSdWNGVjBZbUU1WlhKak4wSXpkbVZZV1V3NWMwTk1MVzFqVjJwSVYyaExTbTlhWTBWZlptWXhZV1pXUjBsaVJETmtWbkJ5VEcxWFYwUkpVakpRVmxoaFJGZDFiMEp4U1ZSdmNGSlJaV000VTB0VFQxOTZXWE10Tm1OQlZHSnFZMU5FVDE5TVNURldNMFZsV201UFRIcHlSMDVEYlc1WmJpMXpOSGR1UVV0emJuUjJVR2QzU25KSFNXRXlVa1F0YUcxT1pHOTFOVGxVVkdoVGJGbFRiRWhxV0VGTGJ4SVhTRkZwUmxvMmFXTkZaaTFuTlU1dlVEYzVMWGgzVVVVYUlrRkdXSEpGWTNGTk0wZHBVaTFaVVdwcFVIRnRXVGd3ZVMxaWFHeGxSVVZOVTNjIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.ca&location=Canada&next_page_token=eyJmYyI6IkVyY0NDdmNCUVVwSE9VcHJVRGh3TkZkekxYTllNRWROYWsxTlp5MWZUbEV4YzJ0R1UxZHdURVZVTjFSSmEwcHJWRUZyY1ZKVVRWQndVSFpVTUhwTlNXRnJRWGxFZEU5SmFYVldRV3hyWTE5MGFqaGFWQzFOVkdSdWNGVjBZbUU1WlhKak4wSXpkbVZZV1V3NWMwTk1MVzFqVjJwSVYyaExTbTlhWTBWZlptWXhZV1pXUjBsaVJETmtWbkJ5VEcxWFYwUkpVakpRVmxoaFJGZDFiMEp4U1ZSdmNGSlJaV000VTB0VFQxOTZXWE10Tm1OQlZHSnFZMU5FVDE5TVNURldNMFZsV201UFRIcHlSMDVEYlc1WmJpMXpOSGR1UVV0emJuUjJVR2QzU25KSFNXRXlVa1F0YUcxT1pHOTFOVGxVVkdoVGJGbFRiRWhxV0VGTGJ4SVhTRkZwUmxvMmFXTkZaaTFuTlU1dlVEYzVMWGgzVVVVYUlrRkdXSEpGWTNGTk0wZHBVaTFaVVdwcFVIRnRXVGd3ZVMxaWFHeGxSVVZOVTNjIiwiZmN2IjoiMyJ9&q=iOS+developer"
    }
}