{
    "search_metadata": {
        "id": "67850820dafde12bb9464b5e",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/a4ee5eb21d206aa7/67850820dafde12bb9464b5e.json",
        "created_at": "2025-01-13 12:33:36 UTC",
        "processed_at": "2025-01-13 12:33:36 UTC",
        "google_jobs_url": "https://www.google.ca/async/callback:550?q=iOS+developer&uule=w+CAIQICIGQ2FuYWRh&udm=8&fc=EswCCowCQUpHOUprTndLbHdORnVDS2EwWnNCeGVHdW5pWUdGZ0VMYy1FcEJHRklsRVdWZzNOeEQ3WWJBT1BWaFRUUVFrdVE5WTA3Ri1Da2xHRGJKUU5SdERGa3pNYnd0RWxaVGhjNG44UktJUS03dVQybXMxNFRCbkk1S3p0Y3RzNzhkanFoUW1mVEZYX1FQa3NMNWtBTDZmaVV6T1V3TDRGWE5YUm1lc3ZYXzdQTWhxblRQMXh5OGwtZ0NzV3dQWl9McWFzWGFSX1lyWGFFZk55R0RxZmhBMF81blZ6SXdLVkVISXRwUzNmbXJCM1N2M2RCYjBRSDhpRWttMmRIWUFKV2dNeWNZRmhaZU1oLUktUBIXSUFpRlo4aTFHSUNlNU5vUC01bmRzUTQaIkFGWHJFY3I1TGtlZ3lXSHF0N2NGSHo2RjNaNFRYeEdtelE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/a4ee5eb21d206aa7/67850820dafde12bb9464b5e.html",
        "prettify_html_file": "https://serpapi.com/searches/a4ee5eb21d206aa7/67850820dafde12bb9464b5e.prettify",
        "total_time_taken": 1.42
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Canada",
        "location_used": "Canada",
        "google_domain": "google.ca",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUbmRMYkhkT1JuVkRTMkV3V25OQ2VHVkhkVzVwV1VkR1owVk1ZeTFGY0VKSFJrbHNSVmRXWnpOT2VFUTNXV0pCVDFCV2FGUlVVVkZyZFZFNVdUQTNSaTFEYTJ4SFJHSktVVTVTZEVSR2EzcE5ZbmQwUld4YVZHaGpORzQ0VWt0SlVTMDNkVlF5YlhNeE5GUkNia2sxUzNwMFkzUnpOemhrYW5Gb1VXMW1WRVpZWDFGUWEzTk1OV3RCVERabWFWVjZUMVYzVERSR1dFNVlVbTFsYzNaWVh6ZFFUV2h4YmxSUU1YaDVPR3d0WjBOelYzZFFXbDlNY1dGeldHRlNYMWx5V0dGRlprNTVSMFJ4Wm1oQk1GODFibFo2U1hkTFZrVklTWFJ3VXpObWJYSkNNMU4yTTJSQ1lqQlJTRGhwUld0dE1tUklXVUZLVjJkTmVXTlpSbWhhWlUxb0xVa3RVQklYU1VGcFJsbzRhVEZIU1VObE5VNXZVQzAxYm1SelVUUWFJa0ZHV0hKRlkzSTFUR3RsWjNsWFNIRjBOMk5HU0hvMlJqTmFORlJZZUVkdGVsRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Mobile iOS Developer / Cocoa – Montreal,QC",
            "company_name": "Kovasys",
            "location": "Montreal, Quebec, Canada",
            "via": "Kovasys IT Recruitment Agency",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=d0BSdex1EETPhpp_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0XNMQrCMBQAUFx7BKcPblIbEVx0jCAoRYoHKD_x00ZifsiPpW7ewUN4L08iTi5vfcV7UuiajfME7nSGHQ3kOVICBZotI3yeL6g55EToy0bDAg5sQAiT7YED7Jk7T9Ntn3OUjVIivuokY3a2snxTHMjwqK5s5EcrPSaKHjO1q_VyrGLo5rMjDygPARf-FzR3MmRL0Bjwgl-qZDTJqgAAAA&shmds=v1_AUFQtOOsGIN5r8rICxhphV7qq1Qsnd3G1ysxcJC6oCsiQat8ag&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=d0BSdex1EETPhpp_AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are looking for iOS mobile developer for our ecommerce client in Ville St. Laurent.\n\nSkills\n\n. Experience with software development;\n\n. Solid knowledge of OOP programming;\n\n. Have built at least one iPad/iPhone/Android/Tablet application;\n\n. Solid understanding of Cocoa/UIKit frameworks and the iPhone SDK;\n\n. Solid understanding of Android OS and its SDK;\n\n. Proficiency in Xcode 4, Interface Builder and Instruments;\n\n. Proficiency in Eclipse, DDMS;\n\n. Solid understanding of the iPhone/iPad/Android Application development process;\n\n. Experience using version control repositories such as SVN or Git;\n\n. Experience consuming web services (REST) and processing data (XML/JSON);\n\n. Solid understanding of data structure and network protocols;\n\n. A basic understanding of backend components that drive mobile applications\n\n. Interface design skills;\n\n. Strong analytical and communication skills;\n\n. Strong interpersonal skills;\n\n. Innovative and creative personality;\n\n. Independent, yet able to work well within a team.",
            "apply_options": [
                {
                    "title": "Kovasys IT Recruitment Agency",
                    "link": "https://kovasys.com/fr/job/mobile-ios-developer-cocoa-montrealqc/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgaU9TIERldmVsb3BlciAvIENvY29hIOKAkyBNb250cmVhbCxRQyIsImNvbXBhbnlfbmFtZSI6IktvdmFzeXMiLCJhZGRyZXNzX2NpdHkiOiJNb250cmVhbCwgUXVlYmVjLCBDYW5hZGEiLCJodGlkb2NpZCI6ImQwQlNkZXgxRUVUUGhwcF9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Mobile Application Developer [Ionic]",
            "company_name": "Peliplat",
            "location": "Vancouver, BC, Canada",
            "via": "LinkedIn",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=SBJbSo8_MDRWa9sNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWLsQrCMBBAce0nOJ2r1EYEFztpBVEQnFxEyiUeTeTMhSSW_oz_aru84fFe8ZsV9VW0Y4J9COwMZicejtQTS6AIj7N4Z56wgotoSITRWBiLk0jHNK9tziHtlEqJqy7lcTeVkY8ST1oG9RadJrTJYqTAmKndbNdDFXy3XNyI3eTAebijN_LtKZZwaEpo0OML_-Ff2KOgAAAA&shmds=v1_AUFQtONMBa4Qp11MPOEIMudp45ibURU76n9Nk-XUgDYYwp6Y7g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=SBJbSo8_MDRWa9sNAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850820dafde12bb9464b5e/images/1d9ba63870e9f0d36acbd0a8d95e15dd4389f902038ee638f778c554081c18de.gif",
            "extensions": [
                "3 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "3 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Discover Peliplat\n\nPeliplat is an online community made by film lovers, for film lovers! We’re revolutionizing the way film enthusiasts and content creators interact globally, empowering them to craft their own stories and bring their cinematic visions to life. On Peliplat, film aficionados can find spaces to share insights, develop new stories, and collaborate on the creation of the next big hit. While our primary focus has been the Latin American market, we are now expanding worldwide, positioning ourselves as a community shaping the future of cinema.\n\nJoin us and be part of this thriving global film community!\n\nWhat Will Your Next Role Look Like?\n\nAs a Mobile Application Developer at Peliplat, you’ll play a crucial role in developing our mobile applications and enhancing user experiences across platforms. You’ll work with a team of passionate developers, designers, and product managers to bring Peliplat’s vision to life on mobile devices, contributing directly to a community where film lovers collaborate, share insights, and bring cinematic ideas to life.\n\nResponsibilities\n• Develop and maintain Peliplat’s mobile application, using Ionic to create cross-platform apps for iOS and Android.\n• Utilize Vue for front-end development and optimization of Peliplat’s additional projects.\n• Engage in technical research, problem-solving, and innovation to address challenges in the app’s development.\n• Complete functional requirements as per project deadlines, collaborating closely with the testing, design, and product teams to ensure smooth integration and support.\n\nQualifications\n• Bachelor’s degree or higher in Computer Science or related field.\n• 3+ years of experience in mobile and front-end development, demonstrating strong coding practices.\n• Knowledge of mobile APIs, UI standards, CSS, and HTML.\n• Proficiency with Cordova/Ionic for hybrid app development, with expertise in JavaScript and frameworks like Vue.js.\n• Ability to conduct front-end functionality and performance testing, with experience optimizing front-end performance.\n• Familiarity with native Android or iOS development and the app deployment process.\n• Strong logical thinking and excellent communication skills, with a collaborative spirit to work effectively across teams.\n\nOur Culture\n\nAs Peliplat expands into a global entity, our organizational culture will extend its influence across various locations, significantly impacting ongoing projects worldwide. Living our culture by building the next space for film enthusiasts just makes us thrilled and excited about what every one of us can bring to Peliplat's success. The pillars of Peliplat's success are thanks to our people who go above and beyond our core values,\n• Ownership - Entrepreneur Mindset\n• Problem-Solving - Master Decoder\n• Result-Oriented - Bullseye Targets\n• Passionate - Committed to Growth\n\nPerks & Benefits\n• Extended Health and Dental Benefits. Ensuring your well-being is always a priority for us.\n• Growth and Development Opportunities. A way to take your career to the next level with us! We will work through our Learning and Development Program to help you achieve your professional goals with Peliplat.\n• Engaging Team Building Activities. We believe in solid connections. Therefore, we have fostered a variety of events and internal clubs to help you become part of Peliplat's culture.\n• Comfortable and Fun Office Environment. A well-equipped office with ergonomic furniture, snacks, and beverages to keep you energized throughout the day.\n• Friday Happy Hour. The perfect way to end the week on a high note with the team!\n\nYour Next Big Opportunity Awaits!\n\nIn Peliplat, we appreciate every candidate and their time. Therefore, our Talent team will review each application and will get back to those who successfully match our needs. As a note, this position is based in Vancouver, BC, so we are only considering those based locally and eligible to work in Canada. We invite every qualified candidate to apply! If you don't have the qualifications needed but have the potential and education, we will leave a space for you to explain \"Why\" you could be the next Mobile Application Developer [ionic]. We will try to reach out and see if there is a place for you here now or maybe in the future.\n\nWe are recognized as an equal-opportunity company and are committed to creating a diverse and inclusive workplace. Every qualified applicant will be considered for this position, regardless of their race, nationality, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. Let's make this environment a place where everyone is recognized, feels valued, and is open to the full field of what they do best!",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/mobile-application-developer-ionic-at-peliplat-4121567352?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://emplois.ca.indeed.com/viewjob?jk=cd105869d0fc2f45&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Work In Tech Job Board - Communitech",
                    "link": "https://www1.communitech.ca/companies/softmax-data-inc-2/jobs/44706144-mobile-application-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.ca",
                    "link": "https://www.monster.ca/job-openings/mobile-application-developer-intermediate-vancouver-bc--120e196e-c2bc-4e88-96e9-78e8f78f262e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://fr.glassdoor.ca/job-listing/mobile-application-developer-intermediate-ecad-labs-JV_IC2278756_KO0,41_KE42,51.htm?jl=1009589622544&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/ECAD-Labs-Inc./Job/Mobile-Application-Developer-(Intermediate)/-in-Vancouver,BC?jid=d5fd317e5f1a44b6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Dice",
                    "link": "https://www.dice.com/job-detail/840b91e5-3265-4018-9d0e-33fa90e9d2e2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/mobile-application-developer-intermediate-ecad-labs-JV_IC2278756_KO0,41_KE42,51.htm?jl=1009589622544&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIFtJb25pY10iLCJjb21wYW55X25hbWUiOiJQZWxpcGxhdCIsImFkZHJlc3NfY2l0eSI6IlZhbmNvdXZlciwgQkMsIENhbmFkYSIsImh0aWRvY2lkIjoiU0JKYlNvOF9NRFJXYTlzTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Développeur iOS senior -Senior iOS Developer",
            "company_name": "OneSpan",
            "location": "Montreal, Quebec, Canada",
            "via": "Greenhouse",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=bDoWFDTgO0a2ToepAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yWKQQrCMBAA8doneFrwJrURwYseLQiCFOkDyiYubUrcDUkqfZK-w4_Z6mUGhslei6wsP-8nOfGehgC2qiESWwmwqf-eU0m_haYKF9HTgsF0IAxnkdbR8til5ONBqRhd0caEyZrCyEMJk5ZR9aLjjCZ2GMg7TNTs9tux8NyuVxVT7ZHBMlyFUyB0OdwG0mRyOCHjHb9pdkChqwAAAA&shmds=v1_AUFQtONvU5EyZUjGSnc8oCdvFE9R-Ttr6_bAH_9HJWIgVQxk8Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=bDoWFDTgO0a2ToepAAAAAA%3D%3D",
            "extensions": [
                "28 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Développeur iOS senior (Montréal, Canada)\n\n(Veuillez noter que la description de poste en anglais se trouve ci-dessous - Please note that the English job description can be found below)\n\nChez OneSpan, nous réinventons la confiance pour aider les entreprises à prospérer en permettant des accords et des transactions numériques sécurisés, conformes et sans friction. À l'échelle mondiale, nous sommes dignes de confiance par des entreprises mondiales, dont plus de 60 % des 100 plus grandes banques du monde, afin d'enrichir l'expérience client et de réduire les menaces actuelles, tout en nous préparant à tirer pleinement parti de ce qui s'en vient demain. Avec une vision audacieuse et une opportunité ambitieuse devant nous, nous recherchons des penseurs créatifs et des idées audacieuses qui viendront perturber notre industrie.\n\nNous développons des solutions de sécurité mobile innovantes qui auront un impact significatif sur tous nos produits et solutions OneSpan actuels et futurs. En tant que Développeur iOS senior, vous rejoindrez notre équipe mobile au bureau de R&D situé à Montréal (QC), Canada. Ce poste est ouvert aux candidats résidant au Québec, Canada, car nous exigeons que vous soyez au bureau une à deux fois par semaine.\n\nVous participerez activement à la création de solutions sécurisées et conviviales en utilisant les meilleures pratiques les plus récentes, en collaborant avec des ingénieurs logiciels, des architectes de produits, des spécialistes en sécurité et d'autres parties prenantes. Nous attendons de vous que vous apportiez votre passion pour le développement Android et votre engagement à livrer des solutions de qualité tout en cherchant constamment des moyens de vous améliorer.\n\nVous allez\n• Contribuer à la conception, au développement et à la maintenance des applications mobiles liées à la sécurité et d'autres composants logiciels sur iOS.\n• Assister et proposer des technologies et des outils pour améliorer l'expérience utilisateur et les processus de développement.\n• Collaborer avec l'équipe de développement tout au long du cycle de vie du logiciel, y compris la conception, la programmation, la gestion des tâches et les tests.\n• Travailler avec des pipelines CI/CD et des frameworks de tests automatisés pour améliorer l'efficacité du développement et la qualité du code.\n• Soutenir l'équipe dans l'utilisation des méthodologies Agile pour s'adapter au changement et améliorer les processus et la documentation.\n• Assurer la sécurité mobile et une expérience utilisateur positive en maintenant la qualité du code et en adhérant aux meilleures pratiques.\n\nVous aurez :\n• Un diplôme en informatique ou dans un domaine connexe.\n• 3 à 6 ans d'expérience en développement iOS.\n• Expérience dans un environnement Agile\n• Une expertise en Swift, ainsi qu'une connaissance suffisante d'Objective-C pour prendre en charge les anciens produits.\n• Une compréhension solide de IOS SDK et des modèles d'architecture d’applications mobiles.\n• Une compréhension approfondie des frameworks iOS : UIKit, SwiftUI, Foundation, etc.\n• Une maîtrise en Xcode et des outils de Debugging.\n• Expérience en programmation Asynchronous et en sécurité Threads.\n• Expérience dans le déploiement et la maintenance d'applications.\n• Expérience avec RESTful API, JSON et les bibliothèques tierces modernes.\n• Solides compétences en résolution de problèmes.\n• Bonnes compétences en communication et un esprit d'équipe collaboratif.\n• Bonne maîtrise de l'anglais.\n\nExigences souhaitées\n• Familiarité avec les principes de sécurité mobile et expérience dans le développement d'applications sécurisées (Keychain, Secure Enclave, cryptage/décryptage/obfuscation).\n• Expérience avec les AppGroups, Extensions, widgets et\n• Expérience de travail avec des équipes interfonctionnelles, y compris des responsables produit, des concepteurs UX et d'autres développeurs.\n• Familiarité avec les pipelines CI/CD et les tests automatisés (tests unitaires, tests UI), y compris BrowserStack.\n• Connaissance des outils de gestion de projet et de contrôle de version (par exemple, Jira, GitLab).\n\nChez OneSpan, nous défions le présent en pensant à l'avenir, en nous exprimant et en travaillant ensemble pour nous améliorer constamment. Chacun est une partie intégrante de notre mission, avec une égalité d'opportunités pour participer et avoir un impact mondial. Parce que nous savons que les véritables connexions sont basées sur l'autonomie et la confiance, nous nous engageons toujours avec un esprit ouvert et favorisons la diversité dans notre réflexion et notre culture. Plus nous aurons de voix représentées et amplifiées, plus nous prospérerons tous, contribuerons et ferons avancer notre industrie. C'est pourquoi nous encourageons chacun à apporter son entière personnalité au travail et à être ouvert à différentes idées, nouveaux défis et nouvelles possibilités.\n\n____________________________________________________________________________________________________________________________________\n\nSenior iOS Developer (Montreal, Canada)\n\nAt OneSpan, we're reimagining trust to help businesses to thrive by enabling secure, compliant, and frictionless digital agreements and transactions. Across the globe, we are trusted by global enterprises, including more than 60% of the world's largest 100 banks, to enrich their customer experience and mitigate threats today, while preparing to take full advantage of what's coming tomorrow. With a bold vision and an ambitious opportunity ahead of us, we are looking for creative thinkers and fearless ideas that will disrupt our industry.\n\nWe are building state-of-the-art mobile security solutions that will significantly impact all our current and future OneSpan products and solutions. As a Senior iOS Developer, you will join our mobile team in the R&D office based in Montreal (QC), Canada. This position is open to candidates who reside in Quebec, Canada, as we require you to be at the office once or twice per week.\n\nYou will actively participate in creating secure and user-friendly solutions using the latest best practices, collaborating with software engineers, product architects, security specialists, and other stakeholders. We expect you to bring passion for Android development and dedication to delivering quality solutions while continuously seeking ways to improve.\n\nYou Will\n• Contribute to the design, development, and maintenance of security-related mobile applications and other software components on iOS.\n• Assist and propose technologies and tools to improve the user experience and development processes.\n• Collaborate with the development team through the software lifecycle, including design, coding, task management, and testing.\n• Work with CI/CD pipelines and automated testing frameworks to enhance development efficiency and code quality.\n• Support the team in using Agile methodologies to adapt to change and improve processes and documentation.\n• Ensure mobile security and a positive user experience by maintaining code quality and adhering to best practices.\n\nYou Will Have\n• A degree in computer science or a related field.\n• 3-6 years of experience in iOS development.\n• Experience working within an Agile environment.\n• Expert-level knowledge of Swift, enough knowledge of Objective-C to support older products\n• A solid understanding of iOS SDK and mobile app architecture patterns.\n• Deep understanding of iOS Frameworks: UIKit, SwiftUI, Foundation, …\n• Proficiency in Xcode and Debugging tools.\n• Experience with Asynchronous programming and Thread safety\n• Experience with App deployment and maintenance\n• Experience working with RESTful APIs, JSON, and modern third-party libraries.\n• Strong problem-solving skills.\n• Good communication skills and a collaborative team spirit.\n• Fluent knowledge of English.\n\nNice to Have\n• Familiarity with mobile security principles and experience in developing secure applications (Keychain, Secure Enclave, encryption/decryption/obfuscation)\n• Experience with AppGroups, Extensions, widgets and wearables.\n• Experience working with cross-functional teams, including product owners, UX designers, and other developers.\n• Familiarity with CI/CD pipelines and automated testing (unit tests, UI tests), including BrowserStack.\n• Knowledge of project management and version control tools (e.g., Jira, GitLab).\n\nAt OneSpan, we challenge the now by thinking ahead, speaking up, and working together to constantly improve. Everyone is an integral part of our mission, with an equal opportunity to participate and make a global impact. Because we know that real connections are built on autonomy and trust, we always engage with open minds and promote diversity in our thinking and culture. The more voices we have represented and amplified, the more we will all thrive, contribute, and drive our industry forward. That’s why we encourage everyone to bring their whole self to work and be open to different ideas, new challenges, and new possibilities.\n\n#LI-hybrid\n#LI-HW1",
            "apply_options": [
                {
                    "title": "Greenhouse",
                    "link": "https://boards.greenhouse.io/embed/job_app?for=onespan&token=6481059&b=https://www.onespan.com/about/careers/job/developpeur-ios-senior-senior-ios-developer-6481059&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=7f42ca45c1faa4aa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Kovasys IT Recruitment Agency",
                    "link": "https://kovasys.com/job/ios-apllications-developer-montrealqc/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/OneSpan/Job/Developpeur-iOS-senior-Senior-iOS-Developer/-in-Montreal,QC?jid=2f9997d285a8fcba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ca.linkedin.com/jobs/view/d%C3%A9veloppeur-ios-senior-senior-ios-developer-at-onespan-4103792039?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/d%C3%A9veloppeur-ios-senior-senior-ios-developer-onespan-JV_IC2296722_KO0,43_KE44,51.htm?jl=1009570742697&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/senior-software-developer/3703742?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.ca",
                    "link": "https://www.monster.ca/fr/offres-demploi/d%C3%A9veloppeur-ios-senior-senior-ios-developer-montr%C3%A9al-qc--76495925-4d80-4713-b1e3-ca552c20b190?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEw6l2ZWxvcHBldXIgaU9TIHNlbmlvciAtU2VuaW9yIGlPUyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJPbmVTcGFuIiwiYWRkcmVzc19jaXR5IjoiTW9udHJlYWwsIFF1ZWJlYywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJiRG9XRkRUZ08wYTJUb2VwQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Senior React Native Mobile Developer (iOS & Android) @WAZO (Canadian residents only)",
            "company_name": "Wazo",
            "location": "Anywhere",
            "via": "Indeed",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=qqx9q6_LlUqYfm55AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2OQUoDQRBFcZsjuPoLkSTEGRHc6MYQQRA0aBaBbEJ1TzFTsa0autqQeCPP4QU8kqObB-9t_h_9nIzeVqxiGa9MseCZiuwZTxYkMe55z8l6zhjLcoVzzLXJJs0Ed-v5ZonxgpQaIUVml4a1OEzTcYILPFqAM-XYDQkPZm3i09uulN5v6to9Va2XYS1W0d5rUw52qHcW_A9b7yhzn6jw9ur68lD12k7P1vRpEMXLx_dX4IiFlONsMB5khv8v9Aubj-Vt0wAAAA&shmds=v1_AUFQtOPk3uxvWRNqCm-si5Y1ASJZzYZV8LcX29AVxzIpvIHaSA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=qqx9q6_LlUqYfm55AAAAAA%3D%3D",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "About Wazo\n\nWazo is a software editor of an API-first Unified Communication Platform designed for telco operators, service providers, and integrators. The platform provides:\n• An all-in-one application suite to support IP telephony, collaboration and customer relationship needs\n• A strong solution that can be deployed on any infrastructure and managed through a cloud administration interface\n• A complete set of application programming interfaces (APIs) to build new communication services and integrate Wazo into the core of their information systems\n• A native open source platform which provides security and freedom to customers.\n\nWazo believes that Unified Communication users should have more control over their communication tools and that businesses should be able to integrate innovative communication features into their business workflows. Wazo’s ambition is to take a significant part of the UCaaS market that is expected to generate over USD 260 billion of revenues by 2028.\n\nSince launching its solution in Europe in 2018, Wazo has successfully gained a foothold in this very competitive market thanks to its unique positioning and innovative IT approach: Wazo has already attracted more than 100,000 users and more than 100 Telecommunication Companies, Value-Added Resellers and Managed Services Providers. Wazo is now accelerating its development with the launch of its solution in the US.\n\nRole\n\nAre you a talented senior developer looking for a new challenge? Come meet us, we're hiring!\n\nReporting to the VP Engineering, you'll work closely with our Mobile development team, and our product and customer success teams to develop the communication solutions and experiences of tomorrow.\n\nThe keywords of our technical stack are: React Native, React JS, WebRTC, REST API, iOS & Android.\n\nJob Description\n• Develop, implement, and enhance various features of our iOS & Android mobile applications with a focus on real time audio and video communication\n• Design intuitive interfaces for quick user adoption\n• Contribute to the development of open-source libraries (React Native CallKeep)\n• Write and automate reliable unit, functional and end to end tests\n• Participate in improving our agile development methodology\n• Contribute to the elaboration of the mobile roadmap in close collaboration with our Product Owners\n• Keep abreast of current technologies and recent developments in mobile and media technologies.\n\nQualifications\n• Bachelor’s degree in Computer Science, Engineering, or related field\n• Minimum 5 years of professional experience in React Native mobile development\n• Proficiency in React Native, Swift, Objective-C, and Java and developing cross platform mobile applications for iOS and Android OS\n• Expertise in voice, video, messaging, and conferencing technologies and webRTC\n• Experience with SIP, SFU architecture and telecommunication infrastructure\n• Familiarity with Linux and Asterisk\n• Familiarity with cloud platforms such as AWS, Google Cloud, or Azure\n• Ability to learn new technology quickly, as well as a strong interest in doing so\n• Ability to work in a multidisciplinary team\n• Enjoy collaborating on open-source projects\n• A habit of staying up-to-date with new practices and technologies\n• French or English proficiencies, both is a plus\n\nWhy Apply to Wazo?\n\n✅ Our mission is to provide the best open source communication platform to allow anyone to build any communication use cases anywhere\n\n✅ We invest in our employees through career development & opportunities, social events, and competitive benefits\n\n✅ You get to collaborate with and learn from smart and creative people around the globe\n\n✅ Team spirit is not a motto: it is a reality\n\nTo keep our employees happy and motivated, we are always assessing the benefits we offer to ensure we are competitive. Here are some we’d like to highlight:\n• Full time permanent position – Canada Based\n• Full benefits covered by the employer\n• Competitive Compensation\n• 4 Weeks of vacation + Comfort Days\n• Work remotely – with possibility to work in the Quebec City office.\n• VRSP (independent)\n• Fun culture with a big opportunity to make an impact on our growing global team\n\nWe welcome everyone to apply to our positions. Wazo is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=1e05582c64387573&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Wazo/Job/Senior-React-Native-Mobile-Developer-(iOS-&-Android)-@WAZO-(Canadian-residents-only)/-in-Qu%C3%A9bec,QC?jid=97a57c63d748a80d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/senior-react-native-mobile-developer-ios-android-wazo-canadian-residents-only-wazo-JV_KO0,77_KE78,82.htm?jl=1009291224100&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUmVhY3QgTmF0aXZlIE1vYmlsZSBEZXZlbG9wZXIgKGlPUyBcdTAwMjYgQW5kcm9pZCkgQFdBWk8gKENhbmFkaWFuIHJlc2lkZW50cyBvbmx5KSIsImNvbXBhbnlfbmFtZSI6Ildhem8iLCJhZGRyZXNzX2NpdHkiOiJRdcOpYmVjIENpdHksIFF1ZWJlYywgQ2FuYWRhIiwiaHRpZG9jaWQiOiJxcXg5cTZfTGxVcVlmbTU1QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Mobile SDK Developer (iOS)",
            "company_name": "Xsolla",
            "location": "Montreal, Quebec, Canada",
            "via": "Lever",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=sq0sZnLhFSSPKrwpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU6Hk0ptVHDR0YKgFJEubuUSjzZy5kIuSj_EDxbf8IrvpNg0Yj0TtPUFavoQS6QEc39tF7CCs1hQwuQGkAAnkZ5pehhyjro3RpWrXjNm7yonLyOBrIzmKVb_dTpgosiYqdvu1mMVQ7-c3VWYEXyARkJOhFzC7U2WXAlHDPjAHx0XJT-XAAAA&shmds=v1_AUFQtOPF6NLvBS3E-mQpk5RfCbfF72Ce2GrNLsdbOku0AfFepw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sq0sZnLhFSSPKrwpAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850820dafde12bb9464b5e/images/1d9ba63870e9f0d3889672cf51063952b7b7c3edd3f14703403184c1321a0643.gif",
            "extensions": [
                "26 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We seek a highly skilled Mobile iOS SDK Developer with at least 5 years of experience creating robust, efficient, and concise SDKs in Objective-C/Swift. The ideal candidate will be key in designing and developing an SDK that integrates Xsolla’s platform and services, enabling game developers to incorporate monetization features into their games seamlessly. This SDK must be lightweight, modular, and deliver a seamless experience for developers and gamers.\n\nRESPONSIBILITIES\n• Design and Development: Architect and develop a highly modular, concise, and lightweight iOS SDK in Swift that integrates Xsolla’s services.\n• Platform Integration: This will enable game & application developers to effortlessly integrate Xsolla’s platform functionalities, such as payments, subscriptions, and in-app purchases, into their games.\n• Optimization: Ensure the SDK remains lightweight, minimizing size while maximizing performance and functionality.\n• Code Quality: Write clean, maintainable, well-documented code that adheres to best practices and coding standards.\n• Collaboration: Work closely with product managers, backend engineers, and other stakeholders to align SDK capabilities with business requirements.\n• Public Eye: Write code in the public eye, being the face of Xsolla inside the community\n• Support and Documentation: Work with the technical writers to provide comprehensive technical documentation and developer guides for seamless integration by game developers.\n\nREQUIREMENTS\n• Minimum 5 years of experience in creating SDKs for iOS applications.\n• Deep expertise in Objective-C/Swift\n• You have strong experience with your platform's APIs and ecosystem and are comfortable debugging complex issues in various setups.\n• Having experience developing commercially shipped SDKs is a plus\n• You want to work in a fast-paced, high-growth environment that values diversity of talent, excellence of product, and exciting engineering challenges at scale.\n• Proven ability to develop concise and lightweight SDKs with excellent performance.\n• Familiarity with best practices for SDK development, including modularity, scalability, and backward compatibility.\n• Knowledge of iOS app lifecycle, memory management, and performance optimization techniques.\n• Strong problem-solving skills and a focus on delivering high-quality results.\n\nDon’t meet every requirement listed? Studies show that women and people of color are less likely to apply for jobs when they don’t meet every requirement. At Xsolla, we are committed to building a diverse and inclusive community, so if you think you could be amazing in this role, even without all the listed qualifications, please apply! You may be exactly who we didn’t even know we need.\n\nBenefits:\n\nWe are passionate about fostering a supportive environment for our team, so we prioritize the physical, mental, and emotional well-being of our employees and their families through a comprehensive Benefits Program. This includes 100% company-paid medical, dental, and vision plans, unlimited Flexible Time Off, and a personalized career roadmap for each employee. By investing in professional development through training and educational opportunities, we ensure that our team thrives both personally and professionally. Together, we’re not just building a business; we’re cultivating a community that values creativity, collaboration, and the transformative power of play.\n\nEqual Employment Opportunity Statement:\n\nXsolla is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate based on race, color, religion, sex, national origin, age, disability, sexual orientation, gender identity, or any other characteristic protected by law.\n\nWe consider qualified applicants with criminal histories in accordance with the Fair Chance Act.\n\nCriminal History Consideration:\n\nFor the Mobile SDK Developer (iOS), we will conduct a background check that may include the following:\n\nCriminal history check\n\nEmployment verification\n\nEducation verification\n\nCredit history check\n\nProfessional license verification\n\nRelevance to Job Responsibilities:\n\nThe background check is relevant to this position because of the following role responsibilities:\n\nHandling sensitive financial information/managing budgets/accessing funds\n\nHandling sensitive employee personal data\n\nAccessing confidential company data\n\nEnsuring compliance with regulatory requirements\n\nRights Under the Fair Chance Act:\n\nApplicants are encouraged to inquire about their rights under the Fair Chance Act. If you have questions regarding our hiring practices, please contact careers@xsolla.com.\n\nBy submitting the following job application form, you consent to Xsolla processing your data for career-related inquiries and potential employment opportunities. We process your data in accordance with this Xsolla Privacy Notice for Job Applicants. Please direct any inquiries regarding your data privacy to careers@xsolla.com.",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/xsolla/7b802c46-e8d3-4cae-b7c5-b46fe99fd02f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://ca.indeed.com/viewjob?jk=ee4fae41d6b8b954&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/Xsolla/Job/Mobile-SDK-Developer-(iOS)/-in-Montreal,QC?jid=72852562ffa22fec&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/mobile-sdk-developer-ios-xsolla-JV_IC2296722_KO0,24_KE25,31.htm?jl=1009572439119&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/xsolla/mobile-sdk-developer-ios/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GameJobs.co",
                    "link": "https://gamejobs.co/Mobile-SDK-Developer-iOS-at-Xsolla?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/mobile-sdk-developer-ios/3712645?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.ca/job/n2YvIwcNiFfNnV4Tv_tpaauYv1xPYOn3UsOWDFdm1x8saMb7HsUwhw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgU0RLIERldmVsb3BlciAoaU9TKSIsImNvbXBhbnlfbmFtZSI6Ilhzb2xsYSIsImFkZHJlc3NfY2l0eSI6Ik1vbnRyZWFsLCBRdWViZWMsIENhbmFkYSIsImh0aWRvY2lkIjoic3Ewc1puTGhGU1NQS3J3cEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Sr. iOS Developers",
            "company_name": "Venus Recruitment",
            "location": "Brampton, ON, Canada",
            "via": "Venus Consultancy",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=6gYYNzdN2jt-Rre7AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCQAwAUFz7CU5ZK_VOBBfdVBAcLCi4lrSG9uSaHJdU-h_-sPiGV3wXRfnIDkL9gDN9KEqirLCGq7SghLkbQBguIn2k5WEwS7r3XjW6Xg0tdK6T0QtTK7N_S6v_Gh0wU4po1Gx3m9kl7lflk3hSuFOXp2AjsUFgOGYckwlXUN8qOCHjC3-IdNhDlgAAAA&shmds=v1_AUFQtOPqdGw1EfDryaEatpQrkHwLlS3FH7g7mwNh7yxPqY1MBA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=6gYYNzdN2jt-Rre7AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850820dafde12bb9464b5e/images/1d9ba63870e9f0d37a21a68b756877f99bc84fecd31142dd1e031922a557a952.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Description\n• Design, build, and maintain native mobile applications for iOS\n• Participate in code reviews and architecture reviews\n• Ensure the performance, quality, and responsiveness of applications\n• Collaborate with a team to define, design, and ship new features\n• Taking ownership, writing UnitTest and UI Test as part of development norm\n\nMentor Junior iOS developer\n\nQualification\n• You know how to write readable, idiomatic and maintainable Swift code\n• You are experienced with a variety of iOS frameworks.\n• You have a deep understanding of Cocoa design patterns and API design.\n• You care about quality and you know what it means to ship high quality code.\n• You love to think in a functional way, and you want to learn what functional programming means (Combine/RxSwift)\n• Experience with offline storage (Realm and or Core Data or FileCache), threading, and performance tuning\n• Familiarity with RESTful APIs to connect iOS applications to back-end services\n• Familiarity with CI/CD and Fastlane\n• You have released at least one App under your supervision from an organization where you did:\n\nCore architecture\n\nCode review\n\nMentored other developer\n\nDevelopment\n\nWrote UnitTest and possibly some UITest\n\nGood to have:\n\nCombine & SwiftUI\n\nRxSwift\n\nRealm\n\nFastlane",
            "apply_options": [
                {
                    "title": "Venus Consultancy",
                    "link": "https://venushiring.ca/job/sr-ios-developers/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gaU9TIERldmVsb3BlcnMiLCJjb21wYW55X25hbWUiOiJWZW51cyBSZWNydWl0bWVudCIsImFkZHJlc3NfY2l0eSI6IkJyYW1wdG9uLCBPTiwgQ2FuYWRhIiwiaHRpZG9jaWQiOiI2Z1lZTnpkTjJqdC1ScmU3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJR1EyRnVZV1JoIn0="
        },
        {
            "title": "Senior iOS Developer",
            "company_name": "CGI",
            "location": "Calgary, AB, Canada",
            "via": "Blind",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=CeARiNASTkkIm5_vAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXHsQrCMBAAUFz7CZ1u1pqI4KKTVii6OPQDyiUeSSTmQi5I_QG_W10evOazaFYjpcAFwm2EM70ocqYCa7iyASEs1gMnGJhdpPbga82y11okKicVa7DK8lNzIsOzfrCRP5N4LJQjVpq2u82scnLLth8uEBL0GB2WdwfHU_dLwjt-ASIM9QSJAAAA&shmds=v1_AUFQtOO-VLkIuPE2zfxlcbqABc6UHD6byTspVcu62nOmQWNU-w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=CeARiNASTkkIm5_vAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850820dafde12bb9464b5e/images/1d9ba63870e9f0d3d3133fa6d8fdec0a89e2989f2fabf5f4668543b3bc465aba.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Position DescriptionCGI is more than just an IT consulting company; we are a global organization offering a world of opportunities. Our benefits include a share purchase program, profit sharing, wellness credits, training and development programs and flexible work schedules and locations.Become part of an outstanding culture that gives you the freedom to innovate, influence decisions, achieve your full potential, and chart your own career!CGI is looking for an accomplished Mobile Developer (iOS) with a deep understanding of multiple development and automation tools and technologies. This role is located in Calgary and is Office based.If you are looking to advance your career while gaining experience in an exciting and diverse development environment, this is the opportunity you have been looking for!Your future duties and responsibilities• Create and enhance features across our flagship E*TRADE and Morgan Stanley apps• Perform annual maintenance on the codebase and automated build scripts to keep pace with changes to iOS and Xcode• Maintain certificates and signing, including certificate pinning, provisioning profiles, and push notification certificates• Monitor production feedback, crash reports, and analytics—and address issues• Work with infrastructure teams to address proxy, software and administrative privilege issues that impact iOS development or build processesRequired Qualifications To Be Successful In This Role• 7+ years experience UI developer with deep familiarity with Broad iOS API experience, including but not limited to: Local Authentication, WebKit, Networking.• Swift 6; familiarity with Obj-C is a plus• Deep knowledge of iOS programming concepts, including but not limited to: Threading, Crash Analysis• The latest Xcode, xcodebuild, application loader, and iOS• Prior experience providing technical guidance to more junior resources, and reviewing pull requests for architectural correctnessAdditional Required Skills:• Strong written and verbal communic",
            "apply_options": [
                {
                    "title": "Blind",
                    "link": "https://www.teamblind.com/jobs/128000216?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkNHSSIsImFkZHJlc3NfY2l0eSI6IkNhbGdhcnksIEFCLCBDYW5hZGEiLCJodGlkb2NpZCI6IkNlQVJpTkFTVGtrSW01X3ZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "iOS Developer",
            "company_name": "Kovasys",
            "location": "Montreal, Quebec, Canada",
            "via": "Kovasys IT Recruitment Agency",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=xkOn_Cohm8HB-6kNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQrCMBAAQLz2CZ4W9CQ1EcGLHhUERUR8QNnEJY3E3ZCNpf7AZ4tzmOY7aebxeocDDZQkU4ElnMSBEhbfgzAcRUKi6a6vNevWWtVkglas0RsvLytMTkb7FKf_Ou2xUE5YqVtvVqPJHBazswyoH4XIcBGuhTC1cHuTI9_CHhkf-AP_4N8ViwAAAA&shmds=v1_AUFQtONZWcNRgyg0V1u55WkCyOYy7ARm2Q4LulyOQoMw0BZCCg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=xkOn_Cohm8HB-6kNAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Our software client in Montreal is looking for intermediate iOS developer to start ASAP.\n• 5 years or less as iOS developer;\n• Experience with SDK iOS10+, Objective C, Swift 4, CoreData, Storyboard et XCode;\n• Comfortable with GIT and agile.",
            "apply_options": [
                {
                    "title": "Kovasys IT Recruitment Agency",
                    "link": "https://kovasys.com/fr/job/ios-montreal-job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://emplois.ca.indeed.com/viewjob?jk=e9d5c12ad40bf634&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.com/c/IT-UNLOCK-CONSULTING-INC./Job/Ios-Developer/-in-Montreal,QC?jid=de0c7d80964d077f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Smart Recruiters Jobs",
                    "link": "https://jobs.smartrecruiters.com/MaaniaConsultancyServices/87190843-ios-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.ca/job-listing/ios-developer-lgs-une-soci%C3%A9t%C3%A9-ibm-an-ibm-company-JV_IC2296722_KO0,13_KE14,48.htm?jl=1009222281837&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Njoyn",
                    "link": "https://groom.njoyn.com/CL/in/share/JobDetails.asp?clid=95811&jobid=J0818-0210&BRID=275202&LANG=1&SBDID=1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://ca.jooble.org/jdp/5932165531170588928?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Dice.com",
                    "link": "https://www.dice.com/job-detail/1bd00fe7-778e-4d47-9e6f-9fa5782fc489?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiS292YXN5cyIsImFkZHJlc3NfY2l0eSI6Ik1vbnRyZWFsLCBRdWViZWMsIENhbmFkYSIsImh0aWRvY2lkIjoieGtPbl9Db2htOEhCLTZrTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        },
        {
            "title": "Senior Ios Developer - Tangerine",
            "company_name": "Scotiabank",
            "location": "Ontario, Canada",
            "via": "Tip Top Job",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=NSEvZr65wT12NRa1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQoCMQwAUFzvEwQhs-hVBBF0VBBdHM79SGvoVWtSmiD3I_6vujxe85k02444SYWzKBzpTVkKVVjCDTlSTUy_X8SDEtYwgDCcRGKm6X4wK7pzTjW3UQ0thTbIywmTl9E9xOufXgesVDIa9evNamwLx_msC2IJPfITEsOVDWuSBRyQ8Y5fgF5y5JgAAAA&shmds=v1_AUFQtOOXhTAnB26NM01lRCru0SkBhLrat1mkPsOnep9hf7-Oug&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=NSEvZr65wT12NRa1AAAAAA%3D%3D",
            "extensions": [
                "22 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "22 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Requisition ID: #\n\nTangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that includes our own internal community. It’s important to us that our employees feel empowered and enthusiastic about belonging to our Orange culture.\n\nAs Canada’s leading digital bank, Tangerine technology is at the heart of everything we do. We have redefined what digital banking is and we continue to evolve on what it can be, using technology to create innovative, forward thinking banking solutions with our clients’ needs in mind. We are made up of high performing, curious, energetic and collaborative individuals who thrive in our high trust agile environment to deliver best in class solutions for our customers. We believe in giving people hands-on challenges and the responsibilities that come with them, allowing them to grow, evolve and create opportunities to build their career. Are you ready to make the change and become part of an established disruptor with the backing of a highly engaged team? If so come join us and help redefine the Canadian banking landscape!\n\niOS Developer\n\nAs an iOS Developer, you'll be joining one of our teams that's rebuilding our mobile banking application. You will be contributing to the development of world-class digital products and experiences on the iOS platform that touch millions of Tangerine customers every day. We're looking to fill our team with influencers, makers, creators and leaders who are flexible, curious, adventurous, versatile and responsive; and who are ready to roll up their sleeves in a collaborative and productive environment to get things done. By joining our team, you will make an impact on our customers and the banking industry.\n\nIs this role right for you? In this role you will:\n\n-You dream in code\n\n-You spend your free time tinkering with new technologies or building apps on the side\n\n-You want to solve real problems that will flip a multi-billion dollar industry on its head\n\n-Interested in the impact that financial services technology can have on people’s everyday lives\n\n-Experienced in user-centered design\n\n-Eager to mentor, teach and share\n\n-Continuous integration and deployment makes you giddy\n\n-Knowledge of the latest and greatest approaches to Agile Technical Practices\n\n-You enjoy collaborating and working alongside people with different skillsets\n\nDo you have the skills that will enable you to succeed in this role? We'd love to work with you if you have:\n\n-5 or more years of iOS development (conceptualization, design, development and debugging)\n\n-Strong knowledge of the iOS platform, Swift, UIKit, Auto Layout and building UI programmatically\n\n-Bonus points for knowledge of RxSwift, SwiftUI and Combine\n\n-Familiarity with mobile architectural and design patterns\n\n-Experience with XCTest and unit-testing\n\n-Deep knowledge of iOS design best practices and Apple’s Human Interface Guidelines\n\n-Familiarity with mobile accessibility\n\n-Experience with building applications that consume RESTful APIs\n\n-Experience with tools such as Jira, Github and Confluence\n\n-Experience with debugging iOS applications and using Instruments\n\nWhat's in it for you?\n\n-Diversity, Equity, Inclusion & Allyship - We strive to create an inclusive culture where every employee is empowered to reach their fullest potential, respected for who they are, and are embraced through bias-free practices and inclusive values across Scotiabank. We embrace diversity and provide opportunities for all employee to learn, grow & participate through our various Employee Resource Groups (ERGs) that span across diverse gender identities, ethnicity, race, age, ability & veterans.\n\n-Accessibility and Workplace Accommodations - We value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. Scotiabank continues to locate, remove and prevent barriers so that we can build a diverse and inclusive environment while meeting accessibility requirements.\n\n-Upskilling through online courses, cross-functional development opportunities, and tuition assistance.\n\n-Competitive Rewards program including bonus, flexible vacation, personal, sick days and benefits will start on day one.\n\n-Community Engagement - no matter where you choose to work from; we offer opportunities for community engagement & belonging with our various programs such as hackathons, contests, cooking with friends, Humans of Digital and much more!\n\nWork arrangements: Hybrid\n\n#LI-Hybrid\n\nLocation(s): Canada : Ontario : Toronto\n\nAt Tangerine we value the unique skills and experiences each individual brings to the team, and are committed to creating and maintaining an inclusive and accessible environment. If you require accommodation during the recruitment and selection process, please let our Recruitment team know.",
            "apply_options": [
                {
                    "title": "Tip Top Job",
                    "link": "https://www.tiptopjob.com/search/jobs/131445813_-senior-ios-developer-tangerine-toronto-ontario-canada-_job.asp?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSW9zIERldmVsb3BlciAtIFRhbmdlcmluZSIsImNvbXBhbnlfbmFtZSI6IlNjb3RpYWJhbmsiLCJhZGRyZXNzX2NpdHkiOiJPbnRhcmlvLCBDYW5hZGEiLCJodGlkb2NpZCI6Ik5TRXZacjY1d1QxMk5SYTFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lHUTJGdVlXUmgifQ=="
        },
        {
            "title": "Leading iOS Developer for Innovative Solutions",
            "company_name": "Arlo Technologies Canada Limited",
            "location": "Richmond, BC, Canada",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.ca/search?ibp=htl;jobs&q=iOS+developer&htidocid=gK0MuNvB06RMjU1-AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3LwWrCQBCHcXr1EXqas2hSBKHUk41SFEHQ3mWzGXenbOYfdtbg0_XZWsHLd_nxTX5fJtsDu040kBzPtOGREwbOdEWmnSpGV2RkOiPdikCN5rRHS8Yu-0hQ-gJC4tdVLGWwj7o2S1Ww8r_5yqOvodziXv-gtUcuFl3mIbnCl8Xy7V4NGqbv65xA3-yjIiEIGzVOXefoIL0U7kiUTuJjD-1m9NnMnv4H63deBcEAAAA&shmds=v1_AUFQtOPFE3zTo1BJH8LW1NB9fAcgVaEgzJyFYEkTTpkfYqJbKw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=gK0MuNvB06RMjU1-AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/67850820dafde12bb9464b5e/images/1d9ba63870e9f0d38e5580409ef590e9b1170345e64d5ab67626258455226b84.gif",
            "extensions": [
                "4 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "4 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Arlo Technologies Canada Limited is a leader in the field of innovative solutions, and we are seeking an experienced Senior iOS Developer to join our team.\n\nWe believe that everyone deserves to feel safe and secure, whether they're at home or away, and we're committed to providing our customers with the peace of mind they need to live their lives without worry. Our deep expertise in AI- and CV-powered analytics, cloud services, user experience, product design, and innovative wireless and RF connectivity enables the delivery of a seamless, smart security experience for Arlo users.\n\nThis role offers an exciting opportunity to play a pivotal part in shaping the future of the Arlo device ecosystem by designing, developing, and maintaining high-quality, scalable iOS applications across various projects. As a proactive and innovative member of our cross-functional team, you will work closely with firmware engineers, product managers, and UX professionals to deliver exceptional products that align with business objectives.\n\nThe ideal candidate will possess strong experience in iOS development, including building native mobile (iOS) applications with a focus on performance and robustness, as well as multi-threaded, asynchronous code. Familiarity with SOLID Design Principles, design patterns such as MVC, MVVM, VIPER, and version control systems like Git is also essential. Effective communication skills, both written and verbal, are crucial for success in this role.\n\nOur salary range for this position reflects the minimum and maximum target for new hire salaries at commencement of employment and is expected to be between $105,000-$165,000 per year. However, base pay offered may vary depending on multiple factors, including role, job-related knowledge, skills, relevant education, and experience. The total compensation package for this position may also include other elements, including bonus, equity, and a full range of benefits.",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://ca.trabajo.org/job-3051-0fdbc32e0a2a282a6c33c6d6d6931e3b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkaW5nIGlPUyBEZXZlbG9wZXIgZm9yIElubm92YXRpdmUgU29sdXRpb25zIiwiY29tcGFueV9uYW1lIjoiQXJsbyBUZWNobm9sb2dpZXMgQ2FuYWRhIExpbWl0ZWQiLCJhZGRyZXNzX2NpdHkiOiJSaWNobW9uZCwgQkMsIENhbmFkYSIsImh0aWRvY2lkIjoiZ0swTXVOdkIwNlJNalUxLUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUdRMkZ1WVdSaCJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVR3RFU25od1RuVXRPVGhUVFdsaFRtSXlOV2M0TURkd1VXZzVURzE0U2xSdGJYTlFZMDFtVkdsRlFtNVZTRFJrVTAwNE9VaGhRMjFHTjIxMlJHTllRMmc1UlhKamRHTjRTV2hRTTBkbmVtZDRSVzh3VUhwUGJsODFYMUl3VEZsVU5uQktWRkJHU2tSellqSlhPVFkxYTI4eVUzRlVVMjlqVlU4NWVqWjRPRWhGUjA1bVlpMWhMVzlCTW5CMmVsVTFUWFEyVG5kcFVraHBZbGh4ZUVScVJYTklWMkU0ZVhSYVEyNTVhazFFV0doT1IyNVdNMjF5ZGxSemRXdFdaVXh0UzNseUxXUldlWFJ0UlhWR1VuTkthVEV3Y1hCMldtb3piMEZsZDJsWUxWVnVkRkl5Y1VFd1RYaE1UV0ZWUkdObmFrUnpWWGQ1YjBsblJGOHpiMDFQT0hGQmJscHhXQklYU1ZGcFJsbzRNa3RMWmxkSU1GQkZVSEZsVjJ4cFFXTWFJa0ZHV0hKRlkzSmlkR0ZpVEMxQmIzbHlUVlYzUkhkZlRtZE1TbHA1VFdGaFFsRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.ca&location=Canada&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJVR3RFU25od1RuVXRPVGhUVFdsaFRtSXlOV2M0TURkd1VXZzVURzE0U2xSdGJYTlFZMDFtVkdsRlFtNVZTRFJrVTAwNE9VaGhRMjFHTjIxMlJHTllRMmc1UlhKamRHTjRTV2hRTTBkbmVtZDRSVzh3VUhwUGJsODFYMUl3VEZsVU5uQktWRkJHU2tSellqSlhPVFkxYTI4eVUzRlVVMjlqVlU4NWVqWjRPRWhGUjA1bVlpMWhMVzlCTW5CMmVsVTFUWFEyVG5kcFVraHBZbGh4ZUVScVJYTklWMkU0ZVhSYVEyNTVhazFFV0doT1IyNVdNMjF5ZGxSemRXdFdaVXh0UzNseUxXUldlWFJ0UlhWR1VuTkthVEV3Y1hCMldtb3piMEZsZDJsWUxWVnVkRkl5Y1VFd1RYaE1UV0ZWUkdObmFrUnpWWGQ1YjBsblJGOHpiMDFQT0hGQmJscHhXQklYU1ZGcFJsbzRNa3RMWmxkSU1GQkZVSEZsVjJ4cFFXTWFJa0ZHV0hKRlkzSmlkR0ZpVEMxQmIzbHlUVlYzUkhkZlRtZE1TbHA1VFdGaFFsRSIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}