{
    "search_metadata": {
        "id": "6785088127c4a5b6aff2de9a",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/db1ef1e1f2e1dc5e/6785088127c4a5b6aff2de9a.json",
        "created_at": "2025-01-13 12:35:13 UTC",
        "processed_at": "2025-01-13 12:35:13 UTC",
        "google_jobs_url": "https://www.google.lt/async/callback:550?q=iOS+developer&uule=w+CAIQICIJTGl0aHVhbmlh&udm=8&fc=EswCCowCQUpHOUprT01HNjZlcnJldWVmaTA1dmF6V3l5dTUwUjV1Sk05ZFMxLTR0aEJjTldCUnlNcThhbWNzbHBCUzU2NGE5MkFsam5fNFlxMEc5YXBoOTNFdmtsLTdDVE1vSlVRTnZiVk1Hc0J1OVRqTUJhYkZVYjRBQVI5dXZscWJuNUVmOWROUGYxVjlJTFZFRzFVLWRMcXI5RVJsOTZaZVV3Umg3MWpEcVZaY2tZcjZLNjVVU1FIdjNzVmY3OUtSam8zOVB1UjBXRU04dmMzb2VEUXV3Z0JoNXV3NmttSmJCWUVHTERkNGRaRFQ5UVBISnhreUp4OWdyLThXcHVaXzctc09sSnFNQmRuRW92YRIXZ0FpRlo1ZVROb3VId2JrUGxyeVktUU0aIkFGWHJFY295STkyOGFSR1BPRkhzUXZReHV5dlQ1SWlYVmc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/db1ef1e1f2e1dc5e/6785088127c4a5b6aff2de9a.html",
        "prettify_html_file": "https://serpapi.com/searches/db1ef1e1f2e1dc5e/6785088127c4a5b6aff2de9a.prettify",
        "total_time_taken": 1.95
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Lithuania",
        "location_used": "Lithuania",
        "google_domain": "google.lt",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMDFITmpabGNuSmxkV1ZtYVRBMWRtRjZWM2w1ZFRVd1VqVjFTazA1WkZNeExUUjBhRUpqVGxkQ1VubE5jVGhoYldOemJIQkNVelUyTkdFNU1rRnNhbTVmTkZseE1FYzVZWEJvT1RORmRtdHNMVGREVkUxdlNsVlJUblppVmsxSGMwSjFPVlJxVFVKaFlrWlZZalJCUVZJNWRYWnNjV0p1TlVWbU9XUk9VR1l4VmpsSlRGWkZSekZWTFdSTWNYSTVSVkpzT1RaYVpWVjNVbWczTVdwRWNWWmFZMnRaY2paTE5qVlZVMUZJZGpOelZtWTNPVXRTYW04ek9WQjFVakJYUlUwNGRtTXpiMlZFVVhWM1owSm9OWFYzTm10dFNtSkNXVVZIVEVSa05HUmFSRlE1VVZCSVNuaHJlVXA0T1dkeUxUaFhjSFZhWHpjdGMwOXNTbkZOUW1SdVJXOTJZUklYWjBGcFJsbzFaVlJPYjNWSWQySnJVR3h5ZVZrdFVVMGFJa0ZHV0hKRlkyOTVTVGt5T0dGU1IxQlBSa2h6VVhaUmVIVjVkbFExU1dsWVZtYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Developer - Spanish/English - Full Remote",
            "company_name": "Jobs4java.eu",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOQQrCMBBFcdsb6GrWgomIbnRbFVQQ7AHKtAxJSpoJmbT0Qt7TuPmf9xePX31X1bOh4DiBezdQ00yeIyXYQRMxOLH6GowvXZbb5D18aORMhR7cgRCm3gIHuDMbT5uLzTnKWWsRr4xkzK5XPY-aA3W86IE7-UcrFhNFj5naw2m_qBjMdl2UchxwRkUTuAAvl-1UXuAPL6_fZKgAAAA&shmds=v1_AUFQtOMG1rc3VqgKTshmHECTxxI2DdEr722TjPtft0nYIgRaVQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d95a942068f11d301099df90f7579c97790db21afac2d370190.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "This a Full Remote job, the offer is available from: Europe\n\nThis is a remote position.\n\nWe are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improve/learn.\n\nThis position is only open for employees, who would like to work remote. Candidates need to be willing to go to the office in Murcia for 5 days on a quarterly base.\n\nTasks and Responsibilities:\n\n​\n• Design and develop software solutions to client requirements;\n• Participate in identifying problem areas and defining solutions;\n• Able to articulate problems and solutions in non-technical language to stakeholders;\n• Understand interactions and dependencies between software components;\n• Support the product engineering lead(s) in project set up, execution and key ceremonies including backlog refinement, sprint planning, demos and retrospectives;\n• Support learning and development activities for junior product engineering resources;\n\nProfile:\n• College / university degree, Bacc. Ing. Comp (or similar);\n• +2 years of iOS mobile development experience (Swift, Objective-C, ...);\n• +5 years of software development experience;\n• Strong understanding of Apple’s design principles & interface guidelines;\n• Candidates need to have a good level of English and/or willing to improve/learn;\n\nOffered:\n• Attractive salary package (employees);\n• Career development training;\n• English classes;\n\nInterested: Please send your resume to\nresume@jobs4java.eu\n\nThis offer from \"Jobs4java.eu\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/65ef62f6f235ccdf79169158-senior-ios-developer---spanish-english---full-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAtIFNwYW5pc2gvRW5nbGlzaCAtIEZ1bGwgUmVtb3RlIiwiY29tcGFueV9uYW1lIjoiSm9iczRqYXZhLmV1IiwiYWRkcmVzc19jaXR5IjoiTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiJEWUtkblRqb1V4NXliMjA5QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Senior Engineer, iOS",
            "company_name": "PayPal",
            "location": "Kaunas, Lithuania",
            "via": "Jobaaj",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=dFZ4bv1d7Erxz-_WAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEwQrCMAwAULzuE_SSs85VBC96FkEFB_uAkY3QZtSkNB3ML_C3xXd41XdV7ToS1gxX8SxEuQZ-dbCHuw5ghHkMoAI3VR9pfQmlJDs7ZxYbbwULj82ob6dCgy5u0sH-9RYwU4pYqD-eDkuTxG83LX5ajMACD5wFrYYnlzCjMP4ARvWI8YoAAAA&shmds=v1_AUFQtOOKLctxbRXk6nycIMdtZCG_UDm15d3SJJqwjPgLoJad0A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=dFZ4bv1d7Erxz-_WAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d95678192f3e1caa20cbb1b6869e0775784030c7adaac0de6b8.gif",
            "extensions": [
                "27 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time"
            },
            "description": "The CompanyPayPal has been revolutionizing commerce globally for more than 25 years. Creating innovative experiences that make moving money, selling, and shopping simple, personalized, and secure, PayPal empowers consumers and businesses in approximately 200 markets to join and thrive in the global economy.We operate a global, two-sided network at scale that connects hundreds of millions of merchants and consumers. We help merchants and consumers connect, transact, and complete payments, whether they are online or in person. PayPal is more than a connection to third-party payment networks. We provide proprietary payment solutions accepted by merchants that enable the completion of payments on our platform on behalf of our customers.We offer our customers the flexibility to use their accounts to purchase and receive payments for goods and services, as well as the ability to transfer and withdraw funds. We enable consumers to exchange funds more safely with merchants using a variety of funding sources, which may include a bank account, a PayPal or Venmo account balance, PayPal and Venmo branded credit products, a credit card, a debit card, certain cryptocurrencies, or other stored value products such as gift cards, and eligible credit card rewards. Our PayPal, Venmo, and Xoom products also make it safer and simpler for friends and family to transfer funds to each other. We offer merchants an end-to-end payments solution that provides authorization and settlement capabilities, as well as instant access to funds and payouts. We also help merchants connect with their customers, process exchanges and returns, and manage risk. We enable consumers to engage in cross-border shopping and merchants to extend their global reach while reducing the complexity and friction involved in enabling cross-border trade.Our beliefs are the foundation for how we conduct business every day. We live each day guided by our core values of Inclusion, Innovation, Collaboration, and Wellness. Together, our values ensure that we work together as one global team with our customers at the center of everything we do - and they push us to ensure we take care of ourselves, each other, and our communities.Job Description Summary:Job Description:Meet Your TeamPayPal is transforming global commerce. Our Engineering team is the heart of this transformation. Were building innovative solutions that delight customers and drive business growth. Join our dynamic engineering team at PayPal, where youll have the opportunity to collaborate with talented peers and work on high-impact projects in an agile environment. Were not just building systems were creating scalable, high-performance solutions that make a real difference in global commerce. We prioritize code quality, customer focus, and rapid iteration. Our engineers work closely with design, product, and QA teams to deliver world-class experiences.Your way to impactAt PayPal, Mobile Software Engineers are the architects of PayPals advanced applications for iOS platforms.Youll design, develop, and optimize core systems powering millions of transactions daily, delivering innovative solutions that delight customers and drive business success.Your day-to-day:As an iOS Software Engineer, you will:Drive innovation and technical excellence in mobile development.Lead complex mobile projects and teams.Collaborate with product leadership to define mobile product strategy.Mentor and develop high-performing engineering teams.Architect and implement scalable mobile solutions and Champion technical excellence and best practices.Stay up to date with emerging mobile technologies.What you need to bring:Bachelors degree in Computer Science or related field.5+ years of experience in mobile app development.Expert proficiency in Swift/Objective-C.Strong object-oriented skills including design, coding and testing patterns.Familiarity with database technologies (SQL and NoSQL databases) and ORM frameworks (Hibernate, JPA).Ability to design scalable, reliable, and maintainable software systems.Thorough understanding of XCodeStrong leadership and communication skills.Preferred Qualifications:Experience with mobile performance optimization, testing and integrations.Knowledge of security best practices for mobile apps.Experience in mobile integration, development and maintenance.Familiarity with continuous integration (Jenkins), application monitoring (Crashlytics and fabric.io), mocking tools (Appium and Apiary), build tool development and enhancements, using unit testing and cucumber tests for functional tests.Contributions to open-source mobile projects.Proficiency in Swift, Objective-C, React Native.Additional Job Description:PayPal is committed to fair and equitable compensation practices.Actual compensation is based on various factors including but not limited to work location, and relevant skills and experience.The total compensation for this position may include an annual performance bonus (or other incentive compensation, as applicable), equity, and medical, dental, vision, and other benefits.For more information, visit https://www.paypalbenefits.com.The U.S. national annual pay range for this role is $84,500 to $204,600Subsidiary:PayPalTravel Percent:0For the majority of employees, PayPals balanced hybrid work model offers 3 days in the office for effective in-person collaboration and 2 days at your choice of either the PayPal office or your home workspace, ensuring that you equally have the benefits and conveniences of both locations.Our Benefits:At PayPal, were committed to building an equitable and inclusive global economy. And we cant do this without our most important asset-you. Thats why we offer benefits to help you thrive in every stage of life. We champion your financial, physical, and mental health by offering valuable benefits and resources to help you care for the whole you.We have great benefits including a flexible work environment, employee shares options, health and life insurance and more. To learn more about our benefits please visit.Who We Are: to learn more about our culture and community.Commitment to Diversity and Inclusion PayPal provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, pregnancy, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state, or local law. In addition, PayPal will provide reasonable accommodations for qualified individuals with disabilities. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact usat .Belonging at PayPal:Our employees are central to advancing our mission, and we strive to create an environment where everyone can do their best work with a sense of purpose and belonging. Belonging at PayPal means creating a workplace with a sense of acceptance and security where all employees feel included and valued. We are proud to have a diverse workforce reflective of the merchants, consumers, and communities that we serve, and we continue to take tangible actions to cultivate inclusivity and belonging at PayPal.Any general requests for consideration of your skills, please . We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates. Please dont hesitate to apply.Notice to Applicants and Employees who reside within New York City. Click to view the notice.",
            "apply_options": [
                {
                    "title": "Jobaaj",
                    "link": "https://www.jobaaj.com/job/paypal-senior-engineer-ios-inida-5-to-7-years-484795?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRW5naW5lZXIsIGlPUyIsImNvbXBhbnlfbmFtZSI6IlBheVBhbCIsImFkZHJlc3NfY2l0eSI6IkthdW5hcywgTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiJkRlo0YnYxZDdFcnh6LV9XQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Developer Support Engineer",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Built In Toronto",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQ7CMAxAUbH2CCx4RtAAEguMgJCACQ5QuZWVBAU7ih3Ua3BjYPnDW37zmTTrI70pSaYCj5qzFIMT-8j0gyVcpAclLEMAYTiL-ETTfTDLunNONbVeDS0O7SAvJ0y9jO4pvf7TacBCOaFRt9muxjazn8_uvx9XOqBBZLhiZdQF3KKFihzxC3F0JeaUAAAA&shmds=v1_AUFQtOMiyj0gT9vHODY-FDIeLLActhCP-LUm0H7E8qznmcpfDA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=h64GvhFeO7yrtKaVAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d954e0e743e9a767b1ce02071b23ccd46b26203755540c78832.gif",
            "extensions": [
                "18 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "18 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like ChatGPT, VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nIf you’re looking to jumpstart your career in tech and have a direct impact on apps used by billions of end-users, the Developer Support Engineer (DSE) role at RevenueCat is a fantastic opportunity. This is one of the few entry-level positions we offer, and it has proven to be an incredible stepping stone—our current Support Lead, a Product Manager, and a Technical Account Manager each started out as DSEs.\n\nIn this role, you’ll help developers integrate the RevenueCat SDK into their apps, troubleshoot tricky edge cases, and unlock new possibilities in subscription monetization. You’ll provide hands-on support for some of the biggest apps in the world—imagine helping the teams behind ChatGPT, VSCO, PhotoRoom, Notion, and others get the best out of RevenueCat. You’ll be empowered to own the support experience, build out internal tools, and identify improvements that shape how developers everywhere use RevenueCat.\n\nIn 2024, our DSEs spoke at conferences in Berlin, Logroño, New York, London, and Tokyo. This is optional, but if you're interested, you can meet RevenueCat customers face to face, have fun working our booth, and share your knowledge with developers worldwide.\n\nWhat you’ll be responsible for\n• Supporting developers daily. You’ll debug issues, untangle complex code paths, and guide developers through onboarding so they can ship subscription features confidently.\n• Collaborating cross-functionally. You’ll partner closely with Engineering and Product to influence the developer experience—everything from our documentation to new features.\n• Building tooling and processes. You’ll craft or improve the internal apps and dashboards that make troubleshooting faster and easier, both for you and your teammates.\n• Driving user success. From investigating stack traces to clarifying best practices, you’ll ensure developers can move from “blocked” to “shipped” without missing a beat.\n\nWithin your first month, you’ll:\n• Deep-dive into the frustrations and roadblocks developers face, helping them get unblocked so they can launch their apps.\n• Familiarize yourself with our support tools and processes.\n• Propose and implement quick wins in our documentation and support articles to reduce common developer pitfalls.\n• Work alongside our engineering team to resolve complex issues and learn the ins and outs of subscription infrastructure.\n\nWithin your first 3 months, you’ll:\n• Spot opportunities for product improvements that will reduce developer friction.\n• Build out test apps and reproducible environments to tackle issues head-on.\n• Own onboarding and solution engineering for new developers using RevenueCat, providing a seamless start-to-finish experience.\n\nWithin your first 6 months, you’ll:\n• Identify recurring blockers and implement targeted improvements—both in our products and in your own support workflows.\n• Craft (and refine) internal dashboards and tooling that accelerate the DSE team’s efficiency.\n• Make meaningful, self-directed contributions to how we scale support for an ever-growing developer community.\n\nAfter 12 months, you’ll have:\n• Gained super-hero level intuition for diagnosing the root causes of even the trickiest tickets.\n• Led the charge on hiring, mentoring, and growing our support engineering team.\n• Found new ways to delight developers, turning frustrating subscription problems into smooth, joyful experiences.\n\nAbout you\n• You’re eager to learn and grow; this is one of the few entry-level positions at RevenueCat and has historically launched multiple careers within our company.\n• You have 2-3 years of experience in an engineering or technical role, or have built and shipped a mobile app that integrates RevenueCat.\n• You’re comfortable with either iOS (Swift / Objective-C) or Android (Java / Kotlin) and have a grasp of app development and release processes.\n• You can debug code with minimal info, diagnosing issues from cryptic logs or stack traces.\n• You thrive in an environment that requires creative problem-solving and a “get it done” mentality.\n• You have strong written and verbal communication skills, and you’re empathetic towards the developer journey.\n\nWhat you’ll need to be successful\n• Technical curiosity and a willingness to learn new tools and frameworks.\n• Resourcefulness in figuring out solutions when the path isn’t obvious.\n• Clear communication skills to translate complex issues into helpful, actionable steps.\n• Outcome-oriented mindset, ensuring your support leads to measurable developer success—fewer tickets, better documentation, and happier customers.\n• Collaboration and comfort with a fully remote, asynchronous setup using tools like Slack, Zoom, Linear, and Notion.\n\nWhat we offer:\n• $112,000 USD Salary regardless of your location\n• Competitive equity in a fast-growing, Series B startup backed by top tier investors including Y Combinator\n• 10 year window to exercise vested equity options\n• Fully remote work environment that promotes autonomy and flexibility\n• Suggested 4 to 5 weeks time off to recharge and focus on mental, physical, and emotional health\n• $2,000 USD to build your personal workspace\n• $1,000 USD annual stipend for your continuous learning and growth\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.",
            "apply_options": [
                {
                    "title": "Built In Toronto",
                    "link": "https://builtintoronto.com/job/developer-support-engineer/3641684?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJEZXZlbG9wZXIgU3VwcG9ydCBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlJldmVudWVDYXQiLCJhZGRyZXNzX2NpdHkiOiJLYXVuYXMsIExpdGh1YW5pYSIsImh0aWRvY2lkIjoiaDY0R3ZoRmVPN3lydEthVkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Flutter Developer",
            "company_name": "Scale3C",
            "location": "Vilnius, Lithuania",
            "via": "Lever",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=EhkdcYfXnlpLTUQFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQoCMQwAUFzvEwQho4heRXHRUVEQN8H1SEu4VmJTLqncF_jd6vJ4zWfSzM9czWiAE72Jpfy2gqt4UMIhRJAMF5GeaXqIZkX3zqly26uhpdAGeTnJ5GV0T_H6p9OIAxVGo26zW49tyf1idg_ItD1CyvBInFPVJdySxYo54Rfw7EtsiQAAAA&shmds=v1_AUFQtOOFgRJPOdb3fWgtDLlQGNok49rs3CV4OAYLFuJD5cWy5w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=EhkdcYfXnlpLTUQFAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Who we are\n\nWe’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web & mobile development and bespoke UX/UI design. No matter how big or small our client’s organization and budgets are, we’ve got a solution for them. This means you have a chance to work with both small and medium-sized businesses. We also provide outsourcing & outstaffing services to our clients.\n\nWhat we are looking for\n\nLooking for a Flutter developer for a full-time job as a contractor in our clients team.\n\nDay to Day\n• Flutter application development\n• Working together with other developers, project manager and UX/UI designer to build smooth & scalable app\n• Learn best software development practises with your colleagues\n• Contribute to quality by identifying spots of improvements\n• Experience with REST API, HTTPS\n\nYou are someone who has...\n• At least 2 years experience as a Software Developer\n• At least 2 year experience with Flutter SDK and Dart language\n• Rich experience in different screens layouting/supporting\n• Experience in building at least 1 Android and/ or iOS application using Flutter\n• Understanding and experience with state-management patterns: Provider, BLoC / MobX\n• Strong experience with Git / Git Flow\n• Strong communication, problem-solving skills\n• Fluency in English language\n• Experience (as an advantage) with Flutter for Web, Flutter for Desktop/ Flutter Platform Channels; in Android development (Android SDK)/ iOS development (Xcode, iOS SDK); with Agile methodologies (Scrum, Kanban)\n\nWhy you’ll love working with Scale3C\n• Work with some of the world’s leading and most recognized brands\n• Have the opportunity to work 100% remote from any country around Europe\n• Office in Vilnius city center\n• Cool and vibrant work environment\n\n€25 - €35 an hour\n\nInterested in the position? We are looking forward to your application, to connect and talk more!\n\nBest regards,\n\nTalent acquisition team",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/scale3c/fe8ff793-1235-49cd-9a9e-0f0d2d848b85?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Built In",
                    "link": "https://builtin.com/job/flutter-developer/2714359?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Layboard",
                    "link": "https://layboard.com/ua/vakansiya/320426/flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/flutter-developer-at-orion-innovation-3932153687?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=78662908099076806&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlNjYWxlM0MiLCJhZGRyZXNzX2NpdHkiOiJWaWxuaXVzLCBMaXRodWFuaWEiLCJodGlkb2NpZCI6IkVoa2RjWWZYbmxwTFRVUUZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVEdsMGFIVmhibWxoIn0="
        },
        {
            "title": "Senior Mobile Developer (Android)",
            "company_name": "Spike Technologies",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "LinkedIn",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=Mye4jIyHtFBV9revAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXHsQrCMBCAYVz7CE43qtRWBEF0kgqC2ElxlTQ9mtN4F3Kp6Lv5cOrg8vP92XuQLY_IJBFqacgjbPGBXgJGGG24jULtGKawlwYUTbQOhGEn0nkcrl1KQVdlqeqLTpNJZAsr91IYG3mWV2n0l4s6EzF4k_AyX8yeReBuUh0D3RBOaB2Ll45QgRjO5Jl6zf-AitIL6p7JUjD-OzkcKLneMJkP_uTja78AAAA&shmds=v1_AUFQtOM2YC-VeRLL3KHmMiLQmYK10HrFdla1-bieONcsj3CEcQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Mye4jIyHtFBV9revAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d95dd1907f06517c636a864f07dd25a28378a11e0163a06069d.gif",
            "description": "Spike Technologies is at the forefront of building cutting-edge Data Engineering and Generative AI technology. We are seeking a Senior Mobile Developer to join our team to build scalable mobile solutions that serve our enterprise clients in the HealthTech industry. This role involves working with proprietary data from Wearables, IoT devices, and other sensors to create mobile experiences that deliver near-real-time data and GenAI insights.\n\nResponsibilities:\n• Lead the design, development, and maintenance of mobile solutions for Android platforms (some work for iOS is expected also).\n• Collaborate with cross-functional teams, including data engineering and product management, to define and implement features for our mobile apps.\n• Ensure the mobile solutions are scalable, reliable, and optimized for a seamless user experience.\n• Implement integrations with backend systems, data engineering pipelines, and microservices.\n• Conduct unit tests, debugging, and performance optimization to ensure stability and responsiveness.\n• Stay current with the latest mobile development technologies, frameworks, and best practices.\n\nQualifications:\n• 5+ years of experience in mobile software development, with expertise in Android (Kotlin, Java)\n• Experience with cross-platform mobile development frameworks such as React Native or Flutter\n• Familiarity with CI/CD pipelines and infrastructure automation for mobile app deployments\n• Experience with mobile analytics and crash reporting tools\n• Strong problem-solving skills and ability to thrive in a fast-paced, dynamic environment\n\nGood to have:\n• Familiarity with cloud platforms like AWS, Azure, or Google Cloud Platform\n• Background in systems design and architecture\n• Experience with developing and maintaining frameworks\n\nWhat we offer:\n• Base salary starts from €4000 gross\n• Generous stock options package with a significant upside\n• Hybrid working model (offices in Vilnius, Lithuania and Palo Alto, CA)\n• USA work visa sponsorship and relocation to Silicon Valley HQ where applicable\n• Dynamic growth: dive into AI and Data tech, seizing high-growth opportunities with cutting-edge projects.\n• Talented peers: collaborate with a smart, ambitious team comprising data scientists, PhDs, Cambridge alumni, and tech industry pros (formerly from Bloomberg, Goldman Sachs, and Google).\n• Solid backing: enjoy stability and ample resources for success, supported by reputable venture capitalists.\n\nAt Spike Technologies, diversity is celebrated, and inclusion is our priority. We welcome applicants from all backgrounds to join our innovative team and contribute to our inclusive culture.\n\nSounds like you? Let's talk.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/senior-mobile-developer-android-at-spike-technologies-4074693615?refId=7kMruy5ptvGRfzGXJ4ni6g%3D%3D&trackingId=9bbZLXi0tCARz7eWgiK%2Bzg%3D%3D&position=3&pageNum=0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "TheVentureCity Job Board",
                    "link": "https://careers.theventure.city/jobs?q=Flutter+Developer&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciAoQW5kcm9pZCkiLCJjb21wYW55X25hbWUiOiJTcGlrZSBUZWNobm9sb2dpZXMiLCJhZGRyZXNzX2NpdHkiOiJWaWxuaXVzLCBWaWxuaXVzIENpdHkgTXVuaWNpcGFsaXR5LCBMaXRodWFuaWEiLCJodGlkb2NpZCI6Ik15ZTRqSXlIdEZCVjlyZXZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lKVEdsMGFIVmhibWxoIn0="
        },
        {
            "title": "Flutter Mobile Developer",
            "company_name": "Raketech",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQoCMQyAYVxvd3HKLNiK4KKrKIguvsCRlnCtxqY0ObkX8L09l3_4hr_7Ljp_5tGMGtwlZCY40YdY6gwbuEoAJWwxgRS4iAxMq2Myq3rwXpXdoIaWo4vy9lIoyOSfEvSfXhM2qoxG_W6_nVwtw3r5wBcZzcNc4JYtjVgy_gD4xR6ciAAAAA&shmds=v1_AUFQtOO-dg92LZZHI01a6dJigajmKgMmA86-5tHIP0HBClHxdg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=sFyaL7yuGTdSdI4NAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d953dbb56a1750897a6cfc09cf12e60fec90ee98f4f83759814.gif",
            "extensions": [
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Portugal\n\nThe role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or Malta.\n\nWe are looking for an enthusiastic Flutter Mobile Developer to help maintain and develop our sports mobile applications.\n• As a Flutter Mobile Developer you are expected to …\n• Write clean, well-documented, and maintainable code for Flutter application\n• Develop and maintain technical documentation for the applications\n• Identify the causes of the most complex issues and implement practical and efficient technical solutions\n• Implement both backend and front-end features\n• Coordinate with UX/UI designers, developers, and test engineers in an Agile environment\n• Abide by industry and company software development standards\n• Conduct code reviews and give feedback to other developers\n• Understand the big picture and offer insightful advice about technologies and projects\n• Be proactive in identifying and communicating potential risks and issues to the team and stakeholders\n• Participate in sprint planning, estimation, and retrospective meetings\n• Keep up-to-date with the latest mobile app development trends and technologies\n• Work in close partnership with cross-functional teams and management\n• Ensure code quality by writing tests, using SonarQube, etc.\n• Success in this role means...\n• Collaborating towards a team effort to improve the overall user experience of our applications.\n• Developing DRY, clean, maintainable and scalable code that can be comprehended and worked on solely through documentation created.\n• Increasing the performance, scalability and security of our mobile applications.\n• You have acquired proficient communication skills in the English language through team collaboration.\n\nThis offer from \"Raketech\" has been enriched by Jobgether.com and got a 86% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66e4d25a5ae7155b1774745b-flutter-mobile-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIE1vYmlsZSBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJSYWtldGVjaCIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoic0Z5YUw3eXVHVGRTZEk0TkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Flutter Engineer",
            "company_name": "Orion Innovation",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "LinkedIn",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=MdaHR_w2vs4fPMVpAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXMsQoCMRAEUGzvE6y2E-S8iGCjlYiKotjZHrkQkpW4G5KN6Cf5l8bCZnhTzDSfUTPZhyJiE-zIIdmKGZx4gGx1Mh6Y4MDsgh2vvUjMK6VyDp3LogVNZ_ihmOzAL3XnIf-iz14nG4MW2y-W81cXyU0314T16kjEzzqsRIIbBsKS2z9gi_KGSyE0GHWopYUzii-aUH8BTbrgaKwAAAA&shmds=v1_AUFQtONOFEKiKrgoB5RVDKehTbUdmVdMPrsNpiwJRG3f3dZACQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=MdaHR_w2vs4fPMVpAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d95e6bc195359301332d249e9f5387ece327fc68b9b7c9c5b8b.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Are you passionate about mobile app development and proficient in Flutter? We are looking for a talented Flutter Mobile Developer to join our dynamic team in Vilnius, Lithuania. We want to hear from you if you thrive in a collaborative environment and have a knack for creating high-quality, efficient, and reliable code!\n\nResponsibilities:\n• Review project requirements and translate them into technical implementation for mobile applications using Flutter.\n• Develop and maintain clean, efficient, and reliable code using the Flutter framework.\n• Write unit and integration tests for your code to ensure its quality and reliability.\n• Collaborate with cross-functional teams to design and implement mobile applications.\n• Review software designs and code implementations by team members and provide constructive feedback.\n• Continuously optimize and improve code quality, adhering to best practices and principles such as OOP, SOLID, DRY, and Clean Architecture.\n• Demonstrate a deep understanding of mobile app development principles, including lifecycle management, permissions, data storage, and adherence to UX/UI guidelines.\n• Troubleshoot and resolve technical issues to ensure the functionality and performance of mobile apps.\n• Maintain a high level of proficiency in the use of Git for version control.\n• Effectively communicate and collaborate with management and other engineering teams on design and technology decisions.\n• Explore and implement advanced features, such as image, video, and audio content processing, as required by the project.\n• Collaborate on projects involving Location Services, Push Notifications, BLE, Firebase, In-App Purchase, Google Maps, and Mapbox.\n\nRequirements:\n• 2+ years of experience in Android or iOS mobile development.\n• Proven experience in Flutter mobile app development.\n• Strong proficiency in RESTful APIs, JSON, and database management.\n• Solid understanding of mobile app development principles, including lifecycle, permissions, data storage, and adherence to UX/UI guidelines.\n• Practical experience with OOP, SOLID, DRY, and Clean Architecture principles.\n• Proficiency in Git version control.\n• Strong communication skills in English, both written and verbal.\n• Nice to have: Experience in processing image, video, or audio content within mobile applications.\n• Nice to have: Experience working with Location Services, Push Notifications, BLE, Firebase, In-App Purchase, Google Maps, or Mapbox.\n\nWe Offer:\n• Employment with a stable and internationally recognized company.\n• Competitive salary and comprehensive benefits package.\n• The inclusive and diverse work environment that values your contributions.\n• Collaboration with a skilled and supportive team of professionals.\n• Flexible working hours to promote work-life balance.\n• Medical insurance coverage.\n• Ongoing training programs and excellent travel opportunities.\n• Various recognition and growth opportunities within the organization\n\nSalary ranges from 2000 to 4200 (Gross), commensurate with experience and qualifications, with room for growth based on performance.",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://lt.linkedin.com/jobs/view/flutter-engineer-at-orion-innovation-4011313882?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiT3Jpb24gSW5ub3ZhdGlvbiIsImFkZHJlc3NfY2l0eSI6IlZpbG5pdXMsIFZpbG5pdXMgQ2l0eSBNdW5pY2lwYWxpdHksIExpdGh1YW5pYSIsImh0aWRvY2lkIjoiTWRhSFJfdzJ2czRmUE1WcEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Flutter Developer",
            "company_name": "Andersen",
            "location": "Vilnius, Vilnius City Municipality, Lithuania",
            "via": "Layboard",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=Abo_bmZd-QGZszpeAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXHsQrCQAyAYVz7CE4ZRWorgoM6iaIgurqW6xl6kTM5Lqno6_ik1sHl5_uLz6iYHGJvhhn2-MQoadAMTtKCoss-gDAcRbqI400wS7qua9VYdWrOyFdeHrUwtvKq79LqL40GlzFFZ9gslvNXlbibrrZ8w6zIQAxXiky9ln_AjuwNl57JU3JxmBLOZKF3TO4LUDRDPaUAAAA&shmds=v1_AUFQtONhgfLPYLH9vlMUhNrMX0KsoeKLATc666O03GSs5vvniQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Abo_bmZd-QGZszpeAAAAAA%3D%3D",
            "extensions": [
                "5K a month",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "5K a month",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Andersen an international IT company invites a Flutter Developer to work on a large-scale project for one of our German customers The project is the creation of mobile applications for various areas of the customer39s business activities including the apps for its clients The company39s main fields of expertise are demand management tolling traffic and connected vehicles The customer is a provider of transportation solutions for sustainable mobility The company has brought projects to fruition in more than 50 countries around the globe With one-stop solutions the company covers the entire value chain of clients from the production of components design and implementation to the operation of systems Responsibilities - Developing a project from scratch - Using Material Design for the interface - Communicating with the API back-end - Participating in the engineering of reusable testable and efficient software solutions - Collaborating with other stakeholders regarding architecture design and technology choice Must-haves - Experience in mobile software development for 5+ years - Experience in developing Flutter applications for mobile devices for 2+ years - Portfolio with at least 2 apps for iOSAndroid developed using Flutter - Experience in uploading apps in App StoreGoogle Play - Experience with third-party libraries and APIs - Understanding of the Agile development lifecycle - Experience in writing unit tests - Experience with Git SVN or other version control tools - Experience in writing readable code creating documentation for existing code and refactoring - Experience in Material Design - Level of English Upper-Intermediate Nice-to-haves - Experience in automated testing Reasons why this job would be interesting to you - At Andersen you will enhance your CV by working on projects for such global brands as Samsung Johnson amp Johnson Ryanair Europcar and many others Our company never runs out of good projects so you wonrsquot stay on the sidelines - You will be able to learn something new every day If you want to change your domain or technology we will help you with this After all Andersen has a huge knowledge base and a strong resource management institution - Our employees work from anywhere in the world at the company39s offices or from home and even combine both formats in the way that suits them best Coworking with compensation is also possible - You will have a stable competitive USD-pegged salary and enjoy an extensive benefit package Also if you want to you will be able to increase your income by taking on additional activities - Your career will be in your hands We offer a clear assessment system and draw a roadmap to your goals Develop as a specialist or manager and your achievements will be appreciated at their true value We invite you to join our team httpspeopleandersenlabcom The vacancy assumes the possibility of remote work remoteon-site We will only consider applications with a resume E-mail cvmobile@andersenlabcom",
            "apply_options": [
                {
                    "title": "Layboard",
                    "link": "https://layboard.com/pl/vakansiya/320426/flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGbHV0dGVyIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFuZGVyc2VuIiwiYWRkcmVzc19jaXR5IjoiVmlsbml1cywgVmlsbml1cyBDaXR5IE11bmljaXBhbGl0eSwgTGl0aHVhbmlhIiwiaHRpZG9jaWQiOiJBYm9fYm1aZC1RR1pzenBlQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSlRHbDBhSFZoYm1saCJ9"
        },
        {
            "title": "Middle/Senior Mobile Flutter Software Engineers",
            "company_name": "IDT Corporation",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBCAYVz7COJws2AjgouOakXRqe4lac_mJN6F5Ip9H1_Uuvzb_xXfWVHdqesCmhqZJMFdHAWEKgyqmKCWp35sQjhxT4yYMqzgKg4y2tR6EIazSB9wvveqMe-MyTmUfVar1JatvI0wOhnNS1z-p8l-8mKwis1mux7LyP1ycTk-4CApSpq-CSWGG6kfLJP9ARihYfmmAAAA&shmds=v1_AUFQtOOhMeooXBzZMjRv3haKBmJlXQVeJ9Bp8NOGDW4MZGu9HA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=T1xvtljJncd1ou0aAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785088127c4a5b6aff2de9a/images/79d0869a4b8f1d953c563597b93713e9c8523d6246467b082c757b237d5e8c98.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan\n\nWe are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution.\n\nYou have a chance to work with a team of outstanding professionals on a challenging product.\n\nYou will never be bored—our team is dynamic, as are our products. Be ready to face thrilling professional challenges and use your strong hard and soft skills to solve them as a Team player.\n\nYour primary responsibility is end-to-end development and support of our user experience in our customer-facing apps.\n\nJoin us if you want to:\n• Have a unique work experience with a really strong engineering team!\n• Become a part of a multinational and cross-functional team.\n• Boost your career with a big international product company and have new growth opportunities.\n• Work on new innovative features and bug fixes in a Scrum Team.\n• Take responsibility for the full software development life-cycle.\n• Collaborate with business stakeholders and be a part of the product development team.\n• Demonstrate your technology-agnostic positive attitude with the ability to learn and desire to implement solutions using various technologies.\n• Work on high-performing, mission-critical, scalable, and resilient applications and services.\n• Drive aggressive technical debt reduction in close collaboration with developers and automation test engineers.\nJoin us, if you have:\n• Have around one year of Flutter cross-platform development experience.\n• Have 5+ years of hands-on mobile development experience (Android and/or iOS).\n• Are truly passionate about mobile development.\n• Can communicate in English (B2+).\n• Are a constant learner.\nYou can please us with:\n• Experience in configuring mobile CI pipelines.\n• Knowledge and experience beyond mobile stack.\nWe offer you:\n• An exciting and challenging job with talented people around.\n• Really good hardware (a laptop with 32 GB RAM and 512 GB SSD).\n• Competitive salary and growth opportunities.\n• Remote work opportunity (with the opportunity to work from offices in Minsk and Warsaw).\n• Superb English lessons.A few words about us:\n\nIDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues.\n\nWe are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.\n\nOur flagship brand, Boss Revolution, offers Money Transfer, International Calling, and Mobile Top-Up services and supports IDT’s mission of enabling people to keep in touch and share resources with family and friends worldwide.\n\nIf you are here, it seems like you are interested, so let’s chat! 😉\n\nThis offer from \"IDT Corporation\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6731f2266fb8bf4a04ae961d-middle-senior-mobile-flutter-software-engineers?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNaWRkbGUvU2VuaW9yIE1vYmlsZSBGbHV0dGVyIFNvZnR3YXJlIEVuZ2luZWVycyIsImNvbXBhbnlfbmFtZSI6IklEVCBDb3Jwb3JhdGlvbiIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoiVDF4dnRsakpuY2Qxb3UwYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        },
        {
            "title": "Senior Python Engineer, Document App",
            "company_name": "PandaDoc",
            "location": "Anywhere",
            "via": "Levels.fyi",
            "share_link": "https://www.google.lt/search?ibp=htl;jobs&q=iOS+developer&htidocid=BLjjEj_gQcgUUFImAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCQAyAYVy7uzhlFu2J4GInQRHEoeADlPQMdydtclxSqI_hG6vLP33wV59F1TyIkxRo3xaF4cIhMVHZwFn8NBIbnHKGLdykByUsPsKPXUXCQKsmmmU9Oqc61EENLfnay-iEqZfZvaTXfzqNWCgPaNTtD7u5zhzWyxb5ib8NJIZ7sjghJ_wCvYbmlZQAAAA&shmds=v1_AUFQtOOdZrysyXv1mB0wbrXGCPU0bb0KB6jHlDe1xhD0szk_Ow&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=BLjjEj_gQcgUUFImAAAAAA%3D%3D",
            "extensions": [
                "24 days ago",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "24 days ago",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "PandaDoc is looking for a Senior Python Engineer to join one of our R&D teams, Document App. The vision of the Document App track is to continuously enhance the reliability and stability of the document domain, while facilitating rapid and straight-forward contributions from the engineering organization.\n\nWe are looking for people who believe in the PandaDoc culture and are ready to develop secure, reliable, and scalable product solutions within our fast-growing business.\n\nAre you adaptable, driven, and friendly? Do you thrive in a fast-paced work environment where collaboration is the norm? If the answer is yes, then you’re a Panda and we want you to join our team.\n\nIn this role, you will:\n• Take end-to-end technical ownership of features and improvements\n• Have the opportunity to build and maintain application architecture\n• Actively collaborate with other engineers and different parts of the organization\n• Follow and contribute to agile development processes (Scrum framework)\n\nOur stack:\n• Microservices\n• Python, Django, AsyncIO\n• AWS, Docker, Kubernetes\n• PostgreSQL, Redis\n• NATS, Kafka\n\nAbout you:\n• At least 3 years of experience in designing and implementing application architectures and code that are scalable, available, maintainable, and performant\n• Care about quality and you know what it means to ship high-quality code\n• Put yourself in the shoes of your users and be a steward of crafting great experiences\n• Strong communicator. Explaining complex technical concepts to product managers, designers, customer support, and other engineers is no problem for you\n• Passion for continued learning and a track record of picking up new technologies and skills\n\nCompany Overview:\n\nPandaDoc empowers more than 50,000 growing organizations to thrive by taking the work out of document workflow. PandaDoc provides an all-in-one document workflow automation platform that helps fast scaling teams accelerate the ability to create, manage, and sign digital documents including proposals, quotes, contracts, and more. For more information, please visit https://www.pandadoc.com.\n\nCompany Culture:\n\nWe're known for our work-life balance, kind co-workers, & creative virtual team-bonding events. And although our Pandas are located across the globe, we stay connected with the help of technology and ensure that everyone on our team feels, well, like a team.\n\nPandas work best when they're happy. We retain our talent by upholding our values of integrity & transparency, and selling a product that changes the lives of our customers.\n\nCheck out our LinkedIn to learn more.\n\nBenefits:\n• An honest, open culture that emphasizes feedback and promotes professional and personal development\n• An opportunity to work from anywhere — our team is distributed worldwide, from Lisbon to Manila, from Florida to California\n• 6 self care days\n• A competitive salary\n• And much more!\n\nPandaDoc is an Equal Opportunity Employer. We are committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law.\n\nEXTERNAL RECRUITERS\n\nApproval Requirement\n\nThe use of external recruiters/staffing agencies requires prior approval from our HR Team. The HR Team at PandaDoc requests that external recruiters/staffing agencies not to contact PandaDoc employees directly in an attempt to present candidates. Complying with this request will be a factor in determining future professional relationships with PandaDoc.",
            "apply_options": [
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=87689793873289926&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHl0aG9uIEVuZ2luZWVyLCBEb2N1bWVudCBBcHAiLCJjb21wYW55X25hbWUiOiJQYW5kYURvYyIsImFkZHJlc3NfY2l0eSI6IkxpdGh1YW5pYSIsImh0aWRvY2lkIjoiQkxqakVqX2dRY2dVVUZJbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUpUR2wwYUhWaGJtbGgifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUV0ppVDNSQ1ZWQjZhVmhPTjNKMFJtbHRaRUZ1YkVaQlVHWkZSVkY0VTFaVE1FaFZjbTFOY1hCaVNqWmtaMU5tWkhKUGMwRm1SMkkwVDFaaFFteDFXa2RXYjNnMlJGZHJkRTlOTjA1eFFsOHpWekkwTUdoRlpHdzNTRWxDU0MxMmJHWldjV0U0VEdab1dVbzJRVEJhYlVzMk1HTnFSbG94WmpsSU0yOWFjM1ZoVGtsdFVEbERkazFXTkVkaU4wNHhXWHBJYldzelZHUlZZaTF1TjBOYWNIRkdlRVpvYUVoSGVHZFFOVlpFV1hCNlEyMWpSV1ZmWmxGM1dXSjJXa05pWm5ac1FVZDFSR0psWkdneVJIcFZORUpzWDNZdFRXTk9OVU0zUVd0a2VrbzRUbEJLVkdGNmJVZEhNMHg0YURsVFVYTm5abEF4VGswME5qQTNTRW96V0dWUVpFVkljQklYWjNkcFJsbzFVRk5CWDNGSmNIUlJVREF0Tm5Bd1FVa2FJa0ZHV0hKRlkzSkJXa05EU0dsbGJXWldSbTB0TkdaVWRISkRhMDVaTjBod1ltYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.lt&location=Lithuania&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUV0ppVDNSQ1ZWQjZhVmhPTjNKMFJtbHRaRUZ1YkVaQlVHWkZSVkY0VTFaVE1FaFZjbTFOY1hCaVNqWmtaMU5tWkhKUGMwRm1SMkkwVDFaaFFteDFXa2RXYjNnMlJGZHJkRTlOTjA1eFFsOHpWekkwTUdoRlpHdzNTRWxDU0MxMmJHWldjV0U0VEdab1dVbzJRVEJhYlVzMk1HTnFSbG94WmpsSU0yOWFjM1ZoVGtsdFVEbERkazFXTkVkaU4wNHhXWHBJYldzelZHUlZZaTF1TjBOYWNIRkdlRVpvYUVoSGVHZFFOVlpFV1hCNlEyMWpSV1ZmWmxGM1dXSjJXa05pWm5ac1FVZDFSR0psWkdneVJIcFZORUpzWDNZdFRXTk9OVU0zUVd0a2VrbzRUbEJLVkdGNmJVZEhNMHg0YURsVFVYTm5abEF4VGswME5qQTNTRW96V0dWUVpFVkljQklYWjNkcFJsbzFVRk5CWDNGSmNIUlJVREF0Tm5Bd1FVa2FJa0ZHV0hKRlkzSkJXa05EU0dsbGJXWldSbTB0TkdaVWRISkRhMDVaTjBod1ltYyIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}