{
    "search_metadata": {
        "id": "678508c0710d7cba81696d75",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/aceb5689f207cd9c/678508c0710d7cba81696d75.json",
        "created_at": "2025-01-13 12:36:16 UTC",
        "processed_at": "2025-01-13 12:36:16 UTC",
        "google_jobs_url": "https://www.google.ro/async/callback:550?q=iOS+developer&uule=w+CAIQICIHUm9tYW5pYQ&udm=8&fc=EswCCowCQUpHOUprTVBpcVpFbi1SeS1GUHdVZ1V3RU1fdWg2TXJzUHdoQ1FGMlN2T0pvT1dYeF9hSThvaVNZcW1SbTRwTUNOZFVkbVVxX1RMTVVqbGFKNW5fZFhoRjJaMTBGUGhLRDc0TzBQdDJxUVU4a3NtOUpmdGo0aDRvMVg0ZnFrdVg4OFFTNDR1VlRaRHFkM3JZVnMyaS1sd0ZIeHF3YmM5SDZteEYxYUJjTU9OZGZtZWdGNkZmQVVRdWkxU01DSmM5OHllWm9kRTQxSUFXaHYzOTFGc1pPaEtrM1RqOHdNTlBqVDBBWDVvQmpaeFBNMEM1Y01QRXh0cUFTLWxQOHF5Q2w2UnR2aVFvbjV4bhIXdndpRlpfV1dHclNmNU5vUGdZeWkyUWsaIkFGWHJFY3A5MHIyMldvVklWTUdFZ3h1c1hSTjUyV1d6R1E&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/aceb5689f207cd9c/678508c0710d7cba81696d75.html",
        "prettify_html_file": "https://serpapi.com/searches/aceb5689f207cd9c/678508c0710d7cba81696d75.prettify",
        "total_time_taken": 0.72
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Romania",
        "location_used": "Romania",
        "google_domain": "google.ro",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVkJwY1ZwRmJpMVNlUzFHVUhkVloxVjNSVTFmZFdnMlRYSnpVSGRvUTFGR01sTjJUMHB2VDFkWWVGOWhTVGh2YVZOWmNXMVNiVFJ3VFVOT1pGVmtiVlZ4WDFSTVRWVnFiR0ZLTlc1ZlpGaG9SakphTVRCR1VHaExSRGMwVHpCUWRESnhVVlU0YTNOdE9VcG1kR28wYURSdk1WZzBabkZyZFZnNE9GRlRORFIxVmxSYVJIRmtNM0paVm5NeWFTMXNkMFpJZUhGM1ltTTVTRFp0ZUVZeFlVSmpUVTlPWkdadFpXZEdOa1ptUVZWUmRXa3hVMDFEU21NNU9IbGxXbTlrUlRReFNVRlhhSFl6T1RGR2MxcFBhRXRyTTFScU9IZE5UbEJxVkRCQldEVnZRbXBhZUZCTk1FTTFZMDFRUlhoMGNVRlRMV3hRT0hGNVEydzJVblIyYVZGdmJqVjRiaElYZG5kcFJscGZWMWRIY2xObU5VNXZVR2RaZVdreVVXc2FJa0ZHV0hKRlkzQTVNSEl5TWxkdlZrbFdUVWRGWjNoMWMxaFNUalV5VjFkNlIxRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Developer",
            "company_name": "Codespring",
            "location": "Cluj-Napoca, Romania",
            "via": "IOS Jobs",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=luk5mhFvkaVukEIrAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU6Ho9pGBBc7VhAcFOwHlGs8kpT0LuSi9Cv8ZvENr_quql1PHCRDePRwoQ9FSZShhpuMoITZehCGq4iLtG59KUnPxqjGxmnBEmxjZTbCNMpiJhn136AeM6WIhYbj6bA0id1208mLNOXADgJDF99TfcckFvfwlBk54A_yBAU1kQAAAA&shmds=v1_AUFQtOOk18j9VH9kA-G7LgOulm0YTXfleEbXJgCeOlQGqUFCEQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=luk5mhFvkaVukEIrAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "As a Senior IOS Developer, you will embark on the exciting journey of developing innovative mobile applications for one of the leading home appliances and home automation global providers. If you would like to become a part of the remote and voice command home automation systems revolution, this is the moment to put your mobile development skills at work.\nYour Responsibilities A Senior iOS Developer\n• You will have to continuously learn and work with cutting edge technologies like Kotlin Multiplatform Mobile (KMM)\n• During the building of iOS (Swift, Kotlin) mobile applications you will have to create application layers, modeling techniques, designing object-oriented components and coding algorithms\n• While actively working with the customer, you will have to proficiently analyze, design and implement their requirements\n• You will be in charge with overseeing the execution of software development from concept to testing\n• You will have to implement unit tests\n• You will be documenting software implementations and tests\n• For a correct implementation, you will have to provide and manage technical support to the client\n• As a member of a development team, you will have to participate in all processed from design to implementation, to give support and guidance, to share knowledge with other team members.\nWhat We Expect From Your Side\n• To have a BSc degree (preferably in Computer Science / Mathematics – Informatics)\n• To demonstrate a mobile application development experience of 3+ years (iOS Swift)\n• To have software development and software design knowledge (OOP, OOD)\nThe Languages You Should Speak\n• English will be the main working and communication language\n• Hungarian would be a big plus\nThe Important Skills Needed For This Role\n• Dealing with ambiguity for we are working with new technologies and concepts\n• A creative strike in your work, in the crucial moments of mobile development\n• Establishing good peer relationships\n• Perseverance, in order to get things done done\n• Problem solving, as a key quality indicator for any complex mobile development project\n• Standing alone on managing your own tasks and time schedule\n• Strong technical learning abilities, for we are progressing really fast\nYour Life At Codespring Matters\n\nWe value your work-life balance a lot, therefore the company offers diverse possibilities to fine tune your professional and personal life:\n• The working hours are flexible\n• The justified overtime is rewarded accordingly\n• The holidays are respected and encouraged\n• Unexpected situations and events are handled with a human touch\n\nYour health and well-being is a top priority since we are in the brain-powered business sector. At Codespring you will benefit of:\n• Private medical insurance\n• Well-being specialized treats for the body and the mind\n• Sport subscriptions for various programs and events\n• Outdoor sports team hangouts (hiking, biking, running, climbing, swimming, kayaking, sailing)\n\nYour lifelong learning is the key to the team’s continuous development. At Codespring │ Softech you will have the chance to enjoy:\n• Specialized programming trainings as per your needs\n• In-depth software development methodologies and practices trainings\n• Certification courses and exams supported by the company\n• Soft skills trainings provided by our certified trainers\n• English classes\n• Access to our rare and very specialized library\n\nCodespring is a growing community who gets stronger through work and common interests based relationships. That is why we support:\n• Project team logouts\n• Team buildings\n• Company days\n• Family oriented events\n• Sport events participation\n\nYour family is important that is why we support our colleagues with specific family oriented programs:\n• New born welcome bonus and gift\n• Annual school start pack for each kid\n• Christmas gifts for children\n• Family reward on the occasion of your round anniversaries at Codespring │ Softech\n• Family events (parties, trips, gatherings)\n\nWe consider that your personality and intellectual background are highly valuable for building an ever stronger software development community at Codespring │ Softech. That is why we are open to meet you and customize your career plan with us.",
            "apply_options": [
                {
                    "title": "IOS Jobs",
                    "link": "https://iosjobs.ro/jobs/2500324113202161-senior-ios-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkNvZGVzcHJpbmciLCJhZGRyZXNzX2NpdHkiOiJDbHVqLU5hcG9jYSwgUm9tYW5pYSIsImh0aWRvY2lkIjoibHVrNW1oRnZrYVZ1a0VJckFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhVbTl0WVc1cFlRIn0="
        },
        {
            "title": "iOS Developer EDEKA App (m/w/d)",
            "company_name": "EDEKA IT Stiftung & Co. OHG",
            "location": "Cluj-Napoca, Romania",
            "via": "Jooble",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=T02i2poGWUn5m66vAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXNuw6CMBQA0LjyCU53MmqEGo0OOhEg-Eg0EXdyqbWUlN6GFuWb_EpjXM56gs8o2KprAal4CU1WdJCl2TmG2FqYtuzNHjMI4UQVOIEdr4EM5ERSi_G-9t66HWPO6Ug6j17xiFPLyIiKBtZQ5X6UrsZOWI1elKvNcoiskfP1vzneofDq6XsjYQIJRXA95KAMJLpvwgta4riAG7VoFH4B_EWVX60AAAA&shmds=v1_AUFQtOP9MMYgaxZifo1hAOGVCvbFvy63YdJ7H0EfEVy_KJzU0Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=T02i2poGWUn5m66vAAAAAA%3D%3D",
            "extensions": [
                "1 month ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "1 month ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Willkommen bei EDEKA IT – dem zentralen IT-Partner für den deutschen Marktführer im Lebensmitteleinzelhandel mit über 11.000 Märkten. Wir gestalten gemeinschaftlich innovative IT-Lösungen, die den Handel leistungsstark und zukunftsfähig machen. Unsere Anwendungen begeistern unsere selbstständigen Einzelhändler:innen, die 7 EDEKA Großhandelsgesellschaften und die EDEKA Zentrale. Mit mehreren Standorten in ganz Deutschland treiben wir die Digitalisierung des Handels voran. Werde Teil unseres Teams und gestalte gemeinsam mit uns die Zukunft des Handels.\n\nWir bei der EDEKA IT sind das Herzstück des digitalen Wandels im EDEKA-Verbund. Als leistungsstarkes Team entwickeln wir IT-Strategien, -Infrastrukturen und -Dienstleistungen für alle Handelsbereiche des EDEKA-Verbunds in ganz Deutschland. Wir bündeln unsere Kompetenzen, um innovative Lösungen zu entwickeln und umzusetzen. So treiben wir den Handel von morgen voran - vielleicht schon bald gemeinsam mit dir?\n\nIn deiner Rolle als iOS Developer EDEKA App (m/w/d) kannst du bei uns deinen ganz persönlichen Beitrag zu unseren Zielen leisten. Mögliche Einsatzorte sind: Berlin, Gaimersheim, Hamburg, Melsungen, Minden, Moers, Neumünster, Offenburg, Cluj-Napoca, Mannheim.\niOS Developer EDEKA App (m/w/d)\n\nInnerhalb eines 15-köpfigen agil nach Scrumban arbeitenden Teams verantworten wir die native Entwicklung von \"state of the art\"-Apps für iOS und Android. Dabei streben wir eine hohe Codequalität und einen hohen Automatisierungsgrad in unseren CI/CD-Strecken an. Wir sind füreinander da und achten darauf, dass auch der Spaß bei der Arbeit nicht zu kurz kommt.\nDeine Aufgaben\n• Im regelmäßigen Austausch mit dem Product Management und dem Android-Team gestaltest du innovative Features für unsere iOS-App und setzt diese um.\n• Mit einer \"Getting things done\" Grundhaltung arbeitest du \"end to end\" und engagierst dich in allen Phasen des Entwicklungsprozesses von der Anforderungsanalyse über Code Reviews, Unit / UI-Tests bis zum Deployment bzw. Release Management.\n• Im Rahmen kontinuierlicher Qualitätssicherung sorgst du für die Optimierung, Skalierung und Weiterentwicklung unseres Codes.\nDein Profil\n• Du hast eine Ausbildung oder ein Studium mit IT-Bezug erfolgreich abgeschlossene oder besitzt eine vergleichbare Qualifikation.\n• Du verfügst über fundierte Praxiserfahrung in der nativen App-Entwicklung für iOS mit Swift, SwiftUI, Combine und RxSwift.\n• Du hast Freude an der Entwicklung einfacher, eleganter Apps, die nutzerfreundlich sind und Spaß machen.\n• Du wagst Experimente und begegnest komplexen Herausforderungen gerne mit kreative Lösungsansätzen.\n• Du besitzt gute Deutsch- und Englischkenntnisse in Wort und Schrift (CEFR-Level B2 oder höher).\nUnser Angebot\n• Work-Life-Balance: Profitiere von 30 Tagen Urlaub und der Möglichkeit zum mobilen Arbeiten.\n• Einfluss: Du gestaltest die IT eines der führenden Lebensmitteleinzelhändlers in Deutschland.\n• Finanzieller Anreiz & weitere Angebote: Freue dich über ein 13. Monatsgehalt und zahlreiche Benefits & Mitarbeitendenangebote runden unsere Wertschätzung für dich ab.\n• Gesamtheitliche Entwicklung (fachlich & persönlich): Dich erwarten bei uns verschiedene Weiterbildungsangebote wie z. B. digitale Lernplattformen und die Option an Fachkonferenzen teilzunehmen.\n• Betriebliches Gesundheitsmanagement: Unser Gesundheitsmanagement kümmert sich um deine Gesundheit am Arbeitsplatz.\n• Kultur & Zusammenarbeit: Wir ermöglichen dir einen optimalen Start in unserem Unternehmen und legen viel Wert auf ein gutes Onboarding, damit du direkt durchstarten und durch unsere verschiedenen Communities und Netzwerke von Anfang an mitgestalten kannst.\nInteressiert?\n\nWir freuen uns auf deine aussagekräftige Bewerbung mit Angaben zu deiner Gehaltsvorstellung auf Basis von 13 Monatsgehältern, deinem möglichem Startdatum und sind gespannt, dich kennenzulernen!\n\nWillkommen sind bei uns alle Menschen – unabhängig von Geschlecht, Nationalität, ethnischer und sozialer Herkunft, Behinderung, Religion, Alter sowie sexueller Orientierung.\nKontakt\n\nPersonal und Organisation\n\nWeitere Informationen findest du hier: .",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ro.jooble.org/jdp/8281367597285537841?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ro.linkedin.com/jobs/view/ios-developer-edeka-app-m-w-d-at-edeka-it-4096880467?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Lucrezi.ro",
                    "link": "https://www.lucrezi.ro/munca/ios-developer-edeka-app-m-w-d-ronvb8b8f3ba9d5adf67/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIEVERUtBIEFwcCAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiRURFS0EgSVQgU3RpZnR1bmcgXHUwMDI2IENvLiBPSEciLCJhZGRyZXNzX2NpdHkiOiJDbHVqLU5hcG9jYSwgUm9tYW5pYSIsImh0aWRvY2lkIjoiVDAyaTJwb0dXVW41bTY2dkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhVbTl0WVc1cFlRIn0="
        },
        {
            "title": "Senior Engineer, iOS",
            "company_name": "F063 DB Global Technology SRL",
            "location": "Bucharest, Romania",
            "via": "Workday",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=3uMhnOAYMENS8N2aAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBAAUFz7CU43a22KRQfdiloQQWjdSxqOJJLelVyE-jX-qnR528t-q2zbIXmOcCXrCTHm4J8d7ODOAwjqaBwwQcNsA67PLqVJTkqJhMJK0smbwvComHDgWb15kIVenI44BZ2w3x_KuZjIbqpbeazgUkMTeNABXmgccWD7ha59gCeoP2Z5knJoedTk9R-noeDMogAAAA&shmds=v1_AUFQtOO50YoZ6XwHf0n23CkBd8SUxxzuaB5-wqNowa3MDMHrfg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=3uMhnOAYMENS8N2aAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Description: DB Global Technology is Deutsche Bank’s technology center in Central and Eastern Europe. Opened in January 2014, the Bucharest office is constantly expanding. The team is made up of enthusiastic professionals that work in an international environment, learning new technologies as part of Deutsche Banks’ businesses. Changing the Bank is a challenging endeavor that we tackle every day and enjoy our success when our efforts fundamentally change how Deutsche Bank works. Your key responsibilities • Work together with our highly skilled international development teams to build and maintain features of our Apps and SDKs. • Ensure proper performance and quality of the code you write and continuously participate in code reviews. • Write unit tests for robustness, edge cases and general reliability. • Write code in compliance with our coding standards and security mechanisms. • Continuously collaborate with cross-functional teams, product owners, designers and QA team in an agile environment. • Participate in developer guilds and enjoy learning/sharing knowledge with the team. Engineer is responsible for managing or performing work across multiple areas of the bank's overall IT Platform/Infrastructure including analysis, development, and administration. It may also involve taking functional oversight of engineering delivery for specific departments. Your skills and experience • Proven work experience in iOS development (banking experience would be a plus). • Well versed in iOS development and have strong knowledge of Swift, SwiftUI, UIKit, RxSwift, Swift Concurrency, XCTest, Xcode, SPM, XCFramework; • Very good knowledge of SOLID principles, design patterns (MVVM, VIPER etc.), Apple design guidelines and general best practices for iOS. • You can develop reusable frameworks and are not new to automated CI/CD process. • You know how to use Xcode instruments and memory graph. • You are very experienced in Client-Server architectures using HTTPS, REST and JSON. • Experience with Mobile App Hardening tools like Arxan is a plus. • You have excellent communication, interpersonal skills and are an effective team player. • You are able to work in a global multi-cultural environment and can work with teams located in different time zones. You can expect: 24 days’ holiday + loyalty days + bank holidays (week days offered for bank holidays on weekend days); Flexible working hours and working from home; Private healthcare and life insurance; A culture of continuous learning with coaching and support from experts in your team. Wir streben eine Unternehmenskultur an, in der wir gemeinsam jeden Tag das Beste geben. Dazu gehören verantwortungsvolles Handeln, wirtschaftliches Denken, Initiative ergreifen und zielgerichtete Zusammenarbeit. Gemeinsam teilen und feiern wir die Erfolge unserer Mitarbeiter*innen. Gemeinsam sind wir die Deutsche Bank Gruppe. Wir begrüßen Bewerbungen von allen Menschen und fördern ein positives, faires und integratives Arbeitsumfeld. Seit über 150 Jahren wird unser Anspruch, die Globale Hausbank für unsere Kunden zu sein, von unseren Mitarbeitern vorangetrieben – in rund 60 Ländern und mit mehr als 150 Nationalitäten. Ihr tiefes Verständnis, ihre Erfahrungen, ihr Fachwissen und ihre Leidenschaft helfen unseren Kunden, sich in einer zunehmend komplexen Welt zurechtzufinden – sei es in unserer Unternehmensbank, unserer Privatkundenbank, unserer Investmentbank oder in unserem Asset Management (DWS). Gemeinsam können wir für unsere Kunden im In- und Ausland Großes bewirken und ihren dauerhaften Erfolg und ihre finanzielle Sicherheit sicherstellen. Mehr Informationen unter: Deutsche Bank Careers (db.com)",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://db.wd3.myworkdayjobs.com/de-DE/DBWebsite/job/Senior-Engineer--iOS_R0328539?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRW5naW5lZXIsIGlPUyIsImNvbXBhbnlfbmFtZSI6IkYwNjMgREIgR2xvYmFsIFRlY2hub2xvZ3kgU1JMIiwiYWRkcmVzc19jaXR5IjoiQnVjaGFyZXN0LCBSb21hbmlhIiwiaHRpZG9jaWQiOiIzdU1obk9BWU1FTlM4TjJhQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFVtOXRZVzVwWVEifQ=="
        },
        {
            "title": "Senior iOS Engineer - Contractor",
            "company_name": "Goodnotes",
            "location": "Anywhere",
            "via": "LinkedIn",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=JK_xov5PxmtX8EZaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQrCQBBGYWxTW1lNLZgVQQQtRQQbwRwgTNZhs5LMH3amyCE8tKZ58DWv-q6qUyOaUSg_G7ppyipSaEdXqBeOjgUPdGTCJfYEpTuQBtlcevfJziGYDXUyZ8-xjhgDVDrM4YPOlrTWc5FpYJf2cNzP9aRpu_5P3goXo6z0wsia-QcdSksqjwAAAA&shmds=v1_AUFQtOPpO5-UznMi0fdRfilxBeUTUPW7IaPlbDm8eI66atAXVQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=JK_xov5PxmtX8EZaAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508c0710d7cba81696d75/images/b6b1f16cd6b1e6ea4514a21433e8853c2a1a59d312d3d84825d0dfb5f32bbb29.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Goodnotes is a powerful note-taking app that combines a natural handwriting experience with powerful AI-enabled digital capabilities. Whether you’re taking notes, brainstorming, or planning, Goodnotes empowers you to do your best thinking and creating. Goodnotes is used by more than 24 million users worldwide and was named Apple's 2022 iPad App of the Year.\n\nThe Role\n• Build and own the entire lifecycle of new user-facing features, leveraging technologies unique to the latest frameworks\n• Collaborate with cross-functional teams, including Product, Design, and QA, focused on delivering the best features for our users\n• Continuously improve the development practices through research, automation, documentation and testing\n• Opportunity to own and improve our release process, application architecture, and developer experience\n\nIdeal Profile\n• Expertise in Swift programming. Knowledge of SwiftUI is advantageous\n• Strong understanding of computer science fundamentals\n• Excellent problem solving, communication, and storytelling skills\n• A love of software craftsmanship\n• A strong desire for self-improvement through side projects and sharing\n• Strong sense of the best tools for any task\n• Shipped one or more non-trivial iOS apps on respective app stores\n• Big plus if you have experience cross-compiling codebase on different mobile platforms\n\nWhat's on Offer?\n• Opportunity to make a positive impact\n• Work alongside & learn from best in class talent\n• Work within a company with a solid track record of success",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://ro.linkedin.com/jobs/view/senior-ios-engineer-contractor-at-goodnotes-4051549534?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Lucrezi.ro",
                    "link": "https://www.lucrezi.ro/munca/senior-ios-engineer-contractor-ronvb30e32666f3e92db/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIEVuZ2luZWVyIC0gQ29udHJhY3RvciIsImNvbXBhbnlfbmFtZSI6Ikdvb2Rub3RlcyIsImFkZHJlc3NfY2l0eSI6IlJvbWFuaWEiLCJodGlkb2NpZCI6IkpLX3hvdjVQeG10WDhFWmFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIVW05dFlXNXBZUSJ9"
        },
        {
            "title": "Senior IOS Engineer",
            "company_name": "Yassir",
            "location": "Bucharest, Romania (+9 others)",
            "via": "Lever",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=BGKZqEtR8akzxpGnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBAAUFz7CeJwc9FEBBfdBBFdBDs5lUs4kkh6F3IR-gf-tnR50-t-q64fiJNUuD8HuHJITFRhBw9xoITVRxCGm0jItD7H1oqerFXNJmjDlrzxMllhcjLbjzhdGDVipZKx0Xg47mdTOPSbN6qmConh8vVL0LaFl0zICf87RLFwigAAAA&shmds=v1_AUFQtONkOE02z8MDzkn-Snq7WtagFZw7L_xQ1gS6th4GoXDERg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=BGKZqEtR8akzxpGnAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508c0710d7cba81696d75/images/b6b1f16cd6b1e6ea5805c9feac8cbf8d8957404b67f1c739c7bc6caadb5ae354.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed (~$200M in funding) by VCs from Silicon Valley, Europe and other parts of the world.\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally.\n\nHelping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.\n\nAbout the role\n• We are looking for a senior iOS developer to join our tech hub in Berlin and support our growth and expansion. You will be part of the engineering team, working with a high-quality code base and the latest tools, where you will promote your skills to be an expert in complex frontend development in iOS (swift). Your primary focus will be the development of mobile applications and their integration with back-end services. You will be working alongside other engineers and developers working on different layers of the infrastructure.\n\nAbout your role as a iOS mobile developer\n• Design and build mobile applications using iOS (swiftUI) platform.\n• Ensure the performance, quality, and responsiveness of applications\n• Collaborate with a team to define, design, and ship new features\n• Identify and correct bottlenecks and fix bugs\n• Help maintain code quality, organization, and automatization\n• Participate in brainstorming sessions and contribute ideas to our technology, algorithms and products.\n• Work with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n• Dive into difficult problems and successfully deliver results on schedule\n\nAbout your experience\n• Must have technical skills with at least 4 years of experience\n• Language: iOS (swift) native\n• Familiarity with cloud message APIs and push notification\n• Web architecture: Rest and restful APIs, micro-services\n• Version control: GIT\n• Nice to have technical skills (Strongly advised)\n• Containers: Docker, kubernetes\n• Caching, Redis server\n• Scaling, Web load balancing\n• Experience in a rapidly growing company in the mobility, on-demand or fintech space is a plus\n• BSc/MSc in Engineering, Computer Science or relevant field\n\nWhy you should join Yassir\n• 😎 You will be part of one of the first Algerian startups to go through the Y Combinator program and one of the fastest-growing tech companies in North Africa. We are current in +30 cities (Algeria, Tunisia, Morocco, Senegal, France and Germany)\n• 💸 Attractive salary and you even get a stake in the company\n• 🚉 Subsidized public transit pass\n• 🤙🏽Have a lasting impact on our company's culture\n• 🚀 Perfect timing with renowned investors to build something great\n• 📈 Extremely steep learning curve with own responsibility and intensive guidance\n• 💯 Make a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans\n\nAt Yassir, we believe in the power of diversity and the importance of an inclusive culture. So, if you're ready to bring your unique perspective and experiences to the table, then we're excited to listen.\n\nDon't just apply for a job, come and be a part of our journey. Let's create a better tomorrow together.\n\nWe look forward to receiving your application!\n\nBest of luck,\n\nYour Yassir TA Team",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.lever.co/Yassir/f9e5b38e-2a2a-4444-96b1-eb637b7e8e14?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "GrabJobs",
                    "link": "https://grabjobs.co/romania/job/full-time/others/senior-swift-ios-137377523?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://ro.linkedin.com/jobs/view/ios-development-engineer-at-purequad-4122007067?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSU9TIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiWWFzc2lyIiwiYWRkcmVzc19jaXR5IjoiQnVjaGFyZXN0LCBSb21hbmlhIiwiaHRpZG9jaWQiOiJCR0tacUV0Ujhha3p4cEduQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFVtOXRZVzVwWVEifQ=="
        },
        {
            "title": "Senior iOS Developer Opportunity at Valuable Recruitment",
            "company_name": "Valuable Recruitment",
            "location": "Bucharest, Romania",
            "via": "Trabajo.org",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=27IKsM1DsMgzrlIKAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_23NsQrCMBCAYVz7CE43F21EcNFNBMGl0IJruYSjjaR3IblIfTWfTrq7_NMHf_XdVG1P7CWBb3u40ZuCRErQxihJC3v9ACo8MRS0gaAjl4rXmVhhDw-xkAmTm0AY7iJjoO1lUo35bEzOoRmzonrXOJmNMFlZzEtsXjPkCRPFgErD8XRYmshjXf89eYZrcSvPuoNOZmSPP-VpHji9AAAA&shmds=v1_AUFQtONYQAKU4PDdFfLvl1dzOHUdfXmfOQpoJMVel4i9T35uEQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=27IKsM1DsMgzrlIKAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508c0710d7cba81696d75/images/b6b1f16cd6b1e6ea11f600a803fe013abf052819ecd17fe26dab48f442223158.gif",
            "extensions": [
                "10 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "At Valuable Recruitment, we're on a mission to bridge centuries of wisdom with today's technology. As a skilled iOS Developer, you'll play a pivotal role in shaping the future of our BibleChat app.\n\nWe're looking for an experienced developer with a strong foundation in SwiftUI and a passion for creating impactful mobile experiences that support spiritual growth.\n\nThis is a unique opportunity to join a high-growth startup at the forefront of the faith-tech sector, working closely with our successful founders who have a proven track record of building impactful companies.\n\nMain Responsibilities:\n• Develop and implement new features for the BibleChat iOS app using SwiftUI, focusing on user engagement and a seamless, intuitive experience.\n• Integrate various SDKs to enhance app functionality and user experience.\n• Work with JSON and REST APIs for efficient data handling.\n• Manage Apple subscriptions and utilize analytics and A/B testing for data-driven improvements.\n• Contribute to continuous integration (CI) practices.\n\nRequirements:\n• 2+ years of experience in iOS development (we're open to a wide range of experience).\n• Strong proficiency in SwiftUI and understanding of object-oriented and MVVM design patterns.\n• Experience integrating SDKs and working with JSON and REST APIs.\n• Knowledge of Git/version control and CI practices.\n• Experience with Apple subscriptions, analytics, and A/B testing.\n• Familiarity with Apple's iOS design principles.\n\nBenefits:\n• A competitive salary of $120,000 per year.\n• An anti-corporate environment where innovation and results are valued above all else.\n• Opportunities to grow professionally and personally.\n\nAbout You:\n\nYou are a skilled iOS Developer with a strong foundation in SwiftUI and a desire to build impactful mobile experiences that support spiritual growth. If you're passionate about creating meaningful mobile applications and want to be part of a mission-driven company, we invite you to apply.",
            "apply_options": [
                {
                    "title": "Trabajo.org",
                    "link": "https://ro.trabajo.org/job-3171-a960c487f2e306d413d5f5e0e48c0843?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://ro.bebee.com/job/8197fe28c2d06888995b810d8241e31d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciBPcHBvcnR1bml0eSBhdCBWYWx1YWJsZSBSZWNydWl0bWVudCIsImNvbXBhbnlfbmFtZSI6IlZhbHVhYmxlIFJlY3J1aXRtZW50IiwiYWRkcmVzc19jaXR5IjoiQnVjaGFyZXN0LCBSb21hbmlhIiwiaHRpZG9jaWQiOiIyN0lLc00xRHNNZ3pybElLQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFVtOXRZVzVwWVEifQ=="
        },
        {
            "title": "Senior Mobile Engineer",
            "company_name": "AscentCore Technology",
            "location": "Cluj-Napoca, Romania (+2 others)",
            "via": "Lever",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=EFdOkE5jeWLe8ZxOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz9BKebxTQiuOgkRQRBB3Uvl3AkKeldyEWo3-LPim94y-9iaZ7ESSrcxKVMcOaQmKiCgas4UMLqIwjDRSRkWh1ja0UP1qrmLmjDlnznZbLC5GS2ozj9N2jESiVjo2G3385d4bA2J_XErZdK8CIfWbKEDySGPr9Hc8ciHjfwkAk54Q9VzlWZngAAAA&shmds=v1_AUFQtOPurKAVsUrv6roWQ9ars8pgTjsM0V51Zk7UDnxG2fYWIw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=EFdOkE5jeWLe8ZxOAAAAAA%3D%3D",
            "extensions": [
                "26 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "26 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Us\n\nAt AscentCore, we believe that great software starts with great people. Our strength comes from combining top-tier development practices with deep, meaningful relationships — both with our clients and our team. Even as we grow, we stay true to the values that define us: quality, speed, value, and innovation. These values help us build trust, not just in the technology we create, but in the way we work together.\n\nWe’re not just about hiring talent — we’re about fostering a community of individuals who are passionate, collaborative, and forward-thinking. We’re proud of our diverse expertise that spans multiple industries, giving us the ability to help companies not only transform but truly thrive.\n\nAt AscentCore, you’re part of something bigger. Whether we’re working on cutting-edge AI solutions or the next breakthrough in software, our mission is simple: to create technology that shapes the future, while building a community where everyone can grow and succeed together.\n\nAbout the Role\n\nWe are looking for an experienced Mobile Developer to be part of a team that is helping our partner on their mission to redefine the way in which pet parents can connect with pet sitters.\n\nThis partner of ours was founded by strong tech experts who share a love for the pet community.\n\nWe’ve grown a wonderful collaboration with them over the past years and it’s a truly immersive partnership experience.\n\nHigh code quality and well planned features are the key here.\n\nThe engineering teams work with well-defined implementation plans that help them invest time for research, coding best practices and their own feeling of accomplishment.\n\nThe primary responsibility will be to design, develop and maintain features, while enhancing the technology stack. This is a great opportunity for someone who’d enjoy a context where there’s intentional encouragement and ownership offered to improve our client’s products.\n\nThe features will include iOS and/or Android development, as well as React Native development and the focus in the long run will be more on React Native.\n\nResponsibilities\n• Feature development in iOS or Android, as well as cross platform development in React Native\n• Create, contribute to and follow implementation plans\n• Have the drive to continuously impact the project & the client's products with technical improvements\n• Actively participate in code reviews, knowledge sharing sessions and hack days targeted at improving the client’s products\n• Eager to learn and improve your craft as a software engineer\n• Provide technical guidance to less senior colleagues\n\nRequirements\n• 5+ years experience as a professional Software Developer\n• Experience with mobile native development and interest in working with it in an initial phase\n• Experience with React Native and desire to further develop in this direction\n• Passionate about code quality, automated testing and engineering best practices\n• You get along well with others and thrive in a collaborative environment\n• Experience working in an Agile environment\n• Very good grasp of English language skills\n\nTech stack\n• React Native\n• Redux\n• Objective-C, swift, Xcode\n• Jest\n• Git/Github\n• Agile Scrum/Kanban\n\nSoft Skills\n• Strong interpersonal skills with the ability to connect, collaborate, and work effectively with team members and stakeholders across all levels of the organization.\n• Skilled at guiding junior developers and sharing best practices, both in coding and in problem-solving approaches\n• Takes the initiative to propose new features, optimizations, or research areas that could benefit the team and the product, contributing to a culture of continuous improvement and growth.\n\nBenefits\n• Medical Benefits Package: Regina Maria\n• Well-being: Access to 7Card App that offers a wide network of fitness and wellness facilities\n• Flexible Benefits Program: Customizable options such as meal vouchers, private pensions, cultural vouchers, vacation vouchers, extra medical services, and sports or transport reimbursement\n• Support for Certifications and Professional Development\n• Rewards & Recognition programs\n• Access to technical training, workshops, conferences, and other professional events\n• Hybrid Work Schedule: A mix of flexibility and in-person collaboration\n• Special Life Milestone Gifts: Celebrating major life events like weddings or the birth of a child\n• Up to 26 vacation days, plus a day off for your birthday\n• Participation in internal events: team buildings, holiday parties, picnics, and social gatherings\n• Snacks and meals with the team\n• Full coverage for business trips\n\nApplication Process\n\nSubmit Your Application: Once you’ve submitted your resume and any additional materials, our team will promptly review your application.\n\nInitial Review: Within 1-2 weeks, you’ll hear back from us about next steps, which may include a request for more information or an interview invitation.\n\nInterviews: You’ll meet with our technical panel to discuss your expertise and problem-solving skills.\n\nYou’ll also connect with your potential hiring manager to explore role-specific responsibilities and team dynamics.\n\nIn some cases, you may also have the opportunity to meet with the client.\n\nTimeline: The entire process typically lasts between 1 to 3 weeks, depending on your availability and coordination with relevant stakeholders.\n\nFeedback & Decision: After completing the interview process, we will provide feedback and inform you of the outcome.",
            "apply_options": [
                {
                    "title": "Lever",
                    "link": "https://jobs.eu.lever.co/ascentcore/3dab9169-e648-482a-a8d5-5be76f77d26f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQXNjZW50Q29yZSBUZWNobm9sb2d5IiwiYWRkcmVzc19jaXR5IjoiQ2x1ai1OYXBvY2EsIFJvbWFuaWEiLCJodGlkb2NpZCI6IkVGZE9rRTVqZVdMZThaeE9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIVW05dFlXNXBZUSJ9"
        },
        {
            "title": "Senior iOS Developer Tech Lead",
            "company_name": "Valuable Recruitment",
            "location": "Bucharest, Romania",
            "via": "Jooble",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=n5bOlC_0tiYTVBcnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBCAYVz7CE43F21E6KKbCIIIQiuu5RKPNpLmQu4qfRwfVbv8w8dffFdF3VL0nMHfWzjThwInyvAgN8CN8AVbuLIFIcx_4QgX5j7Q-jioJjkYIxKqXhTVu8rxaDiS5dm82cqSTgbMlAIqdft6N1cp9mX5xDChDQQNuTx5HSkq-AinyS276AYaHjF6_AFVLuyfowAAAA&shmds=v1_AUFQtONLV_4J7b-KN7FiLZNqjin5i4RyWsmL2v9zB3GxJNXn6Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=n5bOlC_0tiYTVBcnAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "About Us\n\nFounded by two experienced Romanian entrepreneurs with multiple exits Laurentiu Balasa and Marius Iordache BibleChat has a dedicated 35 person team based in Bucharest and Cluj. We have over 7 million downloads and $14 million in funding from worldclass investors such as Play Ventures True Ventures and leading Romanian VCs.\n\nAbout You\n\nYou are a highly skilled and thorough Senior iOS Developer ready to take on a technical leadership role in a fastpaced highgrowth startup. You have a deep understanding of iOS development including SwiftUI MVVM and UIKit and are passionate about creating impactful mobile experiences. You thrive in collaborative environments enjoy mentoring other developers and are driven to contribute to a product that makes a difference in the world.\n\nTop 5 Objectives\n• Lead iOS Development: Provide technical leadership and guidance to the iOS development team setting the technical vision and ensuring alignment with the overall product strategy.\n• Architect and Design: Design and implement scalable and robust iOS architecture ensuring optimal performance and maintainability as the app grows.\n• Develop Advanced Features: Develop and optimize advanced features in SwiftUI and MVVM creating a seamless and engaging user experience.\n• Champion Code Quality: Drive highquality code standards across the iOS team promoting best practices in objectoriented programming and MVVM.\n• Mentor and Collaborate: Mentor junior and midlevel iOS developers fostering a collaborative and highperforming engineering culture.\n\nMain Responsibilities\n• Lead technical architecture and design decisions for the iOS app.\n• Develop and optimize advanced features in SwiftUI and MVVM.\n• Drive highquality code standards and best practices.\n• Oversee the integration of critical SDKs and manage Apple subscriptions.\n• Leverage analytics and A/B testing to drive user engagement and retention.\n• Own the continuous integration (CI) pipeline and ensure smooth releases.\n• Mentor junior and midlevel iOS developers.\n• Collaborate with designers product managers and backend engineers.\n\nRequirements\n• 3 years of experience in iOS development (we value experience whether its 3 years or 10!).\n• Deep expertise in SwiftUI MVVM UIKit and objectoriented design.\n• Experience with JSON REST APIs Git/version control and CI practices.\n• Proven track record in managing Apple subscriptions and using analytics and A/B testing.\n• Strong leadership and mentorship skills.\n• Excellent communication and collaboration abilities.\n\nOpportunities and Benefits\n• Make a Global Impact: Contribute to a product that is transforming how people engage with sacred scriptures worldwide.\n• Work with Experienced Founders: Collaborate directly with successful entrepreneurs who have a proven track record of building impactful companies.\n• Join a HighGrowth Startup: Be part of a dynamic and rapidly growing team at the forefront of the faithtech sector.\n• Compensation and Benefits: We offer a comprehensive benefits package including a cool office environment free massage gym membership free daily lunch and healthcare benefits.\n• Unleash Your Potential: Thrive in an anticorporate environment where innovation and results are valued above all else.\n\nIf youre an experienced Senior iOS Developer ready to take on a leadership role and contribute to a product that is changing lives we invite you to join BibleChat. This is an opportunity to make a real difference in the world while working alongside a talented and dedicated team.",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://ro.jooble.org/jdp/-6158187678705220711?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciBUZWNoIExlYWQiLCJjb21wYW55X25hbWUiOiJWYWx1YWJsZSBSZWNydWl0bWVudCIsImFkZHJlc3NfY2l0eSI6IkJ1Y2hhcmVzdCwgUm9tYW5pYSIsImh0aWRvY2lkIjoibjViT2xDXzB0aVlUVkJjbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhVbTl0WVc1cFlRIn0="
        },
        {
            "title": "Mobile Flutter Developer",
            "company_name": "IMONA Consulting",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.ro/search?ibp=htl;jobs&q=iOS+developer&htidocid=ifYCMCSwtuZJr34QAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGsQrCMBAAUFz7CU43OIk2IrjoJIqiUAUH15KEI41cc6F3lX6IX-Cv-GPq8njFa1SYil0khAP1qtjBHp9InH-bw5kdCNrON8AJjsyBcLxpVLOsjRGhMohajb703BpO6HgwD3byp5bGdpjJKtbL1WIocwrTyam6Xraw4yQ9aUwBYoL7500e7Qxu3NoU7RernvKllwAAAA&shmds=v1_AUFQtOOF5Z5qtOmiWxbH78_EW7oXrlFKSrvGyb-1HyPGLPTwDw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ifYCMCSwtuZJr34QAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508c0710d7cba81696d75/images/b6b1f16cd6b1e6eaafec19bc5ae9fb271d0636e761b3ed53e3f4a7cb12ad0f0e.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: Romania\n\nCompany Description\n\nOur international Client is looking for MOBILE DEVELOPERS with experience on FLUTTER.\n\nJob Description\n\nYOU have a few years experience on mobile development and knowlendge on Dart and Flutter mobile technologies.\n\nYOU have Android / iOS and Agile methodology knowledge.\n\nYOUR English is fluent and you want to become a part of a great Team.\n\nIf interested, drop me a line in confidence.\n\n#imonacareers #growwithus #exploretheworld #noborders #flutter\n\nQualifications\n\nEnglish and Romanian fluency is needed.\n\nThis offer from \"IMONA Consulting\" has been enriched by Jobgether.com and got a 72% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/6595a31c86bd1b54d87ad1cd-mobile-flutter-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRmx1dHRlciBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJJTU9OQSBDb25zdWx0aW5nIiwiYWRkcmVzc19jaXR5IjoiVsOibGNlYSwgUm9tYW5pYSIsImh0aWRvY2lkIjoiaWZZQ01DU3d0dVpKcjM0UUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhVbTl0WVc1cFlRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUa2xMTUhZeE56azJRM0l6VDNOT2FXUk9jWFJaTURCWmFWVldkMGxrVW5kWUxUWlJOMGxwT1ZWTlpHNVBSMVpYUkc5TWJHdFBOMEphVm1oUU9EVkpTMVZYTkdKRGRXOVVZM2RIVlRWZlNVRnVabFZQYkhkMGIwbE5NV1JLYlVwUU5pMVNibVo0YTBRMlJHZG5lRFpWY0RFd1ZXTllNbXhyYWkweVQxSTRlVVJOVlRkRExVZFZWamhXWTFSV2NVSklaMWxLZUhwS1h6ZzJXSGh4TmpKWk1ITjJSMGhVZDBOSGQzUjVWalpJTldkalFVWndZak00UnpsMWNrNXViMjlhUm05WkxTMTFRbUpTZW5oeE5VeE5NVTB5TVMxdmVsa3hhVWxOYTNod1RVTkRTazVrUW5ORGJqWkphVVl3WnpremMyRlFlVk5XVjFkMFQzVklUVkZGYkhoVVZWZGpVeElYZDBGcFJsb3RTM05HV2xkV2QySnJVR3hLWmxBd1VXOGFJa0ZHV0hKRlkzQTJkVko2V0ZkeE5tUklVVnB1WTJ0UllYTTROMlJ3ZVZkclVGRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.ro&location=Romania&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUa2xMTUhZeE56azJRM0l6VDNOT2FXUk9jWFJaTURCWmFWVldkMGxrVW5kWUxUWlJOMGxwT1ZWTlpHNVBSMVpYUkc5TWJHdFBOMEphVm1oUU9EVkpTMVZYTkdKRGRXOVVZM2RIVlRWZlNVRnVabFZQYkhkMGIwbE5NV1JLYlVwUU5pMVNibVo0YTBRMlJHZG5lRFpWY0RFd1ZXTllNbXhyYWkweVQxSTRlVVJOVlRkRExVZFZWamhXWTFSV2NVSklaMWxLZUhwS1h6ZzJXSGh4TmpKWk1ITjJSMGhVZDBOSGQzUjVWalpJTldkalFVWndZak00UnpsMWNrNXViMjlhUm05WkxTMTFRbUpTZW5oeE5VeE5NVTB5TVMxdmVsa3hhVWxOYTNod1RVTkRTazVrUW5ORGJqWkphVVl3WnpremMyRlFlVk5XVjFkMFQzVklUVkZGYkhoVVZWZGpVeElYZDBGcFJsb3RTM05HV2xkV2QySnJVR3hLWmxBd1VXOGFJa0ZHV0hKRlkzQTJkVko2V0ZkeE5tUklVVnB1WTJ0UllYTTROMlJ3ZVZkclVGRSIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}