{
    "search_metadata": {
        "id": "6785054b085abed351643550",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/225e1ce66383b82a/6785054b085abed351643550.json",
        "created_at": "2025-01-13 12:21:31 UTC",
        "processed_at": "2025-01-13 12:21:31 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHQ3plY2hpYQ&udm=8&fc=EqICCuIBQUpHOUprUDFnejFnVzRLb0NhQnA1VDI2d2laWlh1SFRuRmlWZWVQcm8wSUhnM0x4LU50QlhfSVQ3VU83WlJoQXZDbnpjY0hadVdLNDRFMGdxT01CbGNBRmE5Zi1raTczem56SU5icFAxbTBqVVc5aHA1WnBWM2ZZWFRGa1Jqc2JOVDRJSzJZR0Jjb29PWHFXRWpHRkhhaDZzTkNDSXBIM29DQ2IzZzB0UEU3M2d6dUhENWh4Unc0Ykh4NjZHdExyekNJVW1MM2NIbzk0NVpENHdEOG9mWGI3NEIxNy1Za0I1URIXU2dXRlo5ZUVOdTJyNU5vUDdheUowUTAaIkFGWHJFY29XVEptRmJ4aC1nbG16M21oQVRGZDBfXzJXU2c&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/225e1ce66383b82a/6785054b085abed351643550.html",
        "prettify_html_file": "https://serpapi.com/searches/225e1ce66383b82a/6785054b085abed351643550.prettify",
        "total_time_taken": 1.49
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Czechia",
        "location_used": "Czechia",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVxSUNDdUlCUVVwSE9VcHJVREZuZWpGblZ6UkxiME5oUW5BMVZESTJkMmxhV2xoMVNGUnVSbWxXWldWUWNtOHdTVWhuTTB4NExVNTBRbGhmU1ZRM1ZVODNXbEpvUVhaRGJucGpZMGhhZFZkTE5EUkZNR2R4VDAxQ2JHTkJSbUU1WmkxcmFUY3plbTU2U1U1aWNGQXhiVEJxVlZjNWFIQTFXbkJXTTJaWldGUkdhMUpxYzJKT1ZEUkpTekpaUjBKamIyOVBXSEZYUldwSFJraGhhRFp6VGtORFNYQklNMjlEUTJJelp6QjBVRVUzTTJkNmRVaEVOV2g0VW5jMFlraDROalpIZEV4eWVrTkpWVzFNTTJOSWJ6azBOVnBFTkhkRU9HOW1XR0kzTkVJeE55MVphMEkxVVJJWFUyZFhSbG81WlVWT2RUSnlOVTV2VURkaGVVb3dVVEFhSWtGR1dISkZZMjlYVkVwdFJtSjRhQzFuYkcxNk0yMW9RVlJHWkRCZlh6SlhVMmMiLCJmY3YiOiIzIn0="
    },
    "jobs_results": [
        {
            "title": "Senior Mobile Application Developer",
            "company_name": "Volito Software",
            "location": "Czechia",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=A293DVyDiN4j1mmhAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXLsQrCMBCAYVz7CE43CzYiuNRJFATBqeBaknA2J2cu5A4tvofva13-5eNvvoum6zGTVLhKIEY4lMIUvZFkOOELWQpWWMNFAij6GhPMchYZGZf7ZFa0c06V21Ft3mIb5ekkY5DJPSToP4MmX7GwNxy2u83UljyuljdhMoFe7vaeGSjD8YMxkf8BfR2nNpgAAAA&shmds=v1_AUFQtON1qXfv2swnAqfq98aJogMcTvanxHBxxTjXNdu9Ij0Y-w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=A293DVyDiN4j1mmhAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785054b085abed351643550/images/29ce513031e09a69e138ab8ad6234c7ae415018687ee6e9e432e469790116591.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "We are seeking a highly skilled Senior Mobile Application Developer to join our development team at Volito Software. As a key member of our team, you will play a crucial role in designing, developing, testing, and deploying high-quality mobile applications for our clients.\n\nThe ideal candidate will have a strong background in Full Stack development with a minimum of 6 years of experience. They should be proficient in JavaScript, React Native, and Node.JS frameworks, as well as have experience with state management libraries such as Redux.\n\nA successful candidate will also have a solid understanding of RESTful APIs and integration, familiarity with version control systems (e.g., Git), and excellent problem-solving and debugging skills. Strong communication and collaboration skills are essential for this role, as they will require working closely with cross-functional teams to create seamless and responsive user interfaces that meet the needs of our diverse user base.\nResponsibilities:\n• Develop and maintain robust and scalable React Native applications\n• Collaborate with product managers, designers, and other stakeholders to understand project requirements and deliver high-quality solutions\n• Write clean, maintainable, and efficient code following best practices and coding standards\n• Troubleshoot, debug and optimize applications for performance and usability\n• Stay updated on the latest trends and advancements in React Native and mobile development\n• Collaborate with other team members to integrate front-end and back-end components\n• Conduct code reviews to ensure code quality and adherence to coding standards\n\nRequirements:\n• React\n• React native\n• Degree in Computer Science or related field\n• iOS and Android expertise\n• JavaScript and Node.js proficiency\n• Redux and REST API knowledge\n• Git and version control system experience\n\nBenefits:\n• $120,000 - $150,000 per year salary\n• Ongoing professional development opportunities\n• Friendly and collaborative work environment",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://cz.trabajo.org/job-3057-788b3d02a4c4ac2746feea2efcdfb644?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIEFwcGxpY2F0aW9uIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlZvbGl0byBTb2Z0d2FyZSIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6IkEyOTNEVnlEaU40ajFtbWhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Senior Developer Advocate",
            "company_name": "RevenueCat",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBCAYVy7uzjdLJgUwUUnqSA46gOUJB5NJL0LubMUH8Dnti7_-P3Nd9W0D6TEFS44YeaCFc7PiYNThB3c2IOgqyECE1yZh4ybU1QtcrRWJJtB1GkKJvBomdDzbF_s5Z9eoqtY8kL1-0M7m0LDdn1fPvTGzikkgu6DISb3A30cua-JAAAA&shmds=v1_AUFQtOMrm__DAOyptGNhMuj-fNIrViAk0jpSdgMn1pkQxl8msA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=x9TMiPpQlZ0Clmm_AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785054b085abed351643550/images/29ce513031e09a695dfef114f71c74d33ae97ed9ec97d562ca7a9d421b03ec29.gif",
            "extensions": [
                "212K a year",
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "salary": "212K a year",
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: United States, EMEA\n\nAbout us:\n\nRevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps.\n\nWe are a mission driven, remote-first company that is building the standard for mobile subscription infrastructure. Top apps like VSCO, Notion, and ClassDojo count on RevenueCat to power their subscriptions at scale.\n\nOur 80 team members (and growing!) are located all over the world, from San Francisco to Madrid to Taipei. We're a close-knit, product-driven team, and we strive to live our core values: Customer Obsession, Always Be Shipping, Own It, and Balance.\n\nThe Role\n\nRevenueCat helps apps of all shapes and sizes make more money across mobile, the web, and other platforms like Roku and Amazon. As a result, many different types of users log in to – and use – RevenueCat on a day-to-day basis. Product managers, support reps, lifecycle marketers, user acquisition specialists, data analysts, executives: The list goes on.\n\nNone of those users would make it onto RevenueCat unless a developer implements it first. And for smaller apps, developers are these users: They do the marketing, provide support, interpret the performance data, make pricing and packaging decisions, and more.\n\nWe’re looking for a Senior Developer Advocate to help ensure these developers are successful when using RevenueCat. You’d join forces with our current Advocate, and guy you might have seen walking around Seoul in the rain, Charlie Chapman. We’re specifically looking for someone with strong skills in producing written educational content targeted at developers that is technical but engaging. Your work will educate existing RevenueCat users, attract new search traffic, and position RevenueCat as the go-to resource when implementing in-app purchases across platforms.\n\nWhat you’ll be responsible for\n\nYour primary responsibility will be creating high-quality, developer-focused content focused on monetization and in-app purchases. This includes both scenarios where developers use RevenueCat to solve for these use cases, as well as alternative implementations.\n\nExamples of the type of content we’d expect you to produce include blogpost with titles like:\n• \"Migrating a native subscription app to Flutter: A step by step plan\"\n• \"Implementing your first subscription with RevenueCat: Disable ads for paid users\"\n• \"How to detect and highlight the platform of purchase for cross-device subscribers\"\n• \"Adding a multi-tier subscription to your Expo app\"\n\nIn addition to writing, you’ll:\n• Speak at conferences, webinars, and other events to share insights and represent RevenueCat\n• Record videos and collaborate on webinars to help developers implement and succeed with RevenueCat\n• Work cross-functionally to develop resources that support developers using RevenueCat\n\nWithin the first month, you’ll:\n• Learn RevenueCat inside and out\n• Familiarize yourself with our developer community and how to engage them\n• Have produced your first pieces of RevenueCat content\n\nWithin the first 3 months, you’ll:\n• Collaborate with Charlie on a joint content strategy playing to both your strengths\n• Independently research and develop content to fill current gaps in our documentation and other educational efforts\n• Repurpose existing content into new formats (e.g., blog posts into videos) to expand our reach\n\nWithin the first 6 months, you’ll:\n• Represent RevenueCat at industry conferences and webinars, delivering talks and engaging with developers\n• Support product launches with technical content (written or video)\n\nAfter 12 months, you’ll have:\n• Become a fixture across the developer community, having become synonymous with RevenueCat and in-app monetization for Android, Flutter, and/or React Native\n• Found new and novel ways to help us engage developers (think Shipaton, App Store Rejection socks, and similar initiatives)\n\nAbout you\n\nYou’re passionate about teaching and helping developers thrive. You’re deeply experienced in app development, particularly subscription apps, whether as part of a team or through indie projects (preferably both).\n\nWhat you’ll need to be successful\n• 5+ years of experience in app development or developer-focused roles, ideally in a subscription app environment, with a deep understanding of at least one major mobile development platform (Android, Flutter, React Native preferred; iOS a strong alternative) and the ability to learn and write about others\n• Strong independent project management skills, with the ability to manage multiple content initiatives, events, and deadlines across time zones without constant oversight\n• Excellent technical communication skills, capable of translating complex technical concepts into accessible and engaging written, video, and spoken formats for developers\n• A passion for teaching and empowering developers, with the ability to create content that educates and inspires action, including blog posts, tutorials, and videos\n• Proven ability to learn and explain new technologies, with expertise in Android development, Flutter, or React Native preferred (experience with iOS development is a plus if paired with a demonstrated ability to adapt to and write about other platforms)\n• Proven experience in producing content for a developer audience, preferably in a professional capacity as a developer advocate, but we’d consider exceptional candidates that have written, recorded video, and have spoken at conferences targeted at developers as a hobby or side-project\n• Resourcefulness and adaptability, with a problem-solving mindset to navigate the challenges of engaging a global developer community\n• Outcome-driven approach, ensuring your efforts lead to measurable impacts, such as increased content engagement, developer onboarding, and community growth\n• Comfort with a fully remote, asynchronous work environment, and tools like Notion, Zoom, Slack, and Linear. You’ll need to thrive in an environment that balances collaboration with ample time for focused, deep work\n\nWe’re looking for someone who embodies our team’s core values of agency and intellectual curiosity: taking initiative, solving problems, and continually learning to better serve our diverse developer audience. Regular travel may occasionally be required for conferences, events, or team gatherings.\n\nWhat we offer:\n• $212,000 USD salary, regardless of location\n• Competitive equity in a fast-growing, Series C startup backed by top-tier investors, including Y Combinator\n• 10-year window to exercise vested equity options\n• Fully remote and flexible work environment\n• 4-5 weeks of suggested time off annually for mental, physical, and emotional recharge\n• $2,000 USD for workspace setup and $1,000 USD annual stipend for continuous learning\n\nCurious about the interview process? Discover more in our blog post about how we hire and learn tips to help you succeed.\n\nThis offer from \"RevenueCat\" has been enriched by Jobgether.com and got a 90% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/674cc14db10568bbc7b1e688-senior-developer-advocate?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGV2ZWxvcGVyIEFkdm9jYXRlIiwiY29tcGFueV9uYW1lIjoiUmV2ZW51ZUNhdCIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6Ing5VE1pUHBRbFowQ2xtbV9BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Senior Mobile Developer",
            "company_name": "Altimetrik Poland",
            "location": "Czechia",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Wr08_OnSgssQb5IhAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEQQoCMQwAQLzuE8RDzoKtCF70JAqCIAg-YGlr2EazTWmCLH7BT4tzmO4769wdC0mDq0RihBO-kaVigxVcJIJiaCmDFDiLDIzzfTaruvNeld2gFoySSzJ6KRhl8k-J-q_XHBpWDob9ZrueXC3DcnFgoxGt0QtuwqE8gAocP5gyhR9oGghsjgAAAA&shmds=v1_AUFQtONr9_-ZgY8H35HtWQ-Llytlhcsvd7lt6UywBZvAY9NB-w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Wr08_OnSgssQb5IhAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are seeking an experienced Senior iOS Developer to join our team in Kraków. As a key member of our mobile development group, you will be responsible for designing, developing, and maintaining advanced iOS background applications.\n\nAs a skilled mobile developer with expertise in both iOS and Android platforms, you will work closely with cross-functional teams to design and launch new features, ensuring seamless integration across both ecosystems.\n\nYour primary focus will be on delivering high-performance, responsive iOS applications, as well as collaborating with our Android developers to create consistent functionality across both platforms.\n\nIn addition to your technical expertise, you will provide architectural guidance and help establish best practices for mobile development within our organization.\n\nYou will also optimize code for performance, quality, and reusability across iOS and, where relevant, Android platforms.\n\nTo succeed in this role, you should have a strong understanding of iOS app development, including experience with Swift, Objective-C, and RESTful APIs.\n\nFamiliarity with Kotlin, Java, and CI/CD practices is also highly desirable.\n\nThe ideal candidate will possess excellent communication skills, with the ability to clearly convey technical details and collaborate effectively with developers of varying experience levels.\n\nOur company values trust and empowerment, and we prefer to take action rather than just discussing ideas.\n\nWhat's in it for you? Competitive salary ranging from $120,000 to $180,000 per annum, private healthcare benefits, small teams, international projects, modern office space, and a startup atmosphere with no dress code required.",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://cz.trabajo.org/job-3057-7b66f726294f1fc4d394db7519eab2d6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkFsdGltZXRyaWsgUG9sYW5kIiwiYWRkcmVzc19jaXR5IjoiQ3plY2hpYSIsImh0aWRvY2lkIjoiV3IwOF9PblNnc3NRYjVJaEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhRM3BsWTJocFlRIn0="
        },
        {
            "title": "Mobile Application SDK Developer at Blazity",
            "company_name": "Blazity",
            "location": "Czechia",
            "via": "Jobs Trabajo.org",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=M4mglfTotrehE0EJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_zXMsQrCQAyAYVw7OjplFuyJ4KKTtSAoTj6A5I7QO4mXowlS-x6-r3Vw-aefr_rMquYqPjHBoRROAS1Jhlt7gZZexFKoBzRoGMdkb1jBWTwoYR8iTONJpGNa7KNZ0Z1zqlx3apMS6iBPJ5m8DO4hXn-5a8SeCqPRfbNdD3XJ3XL-x1OG40ghJvwCGHgxb5gAAAA&shmds=v1_AUFQtOPfgNEfHgywCbARtSrFPBIke8RDWedu7W9m0-pOUKRLVg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=M4mglfTotrehE0EJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785054b085abed351643550/images/29ce513031e09a6981e32e42b5b90b9a6e2cdfe14b788efeeb4518f62f42ce82.gif",
            "extensions": [
                "25 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "25 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Develop Your Mobile Expertise with Us\n\nAt Blazity, we're a team of seasoned professionals dedicated to crafting top-notch API-first products. Our focus is on building long-term partnerships with clients, serving as their trusted development partners.\n\nWe optimize apps, stores, and websites, implement new features, and automate workflows to deliver exceptional results. If you're looking for your next challenge, why not join our dynamic team?\nWhat We Offer\n• A competitive salary range: 90 - 145 PLN/h\n\nOur benefits package includes:\n• 29 paid days off\n• Comprehensive health and wellness coverage, including Medicover and Multisport\n• Top-notch work equipment\n• Long-term collaboration with opportunities for growth\n• 100% remote work from Poland\n• Flexible working hours\n\nWe foster an open, supportive environment where feedback is valued and teamwork thrives.\nJob Requirements\n• Development and maintenance of mobile SDKs (iOS and Android)\n• Providing support and maintenance for iOS and Android platforms\n• Assisting customers with SDK-related issues\n• Supporting push notifications infrastructure\n• Collaborating on platform-related tasks in Ruby on Rails when required\n\nRequired skills include React, Next.js, SDK, iOS, Android, Swift, Flutter, and Ruby on Rails. Additionally, we offer sport subscription, private healthcare, remote work, flexible working hours, and paid vacation.",
            "apply_options": [
                {
                    "title": "Jobs Trabajo.org",
                    "link": "https://cz.trabajo.org/job-3057-6abef4e45f4ab8d746444a475d9845d6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gU0RLIERldmVsb3BlciBhdCBCbGF6aXR5IiwiY29tcGFueV9uYW1lIjoiQmxheml0eSIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6Ik00bWdsZlRvdHJlaEUwRUpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        },
        {
            "title": "Senior Mobile Cross-Platform Developer (Firebase)",
            "company_name": "Proxify",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNsQrCMBAAUFw7OjrdqEIbEVx0rKgIQsEPKEm4JpE0F-6CVH_Fn1WXt77qM6sud0yBGG5kQkRomUTqLuoyEI9wxCdGysiwPAVGowVXUMOVDAhqth4owZnIRVwcfClZ9kqJxMZJ0SXYxtKoKKGhST3IyJ9evGbMvwL77W4zNTm59bxjmsLwgpCgfaP1QX8B0Zv3UZ4AAAA&shmds=v1_AUFQtONy0oLxm9xzeQkJXXzrpMRSVC8Gw2g718GlZCkxxIwIBQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=D-4ZUrqFUmW5FnU3AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785054b085abed351643550/images/29ce513031e09a6922583632a54c2b8f9688415e8c4f78b27b471105733c132b.gif",
            "extensions": [
                "Work from home",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "This a Full Remote job, the offer is available from: EMEA\n\nAbout us:\n\nTalent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the right direction. 🙂\n\nSince our launch, Proxify's developers have successfully worked with 1200+ happy clients to build their products and growth features. 3500+ talented developers trust Proxify and its network to fulfil their dreams and objectives.\n\nProxify is shaped by a global network of supportive, talented developers interested in remote full-time jobs. Our Glassdoor (4.5/5) and Trustpilot (4.8/5) ratings reflect the trust developers place in us and our commitment to our members' success.\n\nThe Role:\n\nWe are looking for a Senior Mobile Cross-platform Developer with strong proficiency with Firebase for one of our clients. You are a perfect candidate if you are growth-oriented, you love what you do, and you enjoy working on new ideas to develop exciting products.\n\nWhat we’re looking for:\n• Minimum of 5 years of experience in mobile application development with a strong portfolio of released applications.\n• Extensive experience with Firebase services and integrations in mobile applications.\n• Proficiency in mobile development frameworks and languages such as Flutter, React Native, Swift, Kotlin, and Java.\n• Strong knowledge of testing frameworks and debugging tools for mobile applications.\n• Excellent analytical and problem-solving skills with a proactive approach to identifying and resolving issues.\n\nResponsibilities:\n• Design, develop, and maintain high-performance mobile applications for both iOS and Android platforms using Flutter, React Native, or native languages (Swift, Kotlin).\n• Implement and manage Firebase services such as Authentication, Firestore, Realtime Database, Cloud Functions, Cloud Messaging, and Crashlytics to enhance mobile applications.\n• Write clean, maintainable, and efficient code with a focus on reusability and best practices. Conduct unit testing, integration testing, and end-to-end testing to ensure application stability and performance.\n• Identify and troubleshoot performance bottlenecks in mobile applications and optimise for maximum performance and user experience.\n\nWhat Proxify offers\n• Career-accelerating positions at cutting-edge companies\n• Discover exclusive long-term remote engagements at the world's most interesting product companies.\n• Hand-picked opportunities, just for you\n• Skip the typical recruitment roadblocks and biases with personally matched engagements.\n• Fast-track your independent developer career\n• Start small and gain more freedom to take on new engagements as you build your independent developer career.\n• A recruitment process that values your time\n• Only one hiring process with the possibility of several positions, without any additional tests.\n\nThis offer from \"Proxify\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/66becfd9b7394dd03ed0d048-senior-mobile-cross-platform-developer-firebase?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgTW9iaWxlIENyb3NzLVBsYXRmb3JtIERldmVsb3BlciAoRmlyZWJhc2UpIiwiY29tcGFueV9uYW1lIjoiUHJveGlmeSIsImFkZHJlc3NfY2l0eSI6IkN6ZWNoaWEiLCJodGlkb2NpZCI6IkQtNFpVcnFGVW1XNUZuVTNBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUTNwbFkyaHBZUSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVvd0NDc3dCUVVwSE9VcHJUemROYUY5WVltMHpSSEJCVkd0VE4wRldXRjlaZGtSU1VVOVRNa0ZxWjFWRGJUSkhWMmt4WVRnMUxYcEZURmQyYURSUU1FRnlWRlJ0Y3kxZk9GbFhkbG8xWnpsNmFFRmlVbEpQWjAxeVdIaExiWFo0YjBaWFNteHpWa0pSUVVSVFJIbFdaMkpvYTBJNVQzcGlNV2szYUZJdGVIcFJSMnRMTWxsaFpYUnFZV1Z2V2xnM1VXazRjM2RNVDB0bVJFUmhaMjk1YVcxclVXTlFjV1ZCVUVRNFJHYzFlRzFDTm5kNFVISkJNakZYVDJ0d1MxVjBSVkk0TVVkcFZWSnNha1p4U1daQ1VGazBFaGRVUVZkR1dqVklVa1phVDI4d1VFVlFiMkZxVG10QlNSb2lRVVpZY2tWamNVcE1PR1Z5TW5WSFRFTXlVbE5FTkhaYVVUbHNUa2hOVERsUFVRIiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Czechia&next_page_token=eyJmYyI6IkVvd0NDc3dCUVVwSE9VcHJUemROYUY5WVltMHpSSEJCVkd0VE4wRldXRjlaZGtSU1VVOVRNa0ZxWjFWRGJUSkhWMmt4WVRnMUxYcEZURmQyYURSUU1FRnlWRlJ0Y3kxZk9GbFhkbG8xWnpsNmFFRmlVbEpQWjAxeVdIaExiWFo0YjBaWFNteHpWa0pSUVVSVFJIbFdaMkpvYTBJNVQzcGlNV2szYUZJdGVIcFJSMnRMTWxsaFpYUnFZV1Z2V2xnM1VXazRjM2RNVDB0bVJFUmhaMjk1YVcxclVXTlFjV1ZCVUVRNFJHYzFlRzFDTm5kNFVISkJNakZYVDJ0d1MxVjBSVkk0TVVkcFZWSnNha1p4U1daQ1VGazBFaGRVUVZkR1dqVklVa1phVDI4d1VFVlFiMkZxVG10QlNSb2lRVVpZY2tWamNVcE1PR1Z5TW5WSFRFTXlVbE5FTkhaYVVUbHNUa2hOVERsUFVRIiwiZmN2IjoiMyJ9&q=iOS+developer"
    }
}