{
    "search_metadata": {
        "id": "6785056b413b30b1db04d6c9",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/dc55bea356a368df/6785056b413b30b1db04d6c9.json",
        "created_at": "2025-01-13 12:22:03 UTC",
        "processed_at": "2025-01-13 12:22:03 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHR2VybWFueQ&udm=8&fc=EswCCowCQUpHOUprTjd0X0dMT0lvRnFDQlhpb19fWnkwSjdhMVlQcFFOcEd0TmJlMXAzZXVyalVlcktyMnA0SFBMRTB5OHBHdG1sT1VvT0YweElWellGcHF3aDJVWDQ4V2hGOUpaejJERWEwbU42V05sSlJwczNvbVZYWHRxUFNkMkxyenZ5c0t2QW1PUUJsQmJIeHZHRU5KZ0czcGJhUUh0aUdjZE8tejZXazFBcHlNdlhlYkN3NTQ5bGNvTTNTMmNIN3I3bTRac0d0R3BsUExSTVBIakppcHA0dFpUUmZrMHAwTFJBTUtnWHBHZ2cyT1QxdThQcUFrbjVoZy0zLTROaUo5R1RDaUU2UWRJUENsMBIXYXdXRlo1NndDYkRaNU5vUDVjYWhxQW8aIkFGWHJFY29WSW1yVkxMT1NseXhTRWhYZzJFbXQzM1publE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/dc55bea356a368df/6785056b413b30b1db04d6c9.html",
        "prettify_html_file": "https://serpapi.com/searches/dc55bea356a368df/6785056b413b30b1db04d6c9.prettify",
        "total_time_taken": 1.37
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Germany",
        "location_used": "Germany",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUamQwWDBkTVQwbHZSbkZEUWxocGIxOWZXbmt3U2pkaE1WbFFjRkZPY0VkMFRtSmxNWEF6WlhWeWFsVmxja3R5TW5BMFNGQk1SVEI1T0hCSGRHMXNUMVZ2VDBZd2VFbFdlbGxHY0hGM2FESlZXRFE0VjJoR09VcGFlakpFUldFd2JVNDJWMDVzU2xKd2N6TnZiVlpZV0hSeFVGTmtNa3h5ZW5aNWMwdDJRVzFQVVVKc1FtSkllSFpIUlU1S1owY3pjR0poVVVoMGFVZGpaRTh0ZWpaWGF6RkJjSGxOZGxobFlrTjNOVFE1YkdOdlRUTlRNbU5JTjNJM2JUUmFjMGQwUjNCc1VFeFNUVkJJYWtwcGNIQTBkRnBVVW1ack1IQXdURkpCVFV0bldIQkhaMmN5VDFReGRUaFFjVUZyYmpWb1p5MHpMVFJPYVVvNVIxUkRhVVUyVVdSSlVFTnNNQklYWVhkWFJsbzFObmREWWtSYU5VNXZVRFZqWVdoeFFXOGFJa0ZHV0hKRlkyOVdTVzF5Vmt4TVQxTnNlWGhUUldoWVp6SkZiWFF6TTFwdWJsRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior Software Developer iPad",
            "company_name": "Maxon Computer GmbH",
            "location": "Bad Homburg, Germany",
            "via": "Workday",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=WLGFKDRCW9QG-FHnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNTQrCMBBAYdz2CK5m7U8jQje6q0KLIAg9QEnqmEaSTEimWo_jTY2bt_xe8V0UVYfeUISOHvyWEeGML7QUMIK5yTts4UIKEso4jEAeGiJtcXkcmUM6CJGSLXViyWYoB3KCPCqaxZNU-qdPY0aDlYz9vtrNZfB6tb7KOVMncmHiPGqcasF4qPOvJaemqDfQYHTSf35LwtilpAAAAA&shmds=v1_AUFQtOPsbpjk_loi52O4SphAMHA8aWM_Uu8Nj-cfQPJgxAMOQQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=WLGFKDRCW9QG-FHnAAAAAA%3D%3D",
            "extensions": [
                "27 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time"
            },
            "description": "If you want to be a Maxonian and help bring the best 2D and 3D visual effects, motion graphics, gaming, AR/MR/VR, visualization and design software to the market, then we should have a chat. WHO WE ARE: Packed with brilliant, passionate people, Maxon is deeply rooted in the creative industry and committed to empowering the artistic community. We are Maxonians. We encourage and motivate each other to be curious learners. We are obsessed with customer fulfillment and inspiration – before, during and after purchase. If you too want to be a Maxonian and help bring to market the finest software products for 2D and 3D visual effects, motion graphics, games, AR/MR/VR, visualization and general design, let’s talk. WHAT YOU WILL DO: Design, develop, and maintain advanced iPad applications tailored to the needs of 3D artists and animators. Contribute to the overall architecture of the software, ensuring robust, scalable, and maintainable code Work closely with product managers, UX/UI designers, and other developers to conceptualize, build, test, and release new features. Continuously discover, evaluate, and implement new technologies to maximize development efficiency and application performance. Debug and resolve technical issues, providing support for our iPad application users. Participate in code reviews, providing feedback and mentorship to junior developers. Ensure the performance, quality, and responsiveness of applications. Stay current with the latest trends and technologies related to iOS development and 3D software applications. WHAT WE ARE LOOKING FOR: Bachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field. At least 5+ years of experience in software development, with a significant focus on developing iOS applications, particularly for the iPad. Proficiency in Objective-C and C++ programming languages. Strong experience with iOS frameworks such as Core Animation, Core Graphics, and Core Data. Deep understanding of 3D graphics programming and technologies, including OpenGL, Metal, and/or Vulkan Experience with 3D software applications and understanding of 3D modeling, texturing, animation, and rendering processes. Knowledge of software design patterns and best practices in software development. Experience with version control systems such as Git. Strong problem-solving skills and ability to think creatively. Excellent communication skills, both written and verbal. Ability to work collaboratively in a fast-paced environment. WHAT WE OFFER: You will be part of a highly motivated international team of specialists working in an environment that offers a warm welcome with detailed onboarding and a dedicated mentor for a familiarization period as well as a wide range of individual development possibilities. Interested in joining our team? Fill out the form or email us your resume/CV (.pdf). Don’t meet every single requirement? At Maxon we embrace diversity, are avid explorers and curious learners, so if you’re excited about this role but your experience doesn’t entirely match every qualification in the job description, we encourage you to apply in any case. You may be just the right candidate for this or other positions. We’re looking forward to hearing from you! Packed with brilliant, passionate people, Maxon is deeply rooted in the creative industry and committed to empowering the artistic community. We are Maxonians. We encourage and motivate each other to be curious learners. We are obsessed with customer fulfillment and inspiration – before, during and after purchase. If you too want to be a Maxonian and help bring to market the finest software products for 2D and 3D visual effects, motion graphics, games, AR/MR/VR, visualization and general design, let’s talk.",
            "apply_options": [
                {
                    "title": "Workday",
                    "link": "https://maxon.wd103.myworkdayjobs.com/en-US/MAXO/job/Senior-Software-Developer-iPad_JR100278?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.de/jobs/356586311-senior-software-developer-ipad-bei-maxon-computer-gmbh?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/deutschland/software_entwicklung/3828319060/g/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRGV2ZWxvcGVyIGlQYWQiLCJjb21wYW55X25hbWUiOiJNYXhvbiBDb21wdXRlciBHbWJIIiwiYWRkcmVzc19jaXR5IjoiQmFkIEhvbWJ1cmcsIEdlcm1hbnkiLCJodGlkb2NpZCI6IldMR0ZLRFJDVzlRRy1GSG5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Senior iOS Developer (m/w/d) für Messenger-App",
            "company_name": "secunet Security Networks AG",
            "location": "Essen, Germany",
            "via": "XING",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=oK_puPL45ONe7NJGAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXOMQ6CQBBA0dhyBKsp1QhrTGy0IlFJTNSCA5gFx2UVdjYzq8DB7Oy8mNL81_7oPYr2OTpLDPacwxZfWJNHhkmjWnWdwu37YTiiCDqDHKfeQwwHKkBQc1kBOciITI3jTRWCl7VSInViJOhgy6SkRpHDgjp1p0KGXKTSjL7WAS_L1aJLvDOzRLB8OgyQ_2UbejhhaIkfAmkG1sFuOJhDhtxo1_8AVQwyGLgAAAA&shmds=v1_AUFQtOOXJGsi5hucEWJ1kPX2LNUwFMyFDywtF4lqITtTcIfhxA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=oK_puPL45ONe7NJGAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e2f6f02e6393772d15012bcd9b03c2ec0f553226f9cba2bd36.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "OK\n\nSenior iOS Developer (m/w/d) für Messenger-App\n\nstashcat professionalisiert einfache und sichere Kommunikation für die Arbeitswelt. Der High Secure Messenger \"Made in Germany\" findet Verwendung in Behörden, Schulen und Unternehmen. Der Messenger, die Dateiablage, Sprach- und Videotelefonie, Kalender und alle weiteren, eingebundenen Kollaborationstools werden stetig weiterentwickelt und auf die Wünsche und Bedürfnisse der NutzerInnen angepasst. Die stashcat GmbH ist ein Tochterunternehmen der secunet Security Networks AG.\n\nFür unseren Standort in Hannover suchen wir ab sofort Deinen klugen Kopf.\n\nDeine Aufgaben\n• Deine Aufgaben umfassen die kontinuierliche Weiterentwicklung und Wartung unseres bestehenden iOS-Messengers.\n• In spannenden Projektarbeiten entwirfst, planst und implementierst Du neue Features, wobei Du eng mit Teamkollegen, Testern und UI-Designern zusammenarbeitest, um die besten Lösungen für unsere iOS-App zu finden.\n• Zudem arbeitest Du Dich stetig in neue Technologien und Frameworks ein und bewertest deren Potenzial für innovative Lösungen in unserer Applikation.\n• Dabei überwachst Du die Code-Qualität durch Review- und Merge-Prozesse.\n• Du pflegst und erweiterst die technische Dokumentation, um eine hohe Transparenz und Verständlichkeit zu gewährleisten.\n• Als Mentor bietest Du technische Beratung und Unterstützung für die fachliche Weiterentwicklung von Junior Entwicklern und förderst Best Practices sowie kontinuierliche Verbesserungen im Entwicklungsteam.\n\nDein Profil\n• Du hast fundierte Kenntnisse in der nativen iOS-Entwicklung und einschlägige Erfahrung oder einen vergleichbaren Hintergrund in einem verwandten Bereich.\n• Im Bereich Swift hast Du gute Kenntnisse in Combine, Async/Await und dem Swift Package Manager.\n• Dein umfassendes Wissen über Softwarearchitekturen, Datenstrukturen sowie UIKit und andere gängige Apple-Frameworks ermöglicht es Dir, die Entwicklung voranzutreiben und die iOS-App kontinuierlich zu verbessern.\n• Du legst großen Wert auf sauberen, verständlichen und performanten Code, um die Qualität und Wartbarkeit der Software sicherzustellen.\n• Eine selbständige und strukturierte Arbeitsweise, ausgeprägte Teamfähigkeit und die Bereitschaft zur kontinuierlichen Weiterentwicklung gehören zu Deinen Stärken.\n• Kenntnisse in Git und CI/CD sowie Erfahrungen mit Realm.io, kryptografischen Themen (RSA, AES) oder Fastlane und ein grundlegendes Verständnis für Tests und SwiftUI sind von Vorteil, jedoch nicht zwingend erforderlich.\n\nUnser Angebot\n• Wir bieten eine attraktive, leistungsorientierte Vergütung sowie ansprechende Konditionen und die Sicherheiten eines erfolgreichen Unternehmens.\n• Dich erwarten spannende Herausforderungen in einem eingespielten Team sowie vielfältige und abwechslungsreiche Aufgaben im Bereich der IT-Sicherheit.\n• Genieße eine 38,5-Stunden-Woche, Vertrauensarbeitszeit, 30 Tage Urlaub und die Möglichkeit, bis zu zwei Tage pro Woche im Homeoffice zu arbeiten.\n• Unsere modernen Büroräume sind mit aktuellen MacBook Pros, zwei 27-Zoll-Monitoren, höhenverstellbaren Tischen und ergonomischen Schreibtischstühlen bestens ausgestattet, um dir ein angenehmes Arbeitsumfeld zu bieten.\n• Mit der hervorragenden Verkehrsanbindung im Zentrum Hannovers, Parkplätzen für PKW und Fahrrad, erreichst du uns bequem.\n• Profitiere von attraktiven Benefits wie einem vergünstigten Deutschlandticket, Job-Fahrrad und bis zu 20 Tagen Remote-Arbeit innerhalb der EU sowie von Team-Events auf unserer Dachterrasse.\n• Wir bieten verschiedene Arbeitsplatzmodelle wie Mobile Office, Shared-Desk oder die Arbeit vor Ort, sodass wir gemeinsam die Arbeitsform finden, die am besten zu Dir passt.\n• Um dein Wissen auszubauen und einzubringen, unterstützen wir dich bei der Auswahl geeigneter Weiterbildungsmaßnahmen.\n• Ein schneller und unkomplizierter Austausch sowie kurze Entscheidungswege werden durch unseren Unternehmensmessenger unterstützt.\n• Erlebe eine offene Unternehmenskultur mit flachen Hierarchien und Kommunikation auf Augenhöhe.",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/essen-senior-ios-developer-messenger-app-128507219?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAobS93L2QpIGbDvHIgTWVzc2VuZ2VyLUFwcCIsImNvbXBhbnlfbmFtZSI6InNlY3VuZXQgU2VjdXJpdHkgTmV0d29ya3MgQUciLCJhZGRyZXNzX2NpdHkiOiJFc3NlbiwgR2VybWFueSIsImh0aWRvY2lkIjoib0tfcHVQTDQ1T05lN05KR0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Mobile Developer iOS / Android (m/w/d)",
            "company_name": "slashwhy",
            "location": "Hamburg, Germany",
            "via": "Get In IT",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=hKLNS3Eu0_37aGFqAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CeJwo4r2RHBRHAShIoiDH1CS9kgiSS7koq2_4teKb3jVd1Idb6ydJzjTmzwnyuDuD0A4xT6z62EecMB-AWu4sgYhlTsLHKFhNp6mB1tKkj2iiK-NFFVcV3cckCNpHvHJWv61YlWm5FWhdrvbjHWKZjkTr8QO9gMuwkUF_cpmBQ3loOLnB7uvsUqdAAAA&shmds=v1_AUFQtONSF95UTfjvMbfp8EXGdSSsmbfNXPTAGi8T0H9GsaHgIw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=hKLNS3Eu0_37aGFqAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Was dich bei uns erwartet? unser agiles Mindset spannende Herausforderungen, die du gemeinsam mit deinen motivierten Entwicklungskolleg:innen lösen wirst die Entwicklung von innovativen mobilen Anwendungen im Bereich Smart Home mit Swift oder Kotlin die Mitwirkung bei der Konzeption und Entwicklung von nutzerfreundlichen Anwendungen, die genau auf den User zugeschnitten sind der Freiraum für kreative Ideen und für deine Weiterentwicklung kurze Entscheidungswege, flache Hierarchien und ein großartiges Team tolle Räumlichkeiten im Tower am Michel mit einem atemberaubenden 360° Blick über Hamburg sowie die flexible Möglichkeit, im Homeoffice zu arbeiten Worüber freuen wir uns? deine Berufserfahrung als Mobile Developer gute Kenntnisse in der Entwicklung nativer Mobile Apps deine Erfahrungen mit Dart, Kotlin oder Swift, SwiftUI deine Begeisterungsfähigkeit zur schnellen Einarbeitung in neue Sprachen, Frameworks und Technologien (z.B. Flutter, Kotlin Multiplatform, MAUI o.ä.) Bonus: erste Erfahrungen mit Bluetooth Mesh, der Arbeit mit automatisierten Tests, sowie der Nutzung einer Continuous Integration deine Begeisterung für Agilität und deinen Spaß an der Arbeit im Team deine selbstständige und strukturierte Arbeitsweise sowie deinen hohen Qualitätsanspruch deine fließenden Deutsch- und guten Englisch-Kenntnisse Klingt nach dir? Kreiere mit uns den Job, der dich begeistert und uns zusammen voranbringt! Unser agiles, motiviertes Team freut sich auf neue Teammitglieder, die offen und lernbereit sind, gerne Fragen stellen, kreativ sind und mitdenken. Wir mögen keine starren Strukturen und Prozesse, sind neugierig und gehen gern neue Wege. Wir vertrauen auf deine Eigenverantwortung und bieten dir den Freiraum, den du brauchst, um deine Ideen einzubringen und dich weiterzuentwickeln. Unsere Benefits: Home-Office, Flexible Arbeitszeiten & unterschiedliche Teilzeitmodelle, 30 Tage für Weiterentwicklung, Zuschuss hvv-Profiticket, Bike-Leasing, Hansefit, Edenred-Gutscheinkarte, Company Backlog, Sommer- und Winterevents, 360° Blick über Hamburg, Kantinenzuschuss, frisches Obst und grandioser Kaffee aus der Siebträgermaschine, wöchentlicher Brunch, Programme für deine physische und psychische Gesundheit, Corporate Benefits, Betriebliche Altersvorsorge und vermögenswirksame Leistungen, eine offene Feedback- und Fehlerkultur, KiTa-Zuschuss, Hardware nach Wunsch, Workation, Diversity & Inclusion und vieles mehr.",
            "apply_options": [
                {
                    "title": "Get In IT",
                    "link": "https://www.get-in-it.de/jobsuche/p217476?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SaluteMyJob",
                    "link": "https://salutemyjob.com/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Star Job Search",
                    "link": "https://starjobsearch.co.uk/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "My Stateline Jobs",
                    "link": "https://jobs.mystateline.com/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba.de",
                    "link": "https://www.jobijoba.de/detailanzeige/9/15ce645bed5563a5bdd0deef9f341a03?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KSNT Jobs",
                    "link": "https://jobs.ksnt.com/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WANE Jobs",
                    "link": "https://jobs.wane.com/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Top County Careers",
                    "link": "https://topcountycareers.co.uk/jobs/mobile-developer-ios-android-m-w-d-hamburg/1542999990-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIGlPUyAvIEFuZHJvaWQgKG0vdy9kKSIsImNvbXBhbnlfbmFtZSI6InNsYXNod2h5IiwiYWRkcmVzc19jaXR5IjoiSGFtYnVyZywgR2VybWFueSIsImh0aWRvY2lkIjoiaEtMTlMzRXUwXzM3YUdGcUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Software Entwickler Android / iOS / Flutter (m/w/d) Java Swift Dart Kotlin - Programmierer - Mobile App Developer - Engineer",
            "company_name": "CHEQSITE GmbH",
            "location": "Berlin, Germany",
            "via": "Stepstone",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=vogbswuXmvy5nfvbAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2OsU7DMBRF1bWfwHRHQDRGSCwwFRpSihCgsFd28poYbD_LfjTlO_hWdkyXo6ujO5z572z-M2t5J5NOhDrIZLtPRwnL0Ce2PRTsS1v44L5Eij_1alL9GTZ6r9FOdidY6SR4YnE2YIHXxEPS3ltK5b7AMxvrCMsYsaI9OY5HXYfBBjrODRtk0qkbwQEN8-Do5HYUiflGqZxdNWTRYruqY684kOGD-mCT_7HNYymPTgttr64vD1UMwznu1_Vb-_heo_FmjdJ1R6nkXaCh5HX4_gMtF0TN-AAAAA&shmds=v1_AUFQtOMWQI28Gux2nKbpKfRo8A1z3UxvBcHW7B-Ubz9aZtbnuw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=vogbswuXmvy5nfvbAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e21283e7f04b480276df0f33437d28b79a8059159ba627ac68.gif",
            "extensions": [
                "19 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "19 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Wir suchen erfahrene Softwareentwickler und aufstrebende Programmiertalente, die gemeinsam mit uns die nächste Generation unserer schlanken Software implementieren.\n\nKurze Entscheidungswege, kreativer Freiraum zur Gestaltung und professionelle Unterstützung unsererseits ermöglichen es Dir, Dein volles Potenzial zu entfalten und Deine Ideen bestmöglich umzusetzen.\n\nCHEQSITE produziert moderne Apps für die Sicherheitsprüfung und Instandhaltung von Betriebsmitteln und Anlagen. Unsere Applikationen sind im Einsatz bei führenden Unternehmen aus verschiedenen Branchen, u.a. in Industrie, Logistik, Bau und Einzelhandel.\n\nDeine Arbeit bei uns ist vielseitig und herausfordernd. In Forschung und Entwicklung arbeiten wir mit modernen Technologien und Werkzeugen an praktischen Lösungen für unsere Kunden.\n\nJob ad in English, please visit our site (see link below).\n\nDIESE AUFGABEN ERWARTEN DICH\n• Deine Reise als Software Developer bei CHEQSITE beginnt mit der Umsetzung von semikomplexen Frontend- und Backend-Modulen. Gemeinsam mit unserem UI- / UX-Designer setzt Du Wegpunkte für unsere nächste Softwaregeneration.\n• Android programmierst Du mit Java und Kotlin.\n• iPhone iOS und iPad OS programmierst Du mit Swift.\n• Für Cross-Plattform-Anwendungen arbeiten wir mit Flutter und Dart.\n• Mit der Zeit erwarten Dich immer anspruchsvollere Projekte, die weitaus mehr Fähigkeiten erfordern und Dein Know-how stetig erweitern.\n• Unsere Android- und iOS-Apps synchronisieren nahtlos mit unseren PC-Anwendungen. Es besteht daher die Möglichkeit, Deine Fähigkeiten auch in Richtung Web- und Desktop-Development zu erweitern.\n• In Forschungsprojekten und Entwicklungsprojekten setzen wir u.a. auf Augmented Reality (AR), Künstliche Intelligenz / Artificial Intelligence (KI / AI) und Machine Learning (ML).\n• Wir nutzen darüber hinaus Amazon Web Services (AWS), Microsoft Azure Cloud, Google Firebase und viele andere Dienste und Technologien, um unsere Services anzubieten.\n\nDAS ZEICHNET DICH AUS\n• Du bist passionierter Programmierer und möchtest praktische und ansehnliche Software mitgestalten.\n• Deine Fähigkeiten hast Du im professionellen Umfeld bereits unter Beweis gestellt und bist motiviert, diese kontinuierlich weiterzuentwickeln.\n• In Android oder in iOS oder in Flutter hast Du ausgeprägte Programmiererfahrung. Android hast Du mit Java und/oder Kotlin entwickelt. iOS mit Swift oder C# und Flutter mit Dart.\n• Sicherer Umgang mit NoSQL- oder SQL-Datenbanken ist erforderlich wie z.B. mit Couchbase, MongoDB, MySQL, SQLite etc.\n• Fließendes Deutsch oder Englisch ist für die Kommunikation sehr wichtig.\n• Weitere moderne Java, JavaScript, PHP oder Python Frameworks sind Dir bekannt wie z.B. Java Spring Boot, Vue.js, Angular, React, Laravel, Django etc.\n\nWir freuen uns sehr, Mobile Developer, Front-End Experten, Webentwickler, Back-End Entwickler, Informatiker, IT-Ingenieure, Fullstack Anwendungsentwickler, Game Programmer, und Absolventen von Computer Science (Scientist), Informatik, Medieninformatik, Elektrotechnik oder einfach hervorragende Programmierer mit entsprechenden Fähigkeiten in unserem erfolgreichen Team zu begrüßen.\n\nWARUM DU GERNE MIT UNS ARBEITEN WIRST\n• Deine Ideen und Deine Beiträge werden gebraucht und geschätzt. Jeder Entwickler trägt mit Stolz zu erkennbaren Teilen der Softwaresysteme bei.\n• Umfangreicher Gestaltungsfreiraum, schnelle Entscheidungen und professionelle Unterstützung unsererseits bringen Dich und uns schneller zum gemeinsamen Erfolg.\n• Bei uns erwartet Dich eine vielseitige und fordernde Tätigkeit. Gleichzeitig legen wir großen Wert auf die Work-Life-Balance und unterstützen Deine berufliche sowie persönliche Weiterentwicklung.\n• Ein weitgehend stressfreier Arbeitsplatz mit vielfältigen Möglichkeiten für Essen, Musik, Sport und Spiele - alles in einer angenehmen, klimatisierten Umgebung.\n\nKLINGT SPANNEND?\n\nDann schicke uns Deinen Lebenslauf an develop@cheqsite.de und wir melden uns bei Dir. Wir freuen uns darauf, Dich kennenzulernen!\n\nJob ad in English, please visit our site www.cheqsite.de/en/.\n\nCHEQSITE GmbH / Rudower Chaussee 29 / D-12489 Berlin\nTel. +49 030 23320232 / kontakt@cheqsite.de / www.cheqsite.de",
            "apply_options": [
                {
                    "title": "Stepstone",
                    "link": "https://www.stepstone.de/stellenangebote--Software-Entwickler-Android-iOS-Flutter-m-w-d-Java-Swift-Dart-Kotlin-Programmierer-Mobile-App-Developer-Engineer-Berlin-CHEQSITE-GmbH--11549404-inline.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "FRG Technology Consulting",
                    "link": "https://www.frgconsulting.com/job/a0MaA00000089yz.13/java-software-developer-m-w-d-berlin-hybrid?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Get In IT",
                    "link": "https://www.get-in-it.de/jobsuche/p207946?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=5eb964d808823d1b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Absolventa",
                    "link": "https://www.absolventa.de/stellenangebote/9435987-b-junior-java-entwickler-softwaretester-m-w-d-mit-perspektive?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/berlin-java-developer-fullstack-developer-127231327?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WIRED HIRED",
                    "link": "https://jobs.wired.co.uk/job/java-software-developer-mwd-berlin-hybrid-vdapeXakQS-at-frg-technology-consulting-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JOIN",
                    "link": "https://join.com/companies/volentum/13171313-junior-java-entwickler-softwaretester-m-w-d-mit-perspektive?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbnR3aWNrbGVyIEFuZHJvaWQgLyBpT1MgLyBGbHV0dGVyIChtL3cvZCkgSmF2YSBTd2lmdCBEYXJ0IEtvdGxpbiAtIFByb2dyYW1taWVyZXIgLSBNb2JpbGUgQXBwIERldmVsb3BlciAtIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQ0hFUVNJVEUgR21iSCIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoidm9nYnN3dVhtdnk1bmZ2YkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Senior iOS Developer - Spanish/English - Full Remote",
            "company_name": "Jobs4java.eu",
            "location": "Anywhere",
            "via": "Jobgether",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMQQrCMBBFcdsLCK5mLZiI6Ea3VUEXgj1AmZYhSUkzIZOWeh4vaty8z_uLV31X1bOh4DiBezVQ00yeIyXYQRMxOLH6GowvW57b5D28aeRMxR7cgRCm3gIHuDMbT5uLzTnKWWsRr4xkzK5XPY-aA3W86IE7-aMVi4mix0zt4bRfVAxmuy5JOQ44o6IJXIlSGjF8fisE7r-mAAAA&shmds=v1_AUFQtOMPOEklv0w7KWxlgTU3lSz1m-vXaZ94H3Lxwa1A05A-bg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=DYKdnTjoUx5yb209AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e2a4ae1194b6986a8904eca33c141be2d6427215fae9b9bd1e.gif",
            "extensions": [
                "Work from home",
                "Full-time"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Full-time"
            },
            "description": "This a Full Remote job, the offer is available from: Europe\n\nThis is a remote position.\n\nWe are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improve/learn.\n\nThis position is only open for employees, who would like to work remote. Candidates need to be willing to go to the office in Murcia for 5 days on a quarterly base.\n\nTasks and Responsibilities:\n\n​\n• Design and develop software solutions to client requirements;\n• Participate in identifying problem areas and defining solutions;\n• Able to articulate problems and solutions in non-technical language to stakeholders;\n• Understand interactions and dependencies between software components;\n• Support the product engineering lead(s) in project set up, execution and key ceremonies including backlog refinement, sprint planning, demos and retrospectives;\n• Support learning and development activities for junior product engineering resources;\n\nProfile:\n• College / university degree, Bacc. Ing. Comp (or similar);\n• +2 years of iOS mobile development experience (Swift, Objective-C, ...);\n• +5 years of software development experience;\n• Strong understanding of Apple’s design principles & interface guidelines;\n• Candidates need to have a good level of English and/or willing to improve/learn;\n\nOffered:\n• Attractive salary package (employees);\n• Career development training;\n• English classes;\n\nInterested: Please send your resume to\nresume@jobs4java.eu\n\nThis offer from \"Jobs4java.eu\" has been enriched by Jobgether.com and got a 77% flex score.",
            "apply_options": [
                {
                    "title": "Jobgether",
                    "link": "https://jobgether.com/offer/65ef62f6f235ccdf79169158-senior-ios-developer---spanish-english---full-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAtIFNwYW5pc2gvRW5nbGlzaCAtIEZ1bGwgUmVtb3RlIiwiY29tcGFueV9uYW1lIjoiSm9iczRqYXZhLmV1IiwiYWRkcmVzc19jaXR5IjoiR2VybWFueSIsImh0aWRvY2lkIjoiRFlLZG5Uam9VeDV5YjIwOUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "iOS Team Lead Developer Opportunity in Europe",
            "company_name": "Stanwood",
            "location": "Berlin, Germany",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=J62qWeO9qgkAoyvtAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNMQ6CQBBA0dhyBG2mNsoaExvtDIbEmFBgTwaYwJplZrM7KNzGoyrNL17zk-8qyWxRwpNwgAdhCxm9yYmnAIX3EnRkqzNYhtsY_gx7uEsNkTA0PQhDLtI5Wl96VR_PxsTo0i4qqm3SRgYjTLVM5iV1XFLFHgN5h0rV8XSYUs_ddlMq8kekXT5XCs7yDnIKA_L8A4wn5OWjAAAA&shmds=v1_AUFQtONKudnX0XN5eaa77PoMVk8MX8Lhx37kBoIocUQqcR87kg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=J62qWeO9qgkAoyvtAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e23a4c70b18e99efca5153cf73c05059cf316ccbc8a1ca8fb6.gif",
            "extensions": [
                "28 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "28 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are on the lookout for a seasoned iOS developer to join our agile team based in Europe. This role requires a strong sense of ownership and deep customer-focused thinking, with great attention to detail while keeping complexity at bay.\nKey Responsibilities\nRequirements\n• A minimum of 5 years of experience in mobile development using Swift and iOS.\n• Publishing at least 3 apps on the App Store is a must.\n• Familiarity with REST APIs and JSON is required.\n• Experience with Networking, concurrency, GCD, and GitHub is essential.\n• A strong understanding of unit tests, test automation, and UI testing is necessary.\n• Proven expertise in Swift design patterns such as MVC, MVP, VIPER, and MVVM.\n• Familiarity with Realm or a similar technology.\n• Fluent English skills, both written and spoken.\n• A proven track record of working in agile teams with android, backend, web development – including QA and client's stakeholders.\n• Required location: Europe\n\nNice to have\n• Multi-platform experience with react native or flutter.\n• Familiarity with Firebase, Crashlytics, AppStore Connect, Contentful, Jira, Bitrise, CD/CI, Fastlane, Slack, Zeplin, GitLab.\n• Sketch, Wireframes, Frameworks\nBenefits\n• A flexible 10-40 hour work week, depending on project workload and individual availability.\n• A 33% bonus paid to team members, based on seniority and tenure.\n• A 12-month contract extending year to year with an option to achieve a higher position.\n\nFreelance rate: 30-35€ /h (dependent on skills and experience).\n\nThe recruitment process consists of several stages, including a short intro call, homework assignment, technical review, and final interview with the managing director.",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://de.trabajo.org/stellenangebot-3058-96c312fd4f2bdea7619d8189397201a1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sign In - Otta",
                    "link": "https://app.otta.com/jobs/nAKqEHmk?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Meritocracy",
                    "link": "https://meritocracy.is/de/foodora-gmbh/team-lead-sales-eastern-germany-83652?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Welcome To The Jungle",
                    "link": "https://app.welcometothejungle.com/jobs/nAKqEHmk?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgVGVhbSBMZWFkIERldmVsb3BlciBPcHBvcnR1bml0eSBpbiBFdXJvcGUiLCJjb21wYW55X25hbWUiOiJTdGFud29vZCIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoiSjYycVdlTzlxZ2tBb3l2dEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Mobile Developer (Android & iOS, 2-5 Years Experience)",
            "company_name": "Webnotics Solutions",
            "location": "Germany",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=m5o4egjaJnAkR0oHAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMsQrCMBRFce0nOMibRMU2Uuiik6AIQnHoIE4lSR9tJM0LeVHqP_mRxuUO53Bu9p1ldU3KWIQTvtGSxwCro-sCmQ6WYG7NFsq8ggfKwHCekjfoNK4hhysp4MT1AOTgQtRbnB-GGD3vhWC2Rc9RRqMLTaMgh4om8STF_2l5kAG9lRHbstpNhXf9ZnFH5SgVDA3ZVzTkGEz6xjBK9_kB1Gsu468AAAA&shmds=v1_AUFQtOOp6J5Bk96j4uZLETP1fl0SYEUzDRc4_Gk5kihAQhlpUw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=m5o4egjaJnAkR0oHAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Job Information\n\nDate Opened\n\n12/02/2023\n\nJob Type\n\nFull time\n\nIndustry\n\nIT Services\n\nWork Experience\n\n4-5 years\n\nCity\n\nNoida\n\nState/Province\n\nUttar Pradesh\n\nCountry\n\nIndia\n\nZip/Postal Code\n\n201301\n\nAbout Us\n\nWhen it comes to developing web-based and mobile-based applications, we are formidable competition. Our valued clientele and we work together as a team. In this way, we can determine client demands and provide the best solution. Each project is overseen by a project manager and a team of professionals. Founded in 2004, Webnotics is an IT & Software business that provides end-to-end solutions for websites, online applications, and mobile apps.\n\nTo provide startups and small businesses with unique web & app solutions, Webnotics was founded. Webnotics was founded to serve exclusively high-end consumers. As of right now, Webnotics is comprised of individuals with a variety of expertise. A sustainable vision and set of values guide the company's operations, and our services are founded on three principles: love for what we do, commitment to excellence, and honesty.\n\nJob Description\n\nAbout Us:\n\nWebnotics is an innovative technology firm focused on mobile application development. We are dedicated to creating impactful digital solutions and fostering a culture of technological excellence and creative collaboration.\n\nJob Description:\n\nWe're on the hunt for a skilled Mobile Developer with 2-5 years of experience in both Android and iOS platforms. The ideal candidate will possess a solid understanding of mobile development and stay abreast of the latest industry trends and best practices.\n\nKey Responsibilities:\n• Develop and maintain advanced applications for both Android and iOS platforms.\n• Collaborate with cross-functional teams to conceptualize, build, test, and ship new features.\n• Integrate various data sources and backend services.\n• Ensure the performance, quality, and responsiveness of applications.\n• Identify, correct bottlenecks, and fix bugs.\n• Uphold code quality, organization, and automatization.\n\nRequirements\n• Bachelor’s/Master’s in Computer Science, Engineering, or a related field.\n• 2-5 years of proven software development experience, focusing on mobile app development.\n• Demonstrated experience in Android and iOS app development, with at least one original app published in both Google Play and the App Store.\n• Proficient in Android SDK, Swift, and/or Objective-C.\n• Understanding of RESTful APIs to connect applications to back-end services.\n• Knowledge of modern mobile design principles and interface guidelines.\n• Familiarity with cloud message APIs and push notifications.\n• Strong understanding of the full mobile development life cycle.\n• Ability to manage multiple projects and meet deadlines.\n\nNice to Have:\n• Experience with cross-platform mobile application development frameworks (e.g., Flutter, React Native).\n• Familiarity with continuous integration and deployment (CI/CD) practices.\n• Experience in developing IoT-based applications.\n\nBenefits\n• Competitive salary and benefits.\n• Professional growth and development opportunities in a dynamic sector.\n• Supportive, innovative, and collaborative work environment.",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=f6fe0444388cc398&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.de/job-listing/mobile-developer-android-and-ios-2-5-years-experience-webnotics-JV_KO0,53_KE54,63.htm?jl=1009010191873&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgRGV2ZWxvcGVyIChBbmRyb2lkIFx1MDAyNiBpT1MsIDItNSBZZWFycyBFeHBlcmllbmNlKSIsImNvbXBhbnlfbmFtZSI6IldlYm5vdGljcyBTb2x1dGlvbnMiLCJhZGRyZXNzX2NpdHkiOiJHZXJtYW55IiwiaHRpZG9jaWQiOiJtNW80ZWdqYUpuQWtSMG9IQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Android iOS Development (m/f/d) – Frankfurt",
            "company_name": "Log in to view company",
            "location": "Frankfurt, Germany",
            "via": "Gotthe/Job",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=X_t83J0cjDajGghOAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_z2NMQrCMBRAce0RnP6oUhsRXHQSigURHDxASdvfNJrmh-Rb6-YdPIlX8iS2i8sbHjxe9JlE6d5WnnQF-nyBFDs05Fq0DLNW1KKaw_f1hoOX9lbfPcMSjlRAQOnLBshCRqQMTncNswtbIUIwiQosWZdJSa0giwX14kpFGJGHRnp0RjLm682qT5xVi_hECrQFJug0PmDonLTPUf3HMWTo28H-AB41Hpm0AAAA&shmds=v1_AUFQtONM7uZFhR7FHGCjKmtwZuFkFQf5oZ0-ZtzfcAF2lmdO5w&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=X_t83J0cjDajGghOAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Are you excited about technological change in IT? Then shape the digital future together with us. Your know-how in modern IT is in demand for our versatile tasks.\n\nWe are open, uncomplicated and 100 percent fair. People are at the center of everything we do. Because: only together with you can we shape the future of digital transformation. Become part of the[gandapplynow![gundbewirbDichjetzt!\n\nFor a well-known customer we are looking for Mobile Development (Android and iOS) (m/f/d).\n\nReference number: 105475\n\nTasks\n• Perform effort estimation for implementation and all efforts required for technical commissioning of functions necessary in the requirements context.\n• The technical implementation / coding of the required functions based on the development tools, frameworks and libraries used by the client for the Android and iOS operating system.\n• The creation of JUnit/E2E tests to support test automation as required in the respective task reference.\n• The complete documentation of the technical components according to applicable standards of the client as well as in the project specific tools.\n• Consulting of the disciplines Business Engineering, User Experience Consulting, Test as well as Operation.\n• Fixing bugs from the test phases in the applications / components also in the code parts / functions / modules / libraries etc. implemented by other developers.\n• Prepare, perform and document component tests, module tests, module group test.\n• Participate and prepare load and performance tests.\n• Create and maintain system documentation necessary for maintenance and operation of developed components.\n• Create delivery packages for the relevant applications using the CI/CD tools and their rules applicable in the respective context.\n• Set up and maintain development environments.\n• Placing developed applications in the stores of the respective platforms (e.g. Google Play Story, Apple Store) according to applicable standards of the client.\n• Adherence to agreed standards (framework agreement, programming guidelines, process library, HoM manifest to ensure software quality).\n• Advising the client on the description of the DoR and DoD of the user stories.\n• Advising the teams involved in the implementation of the designed solution during the complete duration of the project.\n• Documentation of all results in the tools used in the respective project context and in the language required in the respective project context (German or English).\n\nRequirements\n\nMust-Requirements:\n• Experience in development projects i.V.m. the technology Angular 12+ and TypeScript and / or CSS.\n\nTarget Requirements:\n• Knowledge of methods in such as SCRUM, Extreme Programming, Test-Driven Development are important.\n• Experience in the use and handling of Gitlab and Docker.\n\nSpecial features\n\n==================================\n\nService delivery is exclusively remote.\n\n==================================\n\nFor more information about this offer, we are of course available at any time.\n\nIn order to guarantee a fast processing, we ask for the indication of the reference number.\n\nStart: 09 .2022\n\nDuration: 08 .2022",
            "apply_options": [
                {
                    "title": "Gotthe/Job",
                    "link": "https://gotthejob.co/job/android-ios-development-m-f-d-frankfurt?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBbmRyb2lkIGlPUyBEZXZlbG9wbWVudCAobS9mL2QpIOKAkyBGcmFua2Z1cnQiLCJjb21wYW55X25hbWUiOiJMb2cgaW4gdG8gdmlldyBjb21wYW55IiwiYWRkcmVzc19jaXR5IjoiRnJhbmtmdXJ0LCBHZXJtYW55IiwiaHRpZG9jaWQiOiJYX3Q4M0owY2pEYWpHZ2hPQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "(Senior) Developer (m/w/d) - iOS",
            "company_name": "CGI",
            "location": "Bielefeld, Germany",
            "via": "Cgi.njoyn.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=htwHtglPowh-KXSnAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEMQ6CMBQG4LhyA53eCEapMTEmuqkJ0cWBA5ACP1BT-pq-RvEY3lj9hi_5zJJ9WsIZDhld8IRlj0DpqF6qzWhN5l7-vnFNAh2agdhRwdxbLI5DjF4OSonYvJeoo2nyhkfFDjVP6sG1_Ktk0AHe6ohqu9tMuXf9cn4urmQcnQwsOth2RQXCqN37C00bqlaUAAAA&shmds=v1_AUFQtOMmXSOQOJrrcqW3jECUskoYGsmhHBPorepl0xwKGOPxpg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=htwHtglPowh-KXSnAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e2ffef60cef211f369582d8a6fc3b996160ff4b9bd00100d8f.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Du möchtest Apps entwickeln, die von Hunderttausenden genutzt werden? Du möchtest in einem agilen Team arbeiten und die neuesten Technologien verwenden? Dann ist es höchste Zeit, CGI kennenzulernen.\n\nKomm als iOS Developer (m/w/d) in unser Team am stark wachsenden Standort Bielefeld! Zu unserem Kundenstamm zählen nahezu alle großen Unternehmen der Branchen Telekommunikation, Banking, Health und Energy aus dem Großraum Ostwestfalen-Lippe. Das gibt dir die Möglichkeit, verschiedenste Unternehmen und Projekte kennenzulernen und in unterschiedlichen Teams und Konstellationen zu arbeiten. Du kannst dein Wissen und deine Fähigkeiten anwenden und vertiefen – und fortlaufend Neues lernen. Bring deine eigenen Ideen ein und gestalte deine Karriere!",
            "apply_options": [
                {
                    "title": "Cgi.njoyn.com",
                    "link": "https://cgi.njoyn.com/CORP/in/share/JobDetails.asp?clid=21001&jobid=J1222-2346&BRID&LANG=2&SBDID=1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBEZXZlbG9wZXIgKG0vdy9kKSAtIGlPUyIsImNvbXBhbnlfbmFtZSI6IkNHSSIsImFkZHJlc3NfY2l0eSI6IkJpZWxlZmVsZCwgR2VybWFueSIsImh0aWRvY2lkIjoiaHR3SHRnbFBvd2gtS1hTbkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Lead iOS Developer for Vehicle Companion Apps",
            "company_name": "5V Tech | Certified B Corp™",
            "location": "Germany",
            "via": "Trabajo.org - Stellenangebote, Arbeit",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Mdmzf4nlwSMYuOP1AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWNMQrCMBRAce0RnP4ogo0IXXTSFgQRHJSuJY2_TSTN_yRBKjh6Encv5UmMyxve8F72mWTVEeUVzOkMFd7REqOHjjzUqI2yCCUNLJ0hB1vmAAs4UAsBpVcaktwT9RanGx0jh7UQIdi8D1FGo3JFgyCHLY3iRm34owlaemQrIzarYjnm7Pr5rKjhgqn3hBJ9NJ3BK-zS2fP39QaTLugH6R4_qdp6ObAAAAA&shmds=v1_AUFQtOPFmoj3pFi_ZgbjjQ83h6pJkRbsVWvxXiM-vENuI_w8kA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Mdmzf4nlwSMYuOP1AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056b413b30b1db04d6c9/images/5220cb8214f919e2727f3c013190dccc9744050d683b911991a25cb4a253fa78.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are seeking an experienced Senior iOS Developer to join our team and contribute to the development of innovative vehicle companion apps.\n\nBased in Munich, Germany or remotely within Germany, this full-time position offers a competitive salary up to €100,000 per year, plus bonus and benefits.\n\nThis is an exciting opportunity to work with a leading producer of automotive mobile technology, developing state-of-the-art vehicle companion apps for premium car brands like Audi, Porsche, Lamborghini, and Bentley.\n\nYou will play a vital role in designing, developing, and optimizing mobile applications using the latest technologies such as Bluetooth and augmented reality. Our team works closely with UX/UI designers and developers to deliver high-quality projects.\n\nWith a range of project teams and disciplines to specialize in, you will have ample opportunities for career growth, learning, and developing your expertise.\n\nTo succeed in this role, you should have:\n• Strong experience working on iOS mobile software development;\n• Experience with Swift and SwiftUI;\n• A minimum of German B1 language certification;\n• Bonus: Experience working on automotive systems or connectivity technologies...\n\nOur company, 5V Tech | Certified B Corp™, recognizes talent solutions experts within IoT and Deep Tech. If you meet these requirements, we encourage you to apply today.",
            "apply_options": [
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://de.trabajo.org/stellenangebot-3058-c9d4af820a304009842f573949723c19?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIGlPUyBEZXZlbG9wZXIgZm9yIFZlaGljbGUgQ29tcGFuaW9uIEFwcHMiLCJjb21wYW55X25hbWUiOiI1ViBUZWNoIHwgQ2VydGlmaWVkIEIgQ29ycOKEoiIsImFkZHJlc3NfY2l0eSI6Ikdlcm1hbnkiLCJodGlkb2NpZCI6Ik1kbXpmNG5sd1NNWXVPUDFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUWE0xVm1GU1V6QjBjR1Z6U1dST00wbHVhVTFmY2xKSlRFbzJPRlp2UkhOSExVVlRjbGxwVFZsVlNWOUplRXBoWjBsT04xTlBjazV5UVdaSlIybHJOMjE2WnpWNE5tZHBhVEpxZEZORlZIcEZYMDR5VXprM09YcGZTbU13WnpFdFkwUXpXWEJJVDFaSmJEQkRVVlJoZDNST2RERlpNRk55Tm5aaGFuZGthSEkzVVd0MVp6RnNWbXBuVWtwb2FGRXpSMnRaYkhKb1dDMUxVVWQ0Y1RaUVN6WkhVMWd5Vm5aRU1rZDJibTFSUVVoM1FWZHJYeTFJVUY5R1dVUjVWelEzWlZkeFQydGpkbFZVUTJka1pEWTFhR1pqYkdZeVVtSlZkRjkwVTBGWUxWOU1SbVJLTVhKbWJscGZSRkYxUm1sME5uTk9Wa2d5ZEVGaFgyOVZSelpxVFV3NGJsTjVReElYWWtGWFJscGZNa0ZOY0hGaGQySnJVRzVpZW5oelFWVWFJa0ZHV0hKRlkzQjNkM2h4ZDBSd2NHWldRVWs1V20xQ05uUnBaRVJXU2poVU9IYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Germany&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUWE0xVm1GU1V6QjBjR1Z6U1dST00wbHVhVTFmY2xKSlRFbzJPRlp2UkhOSExVVlRjbGxwVFZsVlNWOUplRXBoWjBsT04xTlBjazV5UVdaSlIybHJOMjE2WnpWNE5tZHBhVEpxZEZORlZIcEZYMDR5VXprM09YcGZTbU13WnpFdFkwUXpXWEJJVDFaSmJEQkRVVlJoZDNST2RERlpNRk55Tm5aaGFuZGthSEkzVVd0MVp6RnNWbXBuVWtwb2FGRXpSMnRaYkhKb1dDMUxVVWQ0Y1RaUVN6WkhVMWd5Vm5aRU1rZDJibTFSUVVoM1FWZHJYeTFJVUY5R1dVUjVWelEzWlZkeFQydGpkbFZVUTJka1pEWTFhR1pqYkdZeVVtSlZkRjkwVTBGWUxWOU1SbVJLTVhKbWJscGZSRkYxUm1sME5uTk9Wa2d5ZEVGaFgyOVZSelpxVFV3NGJsTjVReElYWWtGWFJscGZNa0ZOY0hGaGQySnJVRzVpZW5oelFWVWFJa0ZHV0hKRlkzQjNkM2h4ZDBSd2NHWldRVWs1V20xQ05uUnBaRVJXU2poVU9IYyIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}