{
    "search_metadata": {
        "id": "6785056a599d68ec7a19a5ac",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/586ac318095b8c9d/6785056a599d68ec7a19a5ac.json",
        "created_at": "2025-01-13 12:22:02 UTC",
        "processed_at": "2025-01-13 12:22:02 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIHR2VybWFueQ&udm=8&fc=EswCCowCQUpHOUprTTdwXzR2Q2lKYnNOSGtEbnNyRFJEWVZsbUxaQ1VuaXl3SW54UmZ2d1lHZDJIME5nZ1V0c3JQQnQ0Z3ZLX2daMHFxR1pvN24xVHNzalNaNU9fOHU3a1FBSU5RU0x4WXdyYkdwVVJiT0ZTT2F3YTY3TEZRb0w2RHNtWVd1UGZ6NU9NaGZlcjk3b0JTa1pJWEJkcU9EdU4zamtBMVdiWDZCSVBoREdyWmxDQlNySkRuQ3NkcUE2MWdSbDJBdGFvVFJlMXIycm9MdTRaVGhmdlo1ckEtY20za2JrUzVyTVVPUUFYZ1d1S0EwMWpKaURUMG1OMEhrdnBVd00zcFNuTGZTYUN2bncwURIXYVFXRlotZVpMb1BIMFBFUHFxekM0QTAaIkFGWHJFY3JXUmZPRVhKNmwxWGRDb0lZQ0gwanMxNURwdnc&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/586ac318095b8c9d/6785056a599d68ec7a19a5ac.html",
        "prettify_html_file": "https://serpapi.com/searches/586ac318095b8c9d/6785056a599d68ec7a19a5ac.prettify",
        "total_time_taken": 0.34
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Germany",
        "location_used": "Germany",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUVGR3WHpSMlEybEtZbk5PU0d0RWJuTnlSRkpFV1Zac2JVeGFRMVZ1YVhsM1NXNTRVbVoyZDFsSFpESklNRTVuWjFWMGMzSlFRblEwWjNaTFgyZGFNSEZ4UjFwdk4yNHhWSE56YWxOYU5VOWZPSFUzYTFGQlNVNVJVMHg0V1hkeVlrZHdWVkppVDBaVFQyRjNZVFkzVEVaUmIwdzJSSE50V1ZkMVVHWjZOVTlOYUdabGNqazNiMEpUYTFwSldFSmtjVTlFZFU0emFtdEJNVmRpV0RaQ1NWQm9SRWR5V214RFFsTnlTa1J1UTNOa2NVRTJNV2RTYkRKQmRHRnZWRkpsTVhJeWNtOU1kVFJhVkdobWRsbzFja0V0WTIwemEySnJVelZ5VFZWUFVVRllaMWQxUzBFd01XcEthVVJVTUcxT01FaHJkbkJWZDAwemNGTnVUR1pUWVVOMmJuY3dVUklYWVZGWFJsb3RaVnBNYjFCSU1GQkZVSEZ4ZWtNMFFUQWFJa0ZHV0hKRlkzSlhVbVpQUlZoS05td3hXR1JEYjBsWlEwZ3dhbk14TlVSd2RuYyIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "iOS Developer (m/w/d)",
            "company_name": "Neofonie Mobile GmbH",
            "location": "Berlin, Germany",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=6XS-8vW06Eo0CbAJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXESwrCMBAAUNz2CK5m54eaiOBGdyJUBHXhAUpSp2kkmQmZoPUeHlh8i1d9J1Xtb3c44gsDJ8wwj_qtHwtYwZktCJrcDcAEDbMLON0PpSTZaS0SlJNiiu9Ux1EzoeVRP9nKv1YGkzEFU7DdbNejSuSWsytyz-QRLmx9QGiiPYEnOGAOnmpoMEdDnx_EycU4lwAAAA&shmds=v1_AUFQtOMWVg8rK_-W_tfQxcNHcvPMlK9R7AQv68nSry1GKTKMpg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=6XS-8vW06Eo0CbAJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056a599d68ec7a19a5ac/images/1cae31a53bc9d3f4d7ab0d186270bc27145462b3fc1aa939ff5d79fc84a5d499.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Deine Aufgaben\n• Als Neofonie iOS Entwickler arbeitest Du im Team mit einigen den besten Fachleuten aus den Bereichen Mobile Development, Projektmanagement, Testen zusammen\n• In einem agilen, crossfunktionalen Team entwirfst und gestaltest du innovative Applikationen für iPhone, iPad und Apple Watch\n• Im Rahmen von Kundenprojekten bist du durchgängig an Analyse, Konzeption, Modellierung und Implementierung beteiligt\n• Du hast du einen direkten Impact, herausragende Ergebnisse für unsere Kunden zu erzielen\n\nDein Profil\n• Mind. 8 Jahre Berufserfahrung in der mobilen Entwicklung im iOS Umfeld mit Objective-C/Swift\n• Hochschulstudium der Informatik oder vergleichbare Studienrichtung\n• Erfahrung in Test Driven Development, Unit Tests, CI und CD\n• Gutes Know-How von aktueller Webtechnologien, Frameworks, Tools und spezifischen Designmuster in der iOS-Entwicklung\n• Umfangreiche praktische Erfahrungen mit Issue Tracking Systemen wie JIRA\n• Referenzanwendungen in iTunes und App Store sind von Vorteil\n• Leidenschaft für neue Technologien; Begeisterung für komplexe Probleme\n• Sehr gute Deutsch- und Englischkenntnisse\n\nUnser Angebot\n• Gestaltungsspielräume in vielseitigen und spannenden IT-Projekten für namhafte Kunden\n• Anspruchsvolle Festanstellung mit vielseitigen Entwicklungsperspektiven\n• Moderne IT-Infrastruktur und breites Spektrum an Technologien\n• Flache Hierarchien und offene Kommunikation\n• Gesunde Work-Life-Balance durch flexible Arbeitszeiten\n• Sehr gutes Arbeitsklima mit kompetenten und sympathischen Kollegen\n• Zentrale Lage inmitten der Digitalmetropole Berlin\n• Add-Ons: Mitgliedschaft Urban Sports Club, Dachterrasse, Kicker, Vergünstigungen, kostenfreie Getränke (Kaffee, Tee, Wasser, Softdrinks), Sport-, Team- und Firmenevents, etc.\n\nWir freuen uns auf Dich!\n\nNeofonie Mobile zählt zu den führenden Agenturen für App Entwicklung mit Sitz in Berlin und ist auf die Programmierung von plattform- und channelübergreifenden Lösungen für mobile Endgeräte spezialisiert. Seit 2017 ist Neofonie Mobile als offizielle Google Developers Agency zertifiziert und wurden erst kürzlich mit dem European Digital Media Award ausgezeichnet.\nMit einem kununu Score von 4,4 von 5 Sternen gehört Neofonie Mobile zu einem der beliebtesten Arbeitgebern. Willst Du auch Teil der Neofonie Gruppe werden? Dann bewirb Dich!\n\nLebe Deinen Job mit uns!\n\nDein Team kannst Du im Gegensatz zu vielen anderen Dingen im Leben frei wählen. Wir sagen Dir, warum es eine gute Idee ist, für Neofonie Mobile zu arbeiten.\n\nFlexibel und Familienorientiert\n\nBei uns kannst Du Dir die Arbeitszeit flexibel einteilen – ganz nach Deiner derzeitigen Lebensplanung. Gestalte Deinen Arbeitstag nach Deinen individuellen Anforderungen. Lebe Deinen Job mit uns.\n\nKarriereziele und Zukunft\n\nZukunft heißt auch für uns Weiterbildung. Darum ermöglichen wir Dir, viele individuelle Bildungsoptionen zu nutzen. Wir unterstützen Dich, Deine Karriereziele zu erreichen.\n\nEin starkes Team\n\nWir sind ein Team und als solches unterstützen wir einander. Wir lieben den Austausch mit unseren Kollegen und Kolleginnen. Klar, ein Feierabendgetränk auf unserer Terrasse ist auch immer drin.\n\nMarkup iOS Job dt.\n\nWeitere Jobs\n\nPrevious\n\nJunior Sales Manager (m/w/d)\n\nAndroid Developer (m/w/d)\n\nTechnischer Projekt Manager Mobile (m/w/d)\n\nSales Manager (m/w/d)\n\nJunior Sales Manager (m/w/d)\n\nAndroid Developer (m/w/d)\n\nTechnischer Projekt Manager Mobile (m/w/d)\n\nSales Manager (m/w/d)\n\nJunior Sales Manager (m/w/d)\n\nAndroid Developer (m/w/d)\n\nTechnischer Projekt Manager Mobile (m/w/d)\n\nNext\n\n1\n\n2\n\n3\n\n4",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=2e75c1e7f2dd2ef1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://de.trabajo.org/stellenangebot-856-44a0d9a701732cb4432d9a7a3154e384?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Olsen & Breuner - TalentsConnect",
                    "link": "https://olsen-breuner.job-shop.com/demo/offer/ios-developer-m-w-d/a625777e-28dc-597c-ba65-bc139b0ea2b5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Cool Jobs Clever Companies",
                    "link": "https://job.coolever.life/job/lightspeed-hq-ios-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Arbeiten-In-Berlin.net",
                    "link": "https://arbeiten-in-berlin.net/job/senior-ios-developer-d-w-m-berlin/8534f05dda64df8ed175236d69eb1797?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/ios-developer-jobs/20F3A8ADBCB1B1C3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChtL3cvZCkiLCJjb21wYW55X25hbWUiOiJOZW9mb25pZSBNb2JpbGUgR21iSCIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoiNlhTLTh2VzA2RW8wQ2JBSkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "iOS Developer EDEKA App (m/w/d)",
            "company_name": "EDEKA IT Stiftung & Co. OHG",
            "location": "Gaimersheim, Germany",
            "via": "XING",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=JkMqVOKrk-f3DFAwAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXNuw7CIBQA0Lj2E5zuZNQoGI0OOjW2qY_Boe4NrVfAFC4B1PpLfqUal7Oe5N1LVvpUQoYPbMmhhzzLjymkzsHQ8Ce_jGAKB6ohoPCNArJQEMkW-xsVowtrzkNomQxRRN2whgwnizV1_EZ1-FEFJTy6VkSs5stZx5yV48W_2Z-hjPoa71bCALbE4LQrQH8PoQ36oFCbCRTojbCvDxa9svCtAAAA&shmds=v1_AUFQtON-647vZ11KJPD-7wz8TRxPKqeS4yNnncw1JZD0XY5FSw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=JkMqVOKrk-f3DFAwAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056a599d68ec7a19a5ac/images/1cae31a53bc9d3f4fedf1536279341c4acd0e8d0d748bb84f4ec42510d7a50de.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Wir bei der EDEKA IT sind das Herzstück des digitalen Wandels im EDEKA-Verbund. Als leistungsstarkes Team entwickeln wir IT-Strategien, -Infrastrukturen und -Dienstleistungen für alle Handelsbereiche des EDEKA-Verbunds in ganz Deutschland. Wir bündeln unsere Kompetenzen, um innovative Lösungen zu entwickeln und umzusetzen. So treiben wir den Handel von morgen voran - vielleicht schon bald gemeinsam mit dir?\n\nIn deiner Rolle als iOS Developer EDEKA App (m/w/d) kannst du bei uns deinen ganz persönlichen Beitrag zu unseren Zielen leisten. Mögliche Einsatzorte sind: Berlin, Gaimersheim, Hamburg, Melsungen, Minden, Moers, Neumünster, Offenburg, Cluj-Napoca, Mannheim.\n\nDeine Aufgaben\n• Im regelmäßigen Austausch mit dem Product Management und dem Android-Team gestaltest du innovative Features für unsere iOS-App und setzt diese um.\n• Mit einer \"Getting things done\" Grundhaltung arbeitest du \"end to end\" und engagierst dich in allen Phasen des Entwicklungsprozesses von der Anforderungsanalyse über Code Reviews, Unit / UI-Tests bis zum Deployment bzw. Release Management.\n• Im Rahmen kontinuierlicher Qualitätssicherung sorgst du für die Optimierung, Skalierung und Weiterentwicklung unseres Codes.\n\nDein Profil\n• Du hast eine Ausbildung oder ein Studium mit IT-Bezug erfolgreich abgeschlossene oder besitzt eine vergleichbare Qualifikation.\n• Du verfügst über fundierte Praxiserfahrung in der nativen App-Entwicklung für iOS mit Swift, SwiftUI, Combine und RxSwift.\n• Du hast Freude an der Entwicklung einfacher, eleganter Apps, die nutzerfreundlich sind und Spaß machen.\n• Du wagst Experimente und begegnest komplexen Herausforderungen gerne mit kreative Lösungsansätzen.\n• Du besitzt gute Deutsch- und Englischkenntnisse in Wort und Schrift (CEFR-Level B2 oder höher).\n\nUnser Angebot\n• Work-Life-Balance: Profitiere von 30 Tagen Urlaub und der Möglichkeit zum mobilen Arbeiten.\n• Einfluss: Du gestaltest die IT eines der führenden Lebensmitteleinzelhändlers in Deutschland.\n• Finanzieller Anreiz & weitere Angebote: Freue dich über ein 13. Monatsgehalt und zahlreiche Benefits & Mitarbeitendenangebote runden unsere Wertschätzung für dich ab.\n• Gesamtheitliche Entwicklung (fachlich & persönlich): Dich erwarten bei uns verschiedene Weiterbildungsangebote wie z. B. digitale Lernplattformen und die Option an Fachkonferenzen teilzunehmen.\n• Betriebliches Gesundheitsmanagement: Unser Gesundheitsmanagement kümmert sich um deine Gesundheit am Arbeitsplatz.\n• Kultur & Zusammenarbeit: Wir ermöglichen dir einen optimalen Start in unserem Unternehmen und legen viel Wert auf ein gutes Onboarding, damit du direkt durchstarten und durch unsere verschiedenen Communities und Netzwerke von Anfang an mitgestalten kannst.",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/gaimersheim-ios-developer-edeka-app-124885671?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Schwaben.jobs",
                    "link": "https://www.schwaben.jobs/job/ios-developer-edeka-app-m-w-d-12366714?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/ios-developer-edeka-app-m-w-d-at-edeka-it-4092845437?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.de",
                    "link": "https://www.monster.de/stellenangebot/ios-developer-edeka-app-m-w-d-gaimersheim-bayern--ea5d0a90-d553-4c53-ab3a-0f5e054a4399?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobilize",
                    "link": "https://www.jobilize.com/job/de-gaimersheim-ios-developer-edeka-app-m-w-d-zentrale-ag-co-kg-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIEVERUtBIEFwcCAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiRURFS0EgSVQgU3RpZnR1bmcgXHUwMDI2IENvLiBPSEciLCJhZGRyZXNzX2NpdHkiOiJHYWltZXJzaGVpbSwgR2VybWFueSIsImh0aWRvY2lkIjoiSmtNcVZPS3JrLWYzREZBd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Senior iOS Developer (m/w/d)",
            "company_name": "Sopra Steria Custom Software Solutions",
            "location": "Munich, Germany",
            "via": "Get In IT",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=hVnDoMU03t2XgMi0AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKsQrCMBCAYVz7CE43qmgjioM6KhQEccgDlLSeTSTJhdxV60P5jtbl5xv-4jspthqjowzupuGML_SUMMMsqLe6z2EFF2qA0eTWAkWoiDqP06MVSXxQitmXHYsR15YtBUURGxrUkxr-p2ZrMiZvBOvNbj2UKXaLvaaUDWjB7AycehYKoOkh7_Ed4XtxFBlchGsfXWuXUGEOJn5-um-WWLAAAAA&shmds=v1_AUFQtOMvrNw95WvAwwmeaGILXj3LBekY8S_jk6syiKpANu4Nag&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=hVnDoMU03t2XgMi0AAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Unternehmensbeschreibung Wir sind die Custom Software Solutions - eine Gemeinschaft von Tech-Enthusiast*innen, die darauf spezialisiert sind, maßgeschneiderte Softwarelösungen zu entwickeln. Seit 2018 sind wir Teil des #OneTeams der Sopra Steria und bilden eine starke Symbiose aus Erfahrung und technischer Exzellenz. Wir sind wegweisender Partner, um Unternehmen und Organisationen zukunfts-als auch wettbewerbsfähiger zu machen. Dabei bieten wir, gemeinsam mit dir, unseren Kunden ein breites Leistungsangebot rund um Modernisierung, agile Transformation und Smart Collaboration. In enger Zusammenarbeit mit der Sopra Steria Group erweiterst du ständig deinen Horizont und hast die Chance, deine Expertise unter Beweis zu stellen und zu wachsen. Wenn du mit einem \"Get-IT-Done\"-Mindset deine Fähigkeiten in einem dynamischen Umfeld einsetzen und gemeinsam mit einem erstklassigen Team die Zukunft der Technologie gestalten willst, lass uns gemeinsam durchstarten! Stellenbeschreibung In unserem Mobile-Team arbeitest du an der Erstellung, Weiterentwicklung und Wartung der Software-Produkte unserer Kunden Du entwickelst testbare, modularisierte Komponenten, die als Packages in mehreren Apps eingesetzt werden Mit deinem Gespür für gutes Design setzt du User-Interfaces für iPhone, iPad und Apple Watch problemlos um Bleibe jederzeit auf dem Laufenden was neue Technologien und Trends angeht und geb dein Wissen an dein Team weiter Dein Erfahrungshorizont reicht über die Welt der Mobile Entwicklung hinaus und du unterstützt z.B. auch gerne in der Backend Entwicklung Beratung heißt Flexibilität: Dein Projekteinsatz richtet sich nach unseren Kunden und deiner Projektsituation und beinhaltet sowohl hybrides Arbeiten als auch den Einsatz vor Ort Qualifikationen Ein abgeschlossenes Studium der (Wirtschafts-) Informatik, -Mathematik oder Wirtschaftswissenschaften Mehrjährige Erfahrung in der Entwicklung mit Swift und SwiftUI, du kennst aber auch noch UIKit Der Umgang mit Dependency Managern wie SPM oder Cocoa Pods sowie CI/CD ist dir vertraut Außerdem hast du Praxis in der Entwicklung mit Backend Technologien wie Java, SpringBoot oder Web Technologien wie Angular, React Du hast Projekte als Software Entwickler*in begleitet und den Einsatz Agiler Methodiken schätzen gelernt Ein fundiertes Verständnis von Design Patterns und Architekturen Gute Deutschkenntnisse (ab B2 Niveau) sowie Englischkenntnisse runden dein Profil ab Zusätzliche Informationen Steuerfreier Sachbezug: pro Monat stehen dir zusätzlich zum Gehalt 50 Euro zur Verfügung, die du für eine Urban Sports Club Mitgliedschaft, SpenditCard (Prepaid-Visa-Karte) oder als Kinderbetreuungszuschuss nutzen kannst Weiterbildung: umfangreiche fachliche und methodische Trainings inkl. Zertifizierungen sowie vielfältige Entwicklungsperspektiven innerhalb des Unternehmens, monatlicher Research Day und ein großzügiges Schulungsbudget von bis zu 10 Tagen im Jahr Work-Life-Balance: Arbeitszeitkonto, hybrides und ortsflexibles Arbeiten innerhalb von Deutschland und bis zu 21 Tage pro Jahr in definierten EU-Ländern Flexible Urlaubsgestaltung: 30 Tage Urlaub und die Möglichkeit zur individuellen Erhöhung oder Verringerung des jährlichen Urlaubs um bis zu 5 Tage Wir sorgen für dich: Unterstützung bei der Altersvorsorge (bAV), Arbeitgeberfinanzierte Risiko-Lebensversicherung, Kooperation mit den Helioskliniken und Familienservice Mobility: Jobradl Fahrradleasingprogramm inkl. 25 Euro Bezuschussung im Monat sowie Bezuschussung des Deutschlandtickets als Jobticket mit 14,70 Euro im Monat Sopra Steria setzt sich für eine nachhaltige Zukunft ein: Ob mit konzernweiten Stipendien- und Corporate Volunteering-Programmen oder mit Projekten zur Förderung von Bildung, Chancengleichheit und digitale Inklusion – wir übernehmen Verantwortung für die Gesellschaft. Zudem leisten wir mit ambitionierten und von der Science Based Targets Initiative (SBTi) validierten Klimazielen einen Beitrag im Kampf gegen die Klimakrise. Wir glauben fest daran, dass digitale Innovationen ein Schlüssel zu Gleichberechtigung, Inklusion und Klimaschutz sind. Als Teil des Teams kannst du zu diesen Veränderungen beitragen, indem du mit uns und unseren Partnern Lösungen entwickelst, die langfristig einen positiven Impact schaffen.",
            "apply_options": [
                {
                    "title": "Get In IT",
                    "link": "https://www.get-in-it.de/jobsuche/p271879?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiU29wcmEgU3RlcmlhIEN1c3RvbSBTb2Z0d2FyZSBTb2x1dGlvbnMiLCJhZGRyZXNzX2NpdHkiOiJNdW5pY2gsIEdlcm1hbnkiLCJodGlkb2NpZCI6ImhWbkRvTVUwM3QyWGdNaTBBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "iOS Developer (m/w/d)",
            "company_name": "the peak lab GmbH & Co. KG",
            "location": "Oldenburg, Germany",
            "via": "Jobs At The Peak Lab. Gmbh & Co. KG - Personio",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=PLG5-Xm00uReMHZsAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEMQrCMBQGYFx7BKd_EpWaFMFFR4WKDh08QEnaR1NN8kIStR7Gu4rf8BXfWVGOzQ0nepHlQBFLJ9-yX2GDC2skUrEzYI-aebA0P5icQ9pLmZIVQ8oqj53o2En2pHmSd9bpX5uMihSsytRud9Ukgh_WVTaEQOoBqzRqp89Y4MgC1xqjR2N78voZhxI1Raf85weVezqCoAAAAA&shmds=v1_AUFQtOOGrcpN6Q7wny1H-VKR0F21zrBNeD4vANcr1wEingdZNg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=PLG5-Xm00uReMHZsAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Kein passender Job dabei?\n\nWas wir von dir erwarten\n• Du hast sehr gute Kenntnisse in der Programmierung von Swift unter den beiden UI-Frameworks UIKit und SwiftUI\n• Du kennst das Apple Ökosystem in- und auswendig und hast ein sehr gutes Verständnis vom Aufbau und der Anwendung der Apple SDKs\n• Du beherrscht Frameworks von Drittanbietern wie Realm, Alamofire und Lottie wie im Schlaf\n• Du hast Erfahrung mit Versionsverwaltungssystemen; idealerweise mit Git\n• Du hast ein hohes Qualitätsbewusstsein, arbeitest sehr genau in Bezug auf\nPixel und hast ein Gespür für Design, Farben und Proportionen\n• Du setzt Entwicklungsprojekte nicht nur stumpf um, sondern denkst mit und hinterfragst bei Bedarf den Sinn eventuell unschlüssiger Konzeptvorgaben, um für den User das beste Ergebnis zu realisieren\n• Du bist ein Teamspieler, kannst Projekte aber auch selbstständig umsetzen.\n• Du weißt mit Begriffen wie agiles Projektmanagement umzugehen, arbeitest motiviert, strukturiert und zielorientiert\n\nWas du bei uns tun sollst\n• Du unterstützt bei Konzeption, Implementierung und Entwicklung von nativen iOS- und iPadOS-Apps\n• Du betreust die Weiterentwicklung und Optimierung bestehender iOS-Projekte\n\nWer wir sind\n\nthe peak lab bringt Ideen in die digitale Welt. Aus komplexen Anforderungen machen wir klare, einfache Lösungen, die funktionieren. Der Mensch steht bei unseren Ideen und Produkten immer im Mittelpunkt. Wir schaffen Mehrwerte und begeistern. Wir setzen auf modernste Technologien und skalierbare Infrastruktur, um nachhaltige und zukunftssichere Produkte zu entwickeln. Unsere Arbeit basiert auf fünf Schwerpunkten: Strategie & Beratung, UX & Design, Technologie & Entwicklung, Forschung sowie Datenwissenschaften.\n\nWorauf wir Wert legen\n\nTeamgeist, respektvolles Miteinander, ständigen internen Austausch und eine kreative Arbeitsatmosphäre. Flache Organisationsstruktur, eigene Gestaltungsideen, Weiterbildung und Mitbestimmung sind elementar für uns. Wir glauben an den Erfolg durch Iteration, Kollaboration, Kommunikation, Transparenz und Nachhaltigkeit. Dies gilt nicht nur für unsere Teams, sondern auch in Zusammenarbeit mit unseren Kunden.\n\nWas wir dir bieten\n\nSeit 2020 ist Remote Working bei uns der Standard. Das heißt nicht, dass wir keinen festen Treffpunkt mehr haben. Viel mehr bedeutet es, dass wir unsere Prozesse auf die Arbeit aus der Ferne ausrichten. Du kannst also selbst entscheiden, von wo du arbeiten möchtest. Buxtehude, Berlin oder Bayern – Hauptsache, du passt ins Team.\n\nDu hast Bock auf Büro? Dann nutz unsere flexiblen Arbeitsplätze im Oldenburger CORE.\n\nAls moderner Co-Working-Space hat CORE alles, was du zum Arbeiten brauchst: schnieke Meeting- und Seminarräume, gemütliche Ruhezonen, Sitzecken zum Schnacken, einen Communitytable zum Mittagessen und eine Kaffeeküche. Der Clou: Im Erdgeschoss findest du eine Markthalle, in der es tolle Foodstände und den besten Kaffee der Stadt gibt.\n\nWeitere Benefits findest du unter Jobs auf unserer Website.\n\nWir hätten dich gern in Festanstellung unter Vertrag und bieten eine faire Bezahlung.\n\nWerde Teil unseres Teams\n\nInteressiert an einem Schreibtisch in der Oldenburger Innenstadt oder einfach remote von zuhause? Dann freuen wir uns auf deine Bewerbung!",
            "apply_options": [
                {
                    "title": "Jobs At The Peak Lab. Gmbh & Co. KG - Personio",
                    "link": "https://thepeaklab.jobs.personio.de/job/604597?language=de&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChtL3cvZCkiLCJjb21wYW55X25hbWUiOiJ0aGUgcGVhayBsYWIgR21iSCBcdTAwMjYgQ28uIEtHIiwiYWRkcmVzc19jaXR5IjoiT2xkZW5idXJnLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJQTEc1LVhtMDB1UmVNSFpzQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "iOS Developer (Junior/Mid-level) - Automotive",
            "company_name": "Pixida GmbH",
            "location": "Ingolstadt, Germany",
            "via": "Jooble",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=ZzzMp8SCuWORBvDZAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMQQrCMBAA8doneFo8qdhGBC96EgrVgij4gJK0S7qSZEOSSn2R37S9DMwcJvstspIeLyjxg4Y9BljXgyMO4k5dbua6gRwuQ2LLiT44Sc0KIsrQ9sAOKmZtcHnuU_LxJESMptAxyURt0bIV7FDxKN6s4owm9jKgNzJhczjux8I7vV09aaROQmXVFcjBzWk206NLO6gwWOm-fxyo1HuqAAAA&shmds=v1_AUFQtOPyYlIfvxar0-Hm9qFok-TuzxlMvKP4AeRircsJhLaRaQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ZzzMp8SCuWORBvDZAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Position\n\niOS Developer (Junior/Mid-level) – Automotive\n\nMunich; Ingolstadt; Porto\nProfessional\n\nWe are looking for experienced and highly ambitious software developers who are motivated to develop high-end mobile applications in the field of automotive industry. Together with our customers it is our goal to shape and offer the best possible user experience for upcoming customer applications. Join our journey and become a part of our team!\n\nRESPONSIBILITIES\n\nYou will\n> enjoy writing high-performing and easy to maintain code in Swift\n> develop new iOS applications using cutting-edge technology (MVVM)\n> understand how important code testing is\n> like to work in an interdisciplinary team in an agile environment delivering solutions to leading car manufacturers\n\nREQUIREMENTS\n\n> University degree in Computer Science or in one comparable study or professional experience\n> 1+ years of professional experience with iOS (Swift/SwiftUI/Objective-C) using MVVM\n> Experience with GIT, Automated Testing and Fastlane\n> Like to work in a dynamic and multicultural team\n> Proficient in English, spoken and written\nNice to have:\n> German language skills\n> Knowledge of C++ or any other computer language\n> Experience with Reactive Extensions, AWS services and Bluetooth\n\nBENEFITS\n\n> A highly innovative, agile and unique team with a great working culture and an employer that appreciates news initiatives and ideas\n> kununu.de can give you an impression of our working culture! (\n\nPixida is proud to be an Equal Opportunity Employer! We are committed to a work environment that supports, inspires and respects all individuals and in which all aspects of employment are applied without discrimination. Therefore we encourage all individuals to apply!\n\nIn order to be able to get a comprehensive overview of your application, we ask you to make sure to include certificates, employer's references, etc. with your resume. In addition, we ask you to provide information about your possible start date, salary expectations and language skills.\n\nReady to take your career\nto the next level?\n\nTiago Faro\nE-Mail auf connecticum.de ansehen",
            "apply_options": [
                {
                    "title": "Jooble",
                    "link": "https://de.jooble.org/jdp/6939194732509022081/iOS-Developer-(Junior%2FMid+level)-+-Automotive-Ingolstadt?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChKdW5pb3IvTWlkLWxldmVsKSAtIEF1dG9tb3RpdmUiLCJjb21wYW55X25hbWUiOiJQaXhpZGEgR21iSCIsImFkZHJlc3NfY2l0eSI6IkluZ29sc3RhZHQsIEdlcm1hbnkiLCJodGlkb2NpZCI6Ilp6ek1wOFNDdVdPUkJ2RFpBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "iOS Developer (m/w/d)",
            "company_name": "apploft GmbH",
            "location": "Hamburg, Germany",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Hu8o-euGA6iAszIGAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU43qtRGBBddhRYXBz-gXOKZpCS5kItaP8J_Ft_wmu-iaf31Bmd6UeBMBVZRvdV9DVu4sAYhLMYBJ-iZbaDlydWa5aiUSOisVKzedIaj4kSaZzWxln-jOCyUA1Ya94fd3OVkN4A5B35U6KMewCcYMOpnsS30VCKmzw_r3MvakAAAAA&shmds=v1_AUFQtOOJ4tJo2_1eCJN6MfHXffDj5odOHV9f1OFgMeqWSjHdBg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Hu8o-euGA6iAszIGAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Sei ein Teil unserer Mission\n• Du arbeitest an der Neu- oder Weiterentwicklung von nativen iOS Apps für namhafte Kunden mit.\n• Du bist in App-Projekte involviert und übernimmst selbständig die Umsetzung mittlerer und großer Projekte.\n• Du kannst Junior-Entwickler unterstützen und anleiten.\n• Du arbeitest mit Atlassian Tools wie Jira, Bitbucket und Confluence.\n• Du bildest Dich regelmäßig weiter und bringst Deine Ideen und neuen Erkenntnisse ins Team ein.\n\nDeine Talente, Erfahrungen und Persönlichkeit\n• Du hast ein erfolgreich abgeschlossenes Studium in Informatik oder einer technisch/mathematischen Studienrichtung.\n• Du hast bereits drei oder mehr Jahre Erfahrung in der professionellen Entwicklung von iOS Apps in Swift oder Objective-C.\n• Im Rahmen von größeren Projekten hast Du schon Junior-Entwickler angeleitet.\n• Du kennst Dich sehr gut mit den grundsätzlichen Tools, Prozessen und Vorgehensweisen der Softwareentwicklung aus.\n• Du kennst Dich sehr gut mit Versionsverwaltungssystemen wie z.B. git aus.\n• Du kannst exzellente Kenntnisse in Algorithmen und Datenstrukturen vorweisen.\n• Du bist sehr gut vertraut mit objektorientierter-, funktionaler- und nebenläufiger-Programmierung\n• Du kennst grundlegende Architektur-Muster nativer iOS App wie z.B. MVC, MVVM, VIPER sehr gut.\n\nBonus\n• Du hast schon eigene App-Projekte umgesetzt und veröffentlicht.\n\nDer apploft.-Spirit\n• Rule no1: have fun!\n• Success is our passion.\n• We don't drop the ball.\n• We are family.\n• Stay hungry.\n\nBenefits\n• Spannende, mobile App-Projekte für namhafte Kunden wie bonprix, comdirect, LOTTO oder Gerolsteiner.\n• Ein erfahrenes Team - Mit diversen Möglichkeiten voneinander zu lernen, sich zu entfalten und Einfluss zu nehmen. WEITERENTWICKLUNG WIRD BEI UNS GROSS GESCHRIEBEN.\n• Flache Hierarchien und eine familiäre, offene Arbeitsatmosphäre.\n• Flexible Arbeitszeiten und die optimale Ausstattung für das Arbeiten im Home-Office.\n• Arbeit mit neuesten Technologien.\n• Regelmäßige interne Hackathons.\n• Bike-Leasing Option und Fitnessclub-Zuschuss.\n• Team-Events wie Sommerfest und Weihnachtsfeier.\n• Vierbeiner sind willkommen.\n\nBewirb Dich jetzt!\n\nDu hast noch Fragen? Dann melde Dich gerne bei mir.\nWir haben Deine Neugier geweckt? Dann schicke Deine Bewerbungsunterlagen oder den Link zu Deinem Profil auf Xing, Linkedin, stackoverflow oder GitHub an jobs@apploft.de.\n\nÜber uns\n\nTHINK OUTSIDE THE BOX.\n\nLust mit uns die mobile Welt zu erobern?\n\nWir zelebrieren Apps und suchen Menschen, die genauso begeistert davon sind, mit Leidenschaft Ideen zu entwickeln und Herausforderungen zu meistern. Wir lieben thinking outside the box und möchten immer über den Tellerrand hinausschauen. Du auch?",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=c8438eef345985dd&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs At Apploft GmbH - Personio",
                    "link": "https://apploft.jobs.personio.de/job/609451?language=de&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jooble",
                    "link": "https://de.jooble.org/jdp/-2820451241737294440/iOS-Developer-(m%2Fw%2Fd)-Hamburg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobtensor",
                    "link": "https://jobtensor.com/job/iOS-Developer-mwd-f6c420d6c4e8?lang=en&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Sercanto.de",
                    "link": "https://www.sercanto.de/detail/a/ios-developer-m-w-d_hamburg_800477?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Trabajo.org - Stellenangebote, Arbeit",
                    "link": "https://de.trabajo.org/stellenangebot-2027-a84f5b34df1e8415975aa7a43bf693c3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Simplyhired.de",
                    "link": "https://www.simplyhired.de/job/69dF0Rwj5pVZg1tUflChZNWTwSFMvQYAfdgyFnITXbUjXUWfR9iLsg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChtL3cvZCkiLCJjb21wYW55X25hbWUiOiJhcHBsb2Z0IEdtYkgiLCJhZGRyZXNzX2NpdHkiOiJIYW1idXJnLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJIdThvLWV1R0E2aUFzeklHQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "iOS Developer EDEKA App (m/w/d)",
            "company_name": "EDEKA IT Stiftung & Co. OHG",
            "location": "Minden, Germany",
            "via": "XING",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=t9OIaBqBy5r7uaDhAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yXNvQrCMBAAYFz7CE43iYomIuigU7Gl_iAOdS9pe6aR9i4kUesD-Z4iLt_6RZ9BtDaXHBJ8YssWHaRJeoohthbGnXzJegJzOHIJHpWrGmCCjFm3ONw2IVi_kdL7VmgfVDCVqLiTTFhyL-9c-h-Fb5RD26qAxXK16IUlPRX_5nCFPJhbeJCGEexYwGWfgSE4G6qRZpCh6xS9vwhg9GioAAAA&shmds=v1_AUFQtONNNt2C8JH3yxrLLSsPBNkrOyFcwlDznCZomaa15-MqVA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=t9OIaBqBy5r7uaDhAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056a599d68ec7a19a5ac/images/1cae31a53bc9d3f4601bfb86e8adb4d24d6c5419f571df5116dd3f20f340474c.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Wir bei der EDEKA IT sind das Herzstück des digitalen Wandels im EDEKA-Verbund. Als leistungsstarkes Team entwickeln wir IT-Strategien, -Infrastrukturen und -Dienstleistungen für alle Handelsbereiche des EDEKA-Verbunds in ganz Deutschland. Wir bündeln unsere Kompetenzen, um innovative Lösungen zu entwickeln und umzusetzen. So treiben wir den Handel von morgen voran - vielleicht schon bald gemeinsam mit dir?\n\nIn deiner Rolle als iOS Developer EDEKA App (m/w/d) kannst du bei uns deinen ganz persönlichen Beitrag zu unseren Zielen leisten. Mögliche Einsatzorte sind: Berlin, Gaimersheim, Hamburg, Melsungen, Minden, Moers, Neumünster, Offenburg, Cluj-Napoca, Mannheim.\n\nDeine Aufgaben\n• Im regelmäßigen Austausch mit dem Product Management und dem Android-Team gestaltest du innovative Features für unsere iOS-App und setzt diese um.\n• Mit einer \"Getting things done\" Grundhaltung arbeitest du \"end to end\" und engagierst dich in allen Phasen des Entwicklungsprozesses von der Anforderungsanalyse über Code Reviews, Unit / UI-Tests bis zum Deployment bzw. Release Management.\n• Im Rahmen kontinuierlicher Qualitätssicherung sorgst du für die Optimierung, Skalierung und Weiterentwicklung unseres Codes.\n\nDein Profil\n• Du hast eine Ausbildung oder ein Studium mit IT-Bezug erfolgreich abgeschlossene oder besitzt eine vergleichbare Qualifikation.\n• Du verfügst über fundierte Praxiserfahrung in der nativen App-Entwicklung für iOS mit Swift, SwiftUI, Combine und RxSwift.\n• Du hast Freude an der Entwicklung einfacher, eleganter Apps, die nutzerfreundlich sind und Spaß machen.\n• Du wagst Experimente und begegnest komplexen Herausforderungen gerne mit kreative Lösungsansätzen.\n• Du besitzt gute Deutsch- und Englischkenntnisse in Wort und Schrift (CEFR-Level B2 oder höher).\n\nUnser Angebot\n• Work-Life-Balance: Profitiere von 30 Tagen Urlaub und der Möglichkeit zum mobilen Arbeiten.\n• Einfluss: Du gestaltest die IT eines der führenden Lebensmitteleinzelhändlers in Deutschland.\n• Finanzieller Anreiz & weitere Angebote: Freue dich über ein 13. Monatsgehalt und zahlreiche Benefits & Mitarbeitendenangebote runden unsere Wertschätzung für dich ab.\n• Gesamtheitliche Entwicklung (fachlich & persönlich): Dich erwarten bei uns verschiedene Weiterbildungsangebote wie z. B. digitale Lernplattformen und die Option an Fachkonferenzen teilzunehmen.\n• Betriebliches Gesundheitsmanagement: Unser Gesundheitsmanagement kümmert sich um deine Gesundheit am Arbeitsplatz.\n• Kultur & Zusammenarbeit: Wir ermöglichen dir einen optimalen Start in unserem Unternehmen und legen viel Wert auf ein gutes Onboarding, damit du direkt durchstarten und durch unsere verschiedenen Communities und Netzwerke von Anfang an mitgestalten kannst.",
            "apply_options": [
                {
                    "title": "XING",
                    "link": "https://www.xing.com/jobs/minden-ios-developer-edeka-app-124885679?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Westfalen.jobs",
                    "link": "https://www.westfalen.jobs/job/ios-developer-edeka-app-m-w-d-12366165?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/ios-developer-edeka-app-m-w-d-at-edeka-it-4092845438?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Monster.de",
                    "link": "https://www.monster.de/stellenangebot/ios-developer-edeka-app-m-w-d-minden-nordrhein-westfalen--799f95cf-d77a-443e-b1d4-660ce7b65e01?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIEVERUtBIEFwcCAobS93L2QpIiwiY29tcGFueV9uYW1lIjoiRURFS0EgSVQgU3RpZnR1bmcgXHUwMDI2IENvLiBPSEciLCJhZGRyZXNzX2NpdHkiOiJNaW5kZW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6InQ5T0lhQnFCeTVyN3VhRGhBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "(Junior) iOS/ Mobile Developer (d/w/m)",
            "company_name": "Verimi",
            "location": "Berlin, Germany",
            "via": "Get In IT",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=nHkoiDpaCh1dEk_wAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7BzrdaEUbEVwUFxEKBXEQXEtSj_YkyYW7qPVL_F3xDa_4TorDvHlGYimBLlcDZ3bkEU74Qs8JBeZ38zahhBU07EDRSjcAR6iZe4-z_ZBz0p0xqr7qNdtMXdVxMBzR8Wge7PRfq4MVTN5mbDfb9Vil2C-mNxQKBBThiOIpLqFGCTZ-fg94oIWaAAAA&shmds=v1_AUFQtOPgsxLKUhA5kuE1xwBJr_ovh2vWffBXWTnxMBeq-9t3xg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=nHkoiDpaCh1dEk_wAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056a599d68ec7a19a5ac/images/1cae31a53bc9d3f4758048111e361a2db0f513984f898b6eaa3a727f1a78d57a.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Deine Mission Dein Fokus liegt auf der Entwicklung der iOS Mobile App und SDK unseres Verimi-Systems. Du stellst sicher, dass unsere Software jeden Tag besser wird. Du trägst dazu bei, dass unsere Software auf dem neuesten Stand ist, durch Code Reviews, Unit -und Integrationstests. Du bringst als Teil eines agilen Teams Dein Wissen und Ideen ein, wenn es um Veränderungen in der Architektur geht. Du unterstützt das Produktmanagement dabei, Ideen in Userstories umzusetzen. Du tauschst Dich gern im Team über Klick-Dummies und Benutzerströme aus. Dein Profil Du hast einen Hochschulabschluss in Informatik oder einem verwandten Bereich. Du hast Erfahrung als Entwickler für iOS-Geräte. Du bist versiert in Swift, der iOS-Plattform, Xcode und REST-Webdiensten. Du hast solide Kenntnisse über saubere mobile Architekturen (z. B. MVVM, VIPER). Du bist begeistert von modernen Entwicklungsansätzen wie CI/CD. Du arbeitest organisiert und leistungsorientiert. Du übernimmst gerne Verantwortung für deine Arbeit und bist ein guter Teamplayer. Du sprichst fließend Englisch. Über uns Verimi ID-Wallet - deine digitale Brieftasche. Als Lösungsanbieter für die Identitätsprüfung und sichere Authentifizierung machst du bei uns ganz einfach einen Ausweis-Check und hinterlegst deine digital erfassten Daten anschließend in unserem Verimi ID-Wallet. Damit kannst du dich jederzeit, bequem und sicher bei unseren Partnern einloggen, dich digital mit wenigen Klicks ausweisen, Dokumente digital unterschreiben oder unkompliziert bezahlen. Bei unserer Mission, eine digitalisierte Welt ohne analoge Hürden zu schaffen, sind wir nicht alleine. Wir können uns dabei auf die Unterstützung unserer Gesellschafter aus der deutschen Wirtschaft verlassen, unter anderen haben Allianz, Atruvia, Bundesdruckerei, Deutsche Bahn, Deutsche Telekom, DZ-Bank, GDV und Volkswagen Financial Services in Verimi investiert. Warum Verimi? Wir lieben Datensicherheit und haben die einmalige Chance, die Zukunft des digitalen Identitätsmanagements in Deutschland und Europa mitzugestalten. Unsere Arbeitsbereiche sind vielseitig und bieten viele Möglichkeiten zur Kreativität und Eigeninitiative. Wir freuen uns über Bewerbungen aller Nationalitäten und legen besonderen Wert auf Diversität in unseren Teams. Chancengleichheit ist ein wichtiger Teil unserer Werte, daher ermutigen wir ausdrücklich auch Menschen mit Behinderung, sich zu bewerben. Arbeitsplatz: Bei uns erwartet dich ein zentraler, modern und technisch sehr gut ausgestatteter Arbeitsplatz im Herzen Berlins. Teams: Mit agilen und cross-funktionalen Projektteams sind wir in der Lage kollaborativ selbst komplexeste Projektanforderungen umzusetzen. Hybrides Arbeiten: Immer mittwochs treffen sich alle vor Ort - unsere Geschäftsführer und Teamleiter auch donnerstags. An den anderen Tagen kannst du selbst und flexibel entscheiden, wo du arbeitest. Benefits und Vergütung: Neben einem fairen Gehalt und einem i.d.R. unbefristeten Arbeitsvertrag bieten wir dir diverse Benefits an; entweder als Zuschuss für öffentliche Verkehrsmittel (BVG), für eine Urban Sports-Mitgliedschaft oder für Mahlzeiten, Internet- oder Mobilitätskosten und die Inanspruchnahme von Rabatten über unseren Partner Corporate Benefits. Urlaub: Du bekommst 30 Tage Urlaub (plus zusätzliche 0,5 Tage für Weihnachten und Silvester), sowie selbstverständlich Sonderurlaub für besondere Anlässe wie deine Hochzeit oder die Geburt deines Kindes. OKRs: Wir planen unsere Quartale und unser Jahr mit OKRs auf Company- und Teamebene. Weiterentwicklung: Wir fördern die Weiterbildung aller Mitarbeiter*innen mit einem Weiterbildungsbudget, internen Weiterbildungsmaßnahmen, bieten jedem New Starter ein umfangreiches Onboarding und führen quartalsweise Feedbackgespräche sowie jährliche Developmentgespräche. Werte und Kultur: Wir sind ein diverses und interkulturelles Team mit 90+ Mitarbeiter*innen aus mehr als 20 Nationen und leben eine offene Unternehmenskultur, die von unseren Verimi-Werten (Vertrauen - Respekt - Integrität - Verantwortung - Innovation - Transparenz) geleitet wird. Relocation-Support: Wir unterstützen dich bei der Organisation rund um dein Visum und deine Relocation nach Berlin.",
            "apply_options": [
                {
                    "title": "Get In IT",
                    "link": "https://www.get-in-it.de/jobsuche/p262435?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Www.mojob.me",
                    "link": "https://www.mojob.me/stellenangebote/6936da0e41a256b1a7342e3612c0076e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba.de",
                    "link": "https://www.jobijoba.de/detailanzeige/9/16a1827603e7ef55565ab72e4c7d712a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Top County Careers",
                    "link": "https://topcountycareers.co.uk/jobs/junior-ios-mobile-developer-d-w-m-berlin/1542812294-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KSNT Jobs",
                    "link": "https://jobs.ksnt.com/jobs/junior-ios-mobile-developer-d-w-m-berlin/1542812294-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Valley Central Jobs",
                    "link": "https://jobs.valleycentral.com/jobs/junior-ios-mobile-developer-d-w-m-berlin/1542812294-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KARK Jobs",
                    "link": "https://jobs.kark.com/jobs/junior-ios-mobile-developer-d-w-m-berlin/1542812294-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "News10 Jobs",
                    "link": "https://jobs.news10.com/jobs/junior-ios-mobile-developer-d-w-m-berlin/1542812294-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIoSnVuaW9yKSBpT1MvIE1vYmlsZSBEZXZlbG9wZXIgKGQvdy9tKSIsImNvbXBhbnlfbmFtZSI6IlZlcmltaSIsImFkZHJlc3NfY2l0eSI6IkJlcmxpbiwgR2VybWFueSIsImh0aWRvY2lkIjoibkhrb2lEcGFDaDFkRWtfd0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Junior iOS Developer",
            "company_name": "F&P",
            "location": "Leipzig, Germany",
            "via": "DEVjobs.de",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=SStJFZ9ncb0YsXt4AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEvQrCMBAAYFz7AoLTTQ7-JCK41FUsFEHBByhJOJJIehdyUaqrLy5-w9d8Z826f1LkAvF6hxO-MHHGAlvo2YKgKS4AE3TMPuHiGGrN0motkpSXamp0yvGomdDypB9s5d8gwRTMyVQc9ofdpDL51fy8vEEkuGDMn-g30GEZDb1_pmR7qYYAAAA&shmds=v1_AUFQtON9fg8ZDNNWkHu44jw2qcrzfuC_KtrXGouMNsCGSUyVMA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=SStJFZ9ncb0YsXt4AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/6785056a599d68ec7a19a5ac/images/1cae31a53bc9d3f4436366a3a9406fd9cdb27c051117ddf38081735b0eb5271d.gif",
            "extensions": [
                "27 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "27 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Deine Rolle im Team\n• Als Teil unseres agilen Mobile Teams übernimmst du die Konzeption und Entwicklung von Features in den Bereichen Messaging, Profile, Events, Gruppen und Dates.\n• Du identifizierst und behebst Bugs, implementierst Unit- und Integrationstests.\n• Gemeinsam mit den Backend-Entwicklungsteams designst und entwickelst du APIs und stellst deren Funktionalität sicher.\n• Du bringst dich aktiv bei Scrum Zeremonien deines Teams ein und beteiligst dich an Code Reviews und Pair Programmings.\n\nTechnologien und Skills\n• Swift\n• UIkIt\n• fastlane\n• swiftUI\n• Nimble\n• Jenkins\n\nUnsere Erwartungen an dich:\n\nQualifikationen\n• Gute Kenntnisse in der Programmiersprache Swift und dem Framework UIKit und/oder SwiftUI.\n• Gutes Gespür für Benutzeroberflächen sowie Lust auf sauberen Code und agile Entwicklung.\n• Sicherer Umgang mit den gängigen Design-Pattern.\n• Zielorientierte und selbstständige Arbeitsweise in einem agilen Umfeld.\n• Deutschkenntnisse B2 erforderlich (German level B2 required).\n• Deine Werte und unsere Unternehmenswerte sind eine unschlagbare Kombination!\n\nErfahrung\n• Berufserfahrung in der Entwicklung von mobilen Apps unter iOS wünschenswert, idealerweise im High-Performance-Bereich und/oder Communities.\n• Idealerweise Erfahrung mit CI/CD-Technologien (zB. Jenkins, Fastlane) sowie Unit-Tests (zB. Quick, Nimble) wünschenswert.\n\nAusbildung\n• Abgeschlossenes Studium im Bereich der Informatik oder vergleichbare Ausbildung.\n\nBenefits\n• Jobrad\n• Frisches Obst",
            "apply_options": [
                {
                    "title": "DEVjobs.de",
                    "link": "https://devjobs.de/job/386ee8b89a56bee8e6c4386979f74477?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJKdW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IkZcdTAwMjZQIiwiYWRkcmVzc19jaXR5IjoiTGVpcHppZywgR2VybWFueSIsImh0aWRvY2lkIjoiU1N0SkZaOW5jYjBZc1h0NEFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "(Senior) iOS developer - Bielefeld",
            "company_name": "Talent 4.0",
            "location": "Bielefeld, Germany",
            "via": "CATSone",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=IADc98NKUhXRVamaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0XNMQ7CMAxAUbH2CEweAUFSIRiAjaUSC0PZq7Q1TZBrR3GEylU4LTCxfL3tF-9ZcVjUyEHSEsK1hh6fSBIxwQbOAQnvSP3XF2lB0aXOgzBUIgPh_ORzjnq0VpXMoNnl0JlORiuMrUz2Ia3-0qh3CSO5jM12X04m8rCCmyPkDDtTQuD_bA0VptHx6wPHAFpnnQAAAA&shmds=v1_AUFQtOOoeWEplxeZmvqiBo1OyC6wcepcUPqOfLPzSZQePVIq9Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=IADc98NKUhXRVamaAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "For our customer in the region of Bielefeld, we are urgently searching a (Senior) iOS developer. As (Senior) iOS developer, you develop first-class iOS apps for exciting 2D and 3D plannings for a wide variety of branches in the furniture industry. The apps support the salesperson in the furniture trade from customer advice and product configuration to ordering.\n\nThis position is open for English speaking EU candidates, who are willing to relocate. Workpermit is not provided.\n\nTasks and responsibilities:\n• Develop first-class iOS apps for exciting 2D and 3D plannings for a wide variety of branches in the furniture industry;\n• Use and improve our engineering processes, create exciting projects connected to cloud systems, different APIs and integrate ERP systems;\n• Collaborate with other teams and stay up-to-date on new evolutions and technologies;\n\nProfile:\n• Bachelor or Master degree;\n• Very good Objective-C / Swift skills ;\n• +5 years of experience in iOS development;\n• Experience wit GIT, SQLITE, REST, JSON;\n• C++ and web technology knowledge is an advantage;\n• Passion for quality, good design and clean code;\n\nInterested:\n\nPlease send your resume to vacature@talent40.com.",
            "apply_options": [
                {
                    "title": "CATSone",
                    "link": "https://talent40.catsone.nl/careers/11-General/jobs/549745-Senior-iOS-developer-Bielefeld?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBpT1MgZGV2ZWxvcGVyIC0gQmllbGVmZWxkIiwiY29tcGFueV9uYW1lIjoiVGFsZW50IDQuMCIsImFkZHJlc3NfY2l0eSI6IkJpZWxlZmVsZCwgR2VybWFueSIsImh0aWRvY2lkIjoiSUFEYzk4TktVaFhSVmFtYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMk5KV25CeVQyMVhZVU5TWVhaT1prRjRObUprWW1rNWJUTm9TM3BTVEhCRmFGbHJUM1l6UjFWQ09EVmllRXAwUzBKUGNEVlhYM1Y1WlcxcFJHbDJSVFJxUzNOM1oyOXhXbFJGWVVKVlVTMTJlWFpIVmxKNVlUaFVhR3A1ZGtoTWJrUklZaTFWWTNaU01WWnJXa3R6UW5oeWFqQnZZWGRxUVY5T2JFNUVRVUZVYVZNMGVYZEZiRGhIYzJsaU5IaEdMVXhQU0hObFRFVjRkR2xmY25Sek1scFZTR1ptYVV0SlJXOW1aM0l0ZUVjMmNWcDZZbTUzTm5WNVNVbzBSRmxaVjIxV1ZDMDBNbUZ3WkVWbFRUbDBabmhmUmpaSWFuWnBkbFY1TVRCQk9FVjRjazlvVEdZMFVHcGtaamQxUkZSS1prd3RWR1E1ZVdSeGQyaHBVbEJVWlhwaFJESndjUklYWVdkWFJscGZYM1pJWlZObU5VNXZVSHBqVjBreVFXc2FJa0ZHV0hKRlkyOTJaRWwwTVdKbU5FZFJja3ROTjB0M2VHdFVjUzAxVW14RVkxRSIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=Germany&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMk5KV25CeVQyMVhZVU5TWVhaT1prRjRObUprWW1rNWJUTm9TM3BTVEhCRmFGbHJUM1l6UjFWQ09EVmllRXAwUzBKUGNEVlhYM1Y1WlcxcFJHbDJSVFJxUzNOM1oyOXhXbFJGWVVKVlVTMTJlWFpIVmxKNVlUaFVhR3A1ZGtoTWJrUklZaTFWWTNaU01WWnJXa3R6UW5oeWFqQnZZWGRxUVY5T2JFNUVRVUZVYVZNMGVYZEZiRGhIYzJsaU5IaEdMVXhQU0hObFRFVjRkR2xmY25Sek1scFZTR1ptYVV0SlJXOW1aM0l0ZUVjMmNWcDZZbTUzTm5WNVNVbzBSRmxaVjIxV1ZDMDBNbUZ3WkVWbFRUbDBabmhmUmpaSWFuWnBkbFY1TVRCQk9FVjRjazlvVEdZMFVHcGtaamQxUkZSS1prd3RWR1E1ZVdSeGQyaHBVbEJVWlhwaFJESndjUklYWVdkWFJscGZYM1pJWlZObU5VNXZVSHBqVjBreVFXc2FJa0ZHV0hKRlkyOTJaRWwwTVdKbU5FZFJja3ROTjB0M2VHdFVjUzAxVW14RVkxRSIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}