{
    "search_metadata": {
        "id": "678505fbc1b31e3d100f4c17",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/210780cff678c787/678505fbc1b31e3d100f4c17.json",
        "created_at": "2025-01-13 12:24:27 UTC",
        "processed_at": "2025-01-13 12:24:27 UTC",
        "google_jobs_url": "https://www.google.com/async/callback:550?q=iOS+developer&uule=w+CAIQICIOVW5pdGVkIEtpbmdkb20&udm=8&fc=EswCCowCQUpHOUprT3ZEemItOFMzY25GcVZ0NDlBTVJ5amFqZXRrbVliWXFWUHRoTWljUTBxU1VGdnRqS25vcDNPbjRsR1RSWUMtV3lyUGp4cXNCTjlJV2ItVDBEeEFTdzVtOGxtdE1BYmpxYmk5ZEtPNTFKVG1Ha3dXX1hwUG1qQjdhUElsVzRWTncya0Z5ZWw0ejZoNkdtNmFFS1RTTGJpMGo1cHBLTmdQN1YyTE10ZzE0VFlBSWZvbEtoT3ZBT0NHcHJOUUlwNnl3aWJBNUZ0ZVFIZ2hDV1BmOV96alVrYUJ1NGVCeTVfYXdyS016ZkJkOTRTSjQ0bThiRVRiSkpVQTJDcDRnS3JMZi1qeDl2LRIXLWdXRlo1MlVMZGlycHRRUHVxeTcwUWMaIkFGWHJFY3JyRUM2TmpaeEdIQ1dZa0xHdTJkNFByWktYTEE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/210780cff678c787/678505fbc1b31e3d100f4c17.html",
        "prettify_html_file": "https://serpapi.com/searches/210780cff678c787/678505fbc1b31e3d100f4c17.prettify",
        "total_time_taken": 0.93
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "United Kingdom",
        "location_used": "United Kingdom",
        "google_domain": "google.com",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUM1pFZW1JdE9GTXpZMjVHY1ZaME5EbEJUVko1YW1GcVpYUnJiVmxpV1hGV1VIUm9UV2xqVVRCeFUxVkdkblJxUzI1dmNETlBialJzUjFSU1dVTXRWM2x5VUdwNGNYTkNUamxKVjJJdFZEQkVlRUZUZHpWdE9HeHRkRTFCWW1weFltazVaRXRQTlRGS1ZHMUhhM2RYWDFod1VHMXFRamRoVUVsc1Z6UldUbmN5YTBaNVpXdzBlalpvTmtkdE5tRkZTMVJUVEdKcE1HbzFjSEJMVG1kUU4xWXlURTEwWnpFMFZGbEJTV1p2YkV0b1QzWkJUME5IY0hKT1VVbHdObmwzYVdKQk5VWjBaVkZJWjJoRFYxQm1PVjk2YWxWcllVSjFOR1ZDZVRWZllYZHlTMDE2WmtKa09UUlRTalEwYlRoaVJWUmlTa3BWUVRKRGNEUm5TM0pNWmkxcWVEbDJMUklYTFdkWFJsbzFNbFZNWkdseWNIUlJVSFZ4ZVRjd1VXTWFJa0ZHV0hKRlkzSnlSVU0yVG1wYWVFZElRMWRaYTB4SGRUSmtORkJ5V2t0WVRFRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "iOS Engineer II, Core Experience",
            "company_name": "Spotify",
            "location": "London, United Kingdom",
            "via": "Startup Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=mIe7XPy0oo514YrJAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU7nKrURQQQdpUhVcCjOJU3P5KS9C8kN9VP8W_ENr_guigM9WqjZEyMmaJoSzpIQ6jliImSHsIGr9JDRJhdAGC4ifsTlKajGfDQm57HyWa2Sq5xMRhh7mc1b-vyvy8EmjKNV7Hb77VxF9utVG0Xp9QFiuAsPwiU8mRQHuBH7QaYf4zOXzJwAAAA&shmds=v1_AUFQtOPE55rg6DQhdA_eWnfssVNqatRB8bldCGaCq-lGWgMxlQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=mIe7XPy0oo514YrJAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fbc1b31e3d100f4c17/images/85b951192e48136c158434704daf979ab6d8b911e7b6de6d490a819a727ca947.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Delivering the best Spotify experience possible. To as many people as possible. In as many moments as possible. That’s what the Experience team is all about. We use our deep understanding of consumer expectations to enrich the lives of millions of our users all over the world, bringing the music and audio they love to the devices, apps and platforms they use every day. Know what our users want? Join us and help Spotify give it to them.\n\nWe are looking for a dedicated, engaged, and passionate mid-level iOS Engineer to join the team working on the home screen on the mobile phone. It is an impactful team working on the critical projects with various stakeholders from across Spotify.\n\nAs part of the team, you will be responsible for building, maintaining, and improving UI components used on the screen visited by hundreds of millions of users daily.\n\nWhat You'll Do\n\n• Work with friendly, productive, and supportive team members\n• Bring your expertise, experience, and unique style to the team\n• Engage in challenging and high priority work that requires collaboration across teams\n• Build, maintain, and improve UI components used on Home Screen\n• Run features from inception to rollout to end users\n• Collaborate with the Experimentation Platform when rolling out new features or running A/B tests\n• Manage complex projects with close collaboration with staff engineers\n• Mentor and support team members in their growth\n\nWho You Are\n\n• You know how to write readable, idiomatic and maintainable Swift and are willing to follow already defined coding guidelines and workflows\n• You enjoy working in a dynamic environment, and have strong communication skills given the complexity of the work\n• You are experienced with a variety of iOS frameworks\n• You care about quality and you know what it means to ship high quality code\n• Values team success over personal success\n• It's a plus if you have a backend understanding e.g architecture\n\nWhere You'll Be\n\n• For this role you will be based in London.\n\nSpotify is an equal opportunity employer. You are welcome at Spotify for who you are, no matter where you come from, what you look like, or what’s playing in your headphones. Our platform is for everyone, and so is our workplace. The more voices we have represented and amplified in our business, the more we will all thrive, contribute, and be forward-thinking! So bring us your personal experience, your perspectives, and your background. It’s in our differences that we will find the power to keep revolutionizing the way the world listens.\n\nSpotify transformed music listening forever when we launched in 2008. Our mission is to unlock the potential of human creativity by giving a million creative artists the opportunity to live off their art and billions of fans the chance to enjoy and be passionate about these creators. Everything we do is driven by our love for music and podcasting. Today, we are the world’s most popular audio streaming subscription service.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/ios-engineer-ii-core-experience-spotify-5983372?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/spotify/ios-engineer-ii-core-experience/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=142084996935361222&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs.weekday.works",
                    "link": "https://jobs.weekday.works/spotify-ios-engineer-ii%2C-core-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The SaaS Jobs Board - Cobloom",
                    "link": "https://jobs.cobloom.com/jobs/99230658-ios-engineer-ii-core-experience?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://uk.talent.com/view?id=0bfb2ff40e84&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRW5naW5lZXIgSUksIENvcmUgRXhwZXJpZW5jZSIsImNvbXBhbnlfbmFtZSI6IlNwb3RpZnkiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJtSWU3WFB5MG9vNTE0WXJKQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Consultant / Senior Consultant, iOS Developer, Deloitte Digital",
            "company_name": "Deloitte",
            "location": "Belfast, United Kingdom",
            "via": "Indeed",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Cl8m89_l_WI7lVZEAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_0WOMQrCQBBFsc0RrAbsJGZFsNFOA4IWFkHbsEnGzchmJmRG8Wyeztho83m85v3kPUmue2F9RPNs4KBAJhng71KgcwE5PjFKj0M6YhQyQ8gpkPkICzhKBYp-qFsQhoNIiDjdtma9bpxTjVlQ80Z1VkvnhLGSl7tLpd8ptfUD9tEblqv18pX1HOazX4UYdhhvXscnFybDBk7EoZHuAzETBOi9AAAA&shmds=v1_AUFQtOOHg7iDWQYgXjtE0dTu2QEicevmJjy-_SspYviY7D452Q&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Cl8m89_l_WI7lVZEAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fbc1b31e3d100f4c17/images/85b951192e48136c93091f332b62bb80b55d5f626851d1e06bb3e6971dd55512.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Basic information\n\nLocation\n\nBelfast\n\nBusiness Line\n\nTechnology & Transformation\n\nDate published\n\n16-Sep-2024\n\nReq #\n\n16829\n\nJob description\n\nConnect to your Industry\n\nWant to shape the future of online experiences? So do we.\n\nPart Business. Part Creative. Part Technology. One hundred per cent digital. At Deloitte Digital, we connect creativity with technology for business. Bringing empathy, ideas, and experience into digital transformation. Together with all of Deloitte, we create connections across the breadth of our people, organisation, and ecosystems to make an impact that matters to our clients and to society. We're a new type of creative digital consultancy that fuses strategy, tech and design to identify where businesses need to be, then get them there. Fast. Want to help us shape the future? We're looking for experienced practitioners from a consulting, design, tech or business background who can show our clients what's next, then work with our mixed-discipline team to make it happen.\n\nAs part of our T&T practice, your career with Deloitte Digital can take multiple paths. Including: customer and channel strategy, customer experience design, designing new service capabilities and operations, mobile, online and contact centre technology solutions, and related technology and operational change programmes.\n\nWe embrace the strengths of diverse talent within our team. You may have a brilliant mind, be a confident communicator or a nerd for all things digital, or you may have an impeccable business instinct, a collaborative outlook and a flair for big ideas.\n\nWe encourage consideration of flexible ways of working, both formal and informal arrangements that allow for the best outcomes for our people and our clients. If this opportunity is of interest to you with some flexibility, please do discuss with us.\n\nConnect to your career at Deloitte\n\nDeloitte drives progress. Using our vast range of expertise, we help our clients' become leaders wherever they choose to compete. To do this, we invest in outstanding people. We build teams of future thinkers, with diverse talents and backgrounds, and empower them all to reach for and achieve more.\n\nWhat brings us all together at Deloitte? It’s how we approach the thousands of decisions we make every day. How we behave, our beliefs and our attitudes. In other words: our values. Whatever we do, wherever we are in the world, we lead the way, serve with integrity, take care of each other, foster inclusion, and collaborate for measurable impact. These five shared values lead every decision we make and action we take, guiding us to deliver impact how and where it matters most.\n\nConnect to your opportunity\n\nWe're looking for people who are natural initiative-takers who bring out the best in others, are brilliant listeners and can grow our business without compromising standards, integrity or culture.\n\nYou will work with outstanding digital talent across disciplines to innovate and create great solutions for iconic brands.\n• Develop and maintain advanced iOS applications.\n• Write clean, efficient, and well-documented code.\n• Collaborate with cross-functional teams on feature development.\n• Implement UI/UX designs for a seamless user experience.\n• Integrate third-party APIs and collaborate with backend developers.\n• Conduct thorough testing and debugging to ensure application quality.\n• Stay updated on iOS development trends and technologies.\n• Optimize application performance and resolve technical issues.\n• Ensure compliance with security standards and App Store guidelines.\n• Collaborate on problem-solving and contribute to team discussions.\n\nConnect to your skills and professional experience\n\nOverall, you're an ideas person and problem solver as well as a hands-on doer. You know it takes a mix of people to do amazing work, so you love collaborating with and learning from people with different skills, backgrounds and perspectives. If you have an interesting or unusual mix of skills yourself, even better.\n• Extensive experience in Swift is crucial, as it's the primary language for iOS development. Knowledge of Objective-C is also beneficial, especially for maintaining and updating legacy code.\n• Familiarity with core iOS frameworks like UIKit, CoreData, CoreAnimation, etc., is essential. Experience with SwiftUI for modern iOS development is increasingly important so is a must.\n• Understanding the full lifecycle of iOS apps, from initial design and development to deployment and ongoing maintenance.\n• Ability to integrate third-party APIs and understand networking concepts, including working with RESTful APIs and handling JSON.\n• Knowledge of Apple's design principles and interface guidelines. Experience in creating user-friendly, accessible, and responsive interfaces.\n• Experience with version control systems, particularly Git, for managing changes in code across large teams and projects.\n• Proficiency in writing and maintaining unit tests, UI tests, and debugging complex issues.\n• Ability to optimise app performance and memory usage and understanding of multi-threading and concurrency in iOS apps.\n• Familiarity with Apple's App Store, app submission process, app review guidelines, and managing app releases and updates.\n• Ability to manage multiple aspects of app development projects, including planning, timelines, and collaboration across teams.\n• Strong analytical and problem-solving skills to navigate complex development challenges and implement effective solutions.\n• Staying updated with the latest trends and advancements in iOS development, programming languages, and emerging technologies.\n• Strong communication skills for effectively collaborating with cross-functional teams, including designers, product managers, and other stakeholders.\n• For a senior role, the ability to lead projects, mentor junior developers, and potentially manage a development team.\n• Knowledge of advanced features such as ARKit, CoreML, or advanced SwiftUI is increasingly in demand for creating cutting-edge applications so is really nice to have knowledge of.\n\nHaving a portfolio of developed apps available on the App Store, along with a track record of solving real-world problems through application development, can further strengthen your portfolio and appeal.\n\nConnect to your business - Technology and Transformation\n\nDistinctive thinking, deep expertise, innovation and collaborative working. That’s what connects us. That’s what makes us Deloitte. If you want to help solve some of the biggest tech and transformational challenges around, join us. Together, we’ll make an impact that matters.\n\nCustomer\n\nHuman connections are integral to business. We combine people, ideas and technology to support our clients to build strong connections. For example, through commerce, customer design and sales services.\n\nPersonal independence\n\nRegulation and controls are standard practice in our industry and Deloitte is no exception. These controls provide important legal protection for both you and the firm. We are subject to a number of audit regulations, one of which requires that certain colleagues abide by specific personal independence constraints (e.g., in relation to any financial interests and employment relationships). This can mean that you and your \"Immediate Family Members\" are not permitted to hold certain financial interests (shares, funds, bonds etc.) with audit clients of the firm, and also prohibitions on certain employment relationships (e.g., you are not permitted to hold a secondary employment role with SEC audit clients of the firm whilst being employed by the firm). The recruitment team will provide further detail as you progress through the recruitment process or you can contact the Independence team upon request.\n\nConnect with your colleagues\n\n“What attracted me to Deloitte were the endless opportunities and the collective experience of other like-minded individuals. Deloitte’s clients include many of the world’s largest organisations; I wanted to be part of a team that made a difference that I could be proud of.” - Dan, Technology and Transformation\n\n\"I get to work on projects that help clients in a sector I feel truly passionate about.” - Rhiannon, Technology and Transformation\n\n“Everyone always says “it’s the people,” and that’s true. Working for a brand you feel proud of feels pretty good too. And you don’t have any stress about fitting into a particular stereotype, because there are so many different types of people in Deloitte Digital.”- Gillian, Technology and Transformation\n\nOur hybrid working policy\n\nYou’ll be based in Belfast with hybrid working.\n\nAt Deloitte we understand the importance of balancing your career alongside your home life. That’s why we’ll support you to work flexibly through our hybrid working policy. Depending on the requirements of your role, you’ll have the opportunity to work in your local office, virtual collaboration spaces, client sites and remotely. You’ll get the chance to meet face to face when needed, while you collaborate and learn from colleagues, share your experiences, and build the relationships that will fuel your career and prioritise your wellbeing. Please check with your recruiter for the specific working requirements that may apply for your role.\n\nOur commitment to you\n\nMaking an impact is more than just what we do: it’s why we’re here. So we work hard to create an environment where you can experience a purpose you believe in, the freedom to be you, and the capacity to go further than ever before.\n\nWe want you. The true you. Your own strengths, perspective and personality. So we’re nurturing a culture where everyone belongs, feels supported and heard, and is empowered to make a valuable, personal contribution. You can be sure we’ll take your wellbeing seriously, too. Because it’s only when you’re comfortable and at your best that you can make the kind of impact you, and we, live for.\n\nYour expertise is our capability, so we’ll make sure it never stops growing. Whether it’s from the complex work you do, or the people you collaborate with, you’ll learn every day. Through world-class development, you’ll gain invaluable technical and personal skills. Whatever your level, you’ll learn how to lead.\n\nConnect to your next step\n\nA career at Deloitte is an opportunity to develop in any direction you choose. Join us and you’ll experience a purpose you can believe in and an impact you can see. You’ll be free to bring your true self to work every day. And you’ll never stop growing, whatever your level.\n\nDiscover more reasons to connect with us, our people and purpose-driven culture at deloitte.co.uk/careers\n\nWPFULL SLTTECH BACUSTR BADESGN LOCBEL",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=cc84eb3616757a9a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "EFinancialCareers",
                    "link": "https://www.efinancialcareers.co.uk/jobs-UK-Belfast-Consultant__Senior_Consultant_iOS_Developer_Deloitte_Digital.id21955172?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/consultant-senior-consultant-ios-developer-deloitte-digital-deloitte-JV_IC3304415_KO0,59_KE60,68.htm?jl=1009448219207&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SimplyHired",
                    "link": "https://www.simplyhired.co.uk/job/075TjTHhKk6ulIOFWiffPSZUDjj-HPEgKNIItWPeU_eEDlShQNPrxg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IC8gU2VuaW9yIENvbnN1bHRhbnQsIGlPUyBEZXZlbG9wZXIsIERlbG9pdHRlIERpZ2l0YWwiLCJjb21wYW55X25hbWUiOiJEZWxvaXR0ZSIsImFkZHJlc3NfY2l0eSI6IkJlbGZhc3QsIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJDbDhtODlfbF9XSTdsVlpFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "Ios Developer",
            "company_name": "Eclipse IT Recruitment",
            "location": "Harrogate, United Kingdom",
            "via": "Design Job Board",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=ir022lGATu3apQoNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXKMQ7CMAwAQLH2CUwemBA0CMQCKwgKG4K5SlMrCUrtKDaoT-G5wHLTVZ9JNWtY4IBvTJyxwBIu3IGgLS4AE5yYfcLpPqhm2RkjkmovajW62vFgmLDj0Ty5kz-tBFswJ6vYrrersc7k55ujSzELQnOHG7ryijogKUSCsy2F_W8v4EFRsYdrJN_z8AUDAg-PmwAAAA&shmds=v1_AUFQtOOwUq8q6INTG9jSc-Pp0Vd-FBcnKwwmNzplM_PZP71Iag&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ir022lGATu3apQoNAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Harrogate, Yorkshire\n\nEclipse IT Recruitment\n\niOS Developer\n\nOur clients are on the lookout for an iOS Developer to join our welcoming team of in-house Developers and Designers.\n\nAs a valued team member, you’ll play a crucial role in crafting apps and conceptualising innovative features for integration into our existing Swift and RxSwift codebase. Our apps cater to a user base exceeding half a million monthly visitors, and we’re ambitiously aiming to double that figure in the near future.\n\nGiven the importance of performance, our apps undergo periodic reviews to identify opportunities for enhancement. You’ll be tasked with addressing any issues uncovered during testing and user feedback sessions.\n\nJoining a compact team of developers, you’ll have the support and collaboration needed to thrive, empowering you to take ownership of your projects and stay self-motivated.\n\nKey Responsibilities:\n• Strong storyboard skills (Xcode)\n• Effective communication skills, comfortable asking questions when needed\n• Proficiency in iOS development using Swift\n• Experience with other languages and IDEs, especially RxSwift/RxJava/Kotlin/Android is a bonus\n• Commitment to quality with a meticulous approach to work\n• Experience working with APIs\n• Ability to collaborate within a team\n• Strong written and spoken English\n\nWhy Us?\n• Additional day of annual leave for each full year of service, up to 5 days\n• Work-from-home on a Friday\n• A friendly team of website designers, developers, and digital marketers\n• Centrally located modern office\n• Casual dress code\n• Acknowledged expertise in the field\n• Flexible start times\n• On-site parking available\n\nYou must have a right to work in the UK. No sponsorship is offered for this role",
            "apply_options": [
                {
                    "title": "Design Job Board",
                    "link": "https://www.designjobboard.co.uk/job/ios-developer-28/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJJb3MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiRWNsaXBzZSBJVCBSZWNydWl0bWVudCIsImFkZHJlc3NfY2l0eSI6IkhhcnJvZ2F0ZSwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImlyMDIybEdBVHUzYXBRb05BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "4 x iOS Developer - 1 day onsite - Inside IR35 - £410 per day",
            "company_name": "RecOps",
            "location": "London, United Kingdom",
            "via": "JobNet UK",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=ezrWES7McL0LCGzNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOSwrCQBBEcesRXNVaNPGTbHQriB8IRLIOk0yTjCTTQ3qQeB7v4AE8mZNNUQ9eQc2_s3mRYITJHjjRizp2NGCNLbR6g60YTwEvoWjCJd-ngX6fZLvBJE7SGleuIKSGug0LnJmbjhbH1nsnhzgW6aJGvPKmjmruY7ZU8Rg_uZIpSmnVQK5TnspduhkjZ5slcqozJzAWd7aa7QqFDVc0bsY2mvs__mJK1rkAAAA&shmds=v1_AUFQtONNzGZoANsAVJtVeRJf3PrElhBQF24wIE0RJDX5ZMOZYA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ezrWES7McL0LCGzNAAAAAA%3D%3D",
            "extensions": [
                "14 days ago",
                "£410 a day",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "14 days ago",
                "salary": "£410 a day",
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "RecOps is partnered with a boutique consultancy to provide iOSDevelopers for a national media giant in London.\n\nThis role would be inside IR35 with 1 days per week onsite, ideally, you can interview & start the role in January.\n\nIdeally, you will have some of the following skills:\n• Swift,\n• ObjectiveC,\n• TSS,\n• SwiftUI,\n• Github\n• x -code\n\nWeb Reference : AJM/403013819-4\nPosted Date : Mon, 30 Dec 2024",
            "apply_options": [
                {
                    "title": "JobNet UK",
                    "link": "https://www.jobnet.co.uk/job-in-London-GBR/4-X-IOS-DEVELOPER-1-DAY-ONSITE-INSIDE-IR35-410-PER-DAY-ce308a5c284129f046/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Entire Jobs",
                    "link": "https://www.entirejobs.co.uk/job-in-London-GBR/4-X-IOS-DEVELOPER-1-DAY-ONSITE-INSIDE-IR35-400-PER-DAY-29dc3f3e714b7646cc/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiI0IHggaU9TIERldmVsb3BlciAtIDEgZGF5IG9uc2l0ZSAtIEluc2lkZSBJUjM1IC0gwqM0MTAgcGVyIGRheSIsImNvbXBhbnlfbmFtZSI6IlJlY09wcyIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6ImV6cldFUzdNY0wwTENHek5BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "iOS Engineer - REMOTE",
            "company_name": "Insight Global",
            "location": "Westbury, United Kingdom",
            "via": "Insight Global",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=IdVjiod85qepPTHmAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXGvQrCMBAAYFz7CE43l9qK4KJzKSpS8AfHkrRHEknvSu6E-iS-rrp8fNlnkRWhvUJNLhBighVc6nN7q385sgVBk3oPTNAwu4jLvVedZFdVIrF0okZDX_Y8Vkxoea6ebOVPJ94knKJR7Dbb9VxO5PL8QBKcV2giWxMhEDxQ1L7Su4A7BcUBToHcwOMXS6sK6poAAAA&shmds=v1_AUFQtOO5rtEEhZsLoEOnmDCa-Y1zVXJfKWbx5njt9MkVHkEZgA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=IdVjiod85qepPTHmAAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Our healthcare insurance client is hiring an iOS Developer. This is a 6 month contract with an option for extensions. This will be remote work from home. We are recruiting candidates who live in Brazil and are offering $25.00/hour USD.\n\nThis role is to help support a large mobile initiative to create a super app! This is a UI redesign and refresh. We are looking for a iOS Developer with very strong SwiftUI experience.\n\nWe are a company committed to creating diverse and inclusive environments where people can bring their full, authentic selves to work every day. We are an equal opportunity/affirmative action employer that believes everyone matters. Qualified candidates will receive consideration for employment regardless of their race, color, ethnicity, religion, sex (including pregnancy), sexual orientation, gender identity and expression, marital status, national origin, ancestry, genetic factors, age, disability, protected veteran status, military or uniformed service member status, or any other status or characteristic protected by applicable laws, regulations, and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application or recruiting process, please send a request to HR@insightglobal.com.\n\nTo learn more about how we collect, keep, and process your private information, please review Insight Global's Workforce Privacy Policy: https://insightglobal.com/workforce-privacy-policy/ .",
            "apply_options": [
                {
                    "title": "Insight Global",
                    "link": "https://jobs.insightglobal.com/find_a_job/rhode-island/job-361540/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRW5naW5lZXIgLSBSRU1PVEUiLCJjb21wYW55X25hbWUiOiJJbnNpZ2h0IEdsb2JhbCIsImFkZHJlc3NfY2l0eSI6Ildlc3RidXJ5LCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiSWRWamlvZDg1cWVwUFRIbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "CWM - Digital Storefront - Lead iOS Developer",
            "company_name": "Goldman Sachs",
            "location": "London, United Kingdom",
            "via": "Adzuna",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=F4FGpNdqhY8e4TamAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXIsQrCMBAAUFz7CU63CaKNCC46WihoxaGIY0mbM4mkdyE5pB_lR1qXN7ziuyiq8_MGW6i89aIDtMIJX4lJ5mxQG_D3Fir8YOCIac4L95BRp8EBE9TMNuDy5ERiPiqVcyhtFi1-KAceFRP2PKk39_lPl51OGIMW7PaH3VRGsutVzcGMmqDVg8vgCRomw7SBB3lBA1dP1vD4AxeLn6-vAAAA&shmds=v1_AUFQtOOC2ePCQaC16ByXj7Mb_rUz_-99HmPfp1FzXv5co4SayQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=F4FGpNdqhY8e4TamAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fbc1b31e3d100f4c17/images/85b951192e48136cec631620f00488a08661b177a221602f486c744e06344139.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Consumer and Wealth Management (CWM)\n\nConsumer and Wealth Management brings innovative solutions to traditional banking activities. We are a global team of lenders, investors, risk managers, skilled marketers, web experts and banking specialists. We provide a suite of solutions to help our customers meet their personal financial goals. We make direct investments in, and risk manage, a portfolio of corporate loans and securities. And we help transform distressed communities through investments and loans of private capital.\n\nConsumer Banking\n\nOur Consumer business, Marcus by Goldman Sachs, serves millions of customers across multiple products including lending, deposits, and financial tools. Our goal is to build a leading consumer digital-banking platform and to do this we have two self-reinforcing consumer strategies: direct, where we serve consumers through Marcus, and embedded, where we deliver our products through partner ecosystems. Our partners include Apple, GM, Amazon, Walmart, and Jet Blue and we are in active dialogue with additional companies operating in the consumer economy.\n\nHOW YOU WILL FULFILL YOUR POTENTIAL\n• We are actively seeking a motivated iOS lead with proven industry experience of leading the delivery of mobile apps\n• The ideal candidate will be responsible for inspiring top performance for their team and demonstrate very strong leadership and technical capabilities\n• They will demonstrate in-depth understanding of architecting, developing and deploying high-volume, multi-tiered, mobile applications\n• They will have a flexible attitude and will work closely with engineers, UX and product designers to deliver delightful mobile user experiences\n• They should be comfortable working with Agile processes with an emphasis on quality and collaboration and be eager to influence the processes adopted by the team\n• The candidate will get to work with modern technologies, such as Swift, RESTful web services, OAuth 2.0, and will utilize them to build cutting-edge software that will include advance data visualizations\n• Knowledge of Consumer Finance is not essential but experience in any of these areas may provide a candidate with some advantage\n• Clear verbal and written communication skills will be crucial since the candidate must be able to gather requirements as well as influence and gain consensus for their designs with the global technology team\n\nSKILLS AND EXPERIENCE WE ARE LOOKING FOR\n• Bachelor in Software Engineering, Computer Science or the equivalent in demonstrable work experience\n• At least 3 years of experience managing software engineering teams\n• 5+ years of practical experience in developing high quality software\n• Extensive experience in mobile/ iOS development\n• Appreciation of design and knowledge of Apple HIG (human interface guidelines)\n• Passion for quality and attention to detail\n• Strong opinions loosely held\n\nPreferred Qualifications\n• Active on Github or StackOverflow\n• Experience with Realm is preferred\n• Experience with Cocopods and/or Carthage is preferred\n\nABOUT GOLDMAN SACHS\n\nAt Goldman Sachs, we commit our people, capital and ideas to help our clients, shareholders and the communities we serve to grow. Founded in 1869, we are a leading global investment banking, securities and investment management firm. Headquartered in New York, we maintain offices around the world.\n\nWe believe who you are makes you better at what you do. We're committed to fostering and advancing diversity and inclusion in our own workplace and beyond by ensuring every individual within our firm has a number of opportunities to grow professionally and personally, from our training and development opportunities and firmwide networks to benefits, wellness and personal finance offerings and mindfulness programs. Learn more about our culture, benefits, and people at GS.com/careers.\n\nWe’re committed to finding reasonable accommodations for candidates with special needs or disabilities during our recruiting process. Learn more: https://www.goldmansachs.com/careers/footer/disability-statement.html\n\n© The Goldman Sachs Group, Inc., 2020. All rights reserved.\nGoldman Sachs is an equal employment/affirmative action employer Female/Minority/Disability/Veteran/Sexual Orientation/Gender Identity",
            "apply_options": [
                {
                    "title": "Adzuna",
                    "link": "https://www.adzuna.co.uk/jobs/details/2259533561?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJDV00gLSBEaWdpdGFsIFN0b3JlZnJvbnQgLSBMZWFkIGlPUyBEZXZlbG9wZXIiLCJjb21wYW55X25hbWUiOiJHb2xkbWFuIFNhY2hzIiwiYWRkcmVzc19jaXR5IjoiTG9uZG9uLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoiRjRGR3BOZHFoWThlNFRhbUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "SWE - Applied Machine Learning Engineer, Developer Publications",
            "company_name": "Apple",
            "location": "London, United Kingdom",
            "via": "Careers At Apple",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=40g9vQJQiaDVxDUAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOQQrCMBBFcdsjuHHWUhsR3OhKsAhaQRB1WdJ0SCLpTEii9GSez3Tz4cN78IrfrHjeXzWs4OC9s9jDVSpjCaFBGciShpp0_hhKOOIXHXsMcPt0ziqZLFPM7pk7iJlXBpjgxKwdzvcmJR93QsToKh1TplWleBBM2PEo3tzFadpoZEDvZMJ2s12PlSe9XEw5CJagYeqZSniQTTnvkpN6Hv7qdxkYuQAAAA&shmds=v1_AUFQtOOuQ9vmqiaEbrjQydGPiRJ6WFBLZxRdYU5vh9Dh-vkEUg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=40g9vQJQiaDVxDUAAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fbc1b31e3d100f4c17/images/85b951192e48136c1504d1bcffcf6a10713555dad48903e1261b712b3eb6f39d.gif",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Summary\nPosted: Sep 9, 2024\nWeekly Hours: 35\nRole Number:200565354\n\nApple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nOur developer documentation department seeks a creative engineer who has a robust knowledge of large language models (LLMs), generative AI, and experience with code generation. Our ideal candidate has the ability to fine-tune pre-trained models, and work collaboratively in a multi-discipline team. Strong engineering fundamentals and a passion for code generation models are required.\n\nDescription\n\nDescription\nAs an Applied ML Engineer in the Developer Publications Intelligence team, you will join a multi-discipline team of passionate engineers to design, fine-tune, and produce models that will be used by existing and future tools produced by Apple for third-party developers. We are looking for exceptional candidates to help define the future of Swift code generation in our tools and beyond. Your role is to ensure Apple and our third-party developers using Xcode deliver extraordinary software products to millions of customers around the world!\n\nYour duties will include:\n- Fine-tuning models and making them available for engineers to evaluate and define further experiments\n- Actively engaging in all aspects of model development, from ideation, training, experimentation to deployment\n- Collaborating with data collection, model evaluation, and tool integration teams to develop and implement model solutions\n- Developing and maintaining frameworks and tools to help facilitate the model fine-tuning process\n\nMinimum Qualifications\n\nMinimum Qualifications\n• Proficiency using open-source ML toolkits and frameworks (e.g., PyTorch, TensorFlow, OpenNMT)\n• Strong programming skills (Python, C/C++, Swift, or other language)\n\nKey Qualifications\n\nKey Qualifications\n\nPreferred Qualifications\n\nPreferred Qualifications\n• BS, MS or PhD in Computer Science, Artificial Intelligence, or Machine Learning (or equivalent experience)\n• Experience with Machine Learning (ML), with a particular focus on Large Language Models (LLM) that generate code\n• Proven ability to comprehend, interpret, and apply cutting-edge research into customer-oriented products, particularly developer tools\n• Comprehensive knowledge and hands-on experience with fine-tuning approaches, model recipes, and training models\n• Experience adapting re-trained LLMs for downstream tasks\n• Experience using Xcode to build software for Apple’s platforms\n• Proficiency with the Swift programming language\n• Proficiency with Apple’s development APIs (SwiftUI, Foundation, etc)\n• Comfortable working cross-functionally, bringing together multiple disciplines and expertise\n\nEducation & Experience\n\nEducation & Experience\n\nAdditional Requirements\n\nAdditional Requirements\n\nMore",
            "apply_options": [
                {
                    "title": "Careers At Apple",
                    "link": "https://jobs.apple.com/en-us/details/200565354/swe-applied-machine-learning-engineer-developer-publications?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Totaljobs",
                    "link": "https://www.totaljobs.com/job/swe-applied-machine-learning-engineer-developer-publications/apple-job103956461?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Karkidi",
                    "link": "https://www.karkidi.com/job-details/82438-swe-applied-machine-learning-engineer-developer-publications-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Indeed",
                    "link": "https://uk.indeed.com/viewjob?jk=db818f3c68bd7896&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/a1b87152e9e13153678c451711b990a5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.co.uk/job-listing/swe-applied-machine-learning-engineer-developer-publications-apple-JV_IC2671300_KO0,60_KE61,66.htm?jl=1009595508114&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.com/job-listing/swe-applied-machine-learning-engineer-developer-publications-apple-JV_IC2671300_KO0,60_KE61,66.htm?jl=1009595508114&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Taro",
                    "link": "https://www.jointaro.com/jobs/apple/swe-applied-machine-learning-engineer-developer-publications/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTV0UgLSBBcHBsaWVkIE1hY2hpbmUgTGVhcm5pbmcgRW5naW5lZXIsIERldmVsb3BlciBQdWJsaWNhdGlvbnMiLCJjb21wYW55X25hbWUiOiJBcHBsZSIsImFkZHJlc3NfY2l0eSI6IkxvbmRvbiwgVW5pdGVkIEtpbmdkb20iLCJodGlkb2NpZCI6IjQwZzl2UUpRaWFEVnhEVUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lPVlc1cGRHVmtJRXRwYm1ka2IyMCJ9"
        },
        {
            "title": "Senior IOS Developer - Contract",
            "company_name": "DigiTech Resourcing",
            "location": "United Kingdom",
            "via": "Jobs",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=ksXVFSsHN9dzhSTEAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWMsQrCMBBAce0nON3iItiIoIOOFkQdBKtzSdMjjaR3IXdKP8aPtS6P95ZXfGfFrkYKnOF8q6HCD0ZOmGEFRybN1umkF25B0GbXAxOcmH3E-aFXTbI3RiSWXtRqcKXjwTBhy6N5cSt_NNLbjClaxWazXY9lIr9cVMGHB07DOwq_swvkIRA8KSh2cJ2y4-EH_tHytp8AAAA&shmds=v1_AUFQtOO0Nhu8duyA72aUNQiYYYLODt6-S52MEbVakJ0FvlB8Aw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=ksXVFSsHN9dzhSTEAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678505fbc1b31e3d100f4c17/images/85b951192e48136cc7a662fc770a3dd81445d64b3f9f1d7d783d61f90b877592.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Digitech are partnered with one of the most exciting tech brands to come out of the UK in the last ten years (you'll know who they are!). They have a product used by millions of customers daily and are post IPO tech unicorn. The business have a large remote engineering team across Europe and have hired some of the best in class engineers to help them build out their products. They are actively recruiting into their mobile development functions and are on the lookout for IOS contract engineers to join the team. The expectations on this position are.. Take pride in readable, well-designed, well-tested software Experience in either payments OR fingerprint biometrics/projects 6+ years of experience building iOS applications Swift and/or Objective-C experience Accomplished in scaling iOS architecture 6+ years of experience with iOS development tools like Xcode 6+ years of experience working in a cross-functional team 6+ years of Experience working with UIKit and AutoLayout You'll be working on the design and development of their mobile applications with some exciting projects in the pipeline. This is a contract opportunity with rates flexible dependent on experience. If based in the UK these roles will be INSIDE IR35 You must be based in Europe to apply for this position. Unfortunately the company will not be able to sponsor.",
            "apply_options": [
                {
                    "title": "Jobs",
                    "link": "https://jobs.uktech.news/job/senior-ios-developer-contract-eQUI4wYWOX-at-digitech-resourcing-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSU9TIERldmVsb3BlciAtIENvbnRyYWN0IiwiY29tcGFueV9uYW1lIjoiRGlnaVRlY2ggUmVzb3VyY2luZyIsImFkZHJlc3NfY2l0eSI6IlVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJrc1hWRlNzSE45ZHpoU1RFQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        },
        {
            "title": "iOS Developer, Key for Business",
            "company_name": "Amazon",
            "location": "London, United Kingdom",
            "via": "Jobrapido.com",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=uJVFGGdhh4YOaQBUAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43S21E0EEnRRCs4CDOJWmvSSS9C7ko1R_xd9Xlja_4TIq1v1zhgE8MHDGVUOMLek6wf4gnFIE5nNiAoE6tAyY4MtuA063LOcpGKZFQWck6-7ZqeVBMaHhUdzbypxGnE8agMzbL1WKsItkZ7Ab9_l2e4MzUMZVwI5-xg9qT7Xj4AmY9IWuaAAAA&shmds=v1_AUFQtOOshy3mrIqc05eAdo-WwAHJtOsc1KFOTazYwttkg0UheQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=uJVFGGdhh4YOaQBUAAAAAA%3D%3D",
            "extensions": [
                "10 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Job ID: 2787078 | AMZN Dev Cntr Poland sp. z.o.o\nHow often have you had the opportunity to be a member of a team that is tasked with solving huge everyday problems through innovative technology? Would you like to employ the Internet of Things (IoT) to transform and disrupt an entire industry? If this sounds intriguing, then we’d like to talk to you about a role on the Key for Business team tackling a set of challenges requiring significant innovation. Our patented building access technology supports Amazon Last Mile in the US and now is expanding worldwide.\nKey job responsibilities\nDuties include research, design, implementation, documentation, and maintenance of new and existing systems and the creation of software services and tools to drive the software development process towards higher quality. You will be working on cutting-edge technologies in the market today. The development will be from the concept stage to the launch stage and ensuring the highest level of quality for your deliverables.\nA day in the life:\nResponsible for the design and development of iOS mobile applications which bring smart home capabilities to our customers and provide innovative package delivery experience.\nWorking with other team members to investigate design approaches, prototype new technology and evaluate technical feasibility.\nWorking in an Agile/Scrum environment to deliver high-quality software.\nAbout the team\nYou will be part of an interdisciplinary team of hardware, firmware, software (mobile, backend and frontend), and system engineers to develop and integrate cutting-edge technologies from IoT, wireless and cloud computing into pragmatic solutions for package transportation, logistics, and delivery. Your solutions will guide drivers to deliver packages at the right place, right time, to the right person. Above all, your applications will be deployed in scale to help Amazon delivery exceed customer expectations.\nBASIC QUALIFICATIONS\nBachelor’s degree in Computer Science, Computer Engineering or related field.\nMobile application development experience with iOS.\nDevelopment experience in Swift/Objective C environments.\nComputer Science fundamentals in object-oriented design, data structures, algorithm design, problem solving, and complexity analysis.\nPREFERRED QUALIFICATIONS\nMaster’s degree in Computer Science, Computer Engineering or related field.\nKnowledge of professional software engineering best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations.\nExperience with backend communication protocols using REST and JSON-RPC and device communication using Bluetooth.\nExcellence in technical communication with peers and non-technical cohorts.\nAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (https://www.amazon.jobs/en/privacy_page) to know more about how we collect, use and transfer the personal data of our candidates.\nPosted:\nDecember 20, 2024 (Updated 6 days ago)\nPosted:\nAugust 8, 2024 (Updated 12 days ago)\nPosted:\nDecember 17, 2024 (Updated 15 days ago)\nPosted:\nJune 11, 2024 (Updated 19 days ago)\nPosted:\nAugust 6, 2024 (Updated 20 days ago)\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\n#J-18808-Ljbffr",
            "apply_options": [
                {
                    "title": "Jobrapido.com",
                    "link": "https://uk.jobrapido.com/jobpreview/7555345234603802624?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jora UK",
                    "link": "https://uk.jora.com/job/iOS-Developer-1be9aeae9b044dd65afd0e11551ea663?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "The BIG Jobsite",
                    "link": "https://www.thebigjobsite.com/details/EA6D2C62BEE5753C05D3EAC878A01B82/ios-developer--key-for-business?source=attbus&utm_source=googlejobs&utm_medium=api2&key=87EA872ADD3197C23D7546F8D7814BA1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Learn4Good",
                    "link": "https://www.learn4good.com/jobs/london/uk/info_technology/3844746542/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyLCBLZXkgZm9yIEJ1c2luZXNzIiwiY29tcGFueV9uYW1lIjoiQW1hem9uIiwiYWRkcmVzc19jaXR5IjoiTG9uZG9uLCBVbml0ZWQgS2luZ2RvbSIsImh0aWRvY2lkIjoidUpWRkdHZGhoNFlPYVFCVUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU9WVzVwZEdWa0lFdHBibWRrYjIwIn0="
        },
        {
            "title": "Experienced iOS Developer",
            "company_name": "AJ Bell Management Limited",
            "location": "London, United Kingdom",
            "via": "BeBee",
            "share_link": "https://www.google.com/search?ibp=htl;jobs&q=iOS+developer&htidocid=Sg14Av1LeWCCjXGRAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x3NsQrCMBCAYVz7CE43izZFdNFJUYRacRDnkiZHGknuQnNIX8j31Lr8w7f8xWdWVOcx4eCRDFrw9wec8I2BfwYrqLmDjHowPTDBhdkFnO97kZR3SuUcSpdFizel4aiYsONRvbjLU9rc6wFT0ILteluNZSK32BxqOGIIcNOkHUYkgcZHL9OdoGGyTEt40l-unpzl-AV7Ij0bqAAAAA&shmds=v1_AUFQtOOR1VPbv-JgtXkLeWx9ehW0Rr9ahw8FfxF0hmNPVtmTPw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=Sg14Av1LeWCCjXGRAAAAAA%3D%3D",
            "extensions": [
                "2 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "2 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "We are now searching for a mid-level product-centric iOS engineer to help us achieve our mission of making investing easier for all. We strive to deliver award-winning apps that delight our users by creating exceptional user experiences and user interfaces.\nAbout the Role\n\nAs a pivotal member of our small, highly-focused mobile application development team, you will be responsible for delivering against key company goals by developing, shaping, and iterating our customer-facing iOS applications.\n• Translate designs and wireframes into high-quality code and beautiful products.\n• Design, build, and maintain high-performance, reusable, and reliable Swift and Objective-C code.\n• Ensure and strive for the best possible performance, quality, and responsiveness of the application.\n• Help maintain code quality, organization, and automation.\n• Experience in developing consumer-facing, high-performance iOS applications using Swift and Objective-C.\n• Knowledge of Kotlin Multiplatform is advantageous.\nAbout Us\n\nAJ Bell is one of the fastest-growing investment platform businesses in the UK, offering an award-winning range of solutions for everyone. Our customers trust us with their investments, and we aim to make investing easier, helping people take control of their financial futures.\nBenefits\n\nWe offer a competitive salary and benefits package, including:\n• Starting holiday entitlement of 25 days, increasing up to 31 days with length of service.\n• Holiday buy and sell scheme.\n• A choice of pension schemes with matched contributions up to 6%.\n• Discretionary bonus scheme.\n• Annual free share awards scheme.\n• Health Cash Plan – provided by Medicash.\n• Discounted private healthcare scheme and dental plan.\n• Free gym membership.\n• Employee Assistance Programme.\n• Sick pay+ pledge.\n• Enhanced maternity, paternity, and shared parental leave.\n• Loans for travel season tickets.\n• Charitable giving opportunities through salary sacrifice.\n• Ongoing technical training.\n• Peer recognition scheme, with rewards including restaurant and shopping vouchers or time off.\n\nOur company values diversity and inclusion and does not discriminate on the basis of race, sex, gender identity, sexual orientation, age, pregnancy, religion, physical and mental disability, marital status, and any other characteristics protected by the Equality Act 2010.\n\nEstimated Salary: £60,000 - £80,000 per annum, depending on experience.",
            "apply_options": [
                {
                    "title": "BeBee",
                    "link": "https://gb.bebee.com/job/85c7fe04da8776f61525bece1640d077?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJFeHBlcmllbmNlZCBpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiQUogQmVsbCBNYW5hZ2VtZW50IExpbWl0ZWQiLCJhZGRyZXNzX2NpdHkiOiJMb25kb24sIFVuaXRlZCBLaW5nZG9tIiwiaHRpZG9jaWQiOiJTZzE0QXYxTGVXQ0NqWEdSQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJT1ZXNXBkR1ZrSUV0cGJtZGtiMjAifQ=="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzc0NDb3dDUVVwSE9VcHJUbkJLU2pnd2IyVkxTRTUyT0RFemNXMWpPVW93YmxwVmVXeDFiVUkzUXpGVlZqbHhlblEyVkVKTFVscEdYMnB4U2sxeVpERk1ibkp0T0hGbE5GZG9NakZ3VVZsTlFsQjVRVkJaZFVWMlFYZElabUZxTkdOU1pIRklRa2xGVldSUmNuZG1VbmRQYjBvd2NsZFpZMFpOYTNGQlJYZHZYMVp3ZUVSbFpDMUJXREZ3WTJsaU5uSXdRMFZ4VG1oSGJIWnJkMlZ1TTFoU1NVWktkV2d5ZGpKYVYyZDZOa3RaWTB0alRqZFZXRlZRVjIxQldIUkNVR05EUjBGWmJtZHpiRWMyYWxNM2NXeG9jbkF0Y0ZaSVFrUkZXVzVOYldNMmNVVm9jR2xuVjJFd2NTMXBUbVZIU1RGaE0yNHRlbkJhVDBoMFZWVkdRVTlRWmxVeFVVbDFNRXhpV2tSclREaHBReElXTFhkWFJsbzBUMmhPZG1sUmQySnJVRjlLVTJOTlFSb2lRVVpZY2tWamNuZFpMV3QxUzFaR1JIWlpPVXhFVVZaYWNXWlRNMGcwU21jd1p3IiwiZmN2IjoiMyJ9",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.com&location=United+Kingdom&next_page_token=eyJmYyI6IkVzc0NDb3dDUVVwSE9VcHJUbkJLU2pnd2IyVkxTRTUyT0RFemNXMWpPVW93YmxwVmVXeDFiVUkzUXpGVlZqbHhlblEyVkVKTFVscEdYMnB4U2sxeVpERk1ibkp0T0hGbE5GZG9NakZ3VVZsTlFsQjVRVkJaZFVWMlFYZElabUZxTkdOU1pIRklRa2xGVldSUmNuZG1VbmRQYjBvd2NsZFpZMFpOYTNGQlJYZHZYMVp3ZUVSbFpDMUJXREZ3WTJsaU5uSXdRMFZ4VG1oSGJIWnJkMlZ1TTFoU1NVWktkV2d5ZGpKYVYyZDZOa3RaWTB0alRqZFZXRlZRVjIxQldIUkNVR05EUjBGWmJtZHpiRWMyYWxNM2NXeG9jbkF0Y0ZaSVFrUkZXVzVOYldNMmNVVm9jR2xuVjJFd2NTMXBUbVZIU1RGaE0yNHRlbkJhVDBoMFZWVkdRVTlRWmxVeFVVbDFNRXhpV2tSclREaHBReElXTFhkWFJsbzBUMmhPZG1sUmQySnJVRjlLVTJOTlFSb2lRVVpZY2tWamNuZFpMV3QxUzFaR1JIWlpPVXhFVVZaYWNXWlRNMGcwU21jd1p3IiwiZmN2IjoiMyJ9&q=iOS+developer"
    }
}