{
    "3. Requirements:\nNot mentioned\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{}",
    "3. Requirements:\n• Proven experience in developing Android applications using Kotlin.  \n   • Familiarity with French language and culture.  \n   • Strong problem-solving skills and attention to detail.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Design, develop, and maintain high-performance Android apps using Kotlin.  \n   • Collaborate with cross-functional teams to identify and prioritize feature development.  \n   • Work closely with our design team to ensure seamless user experiences.": "{\n    \"languages_and_runtimes\":[\"Kotlin\"]\n}",
    "3. Requirements:\n• 5+ years of experience in native iOS development using Swift  \n   • Strong understanding of Design Patterns and Object-Oriented Design principles  \n   • Experience working with Restful APIs and implementing scalable architecture  \n   • Ability to work well in a team, self-driven, and eager to learn\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Design, develop, and deliver high-quality software using agile techniques  \n   • Develop clean, maintainable, and reliable code for our native iOS applications  \n   • Collaborate with other developers, sharing and receiving knowledge to drive continuous improvement": "{\n    \"languages_and_runtimes\":[\"Swift\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- 48 Months of experience with Apple SwiftUI framework.  \n   - 60 Months of experience with Native iOS development.  \n   - 60 Months of experience developing with the Apple Swift programming language.  \n   - 60 months experience assisting in translation of business requirements into design specifications, mockups, and user-friendly (-driven) new mobile apps.  \n   - 36 Months of experience assisting testing teams in the user acceptance testing of the system, including helping to define function scripts, business use cases etc. to test system capabilities.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{\n    \"languages_and_runtimes\":[\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"]\n}",
    "3. Requirements:\n• Proven experience in developing native Android applications.  \n   • Strong understanding of Android architecture, design patterns, and best practices for app development.  \n   • Expertise in creating secure, high-performance solutions with a focus on user experience (UX) and user interface (UI).  \n   • Knowledge of modern tools and practices, including version control systems (e.g., Git) and Agile methodologies.  \n   • Attention to detail in maintaining clean, efficient, and well-documented code.  \n   • Strong communication skills and a collaborative mindset to share knowledge and contribute to team success.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Develop high-quality native Android applications using Java and/or Kotlin.  \n   • Design and implement solutions that prioritize performance, security, and exceptional user experience.  \n   • Stay updated with and apply the latest trends and best practices in user interface and user experience design.  \n   • Maintain high code quality standards while actively sharing knowledge with the team.  \n   • Provide mentorship and guidance to junior Android developers.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"version_control\":[\"Git\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- Kotlin experience  \n   - Good experience of mobile testing processes  \n   - Very good knowledge of one platform with knowledge of at least one other  \n   - Good understanding and regular use of Branching Strategies (I.e. GitFlow)  \n   - Good understanding of build process post-PR.  \n   - Understanding of Software Architecture principles, design patterns and system design concepts.  \n   - Capable of writing unit tests and create test doubles.  \n   - Good knowledge of external tools can be used to complete RCA of issues.  \n   - Able to write good documentation and role models high standards to ensure consistency.  \n   - Actively engage with all UI/UX principles.  \n   - Demonstrate good knowledge of avoiding single dependencies and considers security issues in their general approach to work  \n   - Hands-on delivery of Mobile solutions according to the sprint backlog  \n   - Performed a suitable degree of testing against a given solution before delivery  \n   - Performed issue diagnosis using external tools to find the root cause.  \n   - Actively engaged with UI/UX where there are contradictions to Human Interface Guidelines/Material Design.  \n   - Inputting towards the overarching solution design\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Being part of feature and app development from concept through to production, utilising technical skills for app development  \n   - Proactively brings formed decisions to Senior members of the team to reinforce their ideas to ensure they are on the right track  \n   - Actively fostering collaboration with peers in the team in the interest of quality and efficiency  \n   - Working collaboratively with Engineering colleagues and leads to meet sprint  \n   - Collaborates with product owners to ensure that expectations are managed, delivering as required within the specified timelines  \n   - Ensuring tasks are prioritised correctly by making data-led decisions  \n   - Assisting POs/BAs in refining stories to ensure that they meet the teams  \n   - Presenting on the work delivered within an iteration to key stakeholders, clearly demoing the business value in language that non-technical stakeholders can understand.  \n   - Being part of continuous improvement in the team (including quality, process, teamwork, but not limited to these things) through retrospectives and other appropriate channels.  \n   - Using 10% time to increase knowledge and capability of industry-relevant technologies and practices.  \n   - Engaging in cross-skilling within teams across the stack.  \n   - Sharing knowledge across teams through suitable channels (blogs, lightning talks, demos, workshops)  \n   - Documenting solutions and projects to an appropriate level including technical diagrams, associated links and technical notes.": "{\n    \"languages_and_runtimes\":[\"Kotlin\"],\n    \"architectural_patterns\":[\"GitFlow\"],\n    \"documentation_and_knowledge_sharing\":[\"HIG\"]\n}",
    "3. Requirements:\n- You are a passionate Senior Android developer  \n   - You are proficient with Kotlin  \n   - You know and have used RxJava / reactive programming techniques  \n   - You can lead discussions on technical architecture and design  \n   - You believe that all code is legacy code if it isn't unit tested  \n   - You have hands-on knowledge in writing unit, integration and UI tests  \n   - You love agile / scrum and can work as part of a smaller cross-functional & feature focused team  \n   - You are comfortable in taking ownership of big pieces of work, from the planning phase right through to execution and delivery  \n   - You want to learn new technologies and are comfortable discussing them with your peers and upskilling others on them  \n   - You have experience mentoring other engineers and enjoy this process\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Deliver top quality projects made using best practices and guidelines  \n   - Work with our design team to implement clean design that respects the platform  \n   - Work in an agile, cross-functional team taking joint responsibility for the engineering team deliverables  \n   - Take a proactive and hands-on approach in all features and tasks": "{\n    \"languages_and_runtimes\":[\"Kotlin\",\"RxJava\"],\n    \"development_methodologies\":[\"Scrum\",\"Agile\"]\n}",
    "3. Requirements:\n• Bachelor's degree in Computer Science or closely related.  \n• 6+ years of iOS software development experience.  \n• 5 years writing software in Swift programming language.  \n• 3 year of experience building iOS UI programmatically.  \n• 3 year of experience designing and implementing local databases using SQLite.  \n• Must reside in the US\n\n4. Nice to have:\n• 3 year of Flutter software development experience.  \n• 3 year writing software in Dart programming language.  \n• Experience in mobile software CI/CD, developing iOS Bluetooth/IoT solutions, iOS security.  \n• Interest and ability to learn other coding languages as needed.\n\n5. Responsibilities:\n• Design, develop, test, deploy, maintain and improve software.  \n• Manage individual project priorities, deadlines, and deliverables.  \n• Focus on overall product quality and user experience.  \n• Take initiative and be responsible for technical solutions.  \n• Mentor and coach new engineering hires and other software engineers.": "{\n    \"languages_and_runtimes\":[\"Dart\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"Flutter\"],\n    \"data_and_caching\":[\"SQLite\"]\n}",
    "3. Requirements:\n• Proven experience in developing native iOS applications.  \n   • Strong understanding of iOS architecture, design patterns, and best practices for app development.  \n   • Expertise in creating secure, high-performance solutions focused on user experience (UX) and user interface (UI).  \n   • Knowledge of modern tools and workflows, including version control systems (e.g., Git) and Agile methodologies.  \n   • Attention to detail in writing clean, efficient, and well-documented code.  \n   • Excellent communication skills and a collaborative mindset to share knowledge and contribute to the team's success.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Develop high-quality native iOS applications using Swift and/or Objective-C.  \n   • Design and implement solutions that prioritize performance, security, and outstanding user experience.  \n   • Stay updated with and apply the latest trends and best practices in user interface and user experience design.  \n   • Ensure high code quality standards while actively sharing knowledge with the team.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"version_control\":[\"Git\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- Degree in Computer Science, Electrical Engineering, or comparable education  \n   - Strong passion for android as an ecosystem, ideally experience with implementing android apps or working on the android platform level  \n   - Ideally strong coding skills, a desire to ship clean code and document your design decisions  \n   - A desire to learn new things and the ability to understand complex systems  \n   - Good English language skills\n\n4. Nice to have:\n- Not mentioned\n\n5. Responsibilities:\n- You contribute to android platforms powering automotive infotainment systems.  \n   - You implement custom android HALs, services and SDK add-ons.  \n   - You optimize android device configurations.  \n   - You develop architectural concepts.  \n   - You regularly catch up with latest android platform technologies presented on Google’s conferences.": "{\n    \"languages_and_runtimes\":[\"Java\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- Been involved in projects from conceptualisation to release.  \n   - Heavily involved in conversation around architecture and technical roadmap.  \n   - Mentoring less-senior developers.  \n   - Experience with Kotlin, Compose, Coroutines, Flow, and MVVM architecture.\n\n4. Nice to have:\n- Exposure to integrating payment providers.  \n   - Exposure to WebViews.\n\n5. Responsibilities:\nNot mentioned": "{\n    \"languages_and_runtimes\":[\"Coroutines\",\"Flow\",\"Kotlin\"],\n    \"ui_and_cross_platform_frameworks\":[\"Compose\"],\n    \"architectural_patterns\":[\"MVVM\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"WebViews\"]\n}",
    "3. Requirements:\n• At least 3 years of experience in building Android applications;  \n   • Being passionate about software development and problem solving;  \n   • Solid experience with both Kotlin and Java;  \n   • Good knowledge of Android Studio and Android SDK;  \n   • Knowledge of software design patterns;  \n   • Experience with dependency injection (with Dagger, for ex.);  \n   • Strong skills with unit testing;  \n   • Good knowledge of MVVM architecture;  \n   • Experience with reactive programming (RxJava);  \n   • Ability to apply Continuous integration techniques;  \n   • You have strong verbal and written English language skills.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Propose and work on new solutions with respect to the technical and functional needs of a given project;  \n   • Maintain high quality of code, as well as solve appearing challenges with respect to the team guidelines and conventions;  \n   • Ensure high level of functional and technical compliance of the features with the help of unit/integration test;  \n   • Improvement of the UX;  \n   • Making sure that CI processes are followed alongside with overall availability, stability and good performance level of the application;  \n   • Being an active participant of the process of creation of prototypes and supporting innovation within Veepee;  \n   • Actively contribute to code reviews.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\",\"RxJava\"],\n    \"architectural_patterns\":[\"MVVM\"],\n    \"dependency_injection_frameworks\":[\"Dagger\"],\n    \"build_and_dependency_management\":[\"Android Studio\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\"]\n}",
    "3. Requirements:\n• Ability to design and implement iOS applications with Xcode  \n   • Proficient in Objective-C  \n   • Knowledge of REST APIs  \n   • Attention to details  \n   • Experience working collaboratively with designers\n\n4. Nice to have:\n• Experience with Phonegap, HTML5  \n   • Adept at hacking open source software  \n   • Worked with git, subversion\n\n5. Responsibilities:\nNot mentioned": "{\n    \"languages_and_runtimes\":[\"Objective-C\"],\n    \"ui_and_cross_platform_frameworks\":[\"PhoneGap\"],\n    \"build_and_dependency_management\":[\"Xcode\"],\n    \"networking_and_api\":[\"REST API\"],\n    \"version_control\":[\"git\",\"subversion\"]\n}",
    "3. Requirements:\n- Completed degree in computer science or a comparable qualification.  \n   - Several years of professional experience in iOS development with Swift and Objective-C.  \n   - Experience with HealthKit, CoreData, and API integration.  \n   - Understanding of healthcare requirements, ideally with experience in health apps.  \n   - Experience working with agile development methods (Scrum/Kanban).  \n   - Proficiency in Git and modern development tools like Xcode.  \n   - Good German and English language skills.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Development and maintenance of iOS applications in the healthcare sector.  \n   - Conceptualization, design, and implementation of new features as well as their further development.  \n   - Close collaboration with backend developers, UX/UI designers, and product management.  \n   - Ensuring high code quality through code reviews and unit tests.  \n   - Integration of interfaces (APIs) and other technologies required for healthcare apps.  \n   - Analysis and resolution of technical issues as well as optimization of app performance.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"data_and_caching\":[\"Core Data\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"HealthKit\"],\n    \"version_control\":[\"Git\"],\n    \"build_and_dependency_management\":[\"Xcode\"],\n    \"development_methodologies\":[\"Kanban\",\"Scrum\"]\n}",
    "3. Requirements:\n• 3-5+ years Objective C & Swift programming skills experience required along with a relevant 3rd level qualification  \n   • Proven experience developing and debugging mobile applications.  \n   • Understanding of the iOS operating system and programming environments.  \n   • Strong coding skills with proven ability to write well documented, maintainable, and testable code.  \n   • Excellent problem-solving skills and the ability to demonstrate logical troubleshooting steps when working on software bugs  \n   • A genuine passion and interest in technology and software development with a thorough knowledge of best practices and new technologies.  \n   • Self-management skills, particularly in respect to prioritization and execution  \n   • Detail-oriented individual with the ability to rapidly learn and take advantage of new concepts, business models, and technologies.  \n   • Have the ability to communicate technical concepts to non-technical people.\n\n4. Nice to have:\n• Unit Test driven development  \n   • Bluetooth classic or BLE development  \n   • Experience with networking and client-server integration  \n   • Experience with SwiftUI  \n   • Sensor integration  \n   • Examples of Apps on the App Store\n\n5. Responsibilities:\n• Design – working with Product Management, Project Management and end user stories on new product design architecture.  \n   • Development – taking designs and making them happen. Writing and testing code using strict development methodologies including code reuse, maintainability, testing and documentation.  \n   • Building high volume platforms - linking millions of users worldwide at the same time.  \n   • Quality Assurance – developing test cases in line with best practice methodology.  \n   • Project Environment - Working in a cross-functional agile team to develop features with collaboration across the software stacks.": "{\n    \"languages_and_runtimes\":[\"Objective C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"BLE\"],\n    \"development_methodologies\":[\"Agile\",\"TDD\"]\n}",
    "3. Requirements:\n- We are looking for a passionate iOS developer who can create an infrastructure for iOS app development and lead the whole process.  \n   - Collaborate with cross-functional teams of talented engineers to define, design, and develop new features for next-generation applications. Also, they will be responsible for designing and developing top-notch applications for the iOS platform, unit-testing code.  \n   - Maintain a stable production environment and ensure issues are resolved in a timely manner.  \n   - Bachelor’s or Master’s degree in Computer Science, Statistics, Mathematics, or Information Systems, or Progressive experience in Computer Science with experience in the development of applications.  \n   - Demonstrable experience in successfully supporting SaaS and IaaS products.  \n   - At least 7+ years’ experience designing, developing, maintaining, architecting, and developing multi-tier internet-facing applications, and APIs.  \n   - Proven experience as an app developer.  \n   - Proficient in Objective-C, Swift, and Cocoa Touch.  \n   - Extensive experience with iOS Frameworks such as Core Data and Core Animation.  \n   - Knowledge of iOS back-end services.  \n   - Knowledge of Apple’s design principles and application interface guidelines.  \n   - Proficient in code versioning tools including Mercurial, Git, and SVN.  \n   - Knowledge of C-based libraries.  \n   - Familiarity with push notifications, APIs, and cloud messaging.  \n   - Experience with continuous integration.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Designing and building mobile applications for Apple’s iOS platform.  \n   - Experience with full-cycle mobile app development in iOS.  \n   - Collaborating with the design team to define app features.  \n   - Ensuring quality and performance of the application to specifications.  \n   - Identifying potential problems and resolving application bottlenecks.  \n   - Collaborate with cross-functional teams to deliver data-driven insights and contribute to evidence-based decision-making processes.  \n   - Maintaining the code and atomization of the application.  \n   - Designing and implementing application updates.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"Cocoa Touch\"],\n    \"data_and_caching\":[\"Core Animation\",\"Core Data\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Push Notifications\"],\n    \"version_control\":[\"Git\",\"Mercurial\",\"SVN\"]\n}",
    "3. Requirements:\n- Proven experience as an Android Developer with a strong portfolio of Android applications developed and published on the Google Play Store.  \n   - Solid understanding of Java/Kotlin programming languages and object-oriented design principles for building robust and scalable Android applications.  \n   - Hands-on experience with Android development tools and frameworks such as Android Studio, Gradle, and Retrofit.  \n   - Knowledge of RESTful APIs, JSON/XML parsing, and asynchronous programming techniques for integrating backend services into Android applications.  \n   - Proficiency in using Git for version control, including branching, merging, and resolving conflicts in code repositories.  \n   - Excellent problem-solving skills and attention to detail, with a proactive approach to identifying and resolving technical challenges in Android app development.  \n   - Strong communication and collaboration skills, with the ability to effectively interact with team members and stakeholders to discuss requirements, propose solutions, and provide updates on project status.  \n   - Bachelor's degree in Computer Science, Engineering, or a related field.\n\n4. Nice to have:\n- Experience with cross-platform mobile development frameworks such as Flutter or React Native.  \n   - Knowledge of cloud services and technologies for mobile app development, such as Firebase or AWS Mobile Hub.  \n   - Familiarity with Agile methodologies and practices, including Scrum or Kanban.  \n   - Contributions to open-source projects or participation in Android developer communities.  \n   - Relevant certifications or training in Android app development or related areas.\n\n5. Responsibilities:\n- Design, develop, and maintain high-quality Android applications that meet business requirements and user expectations.  \n   - Collaborate with cross-functional teams including product managers, designers, and backend developers to define, design, and deliver new features.  \n   - Implement UI/UX designs following best practices and guidelines to ensure a consistent and intuitive user experience.  \n   - Integrate RESTful APIs and third-party libraries/services to enable seamless data exchange and functionality within the Android applications.  \n   - Optimize application performance and responsiveness, considering factors such as battery consumption, network bandwidth, and device compatibility.  \n   - Conduct thorough testing of Android applications, including unit testing, integration testing, and user acceptance testing, to ensure reliability, security, and scalability.  \n   - Stay updated with the latest trends, technologies, and best practices in Android app development, and apply them to enhance the quality and functionality of the applications.  \n   - Participate in code reviews, knowledge sharing sessions, and continuous improvement initiatives to foster a collaborative and learning culture within the development team.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"ui_and_cross_platform_frameworks\":[\"Flutter\",\"React Native\"],\n    \"build_and_dependency_management\":[\"Android Studio\",\"Gradle\"],\n    \"networking_and_api\":[\"Retrofit\"],\n    \"backend_or_baas_integration\":[\"AWS Mobile Hub\",\"Firebase\"],\n    \"version_control\":[\"Git\"],\n    \"development_methodologies\":[\"Agile\",\"Kanban\",\"Scrum\"]\n}",
    "3. Requirements:\n- ... are passionate about creating and delivering high quality, well tested software  \n   - ... are experienced in building mobile applications with Swift  \n   - … are experienced in writing unit tests wit the XCTest Framework  \n   - … are experienced in working with REST APIs and OpenAPI documentation  \n   - … are able to integrate REST APIs and WebSockets into the application  \n   - … identify and address performance bottlenecks and troubleshoot application issues  \n   - … are able to apply security best practices and protect against OWASP top 10 vulnerabilities  \n   - ... are detailed, flexible & organized  \n   - ... are analytical with a problem solving mindset  \n   - ... are an active contributor in a fun, motivated & growing team!  \n   - ... have a positive mindset and you are result driven  \n   - ... are excellent in Dutch & English, speaking & writing  \n   - ... have a Bachelor in Informatics or equivalent through experience\n\n4. Nice to have:\n- … have experience in Objective - C and SwiftUI this is a plus\n\n5. Responsibilities:\n- You will be working closely with your Product Owner, UX designer & other engineers and developers to translate new features into code in an Agile workflow to help grow our business and keep our customers happy!  \n   - Your task mainly consists of analyzing, developing and programming the AVIOBOOK software.  \n   - In addition, you will participate in analyzing inquiries from internal and external parties and developing and implementing (partial) functions within the AvioVision software related to them.  \n   - Furthermore you will be expected to support younger software developers in their tasks and you will be responsible for following up and reading internal and external documents to gain and further build knowledge regarding the functionalities of the AvioVision Software and component or integrations parts thereof.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"],\n    \"networking_and_api\":[\"REST API\",\"WebSockets\"],\n    \"security_and_cryptography\":[\"OWASP\"],\n    \"testing_frameworks\":[\"XCTest\"],\n    \"documentation_and_knowledge_sharing\":[\"OpenAPI\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n• Great English skills for effective communication with international teams  \n   • Fluent Hungarian language knowledge is highly valued  \n   • Experience in Objective-C based iOS development  \n   • Proficiency in Swift programming language  \n   • Familiarity with iOS frameworks such as UIKit, Core Data, Core Animation, etc.  \n   • Experience with offline storage, threading, and performance tuning  \n   • Familiarity with RESTful APIs to connect iOS applications to back-end services  \n   • Understanding of Apple's design principles and interface guidelines  \n   • Experience working with Cocoapods and open-source libraries  \n   • Experience with performance and memory tuning using Instruments tool  \n   • Familiarity with cloud message APIs and push notifications  \n   • Solid understanding of application design patterns like MVC, MVVM, VIPER, etc.  \n   • Proficient understanding of Git  \n   • Familiarity with continuous integration tools like Jenkins CI\n\n4. Nice to have:\n• Knowledge of unit testing, e.g., XCTest, mock objects, etc.\n\n5. Responsibilities:\n• Apply your expertise in mobile application development on the iOS platform to improve user experience  \n   • Collaborate with cross-functional teams to design and develop solutions to challenging problems  \n   • Provide leadership to development teams and mentor junior developers by setting up standards and best practices": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"UIKit\"],\n    \"architectural_patterns\":[\"MVC\",\"MVVM\",\"VIPER\"],\n    \"build_and_dependency_management\":[\"CocoaPods\"],\n    \"data_and_caching\":[\"Core Data\"],\n    \"networking_and_api\":[\"RESTful APIs\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Core Animation\",\"Push Notifications\"],\n    \"testing_frameworks\":[\"XCTest\"],\n    \"debugging_or_profiling\":[\"Instruments\"],\n    \"version_control\":[\"Git\"],\n    \"ci_cd_and_release_automation\":[\"Jenkins\"]\n}",
    "3. Requirements:\n- BS or MS degree in Computer Science or equivalent  \n   - 2+ years experience in the software development sector/technology industry  \n   - Applications published on the App store  \n   - Familiarity and comfort with the iOS full mobile development life cycle  \n   - Great insight on system design and object-oriented programming  \n   - Logical thinker and effective communicator with a clean and efficient coding style  \n   - High level of fluency with iOS SDL (ObjectiveC & Swift) and strong understanding of Cocoa Touch and Core Data  \n   - Cooperative and collaborative working style with other individuals and development teams (especially the UI design team)\n\n4. Nice to have:\n- Deep understanding of algorithms and design pattern is a plus  \n   - Fluency and experience with other programming languages and platforms is highly desirable (React Swift, AWS, Golang, Spark, MySQL, PHP, JavaScript)\n\n5. Responsibilities:\n- Developing, integrating and deploying iOS mobile application  \n   - Supporting system testing and new version release and upgrades  \n   - Quickly learning and understanding existing software structure and code  \n   - Troubleshooting and debugging to maintain our current iOS mobile application  \n   - Creating and translating designer mock-ups and wireframes into usable code  \n   - Improving reliability, scalability, and performance of our current iOS application  \n   - Recognizing cutting-edge industry application developments and sharing them with our software development team  \n   - Producing functional new features to our iOS mobile application in order to improve our user experience": "{\n    \"languages_and_runtimes\":[\"Golang\",\"JavaScript\",\"ObjectiveC\",\"PHP\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"Cocoa Touch\"],\n    \"data_and_caching\":[\"Core Data\",\"MySQL\"],\n    \"backend_or_baas_integration\":[\"AWS\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- Very strong Kotlin experience.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Help support a large mobile initiative to create a super app.  \n   - UI redesign and refresh.": "{\n    \"languages_and_runtimes\":[\"Kotlin\"]\n}",
    "3. Requirements:\n• 10 + years of IOS Exp  \n   • UI Experience as well as backend development in Native iOS.  \n   • Objective-C and Swift  \n   • Experience working with iOS frameworks such as Core Data, Core Animation, etc.  \n   • Good Communication Skills\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"data_and_caching\":[\"Core Data\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Core Animation\"]\n}",
    "3. Requirements:\n• A HNC/D / Degree in Software Engineering (or similar) or be a Time Served Engineer with relevant experience  \n   • A good understanding of the Android architecture and ecosystem (including low-level and security)  \n   • An understanding of the Android SDK and APIs (especially telecoms and networking)  \n   • Experience with most of the following: Binder / AIDL / Services (C++/Java) / Framework APIs / NDK, JNI & CTS\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Developing, configuring, and optimizing the Android platform  \n   • Modifying the Android framework/services  \n   • Working with the Android development toolchain": "{\n    \"languages_and_runtimes\":[\"C++\",\"Java\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\",\"Android NDK\",\"Binder\",\"AIDL\",\"CTS\",\"JNI\"]\n}",
    "3. Requirements:\n- A skilled programmer who values developing and improving a single application over working on dozens of commercial tools.  \n   - Someone who would like to contribute to an innovative tool.  \n   - A positively charged personality who is not afraid of innovation, unexplored territories, and markets not yet blessed by technology.  \n   - Developers who feel at home in the world of mobile app development.  \n   - A person who is well-versed in current app development trends and has knowledge of UX for iOS.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{}",
    "3. Requirements:\n- Experience with iOS technologies and development languages/tools: Swift, Xcode, Swift Package Manager.  \n   - In-depth knowledge of Apple’s Human Interface Guidelines (HIG).  \n   - Experience integrating web services into mobile applications (REST with JSON, HTTP, HTTPS).  \n   - Familiarity with source control systems and tools (e.g., Git, SourceTree/Fork).  \n   - Ability to analyze requirements and conduct technical feasibility studies.  \n   - Proficiency with relational databases such as MySQL.  \n   - Belief in the success of our projects (which will be better explained during interviews).  \n   - Passion for technology.  \n   - Willingness and ability to invest in personal growth.  \n   - Dynamism and a multidisciplinary approach.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{\n    \"languages_and_runtimes\":[\"Swift\"],\n    \"build_and_dependency_management\":[\"SPM\", \"Xcode\"],\n    \"documentation_and_knowledge_sharing\":[\"HIG\"],\n    \"networking_and_api\":[\"REST API\"],\n    \"data_and_caching\":[\"MySQL\"],\n    \"version_control\":[\"Git\", \"SourceTree\", \"Fork\"]\n}",
    "3. Requirements:\n• Initial experience with Swift SwiftUI and Combine.  \n   • Familiarity with CocoaTouch/CocoaPods and API integration.  \n   • Experience with unit testing is advantageous.  \n   • A collaborative team player with a passion for innovative app development.  \n   • Proficiency in English OR German is required.\n\n4. Nice to have:\n• Experience with unit testing is advantageous.\n\n5. Responsibilities:\n• Develop and optimize iOS applications using Swift across the entire software lifecycle.  \n   • Collaborate with product management to design and implement innovative features.  \n   • Contribute to a seamless customer experience by working closely with frontend and backend developers in featuredriven teams.  \n   • Ensure highquality standards through automated testing and code reviews.": "{\n    \"languages_and_runtimes\":[\"Combine\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"],\n    \"build_and_dependency_management\":[\"CocoaPods\"],\n    \"ui_and_cross_platform_frameworks\":[\"Cocoa Touch\"]\n}",
    "3. Requirements:\n- Experience in developing professional iOS apps  \n   - Expert knowledge in Swift and Objective-C  \n   - Conceptual and analytical skills  \n   - Detailed knowledge of algorithms and data structures  \n   - Passion for app development and design  \n   - Fluent in English, very good German skills\n\n4. Nice to have:\n- Experience in C and C++  \n   - Experience in Android app development  \n   - Knowledge in cryptography and security\n\n5. Responsibilities:\nYou will work with our development team on the creation and enhancement of our apps, as well as the integration of our modules into our customers' apps. You will take on the technical project management for individual projects and collaborate closely with the team in agile structures. You work purposefully and independently within the team and know how to make meaningful use of your freedom.": "{\n    \"languages_and_runtimes\":[\"C\",\"C++\",\"Objective-C\",\"Swift\"],\n    \"development_methodologies\":[\"Agile\"]\n}",
    "3. Requirements:\n- Minimum 3 years of commercial experience as an Android Engineer  \n   - Experience working with Kotlin and Jetpack Compose  \n   - Experience building complex modular Android App Architecture  \n   - Experience working with Retrofit and Coroutines & Flow  \n   - Experience working with MVVM/ MVI design patterns  \n   - Experienced in integrating Android applications with back-end services using RESTful APIs\n\n4. Nice to have:\n- Preferred experience with: Unit testing, Web sockets, and Figma\n\n5. Responsibilities:\n- Actively participate in the development of assigned projects  \n   - Addressing and resolving issues identified in production systems  \n   - Conducting code reviews for pull requests submitted by team members  \n   - Developing new functionalities as outlined in user stories or assigned tasks  \n   - Monitoring and documenting progress using JIRA to track changes made  \n   - Engaging in Scrum-based work management by participating in team meetings and discussions": "{\n    \"languages_and_runtimes\":[\"Coroutines\",\"Flow\",\"Kotlin\"],\n    \"ui_and_cross_platform_frameworks\":[\"Jetpack Compose\"],\n    \"architectural_patterns\":[\"MVI\",\"MVVM\"],\n    \"networking_and_api\":[\"Retrofit\",\"REST API\",\"WebSockets\"],\n    \"collaboration_pm_and_design_handoff\":[\"Figma\",\"Jira\"],\n    \"development_methodologies\":[\"Scrum\"]\n}",
    "3. Requirements:\n• Significant experience implementing iOS applications and tools.  \n   • Good understanding of the iOS runtime.  \n   • Some experience writing tools in Python.\n\n4. Nice to have:\n• Bonus points: experience with taking apart iOS software in order to understand and/or modify it. This includes experience with Objective-C runtime APIs (ie. swizzling) and tools such as CydiaSubstrate, Frida, etc.\n\n5. Responsibilities:\n• Work with the mobile team on a set of tools we've built to statically analyze IPAs in order to find security issues. We have open-sourced parts of our iOS static analyzer at https://github.com/datatheorem/strongarm.  \n   • Improve our dynamic analyzer, which instruments mobile applications in order to study their behavior while running on a device, and detect dangerous actions that could lead to security issues.  \n   • Research and build new security checks to be added to our scanning engine, so we can help customers build more secure iOS apps.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Python\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"CydiaSubstrate\",\"Frida\"]\n}",
    "3. Requirements:\n• BS/MS degree in Computer Science, Engineering, or a related subject  \n   • Proven software development experience and Android skills development  \n   • Proven working experience in Android app development and have published at least one original Android app  \n   • Experience with Android SDK  \n   • Experience working with remote data via REST and JSON  \n   • Experience with third-party libraries and APIs  \n   • Working knowledge of the general mobile landscape, architectures, trends, and emerging technologies  \n   • Solid understanding of the full mobile development life cycle\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Design and build advanced applications for the Android platform  \n   • Collaborate with cross-functional teams to define, design, and ship new features  \n   • Work with outside data sources and APIs  \n   • Unit-test code for robustness, including edge cases, usability, and general reliability  \n   • Work on bug fixing and improving application performance  \n   • Continuously discover, evaluate, and implement new technologies to maximize development efficiency": "{\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\"],\n    \"networking_and_api\":[\"REST API\"]\n}",
    "3. Requirements:\n- 3+ years experience building mobile products on Android.  \n   - Knowledge of Kotlin or Java, Android APIs and design patterns.  \n   - You’ve published one or more apps in the Play Store.  \n   - Experience collaborating directly with product teams and designers, and the ability to deliver value to customers or users. Engineers at Intercom are pragmatists who work closely with others on cross-disciplinary teams.\n\n4. Nice to have:\n- Having experience building an Android SDK is a bonus.\n\n5. Responsibilities:\n- Collaborate on shaping our mobile strategy and roadmap across all Intercom offerings.  \n   - Owning problems end to end, working with design, product, backend engineers as well as other Android and iOS engineers to solve the biggest problems for our customers. We believe in autonomous teams and that the best mobile products are created from close collaboration across the stack, without barriers.  \n   - Help us make the right tradeoffs while being pragmatic and building for the long term.  \n   - Develop technical plans and contribute to our technical architecture as we grow.  \n   - We move fast at Intercom but building a mobile SDK demands a very high quality bar. You will help us build long-standing, well tested and reliable Android code.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\"],\n    \"distribution_and_store_operations\":[\"Google Play Console\"]\n}",
    "3. Requirements:\n• Experience developing Android applications in Java or Kotlin  \n   • Experience upgrading Android applications from Android 10 to Android 11 or higher  \n   • Experience with Android APIs, including location services, camera, notifications, and storage management  \n   • Solid knowledge of Android UI/UX best practices\n\n4. Nice to have:\n• Experience with applications that accept payment transactions  \n   • Experience working in an application support or application maintenance environment  \n   • Knowledge of mobile security best practices  \n   • Experience with SAP UltraLite databases\n\n5. Responsibilities:\n• Work with the Application Support Team to upgrade three Android 10 internal applications to function on Android 11 OS devices  \n   • Work with Application Support Team to convert three Android internal applications from Java to Kotlin  \n   • Produce or enhance technical documentation (e.g. architecture designs, functional designs, release notes, deployment documentation)  \n   • Assist with application testing and provide rework / bug fixes as necessary  \n   • Ensure quality and completeness of the project delivery  \n   • Ensure adherence to operational standards, guidelines, and regulatory requirements": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"data_and_caching\":[\"SAP UltraLite\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Camera\",\"Location\",\"Push Notifications\"]\n}",
    "3. Requirements:\n- **Qualification:** You have successfully completed a degree in computer science or a comparable qualification and bring solid professional experience.  \n   - **Skills:** You are proficient in Kotlin and/or Java and have experience in developing mobile applications.  \n   - **Work Style:** Analytical thinking, a high willingness to learn, and a solution-oriented approach define you.  \n   - **Language Skills:** You communicate confidently in German (C1) and English.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- **App Development:** You will be an integral part of our app team, developing new mobile applications using Kotlin, Jetpack Compose, and GraphQL within an MVVM Clean Architecture.  \n   - **UX/UI Implementation:** You will implement the designs of our UX/UI designers with pixel-perfect precision and attention to detail.  \n   - **Quality Assurance:** Clean code and unit tests are second nature to you, ensuring that our apps meet the highest quality standards.  \n   - **Technology Evaluation:** You stay up to date with the latest technologies and evaluate new tools and approaches with the team for potential use in our projects.  \n   - **Knowledge Sharing:** You enjoy sharing your knowledge with the team, contributing to an open and learning-oriented work culture.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"ui_and_cross_platform_frameworks\":[\"Jetpack Compose\"],\n    \"architectural_patterns\":[\"Clean Architecture\",\"MVVM\"],\n    \"networking_and_api\":[\"GraphQL\"]\n}",
    "3. Requirements:\n- For building the Android mobile apps in Omnissa we are using: Kotlin, Java, RESTful APIs, Android SDK and different versions of Android  \n   - For engineering processes and productivity tools we use Atlassian suite / Jira, Confluence, Git/, Sonar Qube or code quality and Jenkins, Bamboo for CI/CD\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- You will be joining a team of passionate innovators responsible for the Boxer mobile applications, which are an integral part of our Workspace ONE platform. Omnissa applications are used by enterprise clients, with hundreds of thousands of users relying on them daily, and they are installed on millions of mobile devices worldwide.  \n   - You’ll be part of a team that follows established Scrum and Agile processes, maintaining a high standard for code quality  \n   - You will take ownership of your work while participating in the design, development, and testing of product features and components  \n   - You will collaborate with our security and UI/UX teams to ensure that Boxer is both secure and user-friendly  \n   - As an Android mobile engineer, you will engage in code reviews and architecture reviews, contributing to the creation of a robust and scalable product.  \n   - Our products are crucial for our customers, and you will work closely with our support team to ensure that customer needs are met  \n   - You will analyze complex tasks or situations that require an in-depth evaluation of various factors": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"build_and_dependency_management\":[\"Bamboo\",\"Jenkins\"],\n    \"networking_and_api\":[\"RESTful APIs\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\"],\n    \"version_control\":[\"Git\"],\n    \"code_quality_and_static_analysis\":[\"Sonar Qube\"],\n    \"development_methodologies\":[\"Agile\",\"Scrum\"],\n    \"collaboration_pm_and_design_handoff\":[\"Confluence\",\"Jira\"]\n}",
    "3. Requirements:\n• Excellent knowledge of Android SDK  \n   • A deep experience with Kotlin, coroutines, and flows  \n   • Multiple experiences working with ExoPlayer  \n   • Experience with third-party libraries and APIs  \n   • Solid understanding of the full mobile development life cycle  \n   • Good communication skills and ability to work effectively in a small fast-paced team.  \n   • Be self-motivated to explore new technologies, apps, tools and frameworks.\n\n4. Nice to have:\n• Proven experience in developing video-based applications, with a deep understanding of video players, codecs, live streaming, and related technology  \n   • Expertise in video streaming, buffering, encoding, and decoding  \n   • Understanding of video file formats, video analysis, and metadata  \n   • Experience with video editing software and techniques is a plus  \n   • Experience with ExoPlayer cache is a plus  \n   • Basics in Design System approach  \n   • Experience with JetPack Compose\n\n5. Responsibilities:\n• Design and build advanced applications for the Android platform  \n   • Work closely with our product and design teams to customize the video experience for the Android platform  \n   • Focus on user experience, reliability, usability  \n   • Improve video playback performance and other video-related functionalities  \n   • Collaborate with cross-functional teams to define, design, and ship new features": "{\n    \"languages_and_runtimes\":[\"Kotlin\",\"Coroutines\",\"Flows\"],\n    \"ui_and_cross_platform_frameworks\":[\"Jetpack Compose\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android SDK\",\"ExoPlayer\"]\n}",
    "3. Requirements:\n• Good understanding of the Android Architecture and preferably Android-O or later  \n   • Programming experience in Kotlin  \n   • Work Experience in Android code base - Application layer and Application Framework  \n   • Work experience in Android App Development (Content providers, Receivers, Android Framework / Managers etc.)  \n   • Work experience from Mobile or other Domains also ok but Android expertise Must  \n   • Good knowledge in Android Services/Framework layer and its debugging  \n   • Good understanding of Android programming environment using Binders, Shared memory, IPC mechanisms, etc.\n\n4. Nice to have:\n• Preferably expertise in Vehicle Interface & knowledge on Infotainment systems  \n   • Preferably Application development for Android Infotainment systems covering following areas - Navigation, Connectivity (WiFi, BT), Projection (Android Auto, Carplay), Tuner (AM/FM)  \n   • Tools: GIT & Gerrit, JIRA, Android source build system, Android debugging tools.gging tools.\n\n5. Responsibilities:\n• Good understanding of the Android Architecture and preferably Android-O or later  \n   • Programming experience in Kotlin  \n   • Work Experience in Android code base - Application layer and Application Framework  \n   • Work experience in Android App Development (Content providers, Receivers, Android Framework / Managers etc.)  \n   • Work experience from Mobile or other Domains also ok but Android expertise Must  \n   • Good knowledge in Android Services/Framework layer and its debugging  \n   • Good understanding of Android programming environment using Binders, Shared memory, IPC mechanisms, etc.": "{\n    \"languages_and_runtimes\":[\"Kotlin\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Android Auto\",\"Binder\",\"CarPlay\"],\n    \"version_control\":[\"GIT\",\"Gerrit\"],\n    \"collaboration_pm_and_design_handoff\":[\"Jira\"]\n}",
    "3. Requirements:\n- 3+ years experience as Android engineer, coding with Kotlin or Java, on IoT projects.  \n   - 2+ years' experience on RESTful API client.  \n   - 2+ years experience in NoSQL databases (Firestore, MongoDB).  \n   - Experience building BLE devices, with strong understanding of BLE.  \n   - Knowledge of various wireless protocol (NFC, Lora).  \n   - A good understanding of CI/CD.  \n   - Troubleshooting experience.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- You will take on the exiting challenge to build, from the ground up, our first set of Android Embedded apps which will run on the company's Access Control devices. Laying solid foundations, you will help us shape the team and organize ourselves into powering our hardware with extremely reliable apps, ensuring smooth integration with our cloud platform and mobile apps.  \n   - On a regular day, you will work with the product manager, the mobile frontend developers (Android / iOS), the UI/UX designer, the Cloud backend developers, the IoT engineer and the CTO to bring on new features, resolve issues and propose enhancements.  \n   - You will be involved in various stages of the project, from the requirement analysis to its delivery and production. You will also be involved in contributing to improving features and the overall design of the Platform.  \n   - As a founding member of the team, you will have the opportunity to take a leadership role, whether it be as a team lead, technology advocate or driving topics that help support your colleagues, customers and the organization.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\"],\n    \"data_and_caching\":[\"Firestore\",\"MongoDB\",\"NoSQL\"],\n    \"networking_and_api\":[\"REST API\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"BLE\",\"LoRa\",\"NFC\"]\n}",
    "3. Requirements:\n- Interested in building high-quality, maintainable and testable code bases, including API design and unit testing techniques  \n   - You have a proactive attitude and take ownership for your code  \n   - Solid understanding of the full mobile development life cycle  \n   - Ability to understand business requirements and translate them into technical requirements  \n   - You are fluent in English  \n   - Eagerness to work with agile development practices (Scrum, Kanban)  \n   - You have 3+ years of experience in developing applications with Objective-C and/or Swift\n\n4. Nice to have:\n- Other languages such as C++, Python, low level programming or productivity tools is a bonus\n\n5. Responsibilities:\n- Work closely with a small, autonomous team of product owners, designers and developers to build new and innovative applications for iOS  \n   - Implement custom native user interfaces leveraging the latest iOS programming techniques and frameworks like SwiftUI and Combine  \n   - Build reusable iOS software components for interfacing with our back-end platforms (REST APIs)  \n   - Analyze and optimize your application code for quality, efficiency, and performance  \n   - Engage in rigorous code review processes  \n   - Work with your team and co-define the architecture  \n   - Continuously develop and work with an automated releases and test infrastructure  \n   - Improve tooling for general developer productivity  \n   - Become a valued member of an autonomous, multi-functional team  \n   - You have a great ability to learn, and you are eager to expand your areas of expertise  \n   - You have a strong quality approach and care for the overall performance of the product": "{\n    \"languages_and_runtimes\":[\"C++\",\"Objective-C\",\"Python\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"],\n    \"architectural_patterns\":[\"MVVM\"],\n    \"networking_and_api\":[\"REST API\"],\n    \"development_methodologies\":[\"Kanban\",\"Scrum\"]\n}",
    "3. Requirements:\n• Demonstrated skills as an Android developer, ideally with significant Kotlin and Compose experience in a production environment.  \n   • More than 3 years experience, and have worked on building and maintaining an app over a longer period of time. We have millions of users using our apps and products, so experience with software at this scale is a plus.  \n   • Experience with Agile Development, Scrum, Unit Testing, Design Patterns, CI/CD and Continuous Integration is a big asset.  \n   • The ability to work effectively within a team, communicating, and sharing knowledge along the way.  \n   • You work independently and have a willingness to share knowledge and continually develop your skill set.  \n   • You probably have an educational background within computer science (or equivalent).\n\n4. Nice to have:\n• Kotlin Multi-platform is something we are experimenting with, so experience with this is a bonus.  \n   • Experience leading a team or having the ambition to do so is a plus.  \n   • Some understanding of iOS development can also come in handy as you will be refining on features alongside developers working on the iOS version of the app you will work on.  \n   • If you play golf, that is a bonus, but not a requirement.\n\n5. Responsibilities:\n• You will be working closely with developers working on the Trackman Golf app which is the gateway into the Trackman ecosystem and allows users to connect with others, find a Trackman golf simulator or driving range, enhance their golf practice through insightful data, and have fun with games by themselves or with others.  \n   • You will join a team of skilled senior developers who love what they do and in a role where you will have an opportunity to have a big impact both on what is being built and how it is built.  \n   • We value having our developers being part of the refinement early and you will be deeply involved in finding great solutions from a technical as well as a user perspective together with our product owners and UI/UX designers.": "{\n    \"languages_and_runtimes\":[\"Kotlin\"],\n    \"ui_and_cross_platform_frameworks\":[\"Compose\",\"Kotlin Multi-platform\"],\n    \"development_methodologies\":[\"Agile\",\"Scrum\"]\n}",
    "3. Requirements:\n- **Motivation over experience:** Curiosity, interest, and the drive to shape the future of the internet are more important to us than documented years of service. We want to feel your burning enthusiasm and challenge your ability to grasp new concepts. After you join, we’ll ensure you have a steep learning curve—just enough to keep you on your toes. Whether you’re a newcomer, a career changer, or a seasoned pro in the app world, we welcome you.  \n   - **Equality:** Are you afraid of clear statements and passionate arguments? We stand by our opinions and expect the same from you. Tell us what you think. Sometimes you’ll be right, other times we will. Openness is part of arkulpa’s DNA, but holding grudges is not.  \n   - **Technology:** No blaming, no shaming. Those who innovate are constantly learning. We don’t punish a willingness to innovate; instead, we believe in the power of new tools and concepts—if they help our clients and our team improve. Finding the right stack for each task keeps us sharp and makes the work enjoyable.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- You will work with us on exciting projects for a wide variety of clients and industries. From the first meeting to the first line of code and all the way to the release, you will be fully involved and contribute significantly to the success of the project through your work.": "{}",
    "3. Requirements:\nPlaying well in a team and has strong analytical and solution-oriented thinking\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\nNot mentioned": "{}",
    "3. Requirements:\n• Worked on at least one native Swift application published in the App Store  \n   • Experience building mobile apps using Swift, Objective-C, Java, or Kotlin  \n   • Fluent in Swift and at least one other programming language  \n   • Deep understanding of the iOS SDK  \n   • Good knowledge of Xcode and Jetbrains IDEs  \n   • Experience with version control  \n   • Worked with agile scrum frameworks  \n   • Knowledge of MacOS, iOS and Apple software  \n   • Fluent in English, written and spoken  \n   • Your work experience, skills and references will be verified\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• In this position you will be part of one or more remote or in-house agile teams for internal, commercial or research projects.  \n   • Be committed to build quality high-performance software, be willing to work overtime if necessary and be available for international business travel.": "{\n    \"languages_and_runtimes\":[\"Java\",\"Kotlin\",\"Objective-C\",\"Swift\"],\n    \"build_and_dependency_management\":[\"Xcode\"],\n    \"development_methodologies\":[\"Scrum\"]\n}",
    "3. Requirements:\n• Passionate about mobile platforms and translating requirements into a user friendly app  \n   • Excellent knowledge of Kotlin  \n   • Strong knowledge of architecture patterns such as MVVM  \n   • Proven experience of developing and publishing native Android apps to the Google Play store in a professional environment  \n   • Good knowledge of Kotlin Coroutines, Hilt and Retrofit.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n• Ensure that the app meets our quality standards by creating unit tests and doing code reviews  \n   • Design and maintain the architecture of new features and existing ones  \n   • Collaborate with cross-functional teams, designers and technical product owners  \n   • Stay up to date with programming best practices and new technology trends  \n   • Working autonomously you will bring strong communication skills and the ability to mentor colleagues": "{\n    \"languages_and_runtimes\":[\"Kotlin\",\"Coroutines\"],\n    \"architectural_patterns\":[\"MVVM\"],\n    \"dependency_injection_frameworks\":[\"Hilt\"],\n    \"networking_and_api\":[\"Retrofit\"],\n    \"distribution_and_store_operations\":[\"Google Play Console\"]\n}",
    "3. Requirements:\n- You are familiar with Continuous Integration using Jenkins and Gradle.  \n   - You are characterized by solution-oriented thinking, independent and responsible work, as well as teamwork skills.  \n   - You are good at listening, questioning, and explaining.  \n   - You develop the Mein ELBA app – the tool that fits in every pocket. Whether it’s the grandmother quickly managing her payments or the child with their first youth account organizing their finances – the Mein ELBA app makes everything possible: payments, securities transactions, and much more – quickly, easily, and anywhere.  \n   - You have good German and English skills, both written and spoken, and can apply them in your professional daily life.  \n   - You have several years of experience in app development with iOS (Swift).\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- You contribute to the further development of the Mein ELBA app for 2.8 million customers and ensure it runs smoothly.  \n   - You develop an appealing, modern, and accessible interface for our customers to manage their daily banking tasks.  \n   - With your meticulous and security-conscious approach, you ensure that our customers feel well-supported when using online banking.  \n   - You program new features for Austria's largest banking app natively for iOS using Swift.  \n   - You take stakeholders' concerns to heart and strive to quickly find satisfactory solutions for them.": "{\n    \"languages_and_runtimes\":[\"Swift\"],\n    \"build_and_dependency_management\":[\"Gradle\"],\n    \"ci_cd_and_release_automation\":[\"Jenkins\"]\n}",
    "3. Requirements:\n- Passionate about mobile platforms and skilled at translating complex requirements into a streamlined, user-friendly trading experience.  \n   - Proficient in Swift with strong knowledge of iOS best practices, software architecture patterns, UIKit, and SwiftUI.  \n   - Experienced in building, testing, and refining mobile applications, with a proven track record.  \n   - Strong UI/UX & design orientation.  \n   - Takes ownership of your work, proactively enhancing and adding value beyond initial requirements.\n\n4. Nice to have:\nNot mentioned\n\n5. Responsibilities:\n- Design, develop, and maintain advanced features for the iOS platform, collaborating closely with cross-functional teams to deliver a smooth, user-centric trading experience.  \n   - Ensure code quality through extensive testing to meet functional requirements and uphold our quality standards.  \n   - Own and enhance your area of the app by addressing bugs, monitoring and optimizing performance, and implementing improvements to trading functionalities.  \n   - Stay updated on development trends, integrating new techniques and tools to continuously refine the app.": "{\n    \"languages_and_runtimes\":[\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\",\"UIKit\"]\n}",
    "3. Requirements:\n- 5+ years of industry experience in iOS development.  \n   - Strong problem solving skills and attention to detail.  \n   - Proficiency in English (B2 level).  \n   - Expertise in Swift / Objective-C and a solid understanding of iOS networking frameworks and threading models.\n\n4. Nice to have:\n- Experience with UI and unit testing.  \n   - Knowledge of integrating Kotlin Compose Multiplatform.  \n   - Experience with complex project structures.\n\n5. Responsibilities:\n- Collaborating with the design team to develop new features and improve existing ones.  \n   - Maintaining and optimizing the current codebase.  \n   - Automating processes and submitting updates.  \n   - Continuously refining UI/UX.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"Kotlin Multiplatform\"]\n}",
    "3. Requirements:\n• You have at least 5+ years of experience building native apps  \n   • You have a desire to craft beautiful, usable interfaces across all different devices running iOS  \n   • You are empathetic towards the user experience and thoughtful about what we can do to make it better  \n   • You have excellent communication skills and are good at giving and receiving feedback  \n   • You have experience working iteratively and maintaining live products  \n   • You have experience mentoring other engineers in Swift and Objective-C  \n   • You work with an eye toward accessibility, performance and systemic solutions  \n   • You have a proven track record of building reliable, performant, scalable and yet understandable solutions  \n   • You write tests to ensure delivery of high-quality software  \n   • EU citizen or Valid Spanish Work permit\n\n4. Nice to have:\n• You have knowledge of the diabetes industry or other comparable health industries  \n   • You have experience working in an energetic startup environment  \n   • You have a background in Computer Science  \n   • You are familiar with ReSwift, Functional Reactive Programming or App Extensions\n\n5. Responsibilities:\n• Join us in leading innovation on the iOS platform  \n   • Support our ambitions and push even further in the mobile sector to develop at scale and guide the development of our entire efforts on the iOS platform.  \n   • Work autonomously in an interdisciplinary team, collaborating with designers, QA, and product owners  \n   • Bring a fresh perspective and creative approach to the development of our iOS products": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"architectural_patterns\":[\"ReSwift\"]\n}",
    "3. Requirements:\n• You have experience in developing applications with Objective-C or Swift - other languages such as C++, Python, Java, low level programming or productivity tools is a bonus  \n   • Interest in building maintainable and testable code bases, including API design and unit testing techniques  \n   • You are fluent in English  \n   • Eagerness to work with agile development practices (Scrum, Kanban)\n\n4. Nice to have:\n• Other languages such as C++, Python, Java, low level programming or productivity tools is a bonus\n\n5. Responsibilities:\n• Work closely with a small, autonomous team of product owners, designers and developers to build new and innovative applications for iOS  \n   • Implement custom native user interfaces leveraging the latest iOS programming techniques and frameworks like SwiftUI and Combine  \n   • Build reusable iOS software components for interfacing with our back-end platforms (REST APIs)  \n   • Engage in rigorous code-review processes  \n   • Analyze and optimize your application code for quality, efficiency, and performance  \n   • Work with your team and co-define the architecture  \n   • Work with an automated releases and test infrastructure  \n   • Improve tooling for general developer productivity  \n   • Become a valued member of an autonomous, multi-functional team  \n   • You have a great ability to learn, and you are eager to expand your areas of expertise  \n   • You have a strong quality approach and care for the overall performance of the product": "{\n    \"languages_and_runtimes\":[\"C++\",\"Java\",\"Objective-C\",\"Python\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\"],\n    \"architectural_patterns\":[\"MVVM\"],\n    \"development_methodologies\":[\"Kanban\",\"Scrum\"]\n}",
    "3. Requirements:\n• Proven expertise in Swift and Objective-C.  \n   • Solid understanding of iOS architecture patterns.  \n   • Mastery of UIKit, Core Animation, Core Data, and other iOS frameworks.  \n   • Innovative problem-solving abilities.  \n   • Strong leadership qualities for guiding and mentoring junior team members.  \n   • Self-driven commitment to continuous learning to stay updated with the latest iOS technologies and trends.\n\n4. Nice to have:\n• Experience with SwiftUI and a strong understanding of its capabilities.  \n   • Knowledge of CI/CD pipelines and their implementation.\n\n5. Responsibilities:\n• Conduct code reviews to ensure code quality, performance, and security.  \n   • Troubleshoot, debug, and optimize code to enhance application performance.  \n   • Utilize RESTful APIs and integrate third-party libraries seamlessly.  \n   • Collaborate effectively with cross-functional teams to deliver outstanding iOS applications.  \n   • Familiarity with version control systems, particularly Git.": "{\n    \"languages_and_runtimes\":[\"Objective-C\",\"Swift\"],\n    \"ui_and_cross_platform_frameworks\":[\"SwiftUI\",\"UIKit\"],\n    \"architectural_patterns\":[\"iOS architecture patterns\"],\n    \"data_and_caching\":[\"Core Data\"],\n    \"device_and_platform_services_and_third_party_sdks\":[\"Core Animation\"],\n    \"networking_and_api\":[\"RESTful APIs\"],\n    \"version_control\":[\"Git\"],\n    \"ci_cd_and_release_automation\":[\"CI/CD\"]\n}"
}