{
    "We are a dynamic FinTech company headquartered in Australia, now expanding our footprint to Malaysia. Specializing in innovative payment and remittance solutions. Why Join Us? Young dynamic workplace culture with office recreational amenities provided Progressive career prospects Well rewarding project contributions Responsibilities Develop, test, and deploy high quality mobile apps": "en",
    "A minimum of 6 years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS frameworks such as AVFoundation, UIKit, etc. Experience in": "en",
    "iOS Developer Our client is a leading mobile sportsbook operator having global domination with huge investment. This is a unique opportunity to be involved in a business at such a pivotal stage in its development and to become an integral part of the ambitious growth business is set to achieve.": "en",
    "In ByKon were looking for an exceptional Sr. iOS Developer to join our fast-growing team. This is an opportunity to work alongside world-class technology and data science experts paving way for fast-paced career growth and learning. Main resposibilities Develop the structure of the architecture and creation of viewsTranslate concept design": "en",
    "Who we are We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, were here to help people trust themselves enough to build their financial freedom for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned experts": "en",
    "Are you a talented iOS developer ready to make a significant impact? Join Desygner, where innovation meets creativity in a vibrant, multicultural team based in Gold Coast. We celebrate diversity and value bright, talented individuals from all backgrounds.About UsDesygner stands proudly as one of the leading tech companies in the": "en",
    "We are seeking a highly skilled Senior iOS Developer to join our dynamic team. In this role, you will be responsible for developing and maintaining cutting-edge iOS applications. Your expertise in Swift and Objective-C, solid understanding of iOS architecture patterns, and mastery of iOS frameworks such as UIKit, Core Animation,": "en",
    "Deine Rolle im Team Design Umsetzung von Applikationsmodulen und Softwareprojekten für mobile Devices Android und iOS und Backend-Solutions aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, inklusive technischer Analyse und Entwurfserstellung Lösung von technisch anspruchsvollen Herausforderungen Überleitung der Softwarekomponenten von der Entwicklung in die Testabteilung Sicherstellung der Softwarequalität durch Code Reviews und Systemtests": "de",
    "Renders singular focus is best summarised by our purpose continuously innovate and evolve technology to build networks better and connect communities. Renders geospatial network construction platform enables telecommunication network operators and construction teams to digitise the construction workflow and cut the time and cost of large-scale fibre deployment by over": "en",
    "Diabetes is a pesky monster and thats putting it mildly. If youre serious about helping us face it head on, come join us! For a behind-the-scenes look, check out our Monster Culture Blog, this little video and Roche code4life to see what makes mySugr and Roche tick. Heres what were": "en",
    "Short and sweet mohemian is currently seeking a Junior iOS Developer to join our team, that is passionate about creating high-quality software and solving technical challenges. You are the right person if you are solution-oriented and pragmatic, enjoy working in a team, and take pride in the code that you": "en",
    "We are searching for iOS Software Engineers with native iOS development experience As a software engineer youll be working with project managers, designers, software architects and engineers to deliver software products. Qualification Please apply for this position if you meet the following requirements Worked on at least one native Swift": "en",
    "Deine Rolle im Team Du wirkst an der Weiterentwicklung der Mein ELBA App für 2,8 Millionen Kundinnen mit und hältst diese am Laufen. Du entwickelst für unsere Kundinnen eine ansprechende, moderne und barrierefreie Oberfläche um ihre täglichen Bankgeschäfte zu erledigen. Du sorgst mit deiner sorgfältigen und sicherheitsbewussten Arbeitsweise dafür, dass": "de",
    "Looking for a iOS Developer. Playing well in a team and has strong analytical and solution-oriented thinking": "en",
    "ios entwickler 80100 wmd Stellenbeschreibung Du arbeitest mit uns an interessanten Projekten fur völlig unterschiedliche Kunden und Branchen. Vom ersten Meeting an uber die erste Code-Zeile bis hin zum Release bist du voll mit involviert und trägst mit deiner Arbeit maßgeblich zum Erfolg des Projekts bei. Anforderungen motivation vor erfahrung": "de",
    "Sie sind an der Detailspezifikationen und Architekturentscheidungen beteiligt und implementieren neue Modelle und Features Zu Ihren Aufgaben gehört die gründliche Analyse von Problemen und die Entwicklung effektiver Lösungsansätze Sie sind in ständiger Abstimmung mit dem Product Owner, wenn es um technische Herausforderungen wie Komplexität, Umsetzbarkeit, Sicherheit und Performance des Moduls": "de",
    "Your role in the team Design, develop, and maintain advanced features for the iOS platform, collaborating closely with cross-functional teams to deliver a smooth, user-centric trading experience. Ensure code quality through extensive testing to meet functional requirements and uphold our quality standards. Own and enhance your area of the app": "en",
    "Your role in the team Work closely with a small, autonomous team of product owners, designers and developers to build new and innovative applications for iOS Implement custom native user interfaces leveraging the latest iOS programming techniques and frameworks like SwiftUI and Combine Build reusable iOS software components for interfacing": "en",
    "Was sind deine Aufgaben? Du gestaltest attraktive Module und Softwareprojekte für unsere Kundenbegeisterungs-App und dazugehörige Backend-Solutions und setzt diese agil um Deine aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, von technischer Analyse über Entwurfserstellung bis zu Code Reviews und Systemtests tragen zur erfolgreichen Implementierung bei Um die hohen Qualitätsansprüche an unsere Applikationen": "de",
    "Your role in the team As a member of our Development Team, you are responsible for further developing our product and help create and implement new and exciting features. Help to improve the PlanRadar iOS app smartphone, tablet. Write code thats readable, well documented, and has meaningful tests. Build new": "en",
    "Introduction Interactive Paper , a leading-edge technology firm based in Austria, is at the forefront of redefining the intersection between digital and analog experiences, with a focus on delivering transformative, immersive marketing solutions . We invite you to join a high-impact, fast-growing environment where your technical expertise will be instrumental": "en",
    "Whats the position? This is a Full-time Senior iOS Developer position at Neybox for talented individuals who want to work on cutting-edge applications that positively impact the well-being of individuals worldwide. What will I be working on? Youll be working on our two apps Pillow, a sleep-tracking app, and Today,": "en",
    "iOS Developer Job DescriptionWe are looking for an iOS developer who will be responsible for the development of iOS apps for a range of iOS devices. The candidate should be able to develop iOS applications and their integration with back-end services. You will be working alongside other developers on different": "en",
    "iOS Developer dmw Kreiere die Zukunft des Bankings - als iOS Developer für die Mein ELBA App! Ort Linz Anstellung Vollzeit Work from Home Bis zu 60 Homeoffice Die Raiffeisen Software GmbH als ein Teil der Raiffeisen Bankengruppe Österreich beschäftigt rund 950 Mitarbeiterinnen an den Standorten Innsbruck, Leoben, Linz, Salzburg": "de",
    "Android iOS Developer mfd Arbeitsort Anstellungsart Zeitpunkt Hagenberg i. M. Wien Vollzeit Ehest möglich ventopay ist die führende Plattform für Digitalisierung und Innovation in der Gemeinschaftsverpflegung. Die Produktpalette beinhaltet neben einem umfassenden Kassen-, Bezahl- und Abrechnungssystem auch Employer Branding Lösungen in Form von Apps und Websites. Täglich gestalten über 70": "de",
    "Your role in the team You are eagerly following the latest keynote and are excited about the latest developments in the smartphone market You find creative solutions to transform the extensive possibilities of the various platforms into unique features for our customers Your creative talent turns even complex functions into": "en",
    "This a Full Remote job, the offer is available from Europe This is a remote position. We are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improvelearn. This position is only open for employees,": "en",
    "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and theres no telling what you could accomplish When the App Store was first introduced it launched a cultural and": "en",
    "ServiceM8 is a job management app. We exist to help small businesses thrive. Were a product-driven company focused on customer success. Trade and service businesses in over 40 countries around the world rely on ServiceM8 all day, every day. It empowers these people to run a more organised, productive, and": "en",
    "Senior Software Engineer, iOS Apps Full Time Chatswood, Sydney, Australia We are seeking a talented Senior Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia. As part of our team, you will contribute to the development and maintenance of mobile applications,": "en",
    "This a Full Remote job, the offer is available from European Union Who we are Were an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web": "en",
    "Company Description At NCS Australia, we believe in doing technology services better. Our commitment to quality, focus on people, and willingness to challenge traditional thinking set us apart. Our team brings this belief to life by partnering with our clients and communities to make tomorrow together. We are committed to": "en",
    "swipeJobs is a fast-growing, disruptive, and award-winning staffing platform that is transforming the way people find work and businesses manage their workforce. Our platform connects job seekers with employers, allowing businesses to easily fill their staffing needs. We are slowly becoming the stand-alone market leader in the US market and": "en",
    "Android Developer Permanent role based in Melbourne or Sydney We are certified carbon neutral and committed to reducing our impact on the environment. We have long-term partnerships with charities working to address homelessness. Were REA REA Group is not your average digital business. From humble beginnings in a garage in": "en",
    "Job Description for Sr iOS Developer in Sydney. A minimum of 6 years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS": "en",
    "We are searching for an exceptional Remote Mobile Technical Team Lead to join our clients dynamic software development startup. Our client is a prominent multi-asset liquidity and technology white-label solutions provider for brokerages and exchanges, and with a well-funded operation and a team of over 200 employees, they are revolutionizing": "en",
    "Infydots delivers top iOS programmers to help clients strategic importance and assignment conditions. We supply talented reliable iOS coders on-demand to develop and establish iOS apps that help organizations innovate, improve profitability, and rev time to market.No agreement lock-insComplementary evolution managerNo Permitted Profession DisadvantageDaily basis weekly basis monthly basis reportingConstant": "en",
    "About The Role TeamManages the technical design development and maintenance of mobile applications, associated CICD pipelines, automated tests, and development tools using existing and emerging technology platforms.What you will be doing Writes and delivers complex code for features, user stories, reusable modules, unit testing and automated functional testing, debugs existing": "en",
    "Deine Rolle im Team Responsibility for the technical development of blockchain-related products Development of cross platform mobile applications Working closely with related teams to develop decentralized products and services Developments of various APIs related to blockchain technologies Aligning with Information Security team to prevent attacks Regular deployments and documentation of": "de",
    "Sei un appassionato del mondo IT e ti piacerebbe intraprendere un percorso di crescita in ambito iOS? In System Management passione e professione camminano di pari passo. La nostra organizzazione è caratterizzata da team coesi che lavorano in modo sinergico, armonioso e collaborativo. Il motore della nostra realtà aziendale sono": "it",
    "This a Full Remote job, the offer is available from Austria, Germany Unternehmensbeschreibung Du brennst für agile Softwareentwicklung, dich begeistert Ende-zu-Ende Verantwortung und du suchst nach einer angenehmen Arbeitsatmosphäre mit viel Raum für Weiterentwicklung? Willkommen bei Breuninger! Breuninger ist der führende Fashion und Lifestyle Department Store im Premium und Luxussegment": "de",
    "We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, were here to help people trust themselves enough to build their financial freedom for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned experts to invest in": "en",
    "As an iOS Developer, you will be responsible for developing application enhancements to our iOS platform. Your role will involve developing scalable and efficient iOS based apps and enhancements and ensuring the stability and security of the overall architecture. You will work closely with cross-functional teams to deliver solutions that": "en",
    "Select how often in days to receive an alert Can you engineer a brighter tomorrow? Its crystal clear the actions we take in the next few years will significantly impact our future. At Volvo Cars, we embrace change. Were committed to transforming the automotive industry and leading in electrification. For": "en",
    "This a Full Remote job, the offer is available from Europe, Portugal The role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or": "en",
    "Be part of one of the most innovative Digital Business areas that focuses on sustainable digital data products to support Biosecurity compliance. Due to the nature of the client organisation and projects at hand, only Australian Citizens can be considered for the role. To be considered, we seek 5 years": "en",
    "Senior DjangoAngular Developer Full-Stack or FE BE Remote We are seeking two experienced developers to enhance our legacy product catalog applicationa critical platform that bridges communication between data providers and recipients. Youll be instrumental in developing new features that allow providers to input product data with both standard and custom": "en",
    "Apply now Job no 504406Work type Contract Full TimeLocation VariousCategories ITTechnology About the ABC The ABC is the nations most trusted and independent source of Australian conversations, culture, and stories. With over 4,000 employees from diverse backgrounds across over 50 locations around Australia and overseas, we are proud to create,": "en",
    "This a Full Remote job, the offer is available from Europe, Belarus, Poland, Kazakhstan We are looking for experienced MiddleSenior Mobile Flutter Software Engineers to join our core product BOSS Revolution. You have a chance to work with a team of outstanding professionals on a challenging product. You will never": "en",
    "In ByKon were looking for an exceptional Sr. iOS Developer to join our fast-growing team. This is an opportunity to work alongside world-class technology and data science experts paving the way for fast-paced career growth and learning. Main Responsibilities Develop the structure of the architecture and creation of views Translate": "en",
    "Software Engineer, iOS Apps Full Time, Hybrid, Chatswood, Sydney, Australia We are seeking a talented Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia. As part of our team, you will contribute to the development and maintenance of mobile applications, revolutionizing": "en",
    "This a Full Remote job, the offer is available from United States, EMEA About us RevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinators summer 2018 batch and today are handling more than 4B of in-app purchases annually across thousands of apps. We": "en",
    "About the Team DoorDash is building the worlds most reliable on-demand, logistics engine for delivery. We are seeing hypergrowth and expanding ouroffices globally We are looking for Founding Engineers to join ourTeam and to work on building and maintaining a large scale 24x7 global infrastructure system that powers DoorDashs 3-sided": "en",
    "Do you want to push the frontier of digital services in telecommunication? Are you passionate about cutting edge user experience? Do you love to build relevant User Experiences for a broad audience? Then you are exactly right with Drei. Join our mission and become part of Team Up3 at Drei,": "en",
    "Was sind deine Aufgaben? Du gestaltest attraktive Module und Softwareprojekte für unsere Kundenbegeisterungs-App und dazugehörige Backend-Solutions und setzt diese agil um. Deine aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, von technischer Analyse über Entwurfserstellung bis zu Code Reviews und Systemtests, trägt zur erfolgreichen Implementierung bei. Um die hohen Qualitätsansprüche an unsere Applikationen": "de",
    "Overview The Android Developer Kotlin position is a critical role within our organization, responsible for developing and maintaining high-quality mobile applications on the Android platform using Kotlin. This role plays a vital part in our companys technological growth and is instrumental in delivering exceptional user experiences. Key Responsibilities Ensure that": "en",
    "Lead Mobile Developer Hyper Growth Startup 160,000 Super We are working closely with a fast-growing startup who are well-backed and looking to build on early success. They are looking for a seasoned React Native Developer to take on the coding responsibilities of a Lead Developer. There are 2 self-sufficient developers": "en",
    "This is a Senior Android Engineer role with one of the leading companies in AU right now -- Zeller -- with an amazing team. They are continuing to grow rapidly. This is the chance to join right as the takes off. More About the Role at Zeller About the role": "en",
    "About Us We are a leading IoT technology company that has revolutionized the culinary sector with our innovative smart consumer gadget. Our product is designed to elevate the cooking experience by seamlessly integrating advanced technology with culinary precision. Headquartered in Leicester, our team is passionate about pushing boundaries, enhancing user": "en",
    "Your role in the team Development and further development of individual cross-platform apps Holistic support of the development cycle from conception to release Implementation of the design and further development of our mobile apps for iOS and Android Programming the frontend modules while looking at the backend components Participation in": "en",
    "CTO on Demand to Oversee Android App CreationLocation Cambridge, TASMANIA, Australia Posted on Jun 25, 2020 Profile I am looking for a freelancer to mentor and oversee our Android app creation and offer hands-on technical help in the process. Skills Required AndroidMobile App DevelopmentSoftware ArchitectureBackend DevelopmentAPIApplication for CTO on Demand": "en",
    "Your territory As part of our innovative Android Development team, you will Develop a state-of-the-art app that is used by more than a million people Define, implement and test new features for our app within Android frameworks Help with identifying performance bottlenecks in the app and finding solutions to mitigate": "en",
    "About us Were the worlds most-trusted name in keeping cats and dogs safe and healthy. The secret to that success? A team of truly unique individuals who care about each other just as much as going the extra mile for pet parents. Your territory As part of our innovative Android": "en",
    "Android Developer Job Description We are looking for experienced Android developers to design and develop world-class mobile apps. You will be responsible for working closely with our team of skilled engineers to design and develop the next generation of mobile applications. The ideal candidate should have technical expertise in Java,": "en",
    "Fingerprint empowers developers to stop online fraud at the source. We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100 remote company with a strong": "en",
    "SENIOR FRONTEND MOBILE DEVELOPER mwd Dienstort SALZBURG STADT ODER ST. JOHANN IM PONGAU Arbeitszeit VOLLZEIT 38,5 h Eintritt ASAP Eintritt 0 BEWIRB DICH ALL ABOUT TECHNOLOGIEN, DIE LEBEN RETTEN SINNSTIFTEND, NACHHALTIG, AGIL. VERNETZT, INNOVATIV, MODERN. EINZIGARTIG, DYNAMISCH, INTERNATIONAL. Mit 360-Kommunikations- und Leitstellenlösungen schaffen wir Sicherheit. Einsatzorganisationen, Industriekunden und internationale Flughäfen": "de",
    "Position Senior Android Developer mfx Location Gaishorn Your role at Dynatrace Excited about behind the scenesmobile development? Do you want to join aglobal leaderthat enablesdigital transformation? Looking for teammates who appreciateopen communication and facechallengestogether as a team? Why you will love being a Dynatracer Dynatrace is a leader in unified": "en",
    "About us Trideca is a strategy, data and digital partner for technology transformation across Australia. We have worked with some of Australias leading enterprise companies including NAB, Suncorp, Optus, Medibank, AGL and many more, to help transform and empower their businesses. Working for Trideca, you will be challenged to think": "en",
    "LOOP is a digital-first lead agency, exploring the intersections between design, technology and digital brand building for leading brands. With a team of 400 digital talents and through data driven marketing, we help brave clients to stand out in the digital age. Over the last few years our brilliant team": "en",
    "Android Kotlin Developer BAWAG Group is the listed holding company of BAWAG P.S.K., which is one of the largest banks in Austria with 2.1 million customers. As a dynamic employer, we promote talent and drive technological innovations quickly. Flat hierarchies, a flexible working environment and equal opportunities for our employees": "en",
    "Android Developer Job DescriptionWe are looking for experienced Android developers to design and develop world-class mobile apps. You will be responsible for working closely with our team of skilled engineers to design and develop the next generation of mobile applications.The ideal candidate should have technical expertise in Java, Android development": "en",
    "Android Developer dmw Programmieren kommunizieren, kombiniere deine Stärken in dieser vielseitigen Schnittstellenfunktion! Ort Linz Anstellung Vollzeit Work from Home Bis zu 60 Homeoffice Die Raiffeisen Software GmbH als ein Teil der Raiffeisen Bankengruppe Österreich beschäftigt rund 950 Mitarbeiterinnen an den Standorten Innsbruck, Leoben, Linz, Salzburg und Wien. Unser Ziel ist": "de",
    "Deine Rolle im Team Kein Blaming, kein Shaming. Wer verändert, lernt ständig. Wir bestrafen Innovationswille nicht, sondern glauben an die Kraft neuer Tools und Konzepte - wenn sie unseren Kunden und unserem Team helfen, besser zu werden. Für jede Aufgabe den passenden Stack zu finden hält uns wach und macht": "de",
    "Als Lead Developer bei uns bist Du in den gesamten Projektalltag von der Aufwandsschätzung bis zum Deployment eingebunden und spielst dabei eine wichtige Rolle in der Ausdefinition von Stories und Tasks, der fachlichen Leitung des EntwicklerInnen-Teams und übernimmst Verantwortung für technische Umsetzungs-Entscheidungen. Außerdem bist Du Innovationstreiber und sorgst dafür, dass": "de",
    "Im in need of an experienced Android App Developer to take over my current project. The primary focus will be on addressing backend functionality issues. The app is currently hosted on Vultr and requires immediate attention in the following areasDatabase Management Overseeing the database and ensuring its efficient operation.API Development": "en",
    "Location Remote About Us Were a tech startup developing Pebble, an innovative AI device transforming the way people interact with technology. Our team is passionate, forward-thinking, and focused on ambitious goals. Were seeking a skilled Android OS developer to take the lead in customizing the operating system powering the Pebble": "en",
    "Expedia Group brands power global travel for everyone, everywhere. We design cutting-edge tech to make travel smoother and more memorable, and we create groundbreaking solutions for our partners. Our diverse, vibrant, and welcoming community is essential in driving our success. Why Join Us?To shape the future of travel, people must": "en",
    "Android APP weiter entwickeln. Neue Features umsetzen, die wir vorab gemeinsam ausarbeiten.": "de",
    "Functieomschrijving As Android Software Developer you create software which runs on a custom Android Display platform that enables user control functionality of agricultural and other off-road commercial vehicles. You must have the ability to generate efficient software code, based on written and verbal specifications. As Android Software Developer you are": "nl",
    "We are looking for an Embedded iOS SDK Developer in Antwerp, Belgium. As Embedded iOS SDK Developer, you will be working on the Mobile Software Development Kit SDK of our customer and dive deep into low-level embedded programming. English speaking candidates are welcome to apply and need to be willing": "en",
    "Company Description Yambla is a startup based in San Francisco and Belgium. We are revolutionizing the way companies innovate. Even the largest companies have trouble innovating. Nokia, Kodak, BlackBerry and BlockBuster are just a few examples of thriving companies that went from hero to zero overnight due to a lack": "en",
    "Mobile Developer Job Overview New project do develop top cutting Edge Mobile app on both common platform IoS and Android and using adaptative UI for Android Auto and Apple CarPlay. Responsibilities for Mobile Developer Identify and plan for new features Develop application programming interfaces APIs to support mobile functionality based": "en",
    "Gaming1 is hiring with Peerlist for a Full-time IOS REACT NATIVE SOFTWARE ENGINEER LIEGE-BELGIUM. Required skills native ecosystem,Android,iOS,react-native,CICD,redux,English": "en",
    "Functie Als iOS Developer zal je deel uitmaken van ons development team voor de ontwikkeling, doorontwikkeling en support van onze mobiele applicaties voor ERP en retail projecten. Hierbij werk je in een team aan projecten voor klanten. Je belangrijkste verantwoordelijkheid zal eruit bestaan om mee onze ERP en retail software": "nl",
    "Job Description Are you an experienced Flutter Developer eager to create innovative mobile applications? Join our team, where your passion for coding, testing, and delivering cutting-edge apps will make a real impact. As a Flutter Developer, youll be involved in every phase of the development lifecycle, ensuring high-quality and efficient": "en",
    "This a Full Remote job, the offer is available from EMEA About us Talent has no borders. Proxifys mission is to connect top developers around the world with opportunities they deserve. So, it doesnt matter where you are we are here to help you fast-track your independent career in the": "en",
    "Computer Scientist mfd as App Developer for iOS Android RIWA - All geoinformation becomes a digital experience RIWA GmbH is a leading company in the field of geoinformation and municipal specialist processes with over 25 years of experience and market leader in Bavaria. Our team develops innovative solutions for the": "en",
    "Hola! Todavía no conoces HIBERUS TECNOLOGÍA? Somos una empresa de tecnología construida con un ingrediente diferencial, la HIPERESPECIALIZACIÓN. Formar parte de Hiberus significa crecimiento, pasión por la tecnología, interés por la innovación, ambiente laboral flexible y colaborativo, compañerismo, aprendizaje, formación continua, motivación y superación ante nuevos retos...y esto es solo": "es",
    "MEET AVIOBOOK AvioBook is a global leader in providing cutting-edge software and a one-off unique hardware solution for the aviation industry. We began by revolutionising the Electronic Flight Bag EFB market with a product designed by pilots for pilots and their flight crews. Today, we continue to innovate, creating smart,": "en",
    "We are looking for a dynamic and code lover, iOS Developer to join our team and help us in our Platforms! If you want to be part of a young, fun and multicultural team and work for a growing company with multiple challenges and projects, please send us your application": "en",
    "Location Qualifications Ghent Hybrid, Wroclaw Hybrid Position Overview At Showpad, our mobile app is essential to our offering and provides a seamless experience for all users throughout their sales cycle. With a proven track record of user satisfaction, we are committed to continuously enhancing user journeys. As an iOS Engineer,": "en",
    "As a Lead Mobile App Developer, you will oversee the creation of advanced mobile applications for Android and iOS platforms. You will manage cross-functional teams, convert strategic objectives into technical implementations, and ensure the delivery of high-quality, scalable, and high-performing mobile solutions. Responsibilities Lead and mentor development teams, fostering technical": "en",
    "The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. Your skills You have already had a first experience in iOS development with Swift You can implement 3rd party": "en",
    "Mobile Engineer Swift - LLM Training Location Anywhere in the World Remote Europe, Latam, Asia Contract length - 12 Months Opportunity- Full Time, 8 hours, 5 hours Mandatory overlap with PST Total Years Of exp- 3 years Mandatory Mandatory Skills- Swift for iOS min 2 years of experience OR RxSwift": "en",
    "At EY, youll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And were counting on your unique voice and perspective to help EY become even better, too. Join us and": "en",
    "Job Description The number of customers in several countries enjoying our market leading integrated IT platform specifically for local shops, retail chains en couriers is exploding. The Connect24-7 platform allows them to serve their customers always and everywhere. Thats why we are looking to strengthen our experienced team with a": "en",
    "Belgium, Brussels Senior Contract Hiring Process Time to Answer 2 open days Process 1 Phone Call 1 Onsite Interview Days to get an Offer 4 Days after Interview Overview Android Developer with strong clean code principles, knowledge of Googles Android design principles, Kotlin, Jetpack Compose, TDD, Material 3 design, and": "en",
    "At bunq, were not just creating a banking app were reshaping how people experience financial freedom worldwide. As part of the Tricount team, youll design and develop innovative mobile applications that simplify group expense management for millions of users. You will work closely with our team to create seamless, secure,": "en",
    "At 4411, we are committed to making parking a hassle-free experience for all car users. With over 3 million registered users, 4411 is the largest parking application in Belgium. Our app allows you to pay for your parking session easily and remotely, by the minute. In addition to street parking,": "en",
    "This a Full Remote job, the offer is available from Belgium We are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms. You will be responsible for architecting and building these applications, as well as coordinating with the teams responsible": "en",
    "About Us Hey there! Before we dive into the job details, lets give you a quick rundown of our company. At November Five, were not just about digital solutions were about creating memorable experiences with more amazement, more heart, and more results. As the go-to digital partner for customer experience": "en",
    "About Showpad At Showpad, personalities and cultures connect across oceans to create something extraordinary. As a top software company in the Inc. 5,000 Europe list, Showpad is changing the game when it comes to sales enablement. Our employees create the engagement and impact that drives our success as we expand": "en",
    "Were working for a prestigious consumer electronics company based in Belgium that is looking for an experience Embedded Android Developer for a cutting edge conferencing platform project. Were looking for a Senior Engineer that is a great communicator and can bring a team along in the are of Embedded Android": "en",
    "Location Brussels Vacancies 1 Job description Are you passionate about challenges? Izertis is your company. We are looking for an IT Developer for a client in Brussels. Responsibilities Translating requirements into high-quality code Design, build, and maintain high-performance, reusable, and reliable Kotlin code for the Android platform Collaborate with cross-functional": "en",
    "This a Full Remote job, the offer is available from Belgium Our Mobile Apps teams is now hiring on our latest Tech Hub in Athens! We are looking for Senior Android Developer to join our Product development Department. You will be part of the Mobile Apps team and together we": "en",
    "As a React Native Mobile Developer at Massive Media you will be part of a talented, young dynamic team that builds highly scalable products used by millions. We are seeking an experienced, dedicated, and well-organized Mobile Developer with relevant experience in React Native to join our team 60 Ghent-based -": "en",
    "We are looking for an Android developer to join our mobile team. The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. Our offer Training opportunities Home office budget": "en",
    "Als Android Developer zal je verantwoordelijk zijn voor het onderhouden en uitbreiden van de huidige 4411 Android app. De app is reeds volledig in Kotlin geschreven 2 Java en volgt in grote lijnen de best practices die volgens Google zijn gedefinieerd. Ook zijn we begonnen met de transitie naar Jetpack": "nl",
    "Le département Rossel Applications a pour mission la supervision et la prise en charge de lensemble des tâches de conception, de mise en œuvre, dintégration et dévolution des différents environnements applicatifs du Groupe Rossel digital, publicité, contenu éditorial, marketing, finance, RH, support client, gestion dabonnements, vente et distribution, . Selon": "fr",
    "26-04-2024 Antwerp area We are currently looking for a Android developer for Antwerp area. Descriptionprofile Good knowledge of Android development Experience with Kotlin Experience with modern development and operations processes and methodologies Experience with testing Experience with AWS Experience with Javascript andor TypeScript Experience with proxy tools eg. Charles Proxy": "en",
    "The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. Your skills You have already had a first experience in Android development with Kotlin You can implement 3rd party": "en",
    "An established logistics client based in the center of Brussels are currently on the lookout for a Senior Development Lead within Mobile Application Android IOS . They are looking for someone to guide teams and translate technical solutions ensuring quality scalability. This is a 6 month contract extendable working on": "en",
    "Position Senior Development Lead Mobile Apps Location Flexible City-based or Remote Option Duration Long-term project Remote Yes Contract Type Freelance Experience Senior Level 10 years Key Responsibilities Lead and mentor mobile development teams, fostering technical growth. Design and implement cutting-edge, scalable, and customer-centric mobile solutions. Ensure the quality and performance": "en",
    "About us RevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinators summer 2018 batch and today are handling more than 4B of in-app purchases annually across thousands of apps. We are a mission driven, remote-first company that is building the standard for mobile": "en",
    "What will you be doing? As an iOS Developer youll be working closely with your colleagues in the mobile app team, the UX-experts, designers, project managers and in a lot of cases your fellow engineers from the web app team. Youll develop and maintain custom iOS apps made for our": "en",
    "Hi there! Thanks for stopping by Are you actively looking for a new opportunity? Or just checking the market? Well you might just be in the right place! Were looking for a Senior iOS Developer to join our Lightspeed Hospitality Team in EMEA. You will work on a variety of": "en",
    "ABOUT US Hey there! Before we dive into the job details, lets give you a quick rundown of our company. November Five is the go-to digital partner for customer experience leaders like Coca-Cola, Spotify, Telenet, Le Pain Quotidien, Mediahuis or KBC Bank. We dont shy away from a challenge. We": "en",
    "We help the world run better At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces": "en",
    "Department New Financial Services - Eng Employment Type Full Time Location Remote Description Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of": "en",
    "This a Full Remote job, the offer is available from Bulgaria About the client An independently-owned Global business solutions company enabling offshore operations from a locations in the Philippines, India, Bulgaria, Vietnam, Belgium and the US. With European roots, they provide services to global companies that have offices in every": "en",
    "The adesso Group is one of the largest German IT service providers and has outstanding opportunities for growth. At its own locations in Germany, Austria, Switzerland, Turkey, Spain, the Netherlands, Bulgaria, USA and the UK as well as at numerous customer sites, adesso offers consulting and software development services for": "en",
    "Join Us at IQVIA! We are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment eCOA platform. Our fast, flexible, and proven solution enhances efficiencies, delivers real-time data, and sharpens insights, all while providing a superior patient experience. Who": "en",
    "Our client, an American product company, is expanding its team in Bulgaria! They are building their first Mobile Development Team locally and are looking for talented professionals to join them on this journey. The company is developing an innovative SaaS platform, and this is your chance to be part of": "en",
    "Our partner is a product company that creates a one-of-a-kind cloud-based product that helps businesses connect with each other instantly. What do we need? Experience in native mobile development for iOS Understanding of algorithms and data structures. System and network programming experience is a plus - OS basics, processes, IO.": "en",
    "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed 200M in funding by VCs from Silicon Valley,": "en",
    "This a Full Remote job, the offer is available from Bulgaria, Poland, Romania, South Africa, Portugal, Spain, Slovakia Join Us at IQVIA! We are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment eCOA platform. Our fast, flexible, and": "en",
    "Company Description Appolica is a Bulgarian mobile app agency working with start-ups and established brands like KBC, Tide, PostBank, OnTheMarket, ATT, etc. We work together with our clients to build compelling apps that provide lasting engagement with their customers. Our deep understanding of mobile technology enables us to bring a": "en",
    "Department Marketplace- Eng Employment Type Full Time Location Remote Description Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of their money. Over": "the language of the text",
    "We are TINQIN Technology Expertise, Industry Knowledge, Quality Focus and Innovation Spirit! As part of the Be Ys group, TINQIN was founded to challenge the status quo. Were more than just a software company were the driving force behind transformative solutions that shape the future of the insurance industry and": "en",
    "This a Full Remote job, the offer is available from Bulgaria Senior iOS Engineer Human Power BG is an HR agency that offers consultations and recruitment for some of the best companies in Bulgaria. Role Summary Create wondrous, beautiful software that helps people to better understand their world. Were looking": "en",
    "KPMG IT Service OOD is an IT service provider with a mission to digitalize the core business of the KPMG network member firms and their clients. We employ more than 500 people in Sofia and deliver the full spectrum of IT services to our clients, including ServiceNow solutions, SAP solutions,": "en",
    "About us Bulwork is the first IT recruitment agency in Bulgaria with 24 years of stable presence in the market. The company has established a reputation for delivering high-quality services to clients and candidates. We respect the candidates wishes and strive to provide the best service by finding the most": "en",
    "This position is available for more locations in Eastern Europe, but it will be managed from Bulgaria. Our client is designing the next generation of the UC Unified Communication product line for audio and video streaming. From the BSP perspective, the client needs help with board bring-up and support the": "en",
    "We are Omnissa! The world is evolving fast, and organizations everywherefrom corporations to schoolsare under immense pressure to provide flexible, work-from-anywhere solutions. They need IT infrastructure that empowers employees and customers to access applications from any device, on any cloud, all while maintaining top-tier security. Thats where Omnissa comes in.": "en",
    "Were defining what it means to build and deliver the most extraordinary sports and entertainment experiences. Our global team is trailblazing new markets, developing cutting-edge products, and shaping the future of responsible gaming. Here, impossible isnt part of our vocabulary. Youll face some of the toughest but most rewarding challenges": "en",
    "Currently you have the opportunity to join our team at the position of Android Engineer. What will you do? Participate in design, development, and maintenance of our mobile apps Drive technical discussions, make informed decisions, and provide recommendations on software architecture, tools, and best practices. Be part of an agile": "en",
    "This a Full Remote job, the offer is available from Bulgaria Job Description As an Android Software Engineer, you will join our Driver mobile app team. This team provides for fleet companies solution so a driver can do his day-to-day operations based on a combination of a mobile and inhouse": "en",
    "myPOS is an innovative fintech company serving small and medium-sized business clients across the European Economic Area, Switzerland and the UK. It provides easy and convenient in-store, online and on-the-go payment solutions to more than 200,000 businesses in over 35 European countries. With 20 locations across Europe, myPOS boasts a": "en",
    "This a Full Remote job, the offer is available from Bulgaria Our partner is a company founded in Burgas as a start-up, currently employs over 70 people working in four offices in Bulgaria - Sofia, Burgas, Plovdiv and Varna. The company specializes in the sphere of digital technologies and software": "en",
    "This a Full Remote job, the offer is available from Bulgaria Dreаmix was founded 18 years ago by passionate IT students, who wanted to create the dreamiest workplace where everyone is heard, works under transparent management, and lives up to their full potential. Now, many years later, we deliver software": "en",
    "Senior iOS Developer OTT English Services Telework Position Title Senior iOS Developer OTT English Services Telework Status of Employment Contractee Long-Term Fixed Term Unposting Date 2024-12-29 1159 PM This role offers the possibility of full-time telework. Work schedule to be discussed with Hiring Manager according to the guidelines defined by": "en",
    "Opening from Canada Bounteous x Accolite makes the future faster for the worlds most ambitious brands. Our services span Strategy, Analytics, Digital Engineering, Cloud, Data AI, Experience Design, and Marketing. We are guided by Co-Innovation, our proven methodology of collaborative partnership. Bounteous x Accolite brings together 5000 employees spanning North": "en",
    "Infosys is seeking a IOS Developer. This position will interface with key stakeholders and apply technical proficiency across different stages of the Software Development Life Cycle including Requirements Elicitation, Application Architecture definition and Design play an important role in creating the high level design artifacts deliver high quality code deliverables": "en",
    "Job Title IOS Developer Location Sun Bruno, CA Onsite, Locals Preferred Duration 12 Months of Contract. Requirements 5 years of professional experience in various elements of full stack software development native mobile, web front end, back end, and hands-on coding experience in the past Experience with a consumer facing app": "en",
    "Are you great at transforming product requirements into mobile apps? Are you aching to join a wildly dedicated team? Do you want to share your knowledge and build top-notch mobile experiences with our experienced developers? Read on, because we might have a spot for you at our table. ResponsibilitiesPrototype and": "en",
    "Role OverviewMcAfee is searching for an intermediate iOSmacOS Developer to support our VPN team in building private, secure, and beautifully designed apps. Through the TunnelBear iOS app and our Apple SDK, we enable millions of users to connect their devices securely.The team is passionate about building the best user experiences": "en",
    "Remote Junior iOS Software Engineer position at AssistIQ, requiring 1 years of mobile development experience with React Native and iOS.": "en",
    "Our client has engaged ROSS www.getROSS.com to find a phenomenal Mobile Application Developer Android iOS for an amazing permanent opportunity in downtown Toronto. Our Agency ROSS is an innovative leader in Recruitment Process Outsourcing RPO, HR Technology, Recruitment and HR Professional Services. Were a company of People Specialists helping companies": "en",
    "Intelliware is looking for iOS developers to join our team! At Intelliware youll have the opportunity to be part of a top-notch team and work on a wide range of consumer and enterprise mobile applications. We have virtual collaborative project rooms where youll work closely with a cross functional team": "en",
    "Theres a reason you carry an iPhone in your pocket. Its something about the iPhone look... the iPhone feel the way your Apple Watch starts sending you heart rate alerts when your Xcode successfully compiles or the limitless possibilities of SwiftUI, especially now that those medieval iPhone 6s have been": "en",
    "Company Description Continental Technology Solutions is Our consulting and managed services deliver the resources and capabilities required to assess,design, build and manage an agile, flexible IT environment. Youll work with one dedicated team from strategy and assessment through design, implementation, management and optimization to reach a true end-to-end solution. Job": "the language of the text",
    "Who We Are Konrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of": "en",
    "Requisition ID 204334 Tangerine is Canadas leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that": "en",
    "We are looking to hire a full-time iOS Developer with native app development experience. Are you the type of person who loves to collaborate with other talented people to bring an application to life? Are you a talented, team oriented person? Do you like to work on a variety of": "en",
    "We are looking for a great iOS application developer to join our mobile team. In this role you will work closely with our Product and Mobile team to help us shape, design, and build our customers applications. The ideal candidate is an excellent programmer, user-focused, and passionate about playing with": "en",
    "Role iOS Developer Type Contract Role Qualifications Completed Bachelors degree or diploma or equivalent experience in Computer Science, Software Engineering or Software Architecture preferred candidates with substantial and relevant industry experience are also eligible High level understanding of DevOps andor SRE practices 10 years of engineering experience 5 year in": "en",
    "Company A leader in the food and beverage industry, helping the most prominent companies in their sector creating efficiency, lower costs and delivering customer satisfaction. Their platform makes it convenient, quick and easy for guests to order and pay for on mobile phones, web, via in-store kiosks or tablets. Role": "en",
    "Join Robinhood as an iOS Developer, working on high-impact financial products and revolutionizing finance through mobile technology.": "en",
    "BH - Senior iOS Developer - Permanent On behalf of our client, Brainhunter Systems is looking for an outstanding Senior iOS Developer to join their medium sized team of talented, dedicated and friendly mobile professionals. Were looking for someone who can be a driving force in the design, creation and": "en",
    "Position Title Senior iOS Developer OTT English Services Telework Status of Employment Contractee Long-Term Fixed Term Position Language Requirement Language Skills Work at CBCRadio-Canada At CBCRadio-Canada, we create content that informs, entertains and connects Canadians on multiple platforms. Our successes and accomplishments are driven by embodying and upholding values, which": "en",
    "Hi there! Thanks for stopping by Are you actively looking for a new opportunity? Or just checking the market? Well you might just be in the right place! We are looking for a Senior iOS Developer to join one of our squads where you will be supporting Lightspeeds Hospitality product": "en",
    "Come join the Digital Security Revolution! At APrivacy, we provide a seamless digital security that delivers multi-channel customer experiences. We are thus looking for the best talents that seek to upgrade digital security in every possible way. Join the journey of an award-winning FinTech start-up that has already begun to": "en",
    "This a Full Remote job, the offer is available from Canada Who We Are Konrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to": "en",
    "3 years of iOS development experience iPhoneiPad Experience in Swift development. Experienced with Objective-C, along with all primary frameworks and libraries, memory management techniques, thread and state management paradigms, and tuning for performance and responsiveness. Solid understanding of networking protocols, IP through TCP and and libraries for working with back-end": "en",
    "Join our team as a Contract iOS Developer, where you will have the opportunity to work on iOS development, enhancing the graphic management capabilities of the NIVOMAX platform. This role is perfect for a developer with a passion for creating interactive tools using SVG graphics and metadata management. You will": "en",
    "Description Kotlin Wear OS watches Bluetooth Low Energy HRM Local http and websocket connections REST API endpoints Coroutines RxJava CircleCI buildCI": "en",
    "Job Overview Push Interactions is seeking a Junior or Intermediate iOS Developer to join our team. We are looking for people who have a passion for delivering top-quality work on mission critical software. As a iOS Developer and part of our team, you will be responsible for creating iOS code": "en",
    "About the team role The Futures team is introducing Futures trading as a new asset class on the Robinhood platform. We aim to be the best place for our customers to learn about Futures in a safe and accessible manner by building a streamlined, innovative and cost-efficient experience that our": "en",
    "Our Client is one of the fastest-growing companies in BC and is a leader in their industry. They are looking for a Senior iOS Mobile Developer to join their team. This role will be working on an end-user app used by over hundreds of thousands users as well as a": "en",
    "We are looking for an Android Developer who possesses a passion for pushing mobile technologies to the limits. This Android app developer will work with our team of talented engineers to design and build the next generation of our mobile applications. Android programming works closely with other app development and": "en",
    "We required Senior Android Developers responsible for developing new features and maintaining the various Android applications we develop internally, as well as working with external agencies to ensure they adhere to our development guidelines. You will work alongside our other talented teams of engineers and designers to ensuring a superior": "en",
    "3 years of non-internship professional software development experience 2 years of non-internship design or architecture design patterns, reliability and scaling of new and existing systems experience Experience programming with at least one software programming language How often have you had the opportunity to be a member of a team that": "en",
    "About the Role Team As part of the theScore team, you will be working with a team of smart, friendly, and dedicated Engineers, Product Managers and Designers determined to deliver some of the best apps the market has to offer. We want you to be challenged and to get the": "en",
    "We are looking for multiple experienced Android Developers for our client. This is a full-time, permanent position that is remote to start with later relocation to Calgary or Winnipeg required.. Our client is a global enterprise company with a product that youve likely used. You Have Minimum 2 years in": "en",
    "Job details Country Canada State Region Province Ontario Work Location Mississauga, Toronto Domain Delivery Interest Group Infosys Limited Skills TechnologyMobile Development PlatformAndroid Company ITL Canada Requisition ID 127676BR Job description Infosys is seeking a Android Developer. This position will interface with key stakeholders and apply technical proficiency across different stages": "en"
}