{
    "We are a dynamic FinTech company headquartered in Australia, now expanding our footprint to Malaysia. Specializing in innovative payment and remittance solutions. Why Join Us? Young & dynamic workplace & culture (with office recreational amenities provided) Progressive career prospects Well rewarding project contributions Responsibilities: Develop, test, and deploy high quality": "en",
    "A minimum of 6+ years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS frameworks such as AVFoundation, UIKit, etc. Experience in": "en",
    "iOS Developer Our client is a leading mobile sportsbook operator having global domination with huge investment. This is a unique opportunity to be involved in a business at such a pivotal stage in its development and to become an integral part of the ambitious growth business is set to achieve.": "en",
    "In ByKon we're looking for an exceptional Sr. iOS Developer to join our fast-growing team. This is an opportunity to work alongside world-class technology and data science experts paving way for fast-paced career growth and learning. Main resposibilities: Develop the structure of the architecture and creation of viewsTranslate concept design": "en",
    "Who we are We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we’re here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned": "en",
    "Are you a talented iOS developer ready to make a significant impact? Join Desygner, where innovation meets creativity in a vibrant, multicultural team based in Gold Coast. We celebrate diversity and value bright, talented individuals from all backgrounds.About Us:Desygner stands proudly as one of the leading tech companies in the": "en",
    "Diabetes is a pesky monster — and that’s putting it mildly. If you’re serious about helping us face it head on, come join us! For a behind-the-scenes look, check out our Monster Culture Blog, this little video and Roche code4life to see what makes mySugr and Roche tick. Here's what": "en",
    "Render's singular focus is best summarised by our purpose; continuously innovate and evolve technology to build networks better and connect communities. Render's geospatial network construction platform enables telecommunication network operators and construction teams to digitise the construction workflow and cut the time and cost of large-scale fibre deployment by over": "en",
    "We are seeking a highly skilled Senior iOS Developer to join our dynamic team. In this role, you will be responsible for developing and maintaining cutting-edge iOS applications. Your expertise in Swift and Objective-C, solid understanding of iOS architecture patterns, and mastery of iOS frameworks such as UIKit, Core Animation,": "en",
    "Deine Rolle im Team • Design & Umsetzung von Applikationsmodulen und Softwareprojekten für mobile Devices (Android und iOS) und Backend-Solutions • aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, inklusive technischer Analyse und Entwurfserstellung • Lösung von technisch anspruchsvollen Herausforderungen • Überleitung der Softwarekomponenten von der Entwicklung in die Testabteilung • Sicherstellung der": "de",
    "Who we are We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we're here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned": "en",
    "Short and sweet mohemian is currently seeking a Junior iOS Developer to join our team, that is passionate about creating high-quality software and solving technical challenges. You are the right person if you are solution-oriented and pragmatic, enjoy working in a team, and take pride in the code that you": "en",
    "Deine Rolle im Team • Du wirkst an der Weiterentwicklung der Mein ELBA App für 2,8 Millionen Kund:innen mit und hältst diese am Laufen. • Du entwickelst für unsere Kund:innen eine ansprechende, moderne und barrierefreie Oberfläche um ihre täglichen Bankgeschäfte zu erledigen. • Du sorgst mit deiner sorgfältigen und sicherheitsbewussten": "de",
    "Looking for a iOS Developer. Playing well in a team and has strong analytical and solution-oriented thinking": "en",
    "We are searching for iOS Software Engineers with native iOS development experience As a software engineer you'll be working with project managers, designers, software architects and engineers to deliver software products. Qualification Please apply for this position if you meet the following requirements: • Worked on at least one native": "en",
    "Your role in the team • Work closely with a small, autonomous team of product owners, designers and developers to build new and innovative applications for iOS • Implement custom native user interfaces leveraging the latest iOS programming techniques and frameworks like SwiftUI and Combine • Build reusable iOS software": "en",
    "• Sie sind an der Detailspezifikationen und Architekturentscheidungen beteiligt und implementieren neue Modelle und Features • Zu Ihren Aufgaben gehört die gründliche Analyse von Problemen und die Entwicklung effektiver Lösungsansätze • Sie sind in ständiger Abstimmung mit dem Product Owner, wenn es um technische Herausforderungen wie Komplexität, Umsetzbarkeit, Sicherheit und": "de",
    "Your role in the team • Design, develop, and maintain advanced features for the iOS platform, collaborating closely with cross-functional teams to deliver a smooth, user-centric trading experience. • Ensure code quality through extensive testing to meet functional requirements and uphold our quality standards. • Own and enhance your area": "en",
    "ios entwickler 80–100% w/m/d Stellenbeschreibung Du arbeitest mit uns an interessanten Projekten für völlig unterschiedliche Kunden und Branchen. Vom ersten Meeting an über die erste Code-Zeile bis hin zum Release bist du voll mit involviert und trägst mit deiner Arbeit maßgeblich zum Erfolg des Projekts bei. Anforderungen motivation vor erfahrung:": "de",
    "Was sind deine Aufgaben? • Du gestaltest attraktive Module und Softwareprojekte für unsere Kundenbegeisterungs-App und dazugehörige Backend-Solutions und setzt diese agil um • Deine aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, von technischer Analyse über Entwurfserstellung bis zu Code Reviews und Systemtests tragen zur erfolgreichen Implementierung bei • Um die hohen Qualitätsansprüche": "de",
    "🚀 What's the position? This is a Full-time Senior iOS Developer position at Neybox for talented individuals who want to work on cutting-edge applications that positively impact the well-being of individuals worldwide. 💫 What will I be working on? You'll be working on our two apps: Pillow, a sleep-tracking app,": "en",
    "Your role in the team • As a member of our Development Team, you are responsible for further developing our product and help create and implement new and exciting features. • Help to improve the PlanRadar iOS app (smartphone, tablet). • Write code that's readable, well documented, and has meaningful": "en",
    "Introduction Interactive Paper , a leading-edge technology firm based in Austria, is at the forefront of redefining the intersection between digital and analog experiences, with a focus on delivering transformative, immersive marketing solutions . We invite you to join a high-impact, fast-growing environment where your technical expertise will be instrumental": "en",
    "iOS Developer Job Description:We are looking for an iOS developer who will be responsible for the development of iOS apps for a range of iOS devices. The candidate should be able to develop iOS applications and their integration with back-end services. You will be working alongside other developers on different": "en",
    "iOS Developer (d/m/w) Kreiere die Zukunft des Bankings - als iOS Developer für die Mein ELBA App! Ort Linz Anstellung Vollzeit Work from Home Bis zu 60% Homeoffice Die Raiffeisen Software GmbH als ein Teil der Raiffeisen Bankengruppe Österreich beschäftigt rund 950 Mitarbeiter:innen an den Standorten Innsbruck, Leoben, Linz, Salzburg": "de",
    "Android & iOS Developer (m/f/d) Arbeitsort: Anstellungsart: Zeitpunkt: Hagenberg i. M. / Wien Vollzeit Ehest möglich ventopay ist die führende Plattform für Digitalisierung und Innovation in der Gemeinschaftsverpflegung. Die Produktpalette beinhaltet neben einem umfassenden Kassen-, Bezahl- und Abrechnungssystem auch Employer Branding Lösungen in Form von Apps und Websites. Täglich gestalten": "de",
    "Your role in the team • You are eagerly following the latest keynote and are excited about the latest developments in the smartphone market • You find creative solutions to transform the extensive possibilities of the various platforms into unique features for our customers • Your creative talent turns even": "en",
    "This a Full Remote job, the offer is available from: Europe This is a remote position. We are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improve/learn. This position is only open for employees,": "en",
    "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish When the App Store was first introduced it launched a cultural and": "en",
    "ServiceM8 is a job management app. We exist to help small businesses thrive. We're a product-driven company focused on customer success. Trade and service businesses in over 40 countries around the world rely on ServiceM8 all day, every day. It empowers these people to run a more organised, productive, and": "en",
    "Senior Software Engineer, iOS Apps Full Time Chatswood, Sydney, Australia We are seeking a talented Senior Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia. As part of our team, you will contribute to the development and maintenance of mobile applications,": "en",
    "swipeJobs is a fast-growing, disruptive, and award-winning staffing platform that is transforming the way people find work and businesses manage their workforce. Our platform connects job seekers with employers, allowing businesses to easily fill their staffing needs. We are slowly becoming the stand-alone market leader in the US market and": "en",
    "Company Description At NCS Australia, we believe in doing technology services better. Our commitment to quality, focus on people, and willingness to challenge traditional thinking set us apart. Our team brings this belief to life by partnering with our clients and communities to make tomorrow together. We are committed to": "en",
    "Android Developer Permanent role based in Melbourne or Sydney We are certified carbon neutral and committed to reducing our impact on the environment. We have long-term partnerships with charities working to address homelessness. We're REA REA Group is not your average digital business. From humble beginnings in a garage in": "en",
    "This a Full Remote job, the offer is available from: European Union Who we are We’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web": "en",
    "Job Description for Sr iOS Developer in Sydney. A minimum of 6+ years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS": "en",
    "Infydots delivers top iOS programmers to help clients' strategic importance and assignment conditions. We supply talented reliable iOS coders on-demand to develop and establish iOS apps that help organizations innovate, improve profitability, and rev time to market.No agreement lock-insComplementary evolution managerNo Permitted Profession DisadvantageDaily basis /weekly basis /monthly basis reportingConstant": "en",
    "We are searching for an exceptional Remote Mobile Technical Team Lead to join our client's dynamic software development startup. Our client is a prominent multi-asset liquidity and technology white-label solutions provider for brokerages and exchanges, and with a well-funded operation and a team of over 200 employees, they are revolutionizing": "en",
    "This a Full Remote job, the offer is available from: Austria, Germany Unternehmensbeschreibung Du brennst für agile Softwareentwicklung, dich begeistert Ende-zu-Ende Verantwortung und du suchst nach einer angenehmen Arbeitsatmosphäre mit viel Raum für Weiterentwicklung? Willkommen bei Breuninger! Breuninger ist der führende Fashion und Lifestyle Department Store im Premium und Luxussegment": "de",
    "Sei un appassionato del mondo IT e ti piacerebbe intraprendere un percorso di crescita in ambito iOS? In System Management passione e professione camminano di pari passo. La nostra organizzazione è caratterizzata da team coesi che lavorano in modo sinergico, armonioso e collaborativo. Il motore della nostra realtà aziendale sono": "it",
    "Deine Rolle im Team • Responsibility for the technical development of blockchain-related products • Development of cross platform mobile applications • Working closely with related teams to develop decentralized products and services • Developments of various APIs related to blockchain technologies • Aligning with Information Security team to prevent attacks": "de",
    "About The Role & TeamManages the technical design development and maintenance of mobile applications, associated CI/CD pipelines, automated tests, and development tools using existing and emerging technology platforms.What you will be doing Writes and delivers complex code for features, user stories, reusable modules, unit testing and automated functional testing, debugs": "en",
    "As an iOS Developer, you will be responsible for developing application enhancements to our iOS platform. Your role will involve developing scalable and efficient iOS based apps and enhancements and ensuring the stability and security of the overall architecture. You will work closely with cross-functional teams to deliver solutions that": "en",
    "We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we’re here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned experts to invest": "en",
    "Select how often (in days) to receive an alert: Can you engineer a brighter tomorrow? It's crystal clear: the actions we take in the next few years will significantly impact our future. At Volvo Cars, we embrace change. We're committed to transforming the automotive industry and leading in electrification. For": "en",
    "This a Full Remote job, the offer is available from: Europe, Portugal The role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or": "en",
    "Be part of one of the most innovative Digital Business areas that focuses on sustainable digital & data products to support Biosecurity compliance. Due to the nature of the client organisation and projects at hand, only Australian Citizens can be considered for the role. To be considered, we seek: 5+": "en",
    "Senior Django+Angular Developer (Full-Stack or FE + BE) Remote • We are seeking two experienced developers to enhance our legacy product catalog application—a critical platform that bridges communication between data providers and recipients. • You’ll be instrumental in developing new features that allow providers to input product data with both": "en",
    "Software Engineer, iOS Apps Full Time, Hybrid, Chatswood, Sydney, Australia We are seeking a talented Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia. As part of our team, you will contribute to the development and maintenance of mobile applications, revolutionizing": "en",
    "About the Team DoorDash is building the world's most reliable on-demand, logistics engine for delivery. We are seeing hypergrowth and expanding ouroffices globally We are looking for Founding Engineers to join ourTeam and to work on building and maintaining a large scale 24x7 global infrastructure system that powers DoorDash's 3-sided": "en",
    "Was sind deine Aufgaben? • Du gestaltest attraktive Module und Softwareprojekte für unsere Kundenbegeisterungs-App und dazugehörige Backend-Solutions und setzt diese agil um. • Deine aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, von technischer Analyse über Entwurfserstellung bis zu Code Reviews und Systemtests, trägt zur erfolgreichen Implementierung bei. • Um die hohen Qualitätsansprüche": "de",
    "Your role in the team • Development and further development of individual cross-platform apps • Holistic support of the development cycle from conception to release • Implementation of the design and further development of our mobile apps for iOS and Android • Programming the frontend modules while looking at the": "en",
    "Apply now Job no: 504406Work type: Contract Full TimeLocation: VariousCategories: IT/Technology About the ABC The ABC is the nation's most trusted and independent source of Australian conversations, culture, and stories. With over 4,000 employees from diverse backgrounds across over 50 locations around Australia and overseas, we are proud to create,": "en",
    "This is a Senior Android Engineer role with one of the leading companies in AU right now 🔥 -- Zeller -- with an amazing team. They are continuing to grow rapidly. This is the chance to join right as the 🚀 takes off. More About the Role at Zeller 🧐🧐": "en",
    "Company Description Yambla is a startup based in San Francisco and Belgium. We are revolutionizing the way companies innovate. Even the largest companies have trouble innovating. Nokia, Kodak, BlackBerry and BlockBuster are just a few examples of thriving companies that went from hero to zero overnight due to a lack": "en",
    "About us We're the world's most-trusted name in keeping cats and dogs safe and healthy. The secret to that success? A team of truly unique individuals who care about each other just as much as going the extra mile for pet parents. Your territory As part of our innovative Android": "en",
    "About Us: We are a leading IoT technology company that has revolutionized the culinary sector with our innovative smart consumer gadget. Our product is designed to elevate the cooking experience by seamlessly integrating advanced technology with culinary precision. Headquartered in Leicester, our team is passionate about pushing boundaries, enhancing user": "en",
    "Android APP weiter entwickeln. Neue Features umsetzen, die wir vorab gemeinsam ausarbeiten.": "de",
    "Fingerprint empowers developers to stop online fraud at the source. We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. We are a globally dispersed, 100% remote company with a strong": "en",
    "Mobile Developer Job Overview New project do develop top cutting Edge Mobile app on both common platform IoS and Android and using adaptative UI for Android Auto and Apple CarPlay. Responsibilities for Mobile Developer • Identify and plan for new features • Develop application programming interfaces (APIs) to support mobile": "en",
    "CTO on Demand to Oversee Android App CreationLocation: Cambridge, TASMANIA, Australia Posted on: Jun 25, 2020 Profile: I am looking for a freelancer to mentor and oversee our Android app creation and offer hands-on technical help in the process. Skills Required: AndroidMobile App DevelopmentSoftware ArchitectureBackend DevelopmentAPIApplication for: CTO on Demand": "en",
    "Location: Remote About Us We're a tech startup developing Pebble, an innovative AI device transforming the way people interact with technology. Our team is passionate, forward-thinking, and focused on ambitious goals. We're seeking a skilled Android OS developer to take the lead in customizing the operating system powering the Pebble": "en",
    "Computer Scientist (m/f/d) as App Developer for iOS / Android RIWA - All geoinformation becomes a digital experience RIWA GmbH is a leading company in the field of geoinformation and municipal specialist processes with over 25 years of experience and market leader in Bavaria. Our team develops innovative solutions for": "en",
    "Deine Rolle im Team • Kein Blaming, kein Shaming. Wer verändert, lernt ständig. Wir bestrafen Innovationswille nicht, sondern glauben an die Kraft neuer Tools und Konzepte - wenn sie unseren Kunden und unserem Team helfen, besser zu werden. Für jede Aufgabe den passenden Stack zu finden hält uns wach und": "de",
    "Android Developer (d/m/w) Programmieren & kommunizieren, kombiniere deine Stärken in dieser vielseitigen Schnittstellenfunktion! Ort Linz Anstellung Vollzeit Work from Home Bis zu 60% Homeoffice Die Raiffeisen Software GmbH als ein Teil der Raiffeisen Bankengruppe Österreich beschäftigt rund 950 Mitarbeiter:innen an den Standorten Innsbruck, Leoben, Linz, Salzburg und Wien. Unser Ziel": "de",
    "Android Kotlin Developer* BAWAG Group is the listed holding company of BAWAG P.S.K., which is one of the largest banks in Austria with 2.1 million customers. As a dynamic employer, we promote talent and drive technological innovations quickly. Flat hierarchies, a flexible working environment and equal opportunities for our employees": "en",
    "As a Lead Mobile App Developer, you will oversee the creation of advanced mobile applications for Android and iOS platforms. You will manage cross-functional teams, convert strategic objectives into technical implementations, and ensure the delivery of high-quality, scalable, and high-performing mobile solutions. Responsibilities: Lead and mentor development teams, fostering technical": "en",
    "Expedia Group brands power global travel for everyone, everywhere. We design cutting-edge tech to make travel smoother and more memorable, and we create groundbreaking solutions for our partners. Our diverse, vibrant, and welcoming community is essential in driving our success. Why Join Us?To shape the future of travel, people must": "en",
    "Functieomschrijving: • As Android Software Developer you create software which runs on a custom Android Display platform that enables user control functionality of agricultural and other off-road commercial vehicles. • You must have the ability to generate efficient software code, based on written and verbal specifications. • As Android Software": "nl",
    "We are looking for a dynamic and code lover, iOS Developer to join our team and help us in our Platforms! If you want to be part of a young, fun and multicultural team and work for a growing company with multiple challenges and projects, please send us your application": "en",
    "Gaming1 is hiring with Peerlist for a Full-time IOS & REACT NATIVE SOFTWARE ENGINEER (LIEGE-BELGIUM). Required skills: native ecosystem,Android,iOS,react-native,CICD,redux,English": "en",
    "This a Full Remote job, the offer is available from: United States, EMEA About us: RevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps. We": "en",
    "Hola! ¿Todavía no conoces HIBERUS TECNOLOGÍA? Somos una empresa de #tecnología construida con un ingrediente diferencial, la HIPERESPECIALIZACIÓN. Formar parte de Hiberus significa crecimiento, pasión por la tecnología, interés por la innovación, ambiente laboral flexible y colaborativo, compañerismo, aprendizaje, formación continua, motivación y superación ante nuevos retos...y esto es solo": "es",
    "Android Developer Job Description:We are looking for experienced Android developers to design and develop world-class mobile apps. You will be responsible for working closely with our team of skilled engineers to design and develop the next generation of mobile applications.The ideal candidate should have technical expertise in Java, Android development": "en",
    "In ByKon we're looking for an exceptional Sr. iOS Developer to join our fast-growing team. This is an opportunity to work alongside world-class technology and data science experts paving the way for fast-paced career growth and learning. Main Responsibilities: Develop the structure of the architecture and creation of views Translate": "en",
    "Als Lead Developer bei uns bist Du in den gesamten Projektalltag von der Aufwandsschätzung bis zum Deployment eingebunden und spielst dabei eine wichtige Rolle in der Ausdefinition von Stories und Tasks, der fachlichen Leitung des EntwicklerInnen-Teams und übernimmst Verantwortung für technische Umsetzungs-Entscheidungen. Außerdem bist Du Innovationstreiber und sorgst dafür, dass": "de",
    "✈️MEET AVIOBOOK ✈️ AvioBook is a global leader in providing cutting-edge software and a one-off unique hardware solution for the aviation industry. We began by revolutionising the Electronic Flight Bag (EFB) market with a product designed by pilots for pilots and their flight crews. Today, we continue to innovate, creating": "en",
    "LOOP is a digital-first lead agency, exploring the intersections between design, technology and digital brand building for leading brands. With a team of 400 digital talents and through data driven marketing, we help brave clients to stand out in the digital age. Over the last few years our brilliant team": "en",
    "Job Description Are you an experienced Flutter Developer eager to create innovative mobile applications? Join our team, where your passion for coding, testing, and delivering cutting-edge apps will make a real impact. • As a Flutter Developer, you’ll be involved in every phase of the development lifecycle, ensuring high-quality and": "en",
    "Lead Mobile Developer | Hyper Growth Startup | $160,000 + Super We are working closely with a fast-growing startup who are well-backed and looking to build on early success. They are looking for a seasoned React Native Developer to take on the coding responsibilities of a Lead Developer. There are": "en",
    "About us Trideca is a strategy, data and digital partner for technology transformation across Australia. We have worked with some of Australia's leading enterprise companies (including NAB, Suncorp, Optus, Medibank, AGL and many more), to help transform and empower their businesses. Working for Trideca, you will be challenged to think": "en",
    "Do you want to push the frontier of digital services in telecommunication? Are you passionate about cutting edge user experience? Do you love to build relevant User Experiences for a broad audience? Then you are exactly right with Drei. Join our mission and become part of Team “Up3” at Drei,": "en",
    "SENIOR FRONTEND MOBILE DEVELOPER (m/w/d) Dienstort: SALZBURG STADT ODER ST. JOHANN IM PONGAU Arbeitszeit: VOLLZEIT 38,5 h Eintritt: ASAP Eintritt: 0 % BEWIRB DICH ALL ABOUT: TECHNOLOGIEN, DIE LEBEN RETTEN SINNSTIFTEND, NACHHALTIG, AGIL. VERNETZT, INNOVATIV, MODERN. EINZIGARTIG, DYNAMISCH, INTERNATIONAL. Mit 360-Kommunikations- und Leitstellenlösungen schaffen wir Sicherheit. Einsatzorganisationen, Industriekunden und internationale": "de",
    "This a Full Remote job, the offer is available from: Europe, Belarus, Poland, Kazakhstan We are looking for experienced Middle/Senior Mobile Flutter Software Engineers to join our core product – BOSS Revolution. You have a chance to work with a team of outstanding professionals on a challenging product. You will": "en",
    "Position: Senior Android Developer (m/f/x) Location: Gaishorn Your role at Dynatrace Excited about “behind the scenes”mobile development? Do you want to join aglobal leaderthat enablesdigital transformation? Looking for teammates who appreciateopen communication and facechallengestogether as a team? Why you will love being a Dynatracer Dynatrace is a leader in unified": "en",
    "Location Qualifications: Ghent (Hybrid), Wroclaw (Hybrid) Position Overview: At Showpad, our mobile app is essential to our offering and provides a seamless experience for all users throughout their sales cycle. With a proven track record of user satisfaction, we are committed to continuously enhancing user journeys. As an iOS Engineer,": "en",
    "The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. • *﻿﻿Your skills** • You have already had a first experience in iOS development with Swift • You can": "en",
    "Android Developer Job Description: We are looking for experienced Android developers to design and develop world-class mobile apps. You will be responsible for working closely with our team of skilled engineers to design and develop the next generation of mobile applications. The ideal candidate should have technical expertise in Java,": "en",
    "Functie Als iOS Developer zal je deel uitmaken van ons development team voor de ontwikkeling, doorontwikkeling en support van onze mobiele applicaties voor ERP en retail projecten. Hierbij werk je in een team aan projecten voor klanten. Je belangrijkste verantwoordelijkheid zal eruit bestaan om mee onze ERP en retail software": "nl",
    "Overview: The Android Developer – Kotlin position is a critical role within our organization, responsible for developing and maintaining high-quality mobile applications on the Android platform using Kotlin. This role plays a vital part in our company’s technological growth and is instrumental in delivering exceptional user experiences. Key Responsibilities: •": "en",
    "Your territory As part of our innovative Android Development team, you will: • Develop a state-of-the-art app that is used by more than a million people • Define, implement and test new features for our app within Android frameworks • Help with identifying performance bottlenecks in the app and finding": "This text is in English, so the ISO country code is \"en\".",
    "I'm in need of an experienced Android App Developer to take over my current project. The primary focus will be on addressing backend functionality issues. The app is currently hosted on Vultr and requires immediate attention in the following areas:Database Management: Overseeing the database and ensuring its efficient operation.API Development:": "en",
    "We are looking for an (Embedded) iOS SDK Developer in Antwerp, Belgium. As (Embedded) iOS SDK Developer, you will be working on the Mobile Software Development Kit (SDK) of our customer and dive deep into low-level embedded programming. English speaking candidates are welcome to apply and need to be willing": "en",
    "This a Full Remote job, the offer is available from: EMEA About us: Talent has no borders. Proxify's mission is to connect top developers around the world with opportunities they deserve. So, it doesn't matter where you are; we are here to help you fast-track your independent career in the": "en",
    "About Showpad At Showpad, personalities and cultures connect across oceans to create something extraordinary. As a top software company in the Inc. 5,000 Europe list, Showpad is changing the game when it comes to sales enablement. Our employees create the engagement and impact that drives our success as we expand": "en",
    "We're working for a prestigious consumer electronics company based in Belgium that is looking for an experience Embedded Android Developer for a cutting edge conferencing platform project. We're looking for a Senior Engineer that is a great communicator and can bring a team along in the are of Embedded Android": "en",
    "At 4411, we are committed to making parking a hassle-free experience for all car users. With over 3 million registered users, 4411 is the largest parking application in Belgium. Our app allows you to pay for your parking session easily and remotely, by the minute. In addition to street parking,": "en",
    "Belgium, Brussels Senior Contract Hiring Process Time to Answer 2 open days Process 1 Phone Call 1 Onsite Interview Days to get an Offer 4 Days after Interview Overview Android Developer with strong clean code principles, knowledge of Google’s Android design principles, Kotlin, Jetpack Compose, TDD, Material 3 design, and": "en",
    "This a Full Remote job, the offer is available from: Belgium We are looking for a React Native developer interested in building performant mobile apps on both the iOS and Android platforms. You will be responsible for architecting and building these applications, as well as coordinating with the teams responsible": "en",
    "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and": "en",
    "At bunq, we’re not just creating a banking app; we’re reshaping how people experience financial freedom worldwide. As part of the Tricount team, you’ll design and develop innovative mobile applications that simplify group expense management for millions of users. You will work closely with our team to create seamless, secure,": "en",
    "About Us 👋 Hey there! Before we dive into the job details, let's give you a quick rundown of our company. At November Five, we're not just about digital solutions; we're about creating memorable experiences with more amazement, more heart, and more results. As the go-to digital partner for customer": "en",
    "Job Description The number of customers in several countries enjoying our market leading integrated IT platform specifically for local shops, retail chains en couriers is exploding. The Connect24-7 platform allows them to serve their customers always and everywhere. That’s why we are looking to strengthen our experienced team with a": "en",
    "Mobile Engineer (Swift) - LLM Training Location: Anywhere in the World Remote (Europe, Latam, Asia ) Contract length - 12 Months Opportunity- Full Time, 8 hours, 5 hours Mandatory overlap with PST Total Years Of exp- 3+ years Mandatory Mandatory Skills- Swift (for iOS) min 2 years of experience OR": "en",
    "This a Full Remote job, the offer is available from: Belgium Our Mobile Apps teams is now hiring on our latest Tech Hub in Athens! We are looking for Senior Android Developer to join our Product development Department. You will be part of the Mobile Apps team and together we": "en",
    "We are looking for an Android developer to join our mobile team. The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. Our offer • Training opportunities • Home": "en",
    "Als Android Developer zal je verantwoordelijk zijn voor het onderhouden en uitbreiden van de huidige 4411 Android app. De app is reeds volledig in Kotlin geschreven (2% Java) en volgt in grote lijnen de best practices die volgens Google zijn gedefinieerd. Ook zijn we begonnen met de transitie naar Jetpack": "nl",
    "As a React Native Mobile Developer at Massive Media you will be part of a talented, young & dynamic team that builds highly scalable products used by millions. We are seeking an experienced, dedicated, and well-organized Mobile Developer with relevant experience in React Native to join our team (60% Ghent-based": "en",
    "Location Brussels Vacancies 1 Job description Are you passionate about challenges? Izertis is your company. We are looking for an IT Developer for a client in Brussels. Responsibilities: • Translating requirements into high-quality code • Design, build, and maintain high-performance, reusable, and reliable Kotlin code for the Android platform •": "en",
    "26-04-2024 Antwerp area We are currently looking for a “Android developer” for Antwerp area. Description/profile • Good knowledge of Android development • Experience with Kotlin • Experience with modern development and operations processes and methodologies • Experience with testing • Experience with AWS • Experience with Javascript and/or TypeScript •": "en",
    "Le département Rossel Applications a pour mission la supervision et la prise en charge de l’ensemble des tâches de conception, de mise en œuvre, d’intégration et d’évolution des différents environnements applicatifs du Groupe Rossel (digital, publicité, contenu éditorial, marketing, finance, RH, support client, gestion d’abonnements, vente et distribution, …). Selon": "fr",
    "The perfect candidate can work independently, write excellent code and meet expected deadlines. As a consultant you have the necessary social skills and flexibility to successfully complete projects for the customer. • *Your skills** • You have already had a first experience in Android development with Kotlin • You can": "en",
    "Position: Senior Development Lead Mobile Apps 📍 Location: Flexible (City-based or Remote Option) 🕒 Duration: Long-term project 💻 Remote: Yes ⏳ Contract Type: Freelance 💼 Experience: Senior Level (10+ years) Key Responsibilities • Lead and mentor mobile development teams, fostering technical growth. • Design and implement cutting-edge, scalable, and customer-centric": "en",
    "An established logistics client based in the center of Brussels are currently on the lookout for a Senior Development Lead within Mobile Application (Android & IOS) . They are looking for someone to guide teams and translate technical solutions ensuring quality & scalability. This is a 6 month contract (extendable)": "en",
    "Hi there! Thanks for stopping by 👋Are you actively looking for a new opportunity? Or just checking the market? Well… you might just be in the right place! We’re looking for a Senior iOS Developer to join our Lightspeed Hospitality Team in EMEA. You will work on a variety of": "en",
    "About us: RevenueCat makes building, analyzing, and growing mobile subscriptions easy. We launched as part of Y Combinator's summer 2018 batch and today are handling more than $4B of in-app purchases annually across thousands of apps. We are a mission driven, remote-first company that is building the standard for mobile": "en",
    "What will you be doing? As an iOS Developer you’ll be working closely with your colleagues in the mobile app team, the UX-experts, designers, project managers and in a lot of cases your fellow engineers from the web app team. You’ll develop and maintain custom iOS apps made for our": "en",
    "We help the world run better At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces": "en",
    "ABOUT US Hey there! Before we dive into the job details, let's give you a quick rundown of our company. November Five is the go-to digital partner for customer experience leaders like Coca-Cola, Spotify, Telenet, Le Pain Quotidien, Mediahuis or KBC Bank. We don't shy away from a challenge. We": "en",
    "Department: New Financial Services - Eng Employment Type: Full Time Location: Remote Description Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of": "en",
    "The adesso Group is one of the largest German IT service providers and has outstanding opportunities for growth. At its own locations in Germany, Austria, Switzerland, Turkey, Spain, the Netherlands, Bulgaria, USA and the UK as well as at numerous customer sites, adesso offers consulting and software development services for": "en",
    "This a Full Remote job, the offer is available from: Bulgaria About the client: An independently-owned Global business solutions company enabling offshore operations from a locations in the Philippines, India, Bulgaria, Vietnam, Belgium and the US. With European roots, they provide services to global companies that have offices in every": "en",
    "Join Us at IQVIA! We are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment (eCOA) platform. Our fast, flexible, and proven solution enhances efficiencies, delivers real-time data, and sharpens insights, all while providing a superior patient experience. Who": "en",
    "Our client, an American product company, is expanding its team in Bulgaria! They are building their first Mobile Development Team locally and are looking for talented professionals to join them on this journey. The company is developing an innovative SaaS platform, and this is your chance to be part of": "en",
    "Our partner is a product company that creates a one-of-a-kind cloud-based product that helps businesses connect with each other instantly. What do we need? • Experience in native mobile development for iOS • Understanding of algorithms and data structures. • System and network programming experience is a plus - OS": "en",
    "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed (~$200M in funding) by VCs from Silicon Valley,": "en",
    "This a Full Remote job, the offer is available from: Bulgaria, Poland, Romania, South Africa, Portugal, Spain, Slovakia Join Us at IQVIA! We are looking for talented individuals to join our team and help us revolutionize patient care with our electronic clinical outcome assessment (eCOA) platform. Our fast, flexible, and": "en",
    "Company Description Appolica is a Bulgarian mobile app agency working with start-ups and established brands like KBC, Tide, PostBank, OnTheMarket, AT&T, etc. We work together with our clients to build compelling apps that provide lasting engagement with their customers. Our deep understanding of mobile technology enables us to bring a": "en",
    "We are TINQIN – Technology Expertise, Industry Knowledge, Quality Focus and Innovation Spirit! As part of the Be Ys group, TINQIN was founded to challenge the status quo. We’re more than just a software company – we’re the driving force behind transformative solutions that shape the future of the insurance": "en",
    "Department: Marketplace- Eng Employment Type: Full Time Location: Remote Description Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of their money. Over": "en",
    "This a Full Remote job, the offer is available from: Bulgaria Senior iOS Engineer ﻿﻿Human Power BG is an HR agency that offers consultations and recruitment for some of the best companies in Bulgaria. Role Summary: Create wondrous, beautiful software that helps people to better understand their world. Were looking": "en",
    "This position is available for more locations in Eastern Europe, but it will be managed from Bulgaria. Our client is designing the next generation of the UC (Unified Communication) product line for audio and video streaming. From the BSP perspective, the client needs help with board bring-up and support the": "en",
    "About us: Bulwork is the first IT recruitment agency in Bulgaria with 24 years of stable presence in the market. The company has established a reputation for delivering high-quality services to clients and candidates. We respect the candidates' wishes and strive to provide the best service by finding the most": "en",
    "KPMG IT Service OOD is an IT service provider with a mission to digitalize the core business of the KPMG network member firms and their clients. We employ more than 500 people in Sofia and deliver the full spectrum of IT services to our clients, including ServiceNow solutions, SAP solutions,": "en",
    "We are Omnissa! The world is evolving fast, and organizations everywhere—from corporations to schools—are under immense pressure to provide flexible, work-from-anywhere solutions. They need IT infrastructure that empowers employees and customers to access applications from any device, on any cloud, all while maintaining top-tier security. That’s where Omnissa comes in.": "en",
    "myPOS is an innovative fintech company serving small and medium-sized business clients across the European Economic Area, Switzerland and the UK. It provides easy and convenient in-store, online and on-the-go payment solutions to more than 200,000 businesses in over 35 European countries. With 20 locations across Europe, myPOS boasts a": "en",
    "Currently you have the opportunity to join our team at the position of Android Engineer. What will you do? • Participate in design, development, and maintenance of our mobile apps; • Drive technical discussions, make informed decisions, and provide recommendations on software architecture, tools, and best practices. • Be part": "en",
    "We’re defining what it means to build and deliver the most extraordinary sports and entertainment experiences. Our global team is trailblazing new markets, developing cutting-edge products, and shaping the future of responsible gaming. Here, “impossible” isn’t part of our vocabulary. You’ll face some of the toughest but most rewarding challenges": "en",
    "This a Full Remote job, the offer is available from: Bulgaria Dreаmix was founded 18 years ago by passionate IT students, who wanted to create the dreamiest workplace where everyone is heard, works under transparent management, and lives up to their full potential. Now, many years later, we deliver software": "en",
    "This a Full Remote job, the offer is available from: Bulgaria Job Description As an Android Software Engineer, you will join our Driver mobile app team. This team provides for fleet companies solution so a driver can do his day-to-day operations based on a combination of a mobile and inhouse": "en",
    "This a Full Remote job, the offer is available from: Bulgaria Our partner is ﻿a company founded in Burgas as a start-up, ﻿currently employs over 70 people working in four offices in Bulgaria - Sofia, Burgas, Plovdiv and Varna. The company specializes in the sphere of digital technologies and software": "en",
    "Opening from Canada Bounteous x Accolite makes the future faster for the world's most ambitious brands. Our services span Strategy, Analytics, Digital Engineering, Cloud, Data & AI, Experience Design, and Marketing. We are guided by Co-Innovation, our proven methodology of collaborative partnership. Bounteous x Accolite brings together 5000+ employees spanning": "en",
    "Job Title: IOS Developer Location: Sun Bruno, CA (Onsite, Locals Preferred) Duration: 12+ Months of Contract. Requirements: • 5+ years of professional experience in various elements of full stack software development – native mobile, web front end, back end, and hands-on coding experience in the past • Experience with a": "en",
    "Infosys is seeking a IOS Developer. This position will interface with key stakeholders and apply technical proficiency across different stages of the Software Development Life Cycle including Requirements Elicitation, Application Architecture definition and Design; play an important role in creating the high level design artifacts; deliver high quality code deliverables": "en",
    "Senior iOS Developer (OTT) (English Services) (Telework) Position Title: Senior iOS Developer (OTT) (English Services) (Telework) Status of Employment: Contractee Long-Term (Fixed Term) Unposting Date: 2024-12-29 11:59 PM This role offers the possibility of full-time telework. Work schedule to be discussed with Hiring Manager according to the guidelines defined by": "en",
    "Are you great at transforming product requirements into mobile apps? Are you aching to join a wildly dedicated team? Do you want to share your knowledge and build top-notch mobile experiences with our experienced developers? Read on, because we might have a spot for you at our table. Responsibilities:Prototype and": "en",
    "Role OverviewMcAfee is searching for an intermediate iOS/macOS Developer to support our VPN team in building private, secure, and beautifully designed apps. Through the TunnelBear iOS app and our Apple SDK, we enable millions of users to connect their devices securely.The team is passionate about building the best user experiences": "en",
    "Remote Junior iOS Software Engineer position at AssistIQ, requiring 1+ years of mobile development experience with React Native and iOS.": "en",
    "Company Description Continental Technology Solutions is Our consulting and managed services deliver the resources and capabilities required to assess,design, build and manage an agile, flexible IT environment. You'll work with one dedicated team from strategy and assessment through design, implementation, management and optimization to reach a true end-to-end solution. Job": "en",
    "We are looking to hire a full-time iOS Developer with native app development experience. Are you the type of person who loves to collaborate with other talented people to bring an application to life? Are you a talented, team oriented person? Do you like to work on a variety of": "en",
    "Role: iOS Developer Type : Contract Role Qualifications: · Completed Bachelor's degree or diploma (or equivalent experience) in Computer Science, Software Engineering or Software Architecture preferred; candidates with substantial and relevant industry experience are also eligible · High level understanding of DevOps and/or SRE practices · 10+ years of engineering": "en",
    "Our client has engaged ROSS (www.getROSS.com) to find a phenomenal Mobile Application Developer (Android & iOS) for an amazing permanent opportunity in downtown Toronto. Our Agency: ROSS is an innovative leader in Recruitment Process Outsourcing (RPO), HR Technology, Recruitment and HR Professional Services. We’re a company of People Specialists helping": "en",
    "There’s a reason you carry an iPhone in your pocket. It’s something about the iPhone look... the iPhone feel… the way your Apple Watch starts sending you heart rate alerts when your Xcode successfully compiles… or the limitless possibilities of SwiftUI, especially now that those medieval iPhone 6’s have been": "en",
    "Intelliware is looking for iOS developers to join our team! At Intelliware you'll have the opportunity to be part of a top-notch team and work on a wide range of consumer and enterprise mobile applications. We have virtual collaborative project rooms where you'll work closely with a cross functional team": "en",
    "Requisition ID: 204334 Tangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that": "en",
    "Who We Are Konrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to creating best-in-class digital products in use by hundreds of millions of": "en",
    "We are looking for a great iOS application developer to join our mobile team. In this role you will work closely with our Product and Mobile team to help us shape, design, and build our customers’ applications. The ideal candidate is an excellent programmer, user-focused, and passionate about playing with": "en",
    "BH - Senior iOS Developer - Permanent On behalf of our client, Brainhunter Systems is looking for an outstanding Senior iOS Developer to join their medium sized team of talented, dedicated and friendly mobile professionals. We’re looking for someone who can be a driving force in the design, creation and": "en",
    "Position Title: Senior iOS Developer (OTT) (English Services) (Telework) Status of Employment: Contractee Long-Term (Fixed Term) Position Language Requirement: Language Skills: Work at CBC/Radio-Canada At CBC/Radio-Canada, we create content that informs, entertains and connects Canadians on multiple platforms. Our successes and accomplishments are driven by embodying and upholding values, which": "en",
    "Join Robinhood as an iOS Developer, working on high-impact financial products and revolutionizing finance through mobile technology.": "en",
    "• 3+ years of iOS development experience (iPhone/iPad); · Experience in Swift development. • Experienced with Objective-C, along with all primary frameworks and libraries, memory management techniques, thread and state management paradigms, and tuning for performance and responsiveness. • Solid understanding of networking protocols, IP through TCP and and libraries": "en",
    "Company A leader in the food and beverage industry, helping the most prominent companies in their sector creating efficiency, lower costs and delivering customer satisfaction. Their platform makes it convenient, quick and easy for guests to order and pay for on mobile phones, web, via in-store kiosks or tablets. Role": "en",
    "Join our team as a Contract iOS Developer, where you will have the opportunity to work on iOS development, enhancing the graphic management capabilities of the NIVOMAX platform. This role is perfect for a developer with a passion for creating interactive tools using SVG graphics and metadata management. You will": "en",
    "Description • Kotlin • Wear OS watches • Bluetooth Low Energy HRM • Local http and websocket connections • REST API endpoints • Coroutines • RxJava • CircleCI build/CI": "en",
    "Come join the Digital Security Revolution! At APrivacy, we provide a seamless digital security that delivers multi-channel customer experiences. We are thus looking for the best talents that seek to upgrade digital security in every possible way. Join the journey of an award-winning FinTech start-up that has already begun to": "en",
    "Hi there! Thanks for stopping by 👋 Are you actively looking for a new opportunity? Or just checking the market? Well… you might just be in the right place! We are looking for a Senior iOS Developer to join one of our squads where you will be supporting Lightspeed’s Hospitality": "en",
    "This a Full Remote job, the offer is available from: Canada Who We Are Konrad is a next generation digital consultancy. We are dedicated to solving complex business problems for our global clients with creative and forward-thinking solutions. Our employees enjoy a culture built on innovation and a commitment to": "en",
    "We required Senior Android Developers responsible for developing new features and maintaining the various Android applications we develop internally, as well as working with external agencies to ensure they adhere to our development guidelines. You will work alongside our other talented teams of engineers and designers to ensuring a superior": "en",
    "Our Client is one of the fastest-growing companies in BC and is a leader in their industry. They are looking for a Senior iOS Mobile Developer to join their team. This role will be working on an end-user app (used by over hundreds of thousands users) as well as a": "en",
    "We are looking for multiple experienced Android Developers for our client. This is a full-time, permanent position that is remote to start with later relocation to Calgary or Winnipeg required.. Our client is a global enterprise company with a product that you've likely used. You Have: • Minimum 2+ years": "en",
    "• 3+ years of non-internship professional software development experience • 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience • Experience programming with at least one software programming language How often have you had the opportunity to be a member of": "en",
    "About the Role & Team As part of the theScore team, you will be working with a team of smart, friendly, and dedicated Engineers, Product Managers and Designers determined to deliver some of the best apps the market has to offer. We want you to be challenged and to get": "en",
    "We are looking for an Android Developer who possesses a passion for pushing mobile technologies to the limits. This Android app developer will work with our team of talented engineers to design and build the next generation of our mobile applications. Android programming works closely with other app development and": "en",
    "Job Overview Push Interactions is seeking a Junior or Intermediate iOS Developer to join our team. We are looking for people who have a passion for delivering top-quality work on mission critical software. As a iOS Developer and part of our team, you will be responsible for creating iOS code": "en",
    "About the team + role The Futures team is introducing Futures trading as a new asset class on the Robinhood platform. We aim to be the best place for our customers to learn about Futures in a safe and accessible manner by building a streamlined, innovative and cost-efficient experience that": "en",
    "Key Responsibilities: 1. Design and Development: o Lead the design and development of advanced iOS features for the insurance sector. o Ensure the performance, quality, and responsiveness of applications. o Collaborate with a team of developers, designers, and product managers to define, design, and ship new features. 2. Collaboration and": "en",
    "About Us Move money. Make money. Finix processes billions of dollars every year for leading SaaS, marketplace, and e-commerce platforms. With one developer-friendly API, Finix helps companies accept payments, manage payouts, and onboard merchants—everything you need to enable payment processing, and grow revenue. Finix has raised over $100M from American": "en",
    "Job Title: Senior iOS Developer About the Job Since 2019, Kahi has been on a mission to revolutionize the restoration industry. Founded by seasoned entrepreneurs with a deep understanding of both restoration and technology, we're building cutting-edge solutions to empower restoration professionals. We're not just another tech company; we're a": "en",
    "Profitek Systems, a leader in Point of Sale (POS) solutions since 1985 and with clients throughout North America and Asia, is seeking Software and Web Developers. We offer exciting opportunities for energetic individuals towards the development of our flagship brand Profitek POS software, or towards the development of our new": "en",
    "Mid-level iOS Developer position at Google, focusing on Google Home Platform SDK development, requiring 5 years of software development experience.": "en",
    "Job Title: Native iOS Developer Location: Toronto, ON Experience: 3+ Years Job Overview: We are seeking a talented Native iOS Developer with expertise in Swift, SwiftUI, and Composable Architecture (TCA) to design, develop, and maintain high-quality iOS applications. As part of a dynamic team, you will build scalable, maintainable, and": "en",
    "Push Interactions is seeking a Junior or Intermediate iOS Developer to join our team. We are looking for people who have a passion for delivering top-quality work on mission critical software. As an iOS Developer and part of our team, you will be responsible for creating iOS code mainly in": "en",
    "As a Senior iOS developer, you will be working alongside our larger development team to improve our iOS applications. You should have a track record of delivering significant iOS-based solutions, experience developing Swift, C/C++ or Objective-C applications of advanced complexity in (data structures, networking, architecture) and a passion for writing": "en",
    "Job details Country Canada State / Region / Province Ontario Work Location Mississauga, Toronto Domain Delivery Interest Group Infosys Limited Skills Technology|Mobile Development Platform|Android Company ITL Canada Requisition ID 127676BR Job description Infosys is seeking a Android Developer. This position will interface with key stakeholders and apply technical proficiency across": "en",
    "SyncDog is looking for an experienced iOS developer to join a development team working in the mobile security and management industry. This individual should have demonstrated iOS ability, and experience working with client/server technology as it relates to mobile technology. Responsibilities • Design and build advanced applications for the iOS": "en",
    "We're hiring for a iOS Software Developer 2 in our Toronto office (hybrid). We are cultivating a culture that prioritizes innovators, risk-takers, and imaginative thinkers. In pursuit of becoming AI-native, we recognize that fostering a 'builder' mindset is essential. This means seeking out those who can seamlessly integrate AI and": "en",
    "Insight Global is looking for Sr iOS Developers to join a top Telecommunications company in Canada. This role is remote in Canada but requires the successful candidate to work PST hours. Key Responsibilities: Design, build, and maintain efficient, reusable, and reliable code in Swift and Objective-C. Oversee the use of": "en",
    "We are looking for an experienced iOS developer to design, build, and maintain the next generation of iOS apps. Your primary responsibility will be to create iOS applications and integrate them with back-end services. You will be working with other engineers and developers on various layers of the infrastructure. As": "en",
    "Job Title: Software Engineer II (Mobile Developer iOS /Android) Overview: Who is Mastercard? Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and": "en",
    "We believe communication belongs to everyone. We exist to democratize phone service. TextNow is evolving the way the world connects and that's because we're made up of people with curious minds who bring an optimistic, yet critical lens into the work we do. We're the largest provider of free phone": "en",
    "About the team + role We’re excited to invite talented and motivated iOS Developers to join our Apple Design Award-winning team to help expand Robinhood’s mobile experience for our customers. Our iOS community is extremely tight knit! We have weekly syncs, frequent tech talks, and recurring in-person offsites. Come join": "en",
    "Join a leading fintech company that’s democratizing finance for all.Robinhood Markets was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood and its subsidiaries and affiliates are lowering barriers and providing greater access to financial information.": "en",
    "Responsibilities: • Design and build new iOS apps written in Swift & SwiftUI • Developing creative, innovative and practical mobile solutions • Estimating, tasking, and prototyping • Ensure the performance, quality, and responsiveness of applications • Collaborating with cross-functional team members on features, design, and implementation • Identify and correct": "en",
    "iOS Engineer III position at Reddit, developing user-facing mobile applications for one of the internet's largest information sources.": "en",
    "Company Overview LGS, an IBM Company, fosters a workplace that values professional growth and diversity. We welcome talented individuals from diverse backgrounds to collaborate on major projects that propel clients' businesses forward and improve lives. Job Description You will play a crucial role in driving collaborative large-scale digital transformation projects": "en",
    "Senior iOS Developer (Fully Remote / Canadian Preferred) Rave is on a mission to make streaming a social experience. Our app synchronizes video content from top platforms like Netflix, YouTube, and more, allowing friends to watch together while chatting in real-time. With over a million users engaging daily, we're looking": "en",
    "Our client is a software telecom company looking for a skilled iOS developer. You’ll get to build an app that people love to use and work with other talented developers. Qualifications • Experience developing native iOS applications • Fluency in Objective-C • Core Data and Concurrency • Must be technically": "en",
    "Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 82M+ daily": "en",
    "We are looking for iOS mobile developer for our ecommerce client in Ville St. Laurent. Skills . Experience with software development; . Solid knowledge of OOP programming; . Have built at least one iPad/iPhone/Android/Tablet application; . Solid understanding of Cocoa/UIKit frameworks and the iPhone SDK; . Solid understanding of Android": "en",
    "Level of experience: Middle/High Position: Team Member Description: To analyse and implement highly efficient websites based on Magento. Extensive expertise in ecommerce & Magento as Base and with Joomla, WordPress as a plus. • Send Resume to info@emacityleads.com": "en",
    "LGS, an IBM Company, is seeking a highly skilled IOS Developer to join our team. As a key member of our team, you will play a vital role in driving major projects that propel our clients' businesses forward and improve people's lives. We are committed to providing a workplace that": "en",
    "This a Full Remote job, the offer is available from: Canada At Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. Technology is": "en",
    "At Bell, our purpose is to advance how Canadians connect with each other and the world. We achieve this by providing consumers and businesses with the best network technologies in the world, innovative digital solutions and seamless customer experiences. It’s all developed and delivered by the members of #TeamBell and": "en",
    "Note: This position does not offer any Visa sponsorship. We are only looking for applicants who are either local to Vancouver, Canada, or ready to relocate to the employer's location. Job Summary: Our Client is looking for a creative and skilled Mobile Application Developer to join their team. You will": "en",
    "We are seeking an experienced Senior iOS Developer to join our team at Pelmorex Corp. in Canada. Job Description: You will play a key role in the development and enhancement of one of Canada's most popular apps, The Weather Network/MétéoMédia, as part of our Apps team. Your responsibilities will include": "en",
    "Genesis10 is currently seeking a iOS engineer - mid level for a perm role working a hybrid schedule (3 days onsite, 2 days remote) with our client located in Toronto, Canada. Job Description: Our client is looking for an iOS engineer to join their rapidly growing engineering team. They're an": "en",
    "Are you a skilled developer looking for your next challenge? We have an exciting opportunity for a talented iOS Developer to join our client's team on a 6-month contract with a strong possibility of extension. About the Job This is a fantastic chance to work with a high-profile client and": "en",
    "Summary Posted: Sep 4, 2024 Role Number:200566455 Imagine what you could do here! The people here at Apple don’t just build products — we craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that supports the innovation that runs through everything": "en",
    "iOS Developer Job Description We are seeking an experienced iOS developer to join our team at {company}. The ideal candidate will have a solid understanding of iOS development and a proven track record of building successful products. Key Responsibilities: • Develop high-quality iOS applications using Swift and Objective-C; • Design": "en",
    "Discover Peliplat Peliplat is an online community made by film lovers, for film lovers! We’re revolutionizing the way film enthusiasts and content creators interact globally, empowering them to craft their own stories and bring their cinematic visions to life. On Peliplat, film aficionados can find spaces to share insights, develop": "en",
    "Job Description: Rakuten International oversees 7 businesses with over 4,000 employees globally. The brand is recognized for its leadership and innovation in e-commerce, digital content, advertising, entertainment, and communications, bringing the joy of discovery and access to more than 1 billion members across the world. Our teams deliver on the": "en",
    "The Mobile Platform team provides the foundation for our mobile clients and enables our mobile teams to build and deliver features faster and with high quality. This team is responsible for the overall developer experience on both iOS and Android as we strive to leverage the latest capabilities of each": "en",
    "LGS, an IBM Company, is committed to providing a workplace that values professional growth and fosters diversity and inclusivity. We welcome talents from both local and international backgrounds. As a key member of our team, you will play a crucial role in driving major projects that propel our clients' businesses": "en",
    "Level 2 About Company: Since our founding in 1935, we company has been committed to serving local and global communities by being a market leader in Investment Banking, Securities, Investment Management and Wealth Management services. Our belief that capital can work to benefit all of society inspires us to put": "en",
    "Hi there! Thanks for stopping by Are you actively looking for a new opportunity? Or just checking the market? Well... you might just be in the right place! We are looking for a Middle iOS Developer to join our mobile team, where we develop mobile applications for Ecwid by Lightspeed.": "en",
    "We're transforming the grocery industry At Instacart, we invite the world to share love through food because we believe everyone should have access to the food they love and more time to enjoy it together. Where others see a simple need for grocery delivery, we see exciting complexity and endless": "en",
    "About Wazo Wazo is a software editor of an API-first Unified Communication Platform designed for telco operators, service providers, and integrators. The platform provides: • An all-in-one application suite to support IP telephony, collaboration and customer relationship needs • A strong solution that can be deployed on any infrastructure and": "en",
    "We seek a highly skilled Mobile iOS SDK Developer with at least 5 years of experience creating robust, efficient, and concise SDKs in Objective-C/Swift. The ideal candidate will be key in designing and developing an SDK that integrates Xsolla’s platform and services, enabling game developers to incorporate monetization features into": "en",
    "Développeur iOS senior (Montréal, Canada) (Veuillez noter que la description de poste en anglais se trouve ci-dessous - Please note that the English job description can be found below) Chez OneSpan, nous réinventons la confiance pour aider les entreprises à prospérer en permettant des accords et des transactions numériques sécurisés,": "fr",
    "At Arlo, we're passionate about creating innovative and reliable solutions that help people protect what matters most to them. Our team is dedicated to delivering products that exceed our customers' expectations, while always pushing the boundaries of what's possible in the world of protection technology. Arlo’s deep expertise in AI-": "en",
    "Bally's Interactive is a global casino-entertainment company with a diverse portfolio of brands and products. We are currently seeking an iOS Application Developer to join our team in Toronto, Canada. About the Company We are a leading provider of online gaming and sports betting solutions, with a strong presence in": "en",
    "Position Title: iOS Senior Developer - OTT Team (French Services) (Telework) Status of Employment: Contractee Long-Term (Fixed Term) Position Language Requirement: English, French Language Skills: English (Reading - B - Intermediate), English (Speaking - B - Intermediate), English (Writing - B - Intermediate), French (Reading - C - Advanced), French": "en",
    "This a Full Remote job, the offer is available from: Canada Mobile Engineer (Swift) - LLM Training Location: Anywhere in the World Remote (Europe, Latam, Asia ) Contract length - 12 Months Opportunity- Full Time, 8 hours, 5 hours Mandatory overlap with PST Total Years Of exp- 3+ years Mandatory": "en",
    "• 10+ Yrs of exp on Mobile App Development • Designing and building advanced applications for the iOS platform • Collaborating with cross-functional teams to define, design, and ship new features. • Unit-testing code for robustness, including edge cases, usability, and general reliability. • Work on bug fixing and improving": "en",
    "Job DescriptionJob DescriptionSalary: About Wazo Wazo is a software editor of an API-first Unified Communication Platform designed for telco operators, service providers, and integrators. The platform provides: • An all-in-one application suite to support IP telephony, collaboration and customer relationship needs • A strong solution that can be deployed on": "en",
    "Fortinet is growing and we are looking to hire a Mobile Developer (iOS/Android) for our FortiRecorder team in Ottawa. At Fortinet, you will be involved in the full development life cycle of software and product development, you will have opportunity to make your skills and expertise a difference. The ideal": "en",
    "Job Description: iOS Senior Dev Remote Contract Role What are the top 3 skills required for this role? 1. Experience working on iOS solutions using UIKit, SwiftUI, Appium 2. Experience in high availability and scalable iOS solutions. 3. Experience and deep understanding for iOS Design patterns Required Experience in high": "en",
    "Job Title :: Lead iOS Developer Job Location :: Toronto, ON (Hybrid) Mode of hiring :: Contract Job Description Must have: Financial Domain • Design and develop iOS compatible mobile applications • Collaborate with the design team to define the best features • Ensure quality and performance of the application": "en",
    "Who are we ? • We are an advanced, experienced media technology company with creative and passionate management team. • We are positive and optimistic, full of dreams and passion. • We welcome all creative individuals to join us, and make dreams come into reality. We offer you: • New": "en",
    "Job Description Infosys is seeking a IOS Developer . This position will interface with key stakeholders and apply technical proficiency across different stages of the Software Development Life Cycle including Requirements Elicitation, Application Architecture definition and Design; play an important role in creating the high level design artifacts; deliver high": "en",
    "Job Description Under the responsibility of the CTO, the iOS and Android Developer has the responsibility of producing and developing native iOS and Android applications of all kinds in accordance with the requirements of managers and specifications while incorporating a healthy dose of personal initiative. Should be comfortable with evolutive": "en",
    "\\ Must have skills and qualifications: - Minimum 4 years of experience with iOS development (Swift) - Deep understanding of iOS frameworks, performance, and optimization (UIKit, GCD, threading) - Solid and demonstrable understanding of object-oriented design patterns and principles - Extensive experience with automated testing - unit, integration, and UI": "en",
    "Required skills: • BSc in Computer Science, or similar work experience • Knowledge of Objective-C, iOS SDK, Xcode, • Knowledge of OOP principles and design patterns • Knowledge of data structures and algorithms • Multithreading experience is a plus • C++ experience is a plus • Experience with other mobile": "en",
    "Data Theorem is an exciting company focused on creating a more secure world for data. Rooted in a strong engineer first culture, every employee has an impact on product and direction. We are searching for exceptional talent pursuing an opportunity to grow and take ownership of the projects that resonate": "en",
    "Our client in Montreal is looking to hire Senior iOS developer to start ASAP. Requirements: • 5+ years as mobile developer • experience with objective c / swift": "en",
    "I am currently looking for a mobile developer with the following skills : – 1+ year in iOS development – Experience with Swift – Experience in full-stack development is a plus": "en",
    "iOS Developer We are looking to hire a talented iOS developer to design, build, and maintain the next generation of iOS applications. Your primary focus will be developing high-end iOS applications for the latest Apple mobile devices. Your duties may include collaborating with the design team for new application features,": "en",
    "Top Hat is revolutionizing the world of higher education. We are the leading teaching platform that professors use to create an active learning environment. Using Top Hat, professors can transform students' smartphones and laptops into tools of engagement, leading to increased attendance, higher grades, and a more effective lecture experience.": "en",
    "Job Description We are seeking a highly skilled iOS Developer/Architect to join our team as a technical lead. As a key member of our development team, you will be responsible for designing, developing, and maintaining scalable iOS applications from scratch to deployment. The ideal candidate will have a strong proficiency": "en",
    "Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 97M+ daily": "en",
    "Arlo Technologies Canada Limited is a leader in the field of innovative solutions, and we are seeking an experienced Senior iOS Developer to join our team. We believe that everyone deserves to feel safe and secure, whether they're at home or away, and we're committed to providing our customers with": "en",
    "Position DescriptionCGI is more than just an IT consulting company; we are a global organization offering a world of opportunities. Our benefits include a share purchase program, profit sharing, wellness credits, training and development programs and flexible work schedules and locations.Become part of an outstanding culture that gives you the": "en",
    "Our software client in Montreal is looking for intermediate iOS developer to start ASAP. • 5 years or less as iOS developer; • Experience with SDK iOS10+, Objective C, Swift 4, CoreData, Storyboard et XCode; • Comfortable with GIT and agile.": "en",
    "Requisition ID: # Tangerine is Canada’s leading direct bank. We offer flexible and accessible banking options, innovative products, and award-winning Client service. The reason why Tangerine employees come to work each day is to help Canadians live better lives. We focus on making a difference in our communities, and that": "en",
    "Android Developer Intern Job Description We are looking for an Android intern to help build and improve Waygo for Android. This is an unpaid internship but the hourly commitment is flexible and you can get college credit! Waygo app has already helped our users make over 3.5M translations. Your contribution": "en",
    "We are looking for a Mobile Application developer in a full time lead role within our development team. Our firm primarily develops CRM Applications for the passenger airline industry, both desktop and mobile. Our applications enable our Clients to manage their operations while enhancing their customer “passengers” travel experience. We": "en",
    "A well established and continually expanding product-focused software house in the Louth area is looking for talented and motivated C# .Net Developers to join their team. This client are true experts in their field and have been around for many years perfecting what they do. They are known for being": "en",
    "Job Description • Design, build, and maintain native mobile applications for iOS • Participate in code reviews and architecture reviews • Ensure the performance, quality, and responsiveness of applications • Collaborate with a team to define, design, and ship new features • Taking ownership, writing UnitTest and UI Test as": "en",
    "Our client is Canada's largest retailer. They are looking for an Int. Android Developer with Kotlin and Swagger to develop and enhance an e-commerce application. Location: Toronto (4 days/week onsite) Duration: 1 Year Project: e-Commerce Application (Loyalty, Checkout, etc.) Responsibilities: • Develop, maintain, and enhance the Android version of the": "en",
    "Job Description Senior Mobile Application Developer (Android) We’re a naan traditional company… Summary We are seeking a highly skilled and experienced Senior Android Developer to join our dynamic mobile development team. As a Senior Android Developer, you will be responsible for designing, developing, and maintaining high-quality Android applications. You will": "en",
    "Développeur Android intermédiaire (Montréal, Canada) (Veuillez noter que la description de poste en anglais se trouve ci-dessous - Please note that the English job description can be found below) Chez OneSpan, nous réinventons la confiance pour aider les entreprises à prospérer en permettant des accords et des transactions numériques sécurisés,": "fr",
    "Global Financial Firm located in MISSISSAUGA, ON has an immediate contract opportunity for an experienced Sr. Application Programmer \"This role is currently on a Hybrid Schedule. You will need to have reliable internet, computer and android or iphone for remote access into the client systems during remote work. We will": "en",
    "At LGS, we strive to provide a workplace that values your professional growth. Our company culture fosters diversity and inclusivity, and we welcome talents from both local and international backgrounds. As a team member, you will play a crucial role in driving major projects that propel our clients’ businesses forward": "en",
    "Remote Work: No Overview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges. Being a part of": "en",
    "Global Financial Firm located in MISSISSAUGA, ON has an immediate contract opportunity for an experienced Sr. Java Developer \"This role is currently on a Hybrid Schedule. You will need to have reliable internet, computer and android or iphone for remote access into the client systems during remote work. We will": "en",
    "Global Financial Firm located in ____________ has an immediate contract opportunity for an experienced ______________ \"This role is currently on a Hybrid Schedule. You will need to have reliable internet, computer and android or iphone for remote access into the client systems during remote work. We will be expected in": "en",
    "Job Title: Intermediate Android Developer Job ID: MK9912901111 Location : This position is 100% remote. We are looking for an experienced Android Developer to join a fast-growing, Native Mobile Development Team. You have experience successfully shipping mobile applications and supporting them in production, love learning quickly, and helping our clients": "en",
    "Senior Developer, Android Remote – North America On behalf of our client, Brainhunter Systems is looking for an outstanding Senior Android Developer to join our award winning med-tech clients team. This person will drive their mobile technical innovation and contribute to the delivery of impactful experiences to the thousands of": "en",
    "Our software client downtown Montreal is looking for android mobile developer to work full time permanent. Requirements: – 3+ years of experience with Android development – You have published apps in Android Google Play – You have developed with Java or Kotlin – Experience with MVC, MVVM, Gradle": "en"
}