{
    "We are a dynamic FinTech company headquartered in Australia, now expanding our footprint to Malaysia. Specializing in innovative payment and remittance solutions. Why Join Us? Young & dynamic workplace & culture (with office recreational amenities provided) Progressive career prospects Well rewarding project contributions Responsibilities: Develop, test, and deploy high quality": "en",
    "A minimum of 6+ years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS frameworks such as AVFoundation, UIKit, etc. Experience in": "en",
    "iOS Developer Our client is a leading mobile sportsbook operator having global domination with huge investment. This is a unique opportunity to be involved in a business at such a pivotal stage in its development and to become an integral part of the ambitious growth business is set to achieve.": "en",
    "In ByKon we're looking for an exceptional Sr. iOS Developer to join our fast-growing team. This is an opportunity to work alongside world-class technology and data science experts paving way for fast-paced career growth and learning. Main resposibilities: Develop the structure of the architecture and creation of viewsTranslate concept design": "en",
    "Who we are We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we’re here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned": "en",
    "Are you a talented iOS developer ready to make a significant impact? Join Desygner, where innovation meets creativity in a vibrant, multicultural team based in Gold Coast. We celebrate diversity and value bright, talented individuals from all backgrounds.About Us:Desygner stands proudly as one of the leading tech companies in the": "en",
    "Diabetes is a pesky monster — and that’s putting it mildly. If you’re serious about helping us face it head on, come join us! For a behind-the-scenes look, check out our Monster Culture Blog, this little video and Roche code4life to see what makes mySugr and Roche tick. Here's what": "en",
    "Render's singular focus is best summarised by our purpose; continuously innovate and evolve technology to build networks better and connect communities. Render's geospatial network construction platform enables telecommunication network operators and construction teams to digitise the construction workflow and cut the time and cost of large-scale fibre deployment by over": "en",
    "We are seeking a highly skilled Senior iOS Developer to join our dynamic team. In this role, you will be responsible for developing and maintaining cutting-edge iOS applications. Your expertise in Swift and Objective-C, solid understanding of iOS architecture patterns, and mastery of iOS frameworks such as UIKit, Core Animation,": "en",
    "Deine Rolle im Team • Design & Umsetzung von Applikationsmodulen und Softwareprojekten für mobile Devices (Android und iOS) und Backend-Solutions • aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, inklusive technischer Analyse und Entwurfserstellung • Lösung von technisch anspruchsvollen Herausforderungen • Überleitung der Softwarekomponenten von der Entwicklung in die Testabteilung • Sicherstellung der": "de",
    "Who we are We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we're here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned": "en",
    "Short and sweet mohemian is currently seeking a Junior iOS Developer to join our team, that is passionate about creating high-quality software and solving technical challenges. You are the right person if you are solution-oriented and pragmatic, enjoy working in a team, and take pride in the code that you": "en",
    "Deine Rolle im Team • Du wirkst an der Weiterentwicklung der Mein ELBA App für 2,8 Millionen Kund:innen mit und hältst diese am Laufen. • Du entwickelst für unsere Kund:innen eine ansprechende, moderne und barrierefreie Oberfläche um ihre täglichen Bankgeschäfte zu erledigen. • Du sorgst mit deiner sorgfältigen und sicherheitsbewussten": "de",
    "Looking for a iOS Developer. Playing well in a team and has strong analytical and solution-oriented thinking": "en",
    "We are searching for iOS Software Engineers with native iOS development experience As a software engineer you'll be working with project managers, designers, software architects and engineers to deliver software products. Qualification Please apply for this position if you meet the following requirements: • Worked on at least one native": "en",
    "Your role in the team • Work closely with a small, autonomous team of product owners, designers and developers to build new and innovative applications for iOS • Implement custom native user interfaces leveraging the latest iOS programming techniques and frameworks like SwiftUI and Combine • Build reusable iOS software": "en",
    "• Sie sind an der Detailspezifikationen und Architekturentscheidungen beteiligt und implementieren neue Modelle und Features • Zu Ihren Aufgaben gehört die gründliche Analyse von Problemen und die Entwicklung effektiver Lösungsansätze • Sie sind in ständiger Abstimmung mit dem Product Owner, wenn es um technische Herausforderungen wie Komplexität, Umsetzbarkeit, Sicherheit und": "de",
    "Your role in the team • Design, develop, and maintain advanced features for the iOS platform, collaborating closely with cross-functional teams to deliver a smooth, user-centric trading experience. • Ensure code quality through extensive testing to meet functional requirements and uphold our quality standards. • Own and enhance your area": "en",
    "ios entwickler 80–100% w/m/d Stellenbeschreibung Du arbeitest mit uns an interessanten Projekten für völlig unterschiedliche Kunden und Branchen. Vom ersten Meeting an über die erste Code-Zeile bis hin zum Release bist du voll mit involviert und trägst mit deiner Arbeit maßgeblich zum Erfolg des Projekts bei. Anforderungen motivation vor erfahrung:": "de",
    "Was sind deine Aufgaben? • Du gestaltest attraktive Module und Softwareprojekte für unsere Kundenbegeisterungs-App und dazugehörige Backend-Solutions und setzt diese agil um • Deine aktive Mitarbeit im gesamten Entwicklungs-Lifecycle, von technischer Analyse über Entwurfserstellung bis zu Code Reviews und Systemtests tragen zur erfolgreichen Implementierung bei • Um die hohen Qualitätsansprüche": "de",
    "🚀 What's the position? This is a Full-time Senior iOS Developer position at Neybox for talented individuals who want to work on cutting-edge applications that positively impact the well-being of individuals worldwide. 💫 What will I be working on? You'll be working on our two apps: Pillow, a sleep-tracking app,": "en",
    "Your role in the team • As a member of our Development Team, you are responsible for further developing our product and help create and implement new and exciting features. • Help to improve the PlanRadar iOS app (smartphone, tablet). • Write code that's readable, well documented, and has meaningful": "en",
    "Introduction Interactive Paper , a leading-edge technology firm based in Austria, is at the forefront of redefining the intersection between digital and analog experiences, with a focus on delivering transformative, immersive marketing solutions . We invite you to join a high-impact, fast-growing environment where your technical expertise will be instrumental": "en",
    "iOS Developer Job Description:We are looking for an iOS developer who will be responsible for the development of iOS apps for a range of iOS devices. The candidate should be able to develop iOS applications and their integration with back-end services. You will be working alongside other developers on different": "en",
    "iOS Developer (d/m/w) Kreiere die Zukunft des Bankings - als iOS Developer für die Mein ELBA App! Ort Linz Anstellung Vollzeit Work from Home Bis zu 60% Homeoffice Die Raiffeisen Software GmbH als ein Teil der Raiffeisen Bankengruppe Österreich beschäftigt rund 950 Mitarbeiter:innen an den Standorten Innsbruck, Leoben, Linz, Salzburg": "de",
    "Android & iOS Developer (m/f/d) Arbeitsort: Anstellungsart: Zeitpunkt: Hagenberg i. M. / Wien Vollzeit Ehest möglich ventopay ist die führende Plattform für Digitalisierung und Innovation in der Gemeinschaftsverpflegung. Die Produktpalette beinhaltet neben einem umfassenden Kassen-, Bezahl- und Abrechnungssystem auch Employer Branding Lösungen in Form von Apps und Websites. Täglich gestalten": "de",
    "Your role in the team • You are eagerly following the latest keynote and are excited about the latest developments in the smartphone market • You find creative solutions to transform the extensive possibilities of the various platforms into unique features for our customers • Your creative talent turns even": "en",
    "This a Full Remote job, the offer is available from: Europe This is a remote position. We are urgently looking for a Full Remote Senior iOS Developers based in Spain. Candidates need to have a good level of English or willing to improve/learn. This position is only open for employees,": "en",
    "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish When the App Store was first introduced it launched a cultural and": "en",
    "ServiceM8 is a job management app. We exist to help small businesses thrive. We're a product-driven company focused on customer success. Trade and service businesses in over 40 countries around the world rely on ServiceM8 all day, every day. It empowers these people to run a more organised, productive, and": "en",
    "Senior Software Engineer, iOS Apps Full Time Chatswood, Sydney, Australia We are seeking a talented Senior Software Engineer with expertise in native iOS app development to join our dynamic team based in Sydney, Australia. As part of our team, you will contribute to the development and maintenance of mobile applications,": "en",
    "swipeJobs is a fast-growing, disruptive, and award-winning staffing platform that is transforming the way people find work and businesses manage their workforce. Our platform connects job seekers with employers, allowing businesses to easily fill their staffing needs. We are slowly becoming the stand-alone market leader in the US market and": "en",
    "Company Description At NCS Australia, we believe in doing technology services better. Our commitment to quality, focus on people, and willingness to challenge traditional thinking set us apart. Our team brings this belief to life by partnering with our clients and communities to make tomorrow together. We are committed to": "en",
    "Android Developer Permanent role based in Melbourne or Sydney We are certified carbon neutral and committed to reducing our impact on the environment. We have long-term partnerships with charities working to address homelessness. We're REA REA Group is not your average digital business. From humble beginnings in a garage in": "en",
    "This a Full Remote job, the offer is available from: European Union Who we are We’re an award-winning development agency at the heart of Vilnius City with clients all around the world. Being a premier development agency we only work for the best, with the best. We specialize in web": "en",
    "Job Description for Sr iOS Developer in Sydney. A minimum of 6+ years of concurrent commercial experience developing iOS applications. Exceptional technical skills with Swift - development in Swift and a background with Objective-C. A demonstrable history of success using JSON and RESTful services inside the apps. Experience with iOS": "en",
    "Infydots delivers top iOS programmers to help clients' strategic importance and assignment conditions. We supply talented reliable iOS coders on-demand to develop and establish iOS apps that help organizations innovate, improve profitability, and rev time to market.No agreement lock-insComplementary evolution managerNo Permitted Profession DisadvantageDaily basis /weekly basis /monthly basis reportingConstant": "en",
    "We are searching for an exceptional Remote Mobile Technical Team Lead to join our client's dynamic software development startup. Our client is a prominent multi-asset liquidity and technology white-label solutions provider for brokerages and exchanges, and with a well-funded operation and a team of over 200 employees, they are revolutionizing": "en",
    "This a Full Remote job, the offer is available from: Austria, Germany Unternehmensbeschreibung Du brennst für agile Softwareentwicklung, dich begeistert Ende-zu-Ende Verantwortung und du suchst nach einer angenehmen Arbeitsatmosphäre mit viel Raum für Weiterentwicklung? Willkommen bei Breuninger! Breuninger ist der führende Fashion und Lifestyle Department Store im Premium und Luxussegment": "de",
    "Sei un appassionato del mondo IT e ti piacerebbe intraprendere un percorso di crescita in ambito iOS? In System Management passione e professione camminano di pari passo. La nostra organizzazione è caratterizzata da team coesi che lavorano in modo sinergico, armonioso e collaborativo. Il motore della nostra realtà aziendale sono": "it",
    "Deine Rolle im Team • Responsibility for the technical development of blockchain-related products • Development of cross platform mobile applications • Working closely with related teams to develop decentralized products and services • Developments of various APIs related to blockchain technologies • Aligning with Information Security team to prevent attacks": "de",
    "About The Role & TeamManages the technical design development and maintenance of mobile applications, associated CI/CD pipelines, automated tests, and development tools using existing and emerging technology platforms.What you will be doing Writes and delivers complex code for features, user stories, reusable modules, unit testing and automated functional testing, debugs": "en",
    "As an iOS Developer, you will be responsible for developing application enhancements to our iOS platform. Your role will involve developing scalable and efficient iOS based apps and enhancements and ensuring the stability and security of the overall architecture. You will work closely with cross-functional teams to deliver solutions that": "en",
    "We simplify wealth creation. Founded in 2014 in Vienna, Austria by Eric Demuth, Paul Klanschek and Christian Trummer, we’re here to help people trust themselves enough to build their financial freedom — for now and the future. Our user-friendly, trade-everything platform empowers both first-time investors and seasoned experts to invest": "en",
    "Select how often (in days) to receive an alert: Can you engineer a brighter tomorrow? It's crystal clear: the actions we take in the next few years will significantly impact our future. At Volvo Cars, we embrace change. We're committed to transforming the automotive industry and leading in electrification. For": "en",
    "This a Full Remote job, the offer is available from: Europe, Portugal The role is restricted to those physically located in Europe, while this is a remote position, we cannot consider candidates that are not based in such region. Preference will be given to candidates based in Portugal, Spain or": "en",
    "Be part of one of the most innovative Digital Business areas that focuses on sustainable digital & data products to support Biosecurity compliance. Due to the nature of the client organisation and projects at hand, only Australian Citizens can be considered for the role. To be considered, we seek: 5+": "en",
    "Senior Django+Angular Developer (Full-Stack or FE + BE) Remote • We are seeking two experienced developers to enhance our legacy product catalog application—a critical platform that bridges communication between data providers and recipients. • You’ll be instrumental in developing new features that allow providers to input product data with both": "en"
}