{
    "search_metadata": {
        "id": "678508536fd1cafdfcefff33",
        "status": "Success",
        "json_endpoint": "https://serpapi.com/searches/3340dc7925b49c1b/678508536fd1cafdfcefff33.json",
        "created_at": "2025-01-13 12:34:27 UTC",
        "processed_at": "2025-01-13 12:34:27 UTC",
        "google_jobs_url": "https://www.google.de/async/callback:550?q=iOS+developer&uule=w+CAIQICIHR2VybWFueQ&udm=8&fc=EswCCowCQUpHOUprT1I2NkJsd1I5UDFmS2NLaUZtSi1XZ0R1R3R5MGJsWHFjbTBJeXA5VDU4Uk9TQklsb2ZJWWRkSnM1OU50QzFEcDNqNDFDWHJFb1dUSVRXM2Uwd2owUURWcWVVbTdGMEtsTVBBYmp2YmRLSkJEUmtZQXUxc2hHa2k3S2dCcFdIZl9yR1otdHNWWDRSU2FEVTdIZllraHVIdGVtOFJWSlRsMG1tMngwUkNPeDFJeHQzSmtPMXdaRkFyVUdjLVQycDU3SEFyLWdVS09TU0g4b09tV0trcHh5MV9tajZlTDY3ck90VWhlUVNfR3MxU1dNRE02c2FtelFNN0ZaUHRNZnVFcGNiMXU1MBIXVWdpRlo5RHRPSWVxNU5vUHZzRHN1QWsaIkFGWHJFY3BnUEpwbjB2S2htRFB2M0NoRndKZTBjbTlfQUE&fcv=3&async=_fmt:prog,_id:fc_2",
        "raw_html_file": "https://serpapi.com/searches/3340dc7925b49c1b/678508536fd1cafdfcefff33.html",
        "prettify_html_file": "https://serpapi.com/searches/3340dc7925b49c1b/678508536fd1cafdfcefff33.prettify",
        "total_time_taken": 1.46
    },
    "search_parameters": {
        "q": "iOS developer",
        "engine": "google_jobs",
        "location_requested": "Germany",
        "location_used": "Germany",
        "google_domain": "google.de",
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUMUkyTmtKc2QxSTVVREZtUzJOTGFVWnRTaTFYWjBSMVIzUjVNR0pzV0hGamJUQkplWEE1VkRVNFVrOVRRa2xzYjJaSldXUmtTbk0xT1U1MFF6RkVjRE5xTkRGRFdISkZiMWRVU1ZSWE0yVXdkMm93VVVSV2NXVlZiVGRHTUV0c1RWQkJZbXAyWW1STFNrSkVVbXRaUVhVeGMyaEhhMmszUzJkQ2NGZElabDl5UjFvdGRITldXRFJTVTJGRVZUZElabGxyYUhWSWRHVnRPRkpXU2xSc01HMXRNbmd3VWtOUGVERkplSFF6U210UE1YZGFSa0Z5VlVkakxWUXljRFUzU0VGeUxXZFZTMDlUVTBnNGIwOXRWMHRyY0hoNU1WOXRhalpsVERZM2NrOTBWV2hsVVZOZlIzTXhVMWROUkUwMmMyRnRlbEZOTjBaYVVIUk5ablZGY0dOaU1YVTFNQklYVldkcFJsbzVSSFJQU1dWeE5VNXZVSFp6UkhOMVFXc2FJa0ZHV0hKRlkzQm5VRXB3YmpCMlMyaHRSRkIyTTBOb1JuZEtaVEJqYlRsZlFVRSIsImZjdiI6IjMifQ=="
    },
    "jobs_results": [
        {
            "title": "Senior iOS Developer",
            "company_name": "Pixida GmbH",
            "location": "Ingolstadt, Germany",
            "via": "Talent.com",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=7UqDmng764nwNvpoAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMvQrCMBAAYFz7CE6Hoz-JCC52FaouCn2AkrRHEknvQi5IfAmfWV2-8Ws-i2bTIwXOEO49nPGFkRNm2MGNLQiaPHpggo7ZRVy2vpQkJ61FonJSTAmjGnnWTGi56idb-TOINxlTNAWHw3FfVSK3Xj1CDZOBbrYXCARXchx_x1S20GGeDb2_NnfiGJEAAAA&shmds=v1_AUFQtOPWl2rVgmCRh6nkDz8XImrdyboQL0GN-ZA9liWkBMTcAA&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=7UqDmng764nwNvpoAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Senior iOS Developer\n\nAt Pixida we are passionate developers and technology consultants for digitalization and mobility solutions. As we continue to grow, we are looking for an experienced iOS developer to join our product development team for digital solutions in Munich. Do you want to work on cutting edge technology projects in the field of connected services, iOS apps, and tailor-made solutions in IoT? Are you ready to strive for excellence? We are looking forward to meet you!\n\nRESPONSIBILITIES\n\nDevelop iOS applications for our products using Flutter and Swift\n\nImprove our projects with ad-hoc solution analyses, custom developments and integrations\n\nBring to life concepts from vision to reality, for both existing and new products\n\nConstantly research and adopt new technologies and best practices, clean code and testing\n\nEnsure the product quality by continuously reviewing and improving the code-base\n\nWork in collaboration with cross-functional team\n\nSupport building and maintaining a diverse and inclusive culture across the devel-opment team, including training and mentoring other team members\n\nREQUIREMENTS\n\nTechnical Bachelor s / Master s degree / graduate diploma in Computer Science, Electrical Engineering, Mathematics or equivalent education with corresponding experience\n\n3+ years of proven experience with developing iOS applications\n\n1+ years of proven experience with one or more of the latest iOS programming methods : Swift, Xcode, Instruments, XCTest, UIKit, SwiftUI or equivalent\n\nExperienced working with Native UI Frameworks and Components\n\nDomain knowledge in one of the following domains : Mobility, Connectivity, Big Data, Connected Navigation, Cloud Computing, Automotive\n\nExperience with agile software development and extreme programming, e.g., SCRUM, Kanban, Continuous Integration and Deployment\n\nExperienced with current versions of Bluetooth LE on iOS is an advantage\n\nPassionate for new technologies and keen interest in mentoring others\n\nExcellent team player with strong communication skills\n\nBENEFITS\n\nInternational work environment in one of Germany’s most exciting cities\n\nHighly innovative, agile and unique team with a great working culture\n\nSome of the most prestigious customers in high-tech\n\nPermanent position in full time or part time\n\nFlexible working hours\n\nCompetitive compensation, extraordinary pension plan, profit sharing and various benefits in the areas of sport / health, work / life, mobility and fun\n\nVery appealing, state-of-the-art office & work equipment\n\nRoom for independence, personal growth and creativity\n\nProfessional development concept including constant individual trainings\n\nPixida is proud to be an Equal Opportunity Employer! We are committed to a work environment that supports, inspires and respects all individuals and in which all aspects of employment are applied without discrimination. Therefore we encourage all individuals to apply!\n\nPlease note : This is a full-time position that will be remote initially (due to COVID-19) and based in our Munich, Germany office once safe to re-open the office.\n\nIn order to be able to get a comprehensive overview of your application, we ask you to make sure to include certificates, employer s references, etc. with your resume. In addition, we ask you to provide information about your possible start date, salary expectations and language skills.\n\nPIXIDA GMBH – BE PART OF THE SOLUTION!\n\nkarriere@pixida.de\n• www.pixida.com\n\nQuelle : ONLINE Stellenmarkt - www.online-stellenmarkt.net",
            "apply_options": [
                {
                    "title": "Talent.com",
                    "link": "https://de.talent.com/view?id=d9a38ce75172&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba.de",
                    "link": "https://www.jobijoba.de/detailanzeige/9/d44050adfb6e9636473f7540e2879a03?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobborse24.De",
                    "link": "https://jobborse24.de/technology_ingolstadt-c148993/senior-ios-developer-ingolstadt_i1821346296?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlBpeGlkYSBHbWJIIiwiYWRkcmVzc19jaXR5IjoiSW5nb2xzdGFkdCwgR2VybWFueSIsImh0aWRvY2lkIjoiN1VxRG1uZzc2NG53TnZwb0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "iOS Developer",
            "company_name": "Sumup",
            "location": "Cologne, Germany",
            "via": "Meritocracy",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=VZUl7-f-rEKps9txAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAA0L1_oNMNTqKJCC46Vii4OPQDShKOJJLchVwq7dJvF9_wuq07xPcIT_xi4oIVzvBiC4KmugBMMDD7hPtHaK3IXWuRpLw006JTjrNmQsuL_rCVf5MEU7Ek03C63i6LKuSPu3HOc4FI0HNiT3iCAWs2tP4AijjumIAAAAA&shmds=v1_AUFQtOP9l9WmqHJIq17lkxi7ugMOFu2XOWdnG7snoDJGw7xq_A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=VZUl7-f-rEKps9txAAAAAA%3D%3D",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Our SumUp office in Cologne is now hiring for the position of iOS Developer.\n\nThe Job\n\nYou’ll shape the core experience of merchants who are using the iOS App on a daily basis.\n\nIn the first few weeks, you'll dive into the code and learn how to create clean, composable components in our codebase. You'll use this knowledge to start developing and refining features. You'll learn how we write tests, how we manage bluetooth communication, and how we keep performance tip-top.\n\nIn the first three months, you'll develop major features that impact our merchant base. You'll work closely with product and design departments to build features that are maintainable, usable, and beautiful. You'll help us re-think problems we've solved before in a different way as requirements evolve.\n\nBy the end of your first year, you'll have a wealth of knowledge about our complex problem domain, as well as its implications in the interface and in the backend – and how to manage it in a clean way. You'll have launched numerous features in the iOS app as well as in the iOS SDK.\n\nRequirements\n• You are comfortable with Objective-C and the iOS system frameworks.\n• You are curious about Swift, good knowledge would be a plus.\n• You know what to test, why to test it, and how to write flexible tests that won't break.\n• You care about user interaction, usability and of course, making the interface beautiful.\n• You strive for clean code, but also know how to make your \"shortcuts\" easy to delete in a crunch.\n• You love coding and take the time to reflect on all aspects of your implementation, be it the frameworks, languages or processes.\n• You also know how to get things done on the command line.\n• You are not afraid to ask for help or to use Google when something is beyond your grasp.\n• Your precise communication skills make working in a distributed team effective and efficient.\n• Technology excites you and you strive to learn something new on a daily basis!\n\nBenefits\n\nMore reasons to work at SumUp\n• The Mobile Team: You'll be with people who care about mutual learning, keeping our technical knowledge up-to-date, and discussing ideas that contribute to not only the company's success but keeping everyone connected to the wider tech community.\n• Opportunity to attend tech meetups and conferences with the team (especially if you're giving a talk!).\n• Convenient location in the heart of Cologne.\n• All the startup swag you expect: Xbox, unlimited coffee, and a shiny MacBook Pro.\n• Our office has a strong sense of community; we get together regularly for sports, Karneval, and drinks.\n• Our global team comes from 30 different countries creating a fun, international environment.\n\nApply now!\n\nWe are looking forward to meet our next teammate!\n\nIf you want to know what it’s like to work at SumUp check our careers page: https://sumup.com/careers.\n\nWe are looking forward to receiving your application!\n\nAbout us\n\nWe are the leading mobile point-of-sale (mPOS) company in Europe. We started out 6 years ago and built our payment service from scratch to shake up the industry and wake up the entrepreneur within anyone. We created a unique device that with the smartphone that’s in your pocket, allows small merchants to accept card payments anywhere. Whether our merchants are brewing coffee or fixing cars, we want to make technology that everyone knows how to use. So our merchants can get on with what they do best. From our paperless onboarding to taking the first payment, we make it easy. Traditional offerings leave out small businesses, we don’t. We are open and honest about our pricing and have no hidden fees.\n\nToday, hundreds of thousands of small businesses in 30 countries around the world rely on SumUp to get paid. In addition to our original hardware, mobile and web apps we have gone on to develop a suite of APIs and SDKs to integrate SumUp payment into other apps and services.\n\nWhy work for us?\n\nWe do things differently. We build our own payment solution end-to-end so that we can always offer the best value & service. We know how vital payment is to small business, so we use our technology to solve their problems. We believe in open and transparent communication, not strict rules and hierarchies. If you’re looking for the chance to innovate, and disrupt the payment industry – join us. We are a team of hardworking, talented people with one goal: to build a better way to get paid. We’ve got some huge challenges ahead of us, and we need smart, creative people to help us tackle them. If you think you’ve got what it takes - join us.",
            "apply_options": [
                {
                    "title": "Meritocracy",
                    "link": "https://meritocracy.is/de/sumup/ios-developer-40008?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIiwiY29tcGFueV9uYW1lIjoiU3VtdXAiLCJhZGRyZXNzX2NpdHkiOiJDb2xvZ25lLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJWWlVsNy1mLXJFS3BzOXR4QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Mobile Application Developer - Berlin",
            "company_name": "Yeah! Global",
            "location": "Berlin, Germany",
            "via": "Career Page",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=zn-U1ZPbQcPYbcRLAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_yWNMQoCMRBFsd0j2Di2ohsRbNRGERYED2C1TMKwicxmQibIehcPa8Tm8Yv3ec1n1pzuYgMTnFPi4LAEiXClF7EkyrCBC2UOsY6bWFDC7DxUpRMZmOZHX0rSgzGq3A5a6t-1TkYjkaxM5ilWf-jVY6bEWKjf7bdTm-KwWjwI_RI6FosMNfJvraGjPGJ8fwFtQKR1nwAAAA&shmds=v1_AUFQtONJ_pc9AtHHFCCAddnGsbrO-cygdhI5fJDNUl_jG6YRwg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=zn-U1ZPbQcPYbcRLAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "Note: This position does not offer any Visa sponsorship. We are only looking for applicants who are either local to Berlin, Germany, or ready to relocate to the employer's location.\n\nJob Summary:\nOur Client is looking for a creative and skilled Mobile Application Developer to join their team. You will be responsible for designing, developing, and maintaining high-quality mobile applications for both iOS and Android platforms. Your role will involve close collaboration with cross-functional teams to deliver innovative mobile solutions that enhance user experience.\n\nKey Responsibilities:\n• Develop and maintain advanced applications for both iOS and Android platforms.\n• Collaborate with cross-functional teams to define, design, and implement new features.\n• Integrate mobile applications with backend services, ensuring seamless data flow and performance.\n• Optimize application performance, quality, and responsiveness.\n• Identify and resolve bugs, and improve application reliability.\n• Continuously explore and implement new technologies to enhance development efficiency.\n• Write clean, maintainable, and well-documented code.\n• Participate in code reviews and provide constructive feedback to peers.\n• Stay informed about the latest industry trends and technologies to ensure the applications are up-to-date.\n\nQualifications:\n• Bachelors degree in Computer Science, Information Technology, or a related field.\n• 3+ years of proven experience as a Mobile Application Developer or in a similar role.\n• Proficiency in programming languages such as Swift, Objective-C, Java, and Kotlin.\n• Experience with mobile development frameworks like React Native or Flutter.\n• Strong understanding of the full mobile development lifecycle, including design, coding, testing, and deployment.\n• Excellent knowledge of UI/UX principles and best practices.\n• Familiarity with RESTful APIs to connect mobile applications to backend services.\n• Strong problem-solving and analytical skills.\n• Excellent communication and teamwork abilities.\n\nPreferred Skills:\n• Experience with CI/CD practices and tools.\n• Knowledge of mobile app security best practices.\n• Familiarity with cloud services and mobile backend-as-a-service (MBaaS) platforms.\n• Certification in mobile application development (e.g., Certified iOS Developer, Android Developer).",
            "apply_options": [
                {
                    "title": "Career Page",
                    "link": "https://www.careers-page.com/yeah-global/job/L5XXW8W3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/mobile-application-developer-berlin-at-yeah%21-global-4086231852?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Adzuna.de",
                    "link": "https://www.adzuna.de/details/4956139249?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Talent.com",
                    "link": "https://de.talent.com/view?id=8fd87e5bbde4&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobijoba.de",
                    "link": "https://www.jobijoba.de/detailanzeige/9/0dbbdb030e0671a765f886a426b3743f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Recruit.net",
                    "link": "https://www.recruit.net/job/mobile-application-developer-berlin-jobs/9BA14E6868D5143C?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "ZipRecruiter",
                    "link": "https://www.ziprecruiter.de/jobs/356478182-mobile-application-developer-berlin-bei-yeah-global?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJNb2JpbGUgQXBwbGljYXRpb24gRGV2ZWxvcGVyIC0gQmVybGluIiwiY29tcGFueV9uYW1lIjoiWWVhaCEgR2xvYmFsIiwiYWRkcmVzc19jaXR5IjoiQmVybGluLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJ6bi1VMVpQYlFjUFliY1JMQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "(Senior) iOS Developer - Holidu Guests (all genders)",
            "company_name": "Holidu",
            "location": "Munich, Germany",
            "via": "LinkedIn",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=O_Y7mYvKMHIZcwCAAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3NsQrCMBCAYVz7BjrdWEUbEVx0FSqKOPQBSpoeSSS9C7lU6gP5niq4_Ms3_MV7VlzLBslzWoK_N3DCJwaOmGADZw6-H6EeUbJAqUMAi9RjkuVXL9yBoE7GARPUzDbg4uhyjnJQSiRUVrLO3lSGB8WEHU_qwZ380orTCWPQGdvdfjtVkexq_h96gttI3rg11JgGTa8PfrnIS6gAAAA&shmds=v1_AUFQtOOtYUZ_90UQm2RgqFXJZL8uNMqFol4ujG9P6yBNtAS1-A&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=O_Y7mYvKMHIZcwCAAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508536fd1cafdfcefff33/images/5938e2e41dc5c4af5748e499936c268d9ab84a7d1ac9e85301ffeb9e251f804a.gif",
            "extensions": [
                "10 days ago",
                "Full-time"
            ],
            "detected_extensions": {
                "posted_at": "10 days ago",
                "schedule_type": "Full-time"
            },
            "description": "Holidu is one of the fastest-growing travel tech companies worldwide. Our mission is to make the booking and hosting of holiday homes free of doubt and full of joy. We help hosts to manage their vacation rental with ease and guests to find the perfect holiday home they truly enjoy. Our team of more than 600 colleagues from 60+ nations shares a passion for modern technologies, an ambition for constant improvement and the drive to bring the best experience to more than 40k hosts and 100 million website users each year. You want to achieve amazing milestones with us? Then pack your bag, hop on board and get ready for take off!\n\nYour future team\n\nYou'll be part of a dynamic cross-functional agile product team. Our team's mission is to enhance our native applications and improve the services we offer to our customers post-booking. You'll work on creating innovative features that elevate the customer experience and foster customer loyalty to Holidu.\n\nOur Tech Stack\n\nWe leverage a micro-service architecture and utilize:\n• Backend: Java 21 and Kotlin with Spring Boot.\n• Data Storage: Elasticsearch 7, PostgreSQL, MongoDB, Redis.\n• Streaming/Queuing: Kafka, ActiveMQ.\n• DevOps: AWS, Kubernetes, Docker, Jenkins, Git.\n• Web & Node.js Applications: Written in TypeScript.\n• Mobile Apps: Native iOS (Swift) and Android (Kotlin).\n• Monitoring: ELK, Grafana, and custom internal tools.\n\nYour role in this journey\n• Collaborate with Product Managers, Designers, and Backend Engineers to deliver exceptional products on iOS.\n• Develop efficient, reusable mobile components in Swift and architect scalable, reliable mobile solutions.\n• Conduct data-driven experiments to find opportunities and monitor your work.\n• Proactively identify areas for improvement and advocate for best practices.\n\nYour backpack is filled with\n• 4+ years of professional experience in iOS development role.\n• A bachelor's degree in Computer Science or related technical field.\n• Experience in building and deploying native iOS applications, ideally those available in the App Store.\n• Strong engineering and coding skills.\n• Experience with other languages (Java, JavaScript) and platforms (Spring Framework, Node.js, React) is a plus.\n• Understanding of data structures and architectures.\n• Ability to communicate effectively with customers, technical teams, and management to gather requirements and describe product features and technical designs.\n\nOur adventure includes\n• Impact: Make a difference for hundreds of thousands of monthly users.\n• Growth: Take responsibility from day one and develop through regular feedback, workshops, and knowledge exchanges.\n• Personal Development: Use your learning budget and 2 extra study days for conferences, books, courses, and more.\n• Community: Engage with international, diverse, yet like-minded colleagues through regular events and 2 office days per week with your team.\n• Flexibility: Benefit from our hybrid work policy and the chance to work from other local offices for up to 8 weeks a year.\n• Fitness: Get a premium gym membership at a discounted rate.\n• Travel: Enjoy 28 vacation days + 13 public holidays in Bavaria and the possibility to take up to 10 unpaid vacation days with special discounts on our Holidu Homes properties.\n\nNeed a sneak Peek?\n\n-> Check out the adventure that awaits you on Instagram @lifeatholidu and dive straight into the world of Tech at Holidu for more insight!\n\nWant to travel with us?\n\nApply online on our career page! Your first travel contact will be Adam from HR.\n\nWe are committed to diversity in all aspects of our business. We encourage applications from all genders, all corners of the world and all individual backgrounds. You are welcome to submit your application without a photo and without stating your gender, date of birth, marital status, nationality or disability status (if applicable).\n\nIf you require any special assistance when arranging interviews, office visits or the recruitment process in general, please contact the relevant HR person responsible for this job and we will do our best to accommodate your needs.\n\nLocation\n\nMunich, Germany",
            "apply_options": [
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/senior-ios-developer-holidu-guests-all-genders-at-holidu-4110889260?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Northzone Job Board",
                    "link": "https://opportunities.northzone.com/companies/holidu/jobs/43667759-senior-ios-developer-holidu-guests-all-genders?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobs",
                    "link": "https://hv.getro.com/companies/holidu/jobs/43667759-senior-ios-developer-holidu-guests-all-genders?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "JobLeads",
                    "link": "https://www.jobleads.com/de/job/senior-ios-developer-holidu-guests-all-genders--munchen--e5cc29f6cfcafb92c29ce13676a6254f2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiIoU2VuaW9yKSBpT1MgRGV2ZWxvcGVyIC0gSG9saWR1IEd1ZXN0cyAoYWxsIGdlbmRlcnMpIiwiY29tcGFueV9uYW1lIjoiSG9saWR1IiwiYWRkcmVzc19jaXR5IjoiTXVuaWNoLCBHZXJtYW55IiwiaHRpZG9jaWQiOiJPX1k3bVl2S01ISVpjd0NBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Senior iOS Developer",
            "company_name": "5V Tech | Certified B Corp",
            "location": "Stuttgart, Germany",
            "via": "Jobs Im Südwesten",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=4wQAvqw_9_i6AZMUAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMvQrCMBAAYFz7CE43-9MUoYtuVii4OFRcS1rPNJLmwt0pFXwUH1ZdvvHLPrNs2WD0xOBPDRzwiYESMqzhSB0IWu4HoAg1kQs43w2qSbbGiITciVr1fd7TaChiR5O5Uyd_WhksYwpWsd2UxZSn6BZFeYEz_r43VMjqbx6vsIeKOIGP0OhD1VnWFdTIo42vL5ILLSyfAAAA&shmds=v1_AUFQtOPfRtIlL8CEtJCuVOGLJsPcGio1KOL2ylCw0SOlkQj6AQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=4wQAvqw_9_i6AZMUAAAAAA%3D%3D",
            "extensions": [
                "2 days ago",
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "posted_at": "2 days ago",
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior iOS Developer\n\nMunich, Germany - REMOTE (within Germany)\n\nFull-time, Permanent\n\nSalary Up To €100,000 Per Year + Bonus + Benefits\n\nAre you a creative iOS Developer ready to shape the future of vehicle companion apps?\n\nThis is a unique opportunity to work with a leading producer of automotive Mobile technology that develops state-of-the-art vehicle companion apps for a wide range of premium car brands such as Audi, Porsche, Lamborghini, and Bentley amongst other famous OEMs.\n\nHere, you would take a vital role in the design, development, and optimisation of innovative mobile applications, applying the latest technologies such as Bluetooth and augmented reality, while working alongside UX/UI designers and talented developers in other areas of the development lifecycle.\n\nWith a unique range of project teams and disciplines to specialise in, the possibilities for career development, learning, and crafting your expertise are unmatched!\n\nIf You Have...\n• Strong experience working on iOS Mobile Software Development;\n• Experience with Swift and SwiftUI;\n• Minimum of German B1 language certification;\n• Bonus: Experience working on automotive systems or connectivity technologies...\n\n... then take the next step in your career and APPLY TODAY to discuss the details further.\n\n5V Tech are acting as an Employment Agency for the purposes of this job vacancy. We offer a reward scheme if you can recommend someone for this position, up to £250 for you and an additional £250 to a charity of your choice, 5V Tech are recognised talent solutions experts within IoT and Deep Tech working across Europe, the UK, and North America.",
            "apply_options": [
                {
                    "title": "Jobs Im Südwesten",
                    "link": "https://www.jobs-im-suedwesten.de/job/senior-ios-developer-416985?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "SaluteMyJob",
                    "link": "https://salutemyjob.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KHON2 Jobs",
                    "link": "https://jobs.khon2.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "My Stateline Jobs",
                    "link": "https://jobs.mystateline.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "FOX8 Jobs",
                    "link": "https://jobs.fox8.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Star Job Search",
                    "link": "https://starjobsearch.co.uk/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "KSNT Jobs",
                    "link": "https://jobs.ksnt.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "WANE Jobs",
                    "link": "https://jobs.wane.com/jobs/senior-ios-developer-stuttgart-baden-wurttemberg/1539439559-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgaU9TIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IjVWIFRlY2ggfCBDZXJ0aWZpZWQgQiBDb3JwIiwiYWRkcmVzc19jaXR5IjoiU3R1dHRnYXJ0LCBHZXJtYW55IiwiaHRpZG9jaWQiOiI0d1FBdnF3XzlfaTZBWk1VQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJSFIyVnliV0Z1ZVEifQ=="
        },
        {
            "title": "Application Developer – Android / iOS (m/f/x)",
            "company_name": "Envotis",
            "location": "Frankfurt, Germany (+5 others)",
            "via": "Envotis",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=jgPEkOut2_hevrpvAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQ6CQBBA0dhyBBOTKdUoa0xstCJRSGwsPABZYIDVZWazsxLsvINX8GSeRGx-9370mURp4pw1pQ6GCY7Yo2WHHr6vNyRUeTYVKDCXK8w7VathAWs4cwGC2pctjCZjbixOD20ITvZKidi4kTAOy7jkTjFhwYO6cSH_5NJqj87qgPl2txliR81ydqKegxEwBKnXdK8fPqwgQ99pev4A0A1-SKcAAAA&shmds=v1_AUFQtOP0uUBVimGXn4GXqyO5GrKfBxQg1WlASWkKFPEEU7DINg&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=jgPEkOut2_hevrpvAAAAAA%3D%3D",
            "extensions": [
                "Full-time"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time"
            },
            "description": "[et_pb_section fb_built=\"1\" _builder_version=\"4.18.0\" _module_preset=\"default\" custom_margin=\"1px||||false|false\" global_colors_info=\"{}\"][et_pb_row _builder_version=\"4.18.0\" _module_preset=\"default\" custom_margin=\"-59px||||false|false\" global_colors_info=\"{}\"][et_pb_column type=\"4_4\" _builder_version=\"4.18.0\" _module_preset=\"default\" global_colors_info=\"{}\"][et_pb_text _builder_version=\"4.18.0\" _module_preset=\"default\" ul_line_height=\"1.4em\" custom_margin=\"8px||||false|false\" custom_margin_tablet=\"8px||||false|false\" custom_margin_phone=\"-33px|-26px|-44px|-26px|false|true\" custom_margin_last_edited=\"on|phone\" custom_padding=\"|||0px|false|false\" custom_padding_tablet=\"|||0px|false|false\" custom_padding_phone=\"||0px|0px|false|false\" custom_padding_last_edited=\"on|phone\" hover_enabled=\"0\" global_colors_info=\"{}\" sticky_enabled=\"0\"]\n\nEnvotis is a German recruiting and relocation company that acts as a bridge between foreign professionals and German employers in various fields.\n\nEnvotis coordinates and covers the costs of the immigration process and provides extensive relocation support to you and your family. To learn more about our services please check www.envotis.com/our-services/.\n• You will\n• analyze demands and subsequently define the application requirements in collaboration with the various stakeholders\n• develop high quality applications (iOS and/or Android)\n• design and conduct tests to ensure the quality of the developed solution\n• work closely with colleagues across departments in order to continuously improve the existing applications\n• scan for, evaluate and introduce new technologies to optimize the development process\n\nYou have\n• a degree in computer science, in business informatics or in a comparable field\n• experience in application development (at least 4 years)\n• knowledge of at least one of the following programming languages: Kotlin or Swift\n• practical knowledge of agile software development practices (for example SCRUM or Extreme Programming)\n• experience in using IDEs such as Android Studio, Xcode or Netbeans\n• proficiency in English, both in speech and writing (German is an advantage)\n• willingness to relocate to Germany\n\n[/et_pb_text][/et_pb_column][/et_pb_row][/et_pb_section]",
            "apply_options": [
                {
                    "title": "Envotis",
                    "link": "https://www.envotis.com/jobs/application-developer-android-ios-m-f-x/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJBcHBsaWNhdGlvbiBEZXZlbG9wZXIg4oCTIEFuZHJvaWQgLyBpT1MgKG0vZi94KSIsImNvbXBhbnlfbmFtZSI6IkVudm90aXMiLCJhZGRyZXNzX2NpdHkiOiJGcmFua2Z1cnQsIEdlcm1hbnkiLCJodGlkb2NpZCI6ImpnUEVrT3V0Ml9oZXZycHZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "iOS Developer (m/f/d)",
            "company_name": "Progressive IT",
            "location": "Cologne, Germany",
            "via": "Gotthe/Job",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=dDLx4iCB8OkJBbrYAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEsQrCMBAAUFz7CU6Hk0pNRHDRUaHooqB7SeI1iSS5kAulfoW_LL7hNd9Z0_rbA844YqCMBZZRDvK1gg1cSQOjKsYBJeiIbMD50dWa-SAlcxCWq6reCENRUkJNk3yT5n89O1UwB1Wx3-23k8jJrhf3QrYgsx8RLk_wCU4UyCZsocMSVfr8AGhXZtaSAAAA&shmds=v1_AUFQtOO8QEhM4m9g8LY5BOpJOnpGL4RRE0hINjBgMOxfK6vh5g&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=dDLx4iCB8OkJBbrYAAAAAA%3D%3D",
            "extensions": [
                "Full-time and Part-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time and Part-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Description\n\nFor my top client I am looking, at the earliest possible date, for a\n\niOS Developer (m/f/d):\n\nThe goal of the project is to develop a multi purpose app.\n\nThe development is done in Scrum teams, which are sorted by SAFe.\n\nFramework:\n\nWorkload : Full-time or part-time, 32 – 40 hrs/wk.\n\nStart Project : ASAP\n\nDuration : 12 – 18 months\n\nLocation : Remote possible\n\nRequirements:\n• Expertise in Swift development\n• Combine\n• Apollo\n• Clean Swift\n\nNice to have\n• Conception of new features\n• Active design of content\n• iOS app programming\n\nHave we aroused your interest?\n\nIf so, please email your current resume to l.oezkan(at)progressive.de with details of your availability and desired salary (gross annual salary). You are also welcome to reach me at the to discuss details.\n\nOf course you may also forward this request to your contacts, in case of successful placement you will receive a 250 € Amazon voucher as a small thank you and of course my eternal gratitude.",
            "apply_options": [
                {
                    "title": "Gotthe/Job",
                    "link": "https://gotthejob.co/job/ios-developer-m-f-d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJpT1MgRGV2ZWxvcGVyIChtL2YvZCkiLCJjb21wYW55X25hbWUiOiJQcm9ncmVzc2l2ZSBJVCIsImFkZHJlc3NfY2l0eSI6IkNvbG9nbmUsIEdlcm1hbnkiLCJodGlkb2NpZCI6ImRETHg0aUNCOE9rSkJicllBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Senior IOS Developer (ANÜ)",
            "company_name": "Javaji",
            "location": "Eschborn, Germany",
            "via": "Javaji.de",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=40cTJfZb52Uwg-9CAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXEMQrCMBQAUFx7BF3-qKKNFFx0EpRiBx16gPITPk1Kmh_yQ6mX8ATexouJb3jFe1FULQXHCe7PFq40kedICdaXx_ezgT00rEEIk7HAAWrm3tPybHOOclJKxJe9ZMzOlIZHxYE0z2pgLf86sZgoeszUVcfDXMbQb1cNTjg4cAFuYqzmFHZQUxoxvH4dVgrkkQAAAA&shmds=v1_AUFQtOM7tOZJ13MpL1Sqas_aPIBJf6pLR1HzFHT4Z5O0f59fLw&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=40cTJfZb52Uwg-9CAAAAAA%3D%3D",
            "extensions": [
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "Senior iOS Developer (m/w/x)\nLocation: Munich, Germany\nHiring Type: ANÜ\n\nWe are looking forward to you as a senior iOS developer. As a member of the `Mobile Development iOS` team your work is geared to advancing this success worldwide. You enrich the products with your own ideas and technically sound feedback. You are motivated to expand state of the art quality assurance measures throughout the development process. You deliver high quality work and contribute your know-how by way of code reviews and automated tests.\n\nKnowHow- able to present the small concepts with UML\n- Masters Generic Programming\n- Write functional code, too\n- Use injection patterns on-the-fly\n- Understand multithreaded code in details and can write thread-safe code\n- solve complex asynchronous and synchronous requirements in code\n- Understand design patterns deeply, and matches them to the languages, frameworks, SDKs and tools he/she uses\n- do more complex refactoring according to the architecture\n- define and implement simple architectural structures\n- Knowledge more about other technologies in the stack\n- TDD by trade\n- Use mocks on the fly to test his/her code\n- write UI Automation Tests\n\nKeyskills- Setup new project from the scratch with dependency management\n- Knowledge how to build and sign from Command Tools\n- create simple Bash scripts to support build system, CI and CD\n- Knowledge how to identify and find performance problems with Xcode and rectify them\n- experience with iTunes Connect\n- Knowledge about many iOS Frameworks, where to use them and how",
            "apply_options": [
                {
                    "title": "Javaji.de",
                    "link": "https://javaji.de/jobs/559?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgSU9TIERldmVsb3BlciAoQU7DnCkiLCJjb21wYW55X25hbWUiOiJKYXZhamkiLCJhZGRyZXNzX2NpdHkiOiJFc2NoYm9ybiwgR2VybWFueSIsImh0aWRvY2lkIjoiNDBjVEpmWmI1MlV3Zy05Q0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        },
        {
            "title": "Sr. iOS Developer (f/m/x) (Germany)",
            "company_name": "Spark Networks, Inc",
            "location": "Berlin, Germany",
            "via": "Indeed",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=jGbrRB377ePWs-BmAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_y3NsQrCMBAAUFz7CU43SSs1EcGlbiIUHXToB5Q0nG1smgt3Qevn-KciuLz1ZZ9FVjWswN0aOOETPUVkyO960nMBeY08mfAuYAMX6kDQsB2AAtREvcflYUgpSqW1iFe9JJOcVZYmTQE7mvWDOvnRymAYozcJ291-O6sY-vWqiYZHuGJ6EY9SwjlYcAGOyN6FEv75F62x_h6kAAAA&shmds=v1_AUFQtOMN9pmmPSP-PFE-MEI9WmbSA6O3k7xdAf5UA_vnwkIqAQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=jGbrRB377ePWs-BmAAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508536fd1cafdfcefff33/images/5938e2e41dc5c4af4eb32819d8d22a0e91178c64bd42f35c1ea67b4cf378a6c0.gif",
            "extensions": [
                "Full-time",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "schedule_type": "Full-time",
                "qualifications": "No degree mentioned"
            },
            "description": "Job Title: Senior iOS Developer (f/m/d)\n\nLocation: Berlin, Germany\n\nType: Full-time\n\nWho We're Looking For\n\nAre you a skilled iOS developer with a passion for creating high-quality mobile applications? Do you enjoy working in a collaborative environment and leading discussions on the latest technological trends? If so, you might be the perfect fit for our Senior iOS Developer position!\n\nAs a Senior iOS Developer at Spark Networks, you will play a crucial role in advancing our mobile applications. You will work closely with a motivated cross-functional team to develop clean, secure, and reusable code that enhances user experience and maximizes application performance. Your expertise will help drive the success of our mobile apps and contribute to our continuous improvement.\n\nWhat You'll Do\n• Develop Quality Code: Write clean, secure, and reusable code.\n• Create Modular Components: Build modular components that can be shared across multiple applications.\n• Enhance User Experience: Strive to deliver a delightful user experience and maximize application performance.\n• Technology Decisions: Choose the right tools for the job and participate in discussions about different technologies.\n• Lead and Mentor: Join and lead discussions about architectural and low-level decisions, sharing your expertise and learning from others.\n• Collaborate: Work closely with product management, development, and UX teams in a dynamic, cross-functional environment.\n\nWho You Are\n• Experienced Developer: 6+ years of professional experience in native iOS app. development.\n• Proficient with Swift: Strong Swift skills, familiarity with SwiftUI, Swift Concurrency, Combine.\n• Software Architecture Knowledge: Familiar with software development best practices and architectural design patterns.\n• UI Expertise: Experience building complex user interfaces and smooth animations.\n• Modular Development: Experience in building modules that are reused across multiple applications is a plus.\n• Test-Driven: Experienced in writing automated tests (unit tests, UI tests, integration tests).\n• Passionate and Motivated: Strong work ethic, self-motivation, and good organizational skills.\n• Team Player: Enjoys working in a team and supporting colleagues.\n• Fast Learner: Willingness and ability to pick up new languages and frameworks when required.\n• Fluent in English: Proficient in both written and verbal communication.\n\nAbout Us\n\nAt Spark Networks, we’re dedicated to connecting people and sparking meaningful relationships. As a global dating company, we offer a range of premium and freemium apps that welcome millions of singles worldwide. Our mission is to help people find love and have fun along the way.\n\nSpark Networks is a global dating company with an ever-growing portfolio of premium and freemium apps. Our biggest brand, Zoosk, welcomes 40 million singles to its platform and is available in 80+ countries, translated into 25 languages. We also offer niche brands that cater to specific age groups and religious communities, such as Silver Singles for the over 50s, Christian Mingle, and Jdate for Christian and Jewish singles.\n\nDespite our diverse brand portfolio, our mission remains consistent: to help singles around the world find love and enjoy the journey. We pride ourselves on ensuring our users remain engaged, happy, and satisfied throughout their Spark experience.\n\nAs a successful subscription business, Spark Networks\n\nboasts significant opportunities for innovation and growth. At our core, we are a consumer technology company, with product management playing a crucial role in driving our success. Our commitment to continuous improvement and user satisfaction keeps us at the forefront of the dating industry.\n\nReady to join us? Apply now and let's spark something amazing together!\n\nAbout Us\n\nAt Spark Networks, we’re dedicated to connecting people and sparking meaningful relationships. As a global dating company, we offer a range of premium and freemium apps that welcome millions of singles worldwide. Our mission is to help people find love and have fun along the way.\n\nSpark Networks is a global dating company with an ever-growing portfolio of premium and freemium apps. Our biggest brand, Zoosk, welcomes 40 million singles to its platform and is available in 80+ countries, translated into 25 languages. We also offer niche brands that cater to specific age groups and religious communities, such as Silver Singles for the over 50s, Christian Mingle, and Jdate for Christian and Jewish singles.\n\nDespite our diverse brand portfolio, our mission remains consistent: to help singles around the world find love and enjoy the journey. We pride ourselves on ensuring our users remain engaged, happy, and satisfied throughout their Spark experience.\n\nAs a successful subscription business, Spark Networks\n\nboasts significant opportunities for innovation and growth. At our core, we are a consumer technology company, with product management playing a crucial role in driving our success. Our commitment to continuous improvement and user satisfaction keeps us at the forefront of the dating industry.\n\nReady to join us? Apply now and let's spark something amazing together!",
            "apply_options": [
                {
                    "title": "Indeed",
                    "link": "https://de.indeed.com/viewjob?jk=6757bf60822f21c2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Jobtensor",
                    "link": "https://jobtensor.com/job/Sr-iOS-Developer-fmx-Germany-9ddcf77f9b1e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Glassdoor",
                    "link": "https://www.glassdoor.de/job-listing/sr-ios-developer-f-m-x-germany-spark-networks-JV_IC2622109_KO0,30_KE31,45.htm?jl=1009491081104&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "LinkedIn",
                    "link": "https://de.linkedin.com/jobs/view/sr-ios-developer-f-m-x-germany-at-spark-networks-4053812199?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Meritocracy",
                    "link": "https://meritocracy.is/de/wooga/ios-developer-contract-148?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Levels.fyi",
                    "link": "https://www.levels.fyi/jobs?jobId=89911375437931206&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "title": "Simplyhired.de",
                    "link": "https://www.simplyhired.de/job/iRzUdhoWoWGm_QJoafGbKBfLfbC_0nRWv-_0_ViuaKhgOiOWjRNlcg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJTci4gaU9TIERldmVsb3BlciAoZi9tL3gpIChHZXJtYW55KSIsImNvbXBhbnlfbmFtZSI6IlNwYXJrIE5ldHdvcmtzLCBJbmMiLCJhZGRyZXNzX2NpdHkiOiJCZXJsaW4sIEdlcm1hbnkiLCJodGlkb2NpZCI6ImpHYnJSQjM3N2VQV3MtQm1BQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lIUjJWeWJXRnVlUSJ9"
        },
        {
            "title": "Freelance App Developer",
            "company_name": "Twine",
            "location": "Anywhere",
            "via": "Startup Jobs",
            "share_link": "https://www.google.de/search?ibp=htl;jobs&q=iOS+developer&htidocid=RcjpIluvQ0Ayskf5AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQvCMBAG0L2Ts9PNgokILjoJUsHZvSThI4mkuSMXtE7-dXV54xs-gxkbUFwNoLMIXfBEYUGjLd3Yk8K1kIgrXZljwfqUehc9WqtaTNTueg4m8Gy5wvNiH-z1z6TJNUhxHdP-sFuM1LhZ3V-5gvJvQ5tdfX8B1SWeK4EAAAA&shmds=v1_AUFQtONurXKjHwP9eCTtpaM8D1xu5cfxe2Te6yk-9xCdxTJYlQ&shem=jblt,jbolt&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=iOS+developer&htidocid=RcjpIluvQ0Ayskf5AAAAAA%3D%3D",
            "thumbnail": "https://serpapi.com/searches/678508536fd1cafdfcefff33/images/5938e2e41dc5c4af89c56f18ac040c49093bed8b245f7c20e4f17e4e8cc5e2a0.gif",
            "extensions": [
                "Work from home",
                "Contractor",
                "No degree mentioned"
            ],
            "detected_extensions": {
                "work_from_home": true,
                "schedule_type": "Contractor",
                "qualifications": "No degree mentioned"
            },
            "description": "About Twine\nTwine is a leading platform connecting top-tier freelancers, consultants, and contractors with companies that need creative and tech expertise. Trusted by Fortune 500 companies and innovative startups alike, Twine is the go-to marketplace for mission-critical projects. With a network of over 500,000 freelancers and 35,000+ companies, we provide a comprehensive solution for businesses looking to build agile teams and for freelancers seeking opportunities to work on high-impact projects.\n\nOur Mission\nAt Twine, our mission is to empower creators, whether they're businesses or individual freelancers, to grow and thrive. As automation and AI reshape the workforce, we’re driving the shift towards remote, freelance-driven work. We connect companies with top creative talent, enabling collaboration, innovation, and success on a global scale.\n\nAbout the Role\nWe are seeking an experienced App Developer to build a user-friendly scheduling app for a Personal Training organization. This app will streamline the process of reassigning clients between trainers during periods of illness or vacation. The initial version will focus on core functionalities to ensure efficiency and seamless communication among trainers and clients.\n\nThe app will include:\n\n• A feature for trainers to share their schedules and mark their unavailability.\n• Push notifications alerting trainers of reassignments and client needs.\n• An availability input system for trainers to share their open time slots.\n• Automated matching of schedules to find suitable appointment times.\n• Push notifications to confirm proposed times with trainers.\n• Notifications to communicate changes to clients.\n• Individual dashboards for trainers to track proposed and confirmed schedules.\n\nThis is a freelance, remote position with potential for long-term collaboration as additional features are planned for future versions.\n\nRequirements\n\n• Proven experience in app development for iOS and Android platforms.\n• Proficiency in programming languages such as Swift, Kotlin, or React Native.\n• Experience with push notifications and scheduling functionality.\n• Strong UI/UX design skills for creating user-friendly dashboards.\n• Familiarity with back-end development for database management and automation.\n• Ability to deliver a functional MVP (Minimum Viable Product) on time.\n• Excellent communication skills to ensure clarity and alignment throughout the project.\n• Availability to collaborate on future feature enhancements post-launch.",
            "apply_options": [
                {
                    "title": "Startup Jobs",
                    "link": "https://startup.jobs/freelance-app-developer-jointwine-6033399?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "job_id": "eyJqb2JfdGl0bGUiOiJGcmVlbGFuY2UgQXBwIERldmVsb3BlciIsImNvbXBhbnlfbmFtZSI6IlR3aW5lIiwiYWRkcmVzc19jaXR5IjoiR2VybWFueSIsImh0aWRvY2lkIjoiUmNqcElsdXZRMEF5c2tmNUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSUhSMlZ5YldGdWVRIn0="
        }
    ],
    "serpapi_pagination": {
        "next_page_token": "eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUakZNV0dKWWJFMVZaRVpwTFVKWlV6aDRUamhDTlZjMVdtSjJRbFZYTkVZeE1rMUlTbTQxWVhrMU9HUnJkRzUzYmpOSlNHUXpWR1U1TldKbFdIRTBXVUZ3TUZVdFdFODROWEE0ZWxZeFNXOHRZMWgwVEdWU1dsZ3RReTF5VVdnNU5TMUpkMWwzY1dWTVRHRjZiSGcxVUZGelVtRjZSMGhVYUVOTFoyaDZkRTh6VVhwbFZIcExkMFpOWVV4U1IyaEVWbWRNZVZoTWQwaFNiRkJpUzFaeVkzRmpaMUpRWVVaclh6ZGZUWEZ1Y1hSS09FVnNUbGhsTlZCVWJuQTRZMTkxUjNOMGJsaHZXa1ZhTlY5aGJrMDRTall5V1hCNmVYVTRSa28wTFU1bk5VWTJObGRITUVkZlFtMWtZa1pHUmpCV2IwNWliMnRuYjBwTGFtOVFUSGhpU201bGNWazJaUklYVlhkcFJsbzVOMUJRVDNKVk5VNXZVRzFPTjFSdlFYTWFJa0ZHV0hKRlkzSnhjSFJUTm1jMlVHYzNaRlJQY21oNWVtaGhVR3BmYkRCbE5YYyIsImZjdiI6IjMifQ==",
        "next": "https://serpapi.com/search.json?engine=google_jobs&google_domain=google.de&location=Germany&next_page_token=eyJmYyI6IkVzd0NDb3dDUVVwSE9VcHJUakZNV0dKWWJFMVZaRVpwTFVKWlV6aDRUamhDTlZjMVdtSjJRbFZYTkVZeE1rMUlTbTQxWVhrMU9HUnJkRzUzYmpOSlNHUXpWR1U1TldKbFdIRTBXVUZ3TUZVdFdFODROWEE0ZWxZeFNXOHRZMWgwVEdWU1dsZ3RReTF5VVdnNU5TMUpkMWwzY1dWTVRHRjZiSGcxVUZGelVtRjZSMGhVYUVOTFoyaDZkRTh6VVhwbFZIcExkMFpOWVV4U1IyaEVWbWRNZVZoTWQwaFNiRkJpUzFaeVkzRmpaMUpRWVVaclh6ZGZUWEZ1Y1hSS09FVnNUbGhsTlZCVWJuQTRZMTkxUjNOMGJsaHZXa1ZhTlY5aGJrMDRTall5V1hCNmVYVTRSa28wTFU1bk5VWTJObGRITUVkZlFtMWtZa1pHUmpCV2IwNWliMnRuYjBwTGFtOVFUSGhpU201bGNWazJaUklYVlhkcFJsbzVOMUJRVDNKVk5VNXZVRzFPTjFSdlFYTWFJa0ZHV0hKRlkzSnhjSFJUTm1jMlVHYzNaRlJQY21oNWVtaGhVR3BmYkRCbE5YYyIsImZjdiI6IjMifQ%3D%3D&q=iOS+developer"
    }
}